{"BestOfferEnabled": false, "Description": "Up for sale, a 1965 Fender Musicmaster II in exceptional, 100% original condition and in perfect working order. A rare example with a thick slab Brazilian rosewood fretboard, this vintage Fender retains its original vibrant nitro lacquer Olympic White finish, with Fender's 24\" scale and 1 5/8\" nut width. The lightweight poplar body weighs in at just 6lbs 14oz, and the acoustic tone is clear and crisp, translating well through the single coil neck pickup. Essentially a Strat pickup of the era with flat pole pieces hidden beneath the cover, the sweet, singing tone of this guitar can come as quite a shock, given its warmth and complexity. Professionally setup and strung with 11-50 strings, this Musicmaster II boasts low, slinky action and accurate intonation.The maple neck has a decent amount of roundness given its slender nut, and the profile fills the palm comfortably while still being very easy to chord. While the neck starts out at a medium C shape at the nut, as you move up the fretboard the profile grows notably in depth and roundness, with ample chunk by the time you reach the 9th fret and beyond. The original frets are intact and near perfect with well rounded crowns and only a touch of wear beneath the B and High E strings on frets 1-2. The Brazilian rosewood fretboard sports pearl dot inlays and the neck itself is very straight with a responsive truss rod and truss rod nut flush with the neck heel. Seen only for a short time on a few of Fender's short scale models in 1965-66, the fretboard is a thick slab of rosewood instead of the much more common thin veneer, and this thicker rosewood cut delivers a warmer, fuller overall tone. The headstock face retains a perfect \"Musicmaster II\" logo, and the stock Kluson Deluxe double line tuning machines turn very smoothly and hold pitch well. The simple electronics work as they should, with the single gray bobbin pickup wired to Master Volume and Tone knobs. All solder joints are untouched, and the CTS pots date to the 42nd week of '65. The pickup bobbin is also hand dated 2/22/65, and the original brass shielding plates are present in the unmodified body routes. Curiously enough, all Musicmasters were routed for a bridge pickup, even though this feature was something only seen on the Duo Sonic, which shared the same body. The original chrome hardware and plastic parts are all intact and remarkable clean.Of the three colors in which the Musicmaster was offered, Olympic White is perhaps the most popular and the only color to feature a contrasting tortoise pickguard. This particular finish is quite vibrant, with sparingly little yellowing of the clear coat and vertical lacquer checking on the body. The proper paint stick markings are present in the neck pocket, and the finish is extremely clean, showing some small finish chips on the edges of the slab body on the treble side lower bout edge, while the neck profile has a smooth barely ambered gloss with no wear. A black tolex hardshell case is included. Check out our shop \"Mike & Mike's Guitar Bar,\" and please let us know if we can answer any questions!Shipping in the continental USA will be $65, fully insured and shipped via FedEx Ground. Expedited shipping available for an additional fee at buyer's request. We will happily ship WORLDWIDE, but please contact us for an accurate international shipping quote before bidding or buying, as cost varies by buyer location. International orders will be declared as “merchandise,” and the value of merchandise will be declared as the amount paid. We cannot declare anything as a gift or for a lesser value. No exceptions! The customer is responsible for all taxes and duty, which may be collected upon delivery, as well as any additional charges involved with import. We have all necessary CITES paperwork in-hand to ship rosewood worldwide.We do our best to describe all items with honesty and accuracy, but to be sure, please contact us with any questions or concerns prior to bidding or buying. We require payment within 48 hours of auction end. In the unlikely event of a return, buyer pays all shipping costs. Your positive feedback and five star ratings are very important to us, and we appreciate your communication in resolving any issues!", "ItemID": "163273493514", "EndTime": "2018-12-29T01:49:57.000Z", "StartTime": "2018-09-23T07:32:11.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1965-Fender-Musicmaster-II-Vintage-Guitar-Olympic-White-100-Stock-Slab-Board-/163273493514", "ListingType": "FixedPriceItem", "Location": "Seattle, Washington", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1632734935148080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/zDYAAOSwUQ5bpz4I/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/TgcAAOSwvdxbpz4T/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/qJIAAOSwxe1bpz4W/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/MScAAOSwilVbpz4Z/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/S8UAAOSwwb1bpz4b/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/CygAAOSwtItbpz4Q/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/0g4AAOSwRhFbpz4L/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/JRoAAOSwFixbpz4O/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/gwwAAOSw6utbpz4l/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/cM8AAOSwRE9bpz4g/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/NPcAAOSwlxxbpz4j/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/VqsAAOSwmZJbpz4e/$_57.JPG?set_id=8800005007"], "PostalCode": "98117", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mmguitarbar", "FeedbackRatingStar": "Red", "FeedbackScore": 2591, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1499.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1499.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "k***k", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 407}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "1965 Fender Musicmaster II Vintage Guitar Olympic White 100% Stock, Slab Board", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Olympic White"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Musicmaster II"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["1965"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Brand", "Value": ["Fender"]}, {"Name": "Body Type", "Value": ["Solid"]}]}, "HitCount": 1101, "PrimaryCategoryIDPath": "619:3858:33034", "SecondaryCategoryID": "118985", "SecondaryCategoryName": "Musical Instruments & Gear:Vintage Musical Instruments:Vintage Guitars & Basses:Electric Guitars", "SecondaryCategoryIDPath": "619:181162:181163:118985", "Storefront": {"StoreURL": "https://stores.ebay.com/id=269063702", "StoreName": "Mike and Mikes Guitar Bar"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}