{"BestOfferEnabled": false, "Description": "Up for sale, a 2011 Gibson Les Paul SG Custom in exceptional condition and in perfect working order. Part of Gibson's current Custom Shop VOS line of Historic reissue instruments, this SG Custom was one of the last produced by Gibson with a genuine slab ebony fretboard. This guitar sports trio of original Burstbucker 1 and 2 PAF reissue humbuckers that deliver the fullness, midrange cut, and detailed, harmonic rich tones which have made the SG a favorite for decades. This SG Custom (officially marketed as a '60 reissue) is from Gibson's flagship line of vintage reissue models, and the Custom Shop delivers top notch quality and expert craftsmanship. Retaining the Les Paul moniker of the very first years of the SG body shape, this Custom model sports a gloss Polaris White lacquer finish, with the ebony fretboard, pearl block inlays, and split diamond headstock inlay that denote Gibson's most opulent instruments. Weighing in at 8lbs, this SG is very acoustically resonant and well balanced, with a very dynamic and responsive quality. Each pickup selection on the three-way toggle has a unique voice and everything from throaty neck pickup warmth to aggressive chime and bark in the bridge position can be attained at the flip of a switch. Professionally setup here at Mike & Mike's Guitar Bar and strung with 10-46 strings, this SG Custom is dialed in with comfortable, low action and spot on intonation.The neck has a medium C shaped profile with generous shoulders, giving it just enough heft while still having modest depth. The 1 11/16\" nut width fills the palm comfortably, and the frets are practically mint with virtually no wear and well rounded crowns. Notable for being one of the last modern SGs with a real ebony fretboard, this board has a tight grain and slightly porous nature indicative of real ebony as opposed to the \"Richlite\" boards that would soon replace it. The headstock sports a set of gold Gibson Deluxe tuning machines with lightly greened tulip buttons, and the tuners turn very smoothly. The G tuner has a perceptible bend in the arm, yet still functions as intended.On the body, all of the electronics work as they should, and the factory wiring harness is untouched with original braided Gibson wire, stock pots, and ceramic disc tone caps. The trio of gold pickup covers are in great shape, and the tune-o-matic bridge and long frame Lyre Vibrola tailpiece have clean gold plating as well. One of the more responsive modern Gibson Vibrolas, this vibrato actuates very easily and is reliable for expressive warbles and modest dives. Cosmetically, this guitar has been very well cared for since new and wear is limited to light yellowing of the finish adjacent to the nut from where the guitar rested on a wall hanger yolk, one finish chip on the bass side lower bout edge near the Vibrola, and a few light nicks and finish scuffs on the guitar as a whole. The finish is very vibrant with sparingly little aging, and overall this SG is quite clean and a stunning example of one of Gibson's most eye-catching and fun to play models.A hardshell case is included. Check out our shop \"Mike & Mike's Guitar Bar,\" and please let us know if we can answer any questions!Shipping in the continental USA will be $75, fully insured and shipped via FedEx Ground. Expedited shipping available for an additional fee at buyer's request. We will happily ship WORLDWIDE, but please contact us for an accurate international shipping quote before bidding or buying, as cost varies by buyer location. International orders will be declared as “merchandise,” and the value of merchandise will be declared as the amount paid. We cannot declare anything as a gift or for a lesser value. No exceptions! The customer is responsible for all taxes and duty, which may be collected upon delivery, as well as any additional charges involved with import. We have all necessary CITES paperwork in-hand to ship rosewood worldwide.We do our best to describe all items with honesty and accuracy, but to be sure, please contact us with any questions or concerns prior to bidding or buying. We require payment within 48 hours of auction end. In the unlikely event of a return, buyer pays all shipping costs. Your positive feedback and five star ratings are very important to us, and we appreciate your communication in resolving any issues!", "ItemID": "153315236277", "EndTime": "2018-12-24T09:41:03.000Z", "StartTime": "2018-12-24T01:07:31.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2011-Gibson-Les-Paul-Custom-SG-Historic-VOS-Triple-Pickup-Polaris-White-w-Case-/153315236277", "ListingType": "FixedPriceItem", "Location": "Seattle, Washington", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1533152362778080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/~bwAAOSw0xtcIC5T/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/BcIAAOSwBPRcIC5i/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/wRwAAOSwUPVcIC5k/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/~i0AAOSwmkBcIC5m/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/JKkAAOSwvNVcIC5o/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/lk0AAOSwzodcIC5V/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/CxEAAOSwVNNcIC5c/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/-PEAAOSwz05cIC5e/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/vYMAAOSwmT1cIC5g/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/YNYAAOSwkQhcIC5X/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/L68AAOSwZ4RcIC5Z/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/RMsAAOSwYUZcIC5R/$_57.JPG?set_id=8800005007"], "PostalCode": "98117", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mmguitarbar", "FeedbackRatingStar": "Red", "FeedbackScore": 2591, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 3499.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 3499.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "8***1", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1119}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "2011 Gibson Les Paul Custom SG Historic VOS Triple Pickup Polaris White w/ Case", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Polaris White"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Material", "Value": ["Mahogany"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model", "Value": ["Les Paul Custom SG"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["2011"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}]}, "HitCount": 41, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=269063702", "StoreName": "Mike and Mikes Guitar Bar"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}