{"BestOfferEnabled": false, "Description": "THE POP ROCK SHOP... NO ONE DOES IT LIKE WE DO!A New Modern Unique & Fantastic Way To Find The Gear You Always Wanted, Need Or Are Looking For...We Feature Handpicked Fully Tested & Evaluated Musical Equipment That Is Professionally Aged & Preserved In Our Humidity & Temperature Controlled Vaults Until Released For Sale & Sold...Each Guitar Is Given a Full Pro Setup During Its Initial Evaluation. Additional Setup Tweaks Are Done On Used Gear As Needed During Aging & Preserving...Our Unique Setup Process & Vault Aging & Preserving Makes Each Guitar Play & Be Its Best (37 Years Experience Playing & Setting Up Guitars)...Each Item's Description Is Done Specifically For The Item Listed With Hours of Research, Personal Evaluations & Tons of Detail... Each Item Includes a Full Set of Our Professional High Quality Pictures Allowing Our Buyers a Fun & Informative Experience Online...Seeing The Item In Clear Beautiful Detail From Multiple Viewing Points Gives You a Real Sense of What You Are Actually Buying...All This Is Done To Provide You a Professional & Unmatched Experience Helping You To Make The Right Choice, Each and Every Time...We Are Unique In Providing Our Customers All of This Unmatched Service, Experience and Care Which Includes Everything Above Plus...Our Pop Rock Shop Sale Package Which Always Includes A Fantastic Combination of Added Bonuses... A Great Price, A Killer Setup And Pro Vaulted Hand Selected Gear...We Have a Continual Changing Collection of Rare, Out of Production, Hard To Find & Hand Selected High Quality & Collectible Musical Equipment...Be Sure To Watch For Our Ever Growing Fresh Updated & Exciting Inventory Coming To You Online All The Time...If You Don't See What You're Looking For In Our Current Listings Just Message Us Anytime As We Have TONS of Gear Not Yet Listed And We'll Get Right Back To You...THE POP ROCK SHOP, THE ONLY PLACE TO GO WHEN YOU'RE LOOKING FOR GREAT PLAYING, HIGH QUALITY PROFESSIONALLY AGED & PRESERVED GUITARS! Click HERE To See Our Complete Current Listed Inventory of Fantastic Gear..._____________________________________________________________________________________________________________ POP ROCK SHOP \"HOT-ROD MOD\"RARE 2014 FENDER SPECIAL EDITION CLASSIC SERIES '60s STRAT ONE OF ONLY 500 EVER MADE!THIS ONE IS FROM THE 1ST MONTH OF PRODUCTION (1/2015)(ALL STOCK ORIGINAL EXCEPT FOR THE LOADED PICKGUARD)CAN EASILY BE CONVERTED BACK TO AN ALL ORIGINAL CLASSIC STRAT BUT SOUNDS KILLER WITH THE CUSTOM UPGRADE MODS! CUSTOM BUILT SSS 3-PLY 60'S WHITE PICKGUARD LOADED WITH...HANDPICKED VINTAGE STYLE STAGGERED POLE ALNICO PICKUPSCUSTOM SHOP WAXED CLOTH GAVITT PUSH-BACK WIRINGMATCHED SET OF BRAND NEW CTS POTS & ORANGE DROP CAPCUSTOM POP SHOP HAND-AGED VOLUME & TONE KNOBS CRAZY COOL RARE FENDER CANARY DIAMOND CUSTOM FINISHA DEALER LIMITED RUN OF THE CANARY DIAMOND FINISH - ONLY 500 WERE MADE OF THIS ULTRA RARE COLOR...DERIVED FROM THE DUPONT HUES USED IN THE AUTOMOBILE INDUSTRY IN THE 1950's & 1960's _____________________________________________________________________________________________________________1 DAY SPECIAL FLASH AUCTION... NO RESERVE!STARTING PRICE 50% BELOW THE BUY IT NOW SALE PRICE! OR... YOU CAN BUY IT NOWPACKAGE SALE PRICE$825_____________________________________________________________________________________________________________ FROM OUR OUT OF PRODUCTION LIMITED EDITION POP ROCK SHOP SHOP-MOD INVENTORYPROFESSIONALLY AGED & PRESERVED IN OUR VAULT NOW APPROACHING 5 YEARS OLD(Humidity & Temperature Controlled In Our VAULT At All Times)LIGHT RESONATED DRY AGED WEIGHT 7lbs. 9 oz. SPECIAL FEATURES & HIGHLIGHTSTHIS ONE HAS A $200 CUSTOM BUILT SSS 3-PLY 60'S WHITE PICKGUARD LOADED WITH...HANDPICKED VINTAGE ALNICO PICKUPSCUSTOM SHOP GAVITT PUSH-BACK WAXED CLOTH WIRINGMATCHED SET OF BRAND NEW CTS POTS & ORANGE DROP CAPCUSTOM POP SHOP HAND-AGED VOLUME & TONE KNOBS THIS EXTREMELY HARD TO FIND RARE MODEL WAS INTRODUCED IN EARLY 2015 AND DISCONTINUED AFTER ONLY 500 WERE BUILT...THIS ONE BUILT 1/2015 - 1ST MONTH OF PRODUCTION RELEASELIMITED PRODUCTION OF ONLY 500 OF THIS RARE CANARY DIAMOND FINISH EVER MADE (DERIVED FROM THE DUPONT HUES USED IN THE AUTOMOBILE INDUSTRY IN THE 1950's & 1960's) MAPLE \"C\" SHAPE NECK WITH SATIN POLYURETHANE FINISH (A NECK WITH GREAT FEEL THAT MAKES FOR EFFORTLESS MOVEMENT UP & DOWN THE NECK, SOLID CONTROL & COMFORT)7.25 RADIUS 21 VINATGE STYLE FRETSTHIS ONE HAS A KILLER HAND PICKED BEAUTIFUL DEEP RICK MULTI COLOR LIGHT & DARK ROWOOD FRETBOARD THE POP ROCK SHOP'S THOUGHTS & HIGHLIGHTSAFTER THE CUSTOM POP SHOP HOT-ROD MOD UPGRADE THIS THING HAS ALL TEH MAGIC MOJO OF THE FENDER 1960'S VIBE...A KILLER VINTAGE SOUNDING & WONDERFUL PLAYING 5 OLD VAULT AGED & PRESERVED KILLER MODDED COLLECTOR LIMITED BUILD STRAT!WE ABSOLUTELY LOVE THIS NECK! IT FEELS & PLAYS EFFORTLESSLYTHE 5 YEAR DRY AGED ALDER BODY IS SUPER RESONANTWE UPGRADED IT WITH A $200 CUSTOM BUILT SSS 3-PLY 60'S WHITE PICKGUARD LOADED WITH... HANDPICKED VINTAGE ALNICO PICKUPSCUSTOM SHOP GAVITT PUSH-BACK WAXED CLOTH WIRINGMATCHED SET OF BRAND NEW CTS POTS & ORANGE DROP CAPCUSTOM POP SHOP HAND-AGED VOLUME & TONE KNOBS*CAN EASILY BE TURNED BACK TO STOCK FOR COLLECTING BY SWAPPING OUT THE LOADED PICKGUARD SETUP / PLAYABILITY / TONE(SEE OUR REVIEWS BELOW)BEFORE A GUITAR IS VAULTED FOR AGING & PRESERVING WE PERFORM AN EXTENSIVE EVALUATION AND PRO SETUPTHEN WHEN PULLED FROM THE VAULT FOR SELLING WE DO ANOTHER EVALUATION AND TWEAK THE SETUP IF NEEDED JUST PRIOR TO LISTINGADDITIONALLY, THE PICKUPS ARE INDIVIDUALLY SET TO WHAT WE CALL \"THE SWEET SPOT\" MAKING THE GUITAR SOUND AS GOOD AS WE CAN GET IT(BALANCED PEAK OUTPUT... NOT TOO WEAK (CAUSES THIN TONE) AND NOT TOO STRONG (TO ELIMINATE ANY MUDDY OR DISTORTED SOUND)FINAL HEIGHT & ANGLE SETTING OF THE BASS & TREBLE SIDE OF EACH PICKUP IS SET TO ACHIEVE THE INTENDED TONE CHARACTER OF EACH MODEL GUITARLAST, AFTER A GUITAR IS SOLD WE PERFORM A FREE FINAL SETUP TWEAK AND TESTING OF ALL FUNCTIONS JUST BEFORE SHIPPING... OUR VAULT AGING & PRESERVING PROCESS ALLOWS THE GUITAR'S NECK & BODY WOOD TO AGE & DRY NATURALLY PRODUCING ADDED RESONANCE THAT ONLY TIME CAN CREATEOUR VAULTS ARE TEMPERATURE & HUMIDITY CONTROLLED AT ALL TIMES CREATING THE PERFECT ENVIRONMENT FOR PRODUCING FANTASTIC PLAYING & SOUNDING GUITARSDEPENDING ON THE LENGTH OF TIME A GUITAR SITS IN OUR VAULTS, THIS UNIQUE & RARE PROCESS OF TIME AGING & DRYING ADDS NATURAL RESONANCE, AGED WOODY TONE & FEEL THIS GUITAR...THIS THING IS CRAZY COOL AND A RARE CHANCE TO GRAB A 5 YEAR AGED & PRESERVED 1 OF ONLY 500 SPECIAL LIITED EDITION CLASSIC SERIES '60s STRATSTHIS ONE NOW HAS A MUCH IMPROVED POP ROCK SHOP UPGRADED CLASSIC VINTAGE '60S CUSTOM STRAT TONE...THAT SOUGHT AFTER ROUNDED THROATY THICK DEEP NECK TONE, BELL LIKE MIDS & LOTS OF VINTAGE SPANK IN POSITIONS 2 & 4!THE STUNNING DUPONT CUSTOM YELLOW BODY FINISH ON THIS GUITAR LOOKS FREAKIN' WILD!THE 5 YEAR NATURALLY AGED ALDER BODY RESONATES STRONG - YOU CAN FEEL THE GUITARS RESONANCE & TONE IN YOUR HANDS ALL THE WAY FROM THE NECK THROUGH THE BODYPLAYS SMOOTH AFTER THE ALMOST 5 YEARS OF AGING/SETTLING OF THE MAPLE NECK + SEVERAL OF OUR FULL SETUPS & TRUSS TWEAKSNECK IS PERFECTLY SETTLED, ALMOST DEAD STRAIGHT & NEEDED ONLY SLIGHT TRUSS RELIEF YET WE WERE ABLE TO GET EXRA LOW ACTION.THIS IS A GOOD ONE!_____________________________________________________________________________________________________________ Here's THE POP ROCK SHOP PACKAGE AUCTION DEAL... Guitar + Preserving & Setup PackageWas $1249(Discounted Sale Price $825 + Our $200 Shop Mod + Our Pro Preserving & Aging $150 + Our Famous $75 Full Setup Included In The Package Price)(OUR HAND SELECTION, PROFESSIONAL EVALUATIONS, PLUS A FREE FINAL POLISH & SETUP TWEAK ARE ALWAYS INCLUDED FREE!) 1 DAY SPECIAL FLASH AUCTION... NO RESERVE!STARTING PRICE 50% BELOW THE BUY IT NOW SALE PRICE! OR... YOU CAN BUY IT NOWPACKAGE SALE PRICE$825 NOW SAVE AN ADDITIONAL $425 DURING THIS SHOP BUY IT NOW SALE!SOLD AS-IS NO RETURNS FOR ANY REASON SO PLEASE ASK ANY QUESTIONS BEFORE YOU BUY CONDITIONA TRULY GREAT PLAYING & LOOKING MEXI STRAT IN ITS RARE AND VERY LIMITED CANARY DIAMOND FINISH...OUR 5 YEAR OLD VAULT AGED & PRESERVED POP ROCK SHOP MODDED SSS BEAUTY... MODIFIED SPECIAL EDITION CLASSIC SERIES. GIVEN AN INITIAL FULL PRO SETUP BEFORE STORING PLUS SEVERAL INTERIM SETUP TWEAKS OVER ITS 5 YEARS OF AGING & PRESERVING... A VERY COOL, NOT OFTEN SEEN MEXI CLASSIC SERIES STRATOCASTER IN ITS FACTORY UPGRADED CLASSIC CANARY DIAMOND FINISH! GIVEN AN INITIAL FULL PRO SETUP BEFORE STORING... PRO AGED & PRESERVED IN OUR TEMPERATURE & HUMIDITY CONTROLLED VAULTS AT ALL TIMES PLUS SEVERAL INTERIM SETUP TWEAKS AS NEEDED (GUITAR SPECIFIC)... OUR NATURAL TIME AGING & SETTLING PROCESS ALLOWS ITS WOOD TO DRY & SETTLE NATURALLY, ACQUIRING THAT SOUGHT AFTER ADDED RESONANCE, STABILITY AND A \"NATURALLY AGED TONE\" THAT ONLY COMES FROM TIME & PATIENCE... THIS UNIQUE POP ROCK SHOP EXCLUSIVE \"VAULT AGING & PRESERVING PROCESS\" THAT WE ARE FAMOUS FOR SETS OURSELVES APART FROM THE REST BY PROVIDING THIS PRO, HUMIDITY & TEMP CONTROLLED VAULT AGING & PRESERVING ON EVERY GUITAR WE SELL! ADD TO THIS ONE OR MORE OF OUR FAMOUS FULL CUSTOM SETUPS AND WHAT GETS DELIVERED TO YOUR DOOR IS A FANTASTIC EXAMPLE OF WHAT A GUITAR SHOULD LOOK, SOUND AND FEEL LIKE... SETUP AND READY TO ROCK! WE ALWAYS INCLUDE INDIVIDUAL EVALUATIONS, SETUPS AND TEST RUNS TO ENSURE ITS AS GOOD AS WE CAN GET IT BEFORE LAUNCHING FOR SALE! OUR VAULT AGING & PRESERVING PROCESS ALSO MAKES FOR A ROCK SOLID DEAD STRAIGHT NECK THAT WILL REMAIN TRUE FOREVER! IN OVERALL NOS DISPLAY PRESERVED CONDITION PLUS THE HANDLING & TESTING OF THE SHOP MOD UPGRADES WITH ONE VERY MINOR TINY INDENT/MARK ON RIGHT SIDE, TYPICAL HAIRLINE FINISH CRACK IN NECK POCKET *(VERY COMMON). TYPICAL SWIRLS ETC. FROM TESTING USE, CLEANING POLISHING, ETC.. SOLD AS-IS NO RETURNS FOR ANY REASON SO PLEASE ASK QUESTIONS BEFORE YOU BUY... ENJOY! WHY BUY A GUITAR FROM THE POP ROCK SHOP…1) EVERY GUITAR WE SELL IS HAND-SELECTED, RECEIVES OUR FAMOUS FULL SETUP, IS PROFESSIONALLY AGED & PRESERVED IN OUR VAULT AND FULLY EVALUATED, BEFORE GOING UP FOR SALE…2) OUR VAULTS ARE TEMPERATURE & HUMIDITY CONTROLLED CREATING THE PERFECT ENVIRONMENT FOR THE CONTINUAL AGING OF OUR GUITARS…3) DURING THE AGING PROCESS OUR INVENTORY IS PERIODICALLY EVALUATED, ALLOWING US TO PERFORM INTERIM TRUSS & SETUP TWEAKS AS NEEDED UNTIL IT'S PERFECT…4) THE GUITAR’S BODY, NECK & FINISH BREATH, AGE, DRY & SETTLE OVER TIME, MAKING THE GUITAR BETTER & BETTER AS TIME GOES ON…5) THIS RARE & EXCLUSIVE PROCESS CONTINUES TURNING OUT SOME OF THE BEST PLAYING, SOUNDING & COLLECTIBLE GUITARS IN THE WORLD WITH PERFECTLY AGED & SETTLED NECKS THAT STAY TRUE FOREVER…6) THE PROOF IS IN THE RESULTS & CUSTOMERS FEEDBACK... BELOW, FIND A SAMPLE OF CURRENT OWNERS OF A POP ROCK SHOP “AGED & PRESERVED, PRO SETUP GUITAR”… EACH GUITAR COMES WITH OUR FAMOUS PROFESSIONAL CUSTOM SETUP BY THE POP ROCK MASTER HIMSELF...\"HE HAS BEEN SETTING UP GUITARS, EACH INDIVIDUALLY, BY FEEL FOR OVER 35 YEARS AND HAS MASTERED HIS SETUP SKILLS TO THE POINT THAT HE GETS EVERY GUITAR TO PLAY AS GOOD AS IT CAN BE...PLAYER AFTER PLAYER CONTINUE TO RESPOND WITH AMAZEMENT AT HOW GOOD THEIR NEW GUITAR PLAYS & FEELS RIGHT OUT OF THE BOX...EVEN THE TOURING PROS THAT WE HAVE SOLD TO HAVE COMMENTED THAT \"THIS IS THE BEST PLAYING GUITAR I'VE EVER HAD\"... JUST LOOK AT THE MOUNTAIN OF REVIEWS THAT KEEP COMING FROM BUYERS WHO ALMOST ALWAYS TALK ABOUT THE SETUP AND PLAYABILITY OF OUR GUITARS ABOVE ALL ELSE...\" EXTRA CARE & VALUE FROM THE POP ROCK SHOP1) HAND-SELECTED GUITARS: EACH GUITAR THAT IS LISTED FOR SALE IS INDIVIDUALLY HAND-SELECTED & PUT THROUGH OUR EVALUATION PROCESS. NOTHING GETS LISTED FOR SALE UNTIL WE PERSONALLY SPEND THE NECESSARY TIME WITH EACH ITEM, EVALUATING, TESTING, PLAYING AND TWEAKING THE SETUPS UNTIL IT'S RIGHT WHERE WE WANT IT!2) PROFESSIONAL PRESERVING & AGING: EVERY GUITAR, NEW OR USED IS PROFESSIONALLY PRESERVED & AGED IN OUR HUMIDITY & TEMPERATURE CONTROLLED VAULTS UNTIL SOLD! A RARE & UNIQUE POP ROCK SHOP EXCLUSIVE...3) FULL EVALUATIONS & PRODUCT TESTING: EVERY ITEM IS FULLY EVALUATED, TESTED & RATED WITH A FULL DESCRIPTION, SUMMARY & EVALUATION INCLUDED IN EVERY POP ROCK SHOP DETAILED LISTING!4) OUR ALWAYS INCLUDED FAMOUS GUITAR SETUPS (a $75 Value Add): USING OUR 35 YEARS OF EXPERIENCE, EVERY GUITAR GETS DELIVERED TO YOU FULLY SETUP & READY TO PLAY... DEPENDING ON THE GUITAR, MANY ALSO RECEIVE ADDITIONAL MULTIPLE-IMTERUM SETUPS DURING THE PRESERVING & AGING PROCESS! THIS ALLOWS YOU TO PLAY IT RIGHT OUT OF THE BOX AS-IS, PLUS YOU CAN EASILY GIVE IT YOUR OWN PERSONAL TWEAKS JUST THE WAY YOU LIKE IT!5) HI QUALITY PROFESSIONAL PICTURES & ACCURATE DETAILED DESCRIPTIONS: WE PROVIDE OUR BUYERS WITH LISTINGS THAT HAVE PROFESSIONAL HIGH QUALITY DETAILED PHOTOS ALONG WITH EXTENSIVE RESEARCH PROVIDING LOTS OF DETAILS & PERSONAL HANDS-ON EVALUATIONS IN ALL OUR LISTINGS. WE SPEND WAY MORE TIME THAN MOST, CREATING LISTINGS THAT SET US APART FROM OTHER SHOPS & PRIVATE SELLERS. WE USE OUR EXTENSIVE KNOWLEDGE AND TAKE THE EXTRA TIME & CARE SO YOU CAN TRULY SEE & UNDERSTAND WHAT YOU ARE BUYING! ONCE YOU VIEW A FEW OF OUR LISTINGS YOU WILL EASILY SEE HOW THIS EXTRA EFFORT SETS US MILES APART FROM THE REST!6) OUR POST SALE INSPECTION PROCESS: EACH ITEM IS FULLY INSPECTED THEN FULLY RE-TESTED & THEN CLEANED & POLISHED BEFORE PACKING SO THAT YOU RECEIVE A CLEAN, WORKING AS DESCRIBED ITEM EVERY TIME! EVERY GUITAR ALSO RECEIVES FREE A FINAL SETUP CHECK & TWEAK IF NEEDED...7) OUR PROFESSIONAL DELIVERY/SHIPPING SYSTEM: EVERY ITEM IS CLEANED, PROFESSIONALLY PACKED & SHIPS SAFELY WITHIN 3 BUSINESS DAYS. WE USE BUBBLE WRAP IN MOST CASES BEFORE BOXING. EVERY GUITAR IS 1ST FOAM WRAPPED TO PROTECT ITS FINISH AND THEN 100% BUBBLE WRAPPED FOR EXTRA PROTECTION! WE USE THE ORIGINAL FACTORY SHIP BOX WHEN AVAILABLE. IN SOME CASES WE ALSO DOUBLE BOX USING QUALITY GUITAR SHIPPING BOXES & EXTRA PADDING (NOT ALWAYS NECESSARY FOR GUITARS THAT HAVE GIG BAGS OR CASES) ALL PACKAGES ARE ALSO MARKED \"FRAGILE\" ON ALL SIDES AS WELL AS NOTING \"FRONT & TOP\" FOR SHIPPERS & HANDLERS!8) ADDED PEACE OF MIND ON YOUR PURCHASE: ON EVERY SALE, WE COVER THE COST OF ADDING FREE FULL COVERAGE INSURANCE TO YOUR ORDER SO THAT YOU CAN HAVE A WORRY FREE SHOPPING EXPERIENCE!THE POP ROCK SHOP...HAND-SELECTED, PROFESSIONALLY VAULT AGED & PRESERVED & FULLY EVALUATED GUITARS... NO ONE DOES IT LIKE WE DO! POP ROCK SHOP FEEDBACK /CUSTOMER REVIEWS...5-STAR RATING & FEEDBACKOMG. The box it came in exuded cool. And no wonder. I have NEVER (out of 40+ guitars) have had a guitar like this. It came out of the box, it jumped on the tuner before I could even get it plugged in it was in tune.It wanted to play!!! The Pop Rock Shop knows how to make guitar buying fun again!!! How cool is that?? Want a great guitar? Want to really enjoy the process and be excited? Pop Rock Shop is the place! February 26 5-STAR RATING & FEEDBACKPop Rock Shop Awesome ! Guitar arrived on time in pristine condition ! Guitar was better than expected and exceeded my expectations!Beautiful Epi, much thanks and would deal with Pop Rock Shop again! January 17, 2017 by Bob 5-STAR RATING & FEEDBACKTop drawer service & communication, very pleased with THE POP ROCK SHOP. No hesitation considering buying gear again from you guys, for sure! January 08 5-STAR RATING & FEEDBACKOh man I don't know where to begin. Great transaction. Their set up job is leaps and bounds ahead of most. Only played one guitar in my life that felt better than this one and it was $2400 more expensive.One heck of an instrument and great customer service! December 30, 2016 5-STAR RATING & FEEDBACKFantastic seller, Fantastic product, Fantastic packaging &amp; shipping, everything as promised! This store has the most unique instruments &amp; amplifiers.Brand new landmark tech 21 300! 5 star!:) February 14, 2017 5-STAR RATING & FEEDBACKThis transaction has been way beyond just a guitar purchase this is been an guitar and color that I've wanted for some time and finally found the perfect piece and perfect shop,I communicated with The Pop Rock Shop a number of times, with very pleasant fast, personal replies. The Pop Rock Shop\" knows guitars!If you want museum quality great piece look no further than with them., shipping, packing, communication total first class, I was treated like a rock star from the first click on his item. I'll be back! June 07, 2016 5-STAR RATING & FEEDBACKIncredible guitar! Perfectly set up out of the box. Fast shipping!! Very impressed with The Pop Rock Shop.Will be buying from here again, no question. A++ December 31, 2016 5-STAR RATING & FEEDBACKGreat guitar! Great seller!! Thanks!!! September 09, 2016 5-STAR RATING & FEEDBACKSeamless transaction. Emails answered promptly and updated regularly. Arrived on time, and quickly, and packaged well, for shipping. The guitar!!!..amazingly beautiful!!Seriously, Inca Silver! Would shop here, again, for sure. Thanks! August 16, 2016 5-STAR RATING & FEEDBACKThe guitar is a true gem, exceeding my expectations, and The Pop Rock Shop was great to work with, and kept working with meall the way until I finally took possession of the SG! July 27, 2016 5-STAR RATING & FEEDBACKOnce again the Pop Rock Shop delivers!!! Great axe, great service, great vibes! April 19, 2016 by Kip 5-STAR RATING & FEEDBACKGreat seller, cares about his customers, made the sale a very pleasurable experience for me! February 05 5-STAR RATING & FEEDBACKGuitar was in perfect condition, exactly as described. Great seller, great communication and fast shipping! March 11, 2016 5-STAR RATING & FEEDBACKPerfect transaction. Everything was setup ready to tune and play out of the box. Plays very nice! August 01, 2016 by David 5-STAR RATING & FEEDBACKWhat a great guitar! It was shipped quickly, packed carefully and was exactly as described--AWESOME! Of course I had to play it as soon as I unpacked it.The set-up was perfect and it arrived almost perfectly in tune. Unbelievable! Thank you, Pop Rock Shop! August 15, 2016 Model Name: SPECIAL LIMITED EDITION CLASSIC '60S SRATOCASTER®Series: Classic Series Body: Alder Neck: Maple “C” Shape, (Polyurethane Finish) Fingerboard: Rowood (7.25” Radius/184 mm) No. of Frets: 21 Vintage Style Scale Length: 25.5” (648 mm) Width @ Nut: Synthetic Bone, 1.650” (42 mm) Hardware: Chrome Machine Heads: Fender®/Ping® Vintage Style Tuning Machines Bridge: Vintage Style Synchronized Tremolo Pickup Switching: 5-Position Blade: Position 1. Bridge Pickup Position 2. Bridge and Middle Pickup Position 3. Middle Pickup Position 4. Middle and Neck Pickup Position 5. Neck Pickup Controls: Master Volume, Tone 1. (Neck Pickup), Tone 2. (Middle Pickup) Color:(363) CANARY DIAMOND (ONLY 500 PRODUCED) Unique Features: AGED KNOBS & SWITCH TIP (POP ROCK SHOP HAND- AGED) White Dot Position Inlays Source: Mexico INTRODUCED: 2/2014 DISCONTINUED: 2015 (LIMITED PRODUCTION RUN OF ONLY 500) COMMENTS: SPECIAL LIMITED DEALER EXCLUSIVE MODEL (ONLY 500 TO BE BUILT IN 2014 )", "ItemID": "283360737552", "EndTime": "2019-02-02T02:00:15.000Z", "StartTime": "2019-02-01T02:00:15.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/FENDER-SPECIAL-EDITION-CLASSIC-60s-STRATOCASTER-RARE-CANARY-DIAMOND-1-500-/283360737552", "ListingType": "Chinese", "Location": "Scottsdale, Arizona", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2833607375528080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/ODQ0WDE2MDA=/z/wgEAAOSwvfpcGCHX/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5Mjk=/z/aXYAAOSwwS5cGCHU/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODg2WDE2MDA=/z/juUAAOSwoylcGCHP/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MTI=/z/WLUAAOSwLKhcGCHR/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODA4WDE2MDA=/z/ULAAAOSw0xtcGCHa/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDc5/z/MhEAAOSw~KNcGCHh/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTY4WDE2MDA=/z/DIkAAOSwuZVcGCHd/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTY2WDE2MDA=/z/NF8AAOSwC~9cGCoH/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/zE4AAOSwJ3RcGCHk/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTk2WDE1OTk=/z/5BgAAOSwBMpcGCHo/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODgyWDE2MDA=/z/6lAAAOSw~BRcGCHq/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MjU=/z/AOAAAOSwMKxcGCHt/$_1.JPG?set_id=8800005007"], "PostalCode": "85255", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jmhsrv1", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 303, "PositiveFeedbackPercent": 100.0}, "BidCount": 5, "ConvertedCurrentPrice": {"Value": 471.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 471.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "6***i", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 0}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "CA", "GB", "DK", "RO", "SK", "BG", "CZ", "FI", "HU", "LV", "LT", "MT", "EE", "AU", "GR", "PT", "CY", "SI", "JP", "CN", "SE", "KR", "ID", "TW", "TH", "BE", "FR", "HK", "IE", "NL", "PL", "ES", "IT", "DE", "AT", "BS", "IL", "MX", "NZ", "SG", "CH", "NO", "SA", "UA", "AE", "QA", "KW", "BH", "HR", "MY", "CL", "CO", "CR", "PA", "TT", "GT", "HN", "JM", "AG", "AW", "BZ", "DM", "GD", "KN", "LC", "MS", "TC", "BB", "BD", "BM", "BN", "BO", "EG", "GF", "GG", "GI", "GP", "IS", "JE", "JO", "KH", "KY", "LI", "LK", "LU", "MC", "MO", "MQ", "MV", "NI", "OM", "PK", "PY", "RE"], "Site": "US", "TimeLeft": "PT0S", "Title": "FENDER SPECIAL EDITION CLASSIC ‘60s STRATOCASTER RARE CANARY DIAMOND 1 of 500!", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["CANARY DIAMOND"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["SPECIAL EDITION CLASSIC '60 STRATOCASTER MOD"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Country/Region of Manufacture", "Value": ["Mexico"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Model Year", "Value": ["2014"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Series", "Value": ["FENDER CLASSIC SERIES"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Material", "Value": ["Solid Wood", "Alder"]}, {"Name": "Brand", "Value": ["FENDER"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}, {"Name": "Body Type", "Value": ["SOLID"]}]}, "HitCount": 122, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=220117578", "StoreName": "THE POP ROCK SHOP"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 476.0, "CurrencyID": "USD"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": true, "ConditionDescription": "SAVE NOW 2 WAYS IN THIS FANTASTIC SHOP SALE & AUCTION! A SHOP MODDED SPECIAL EDITION '60's STRAT UPGRADED CUSTOM LOADED PICKGUARD WITH HANDPICKED VINTAGE STYLE ALNICO PICKUPS, CUSTOM SHOP GAVITT PUSH-BACK CLOTH WIRING PLUS ALL BRAND NEW CTS POTS!  SPECIAL 3-DAY PACKAGE SALE!  WAS 1249... BUY IT NOW ONLY 825!  SEE ALL THE GREAT DETAILS ON THIS SHOP MODIFIED CLASSIC SERIES STRAT... 5 YEAR OLD VAULT PRESERVED BEAUTY.  FEATURED IN THE CANARY DIAMOND FACTORY FINISH. RELEASING FOR THE VERY 1ST TIME!", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}