{"BestOfferEnabled": false, "Description": "1960s VOX Phantom VI Electric Guitar 6 String Black and White **No Reserve** 1960s VOX Phantom VI Electric Guitar 6 String Black and White **No Reserve** Click images to enlarge Description Up for Auction is: 1960s VOX Phantom VI Electric Guitar 6 String Black and White.  I have taken pictures of the scratches and dings I observed on the guitar.  The previous owner engraved his social security number on the plate on the back and very little under the top first snap.  Also his name and phone number on the plate.  I did not take a picture of this because I cannot put his social security number out on the internet.  THis does not have a case.  I do not know the history of this guitar. You get exactly what you see in the pictures.     View My Feedback Once you have completed checkout we are unable to make changes to your order. Before completing your purchase, please make sure your shipping address is correct and formatted properly. We are unable to make changes to the shipping address after you have made payment and will only ship to the address provided at checkout.  For our mutual protection, orders over $150.00 will be shipped \"Signature Required\"...no exceptions. Items exceeding $250.00 will require insurance. Make note that all delivery times are estimates not guarantees. We have no control over delays caused by shipping carriers. **Please be aware, if you wish to return a new item, it MUST be in the same condition as it was sent.** ***ALL LOCAL PICK UPS MUST PRESENT A PHOTO ID AND HAVE A COPY OF YOUR INVOICE. PLEASE EMAIL ME TO SCHEDULE YOUR APPOINTMENT TO PICK UP YOUR PURCHASE.***   All of our auctions start at .01 with NO RESERVE. PRODUCT DESCRIPTION This product has been described to the best of our knowledge and in the greatest detail and truthfulness. We have also taken detailed photographs of the actual product being sold. These photographs often describe the item better than words. We have made every reasonable effort to disclose any known defects. We also test our products to the best of our ability.. DISCLAIMER Fast Cash Pawn Brokers is a resale store. We can not tell you if the item originally came from a smoke-free or pet-free home. New items may or may not be eligible for a warranty through the manufacturer. Please contact the original manufacturer to see if your item is eligible.    We have 3 other auction sites if you would like to see the items they have for sale-  Fastcashpawnbroker, Fastcashpawnbroker.com, and  Fastcashpawnbroker3.   Please Read Terms Before Bidding!   Emails requesting a buy-it-now price, shipments to Canada or overseas, or asking us to end a listing early will not receive a reply. PERSONAL CHECKS ARE NOT ACCEPTED AND WILL BE RETURNED. SALES TAX By law, we are required to collect sales tax on all auction items with a delivery address in Maryland. This applies to items which are picked up locally at one of our facilities. The tax rate will be 6%.  Payment for all items is due within 5 days of the auctions ending date. An e-mail notice is sent from our Paypal account after the end of auction with a checkout link. Non paying bidders will be left negative feedback unless they contact me via email to advise of a delay. Shipping Information: Please Note- ALL shipping costs are non-negotiable. We will only ship to the PayPal-REGISTERED Address included with the PayPal payment. We ship 3 days a week which will sometimes vary.  We try to get items out no later than  2-3 days after the auction ends.  We DO NOT ship on weekends. Items with payment received on Friday through Sunday will not ship until the following Monday. If you choose Media Mail as your shipping option- please allow up to 14 days for delivery SHIPPING AND INSURANCE Please use the Shipping Calculator located at the bottom of this listing.  Shipping quote is based on the actual published rates currently charged by the USPS and UPS. If your package is returned to us because of an incorrect address or if you were not able to receive/accept your package you will be responsible for shipping, return shipping & re-shipping charges. SHIPPING DESTINATIONS At this time, we ship only to the USA from from our Annapolis, Maryland location. No shipments will be made outside of the USA nor to Puerto Rico.  COMBINE SHIPPING We do offer combined shipping on multiple purchases in order to save our customers a great deal of money. The process of combining shipments can be difficult because of the extreme variation of the products that we sell (which range vastly in size, weight and fragility). We have developed a general system that usually works to everyone's satisfaction. After you win multiple auctions you will be allowed to combine your items automatically through our checkout system which will be e-mailed to you within 24 hours of winning any auction. For more detailed information on how our shipping and combined shipping work please click our calculate shipping icon located on every auction. PLEASE NOTIFY ME PRIOR TO PAYING FOR YOUR ITEMS, IF YOU WISH TO COMBINE SHIPPING. LOCAL PICK UP All customers are welcome to pick up their product in person at our store located in Annapolis, Maryland provided that prior arrangements with our eBay department have been made, which may include scheduling an appointment for your pickup. You will not be charged for shipping, however, there is a $2.00 handling fee for all purchases under $25.00. All local pick up customers will also be required to present a valid form of ID (drivers license or credit card) with the identical name that appears on their eBay account. This is so that no one else attempts to pickup your item if it has been paid via Paypal. Please remember that any purchased product that is not picked up after 30 days will remain the property of Fast Cash Pawnbrokers and you will be credited for your full purchase minus a $5 or 20% restocking fee (whichever is higher). Please remember, do not show up for your local pick up with out making prior arrangements through the eBay department, as the facility will not be prepared to handle your order. Unscheduled pickups will be turned away! Returns/Refunds: REFUND POLICY GENERAL Please remember that Annapolisjewelryandloan sells items in various condition, from brand new and factory sealed to severely damaged and parts only. Please make sure you always read the condition of each item prior to bidding. All refund claims must be made within 30 days from receipt of product and all requests must be  in writing (email). With the exception of a missing item all refunds will require a return authorization number (RMA) issued by annapolisjewelryandloan and the item must be shipped back to us for inspection and processing. Failure to obtain an RMA prior to returning an item will result in an Unauthorized Return which will incur additional penalties (see bellow for details). All returned items must be sent through the mail (UPS or Postal Service) and may NOT be dropped of in person. Any reimbursements will be made via the payment method chosen by the customer when the item was purchased (ie: if you paid with your Visa Card you will be refunded on your Visa Card). Please note that refunds take up to 7 days to post to your account and may not be visible until your next months billing statement. REFUND INCORRECT ITEM In the event that a customer receives an item different than the item that appeared at auction,  the customer will be fully refunded for that item including all shipping costs and  packing/handling fees related to that item as well as return shipping costs, up to the shipping  amount originally charged for the item returned. REFUND SHIPPING DAMAGE In the event that an item is damaged, beyond the condition stated at auction, the customer may claim up to the amount of insurance purchased on the package. REFUND UNAUTHORIZED RETURN In the event that we receive any item that does not contain an RMA number (Return  Merchandise Authorization) and to the extent that we can identify the item, we will refund the  full purchase price for the item minus a 30% restocking fee. We will NOT refund any shipping,  packing or handling fees. About Us: FastCashPawnbroker is the eBay Division of Fast Cash Pawnbrokers, a company serving Annapolis, Maryland. We specialize in offering new and used merchandise for sale at bargain prices. Our stock is varied, constantly changing, and includes many limited-quantity items. We select items for auction that we feel will be attractive to the online buying audience. We hope you will enjoy bidding on the merchandise we offer for auction, and we will try to assure your satisfaction. Fast Cash Pawnbrokers is an established, licensed business with a reputation to maintain. We guarantee that the merchandise you receive from us is as represented. What does that mean? Well, we are human and can make mistakes. So if you are not satisfied due to an unrecognized or unreported product flaw or misrepresentation, we will work diligently to rectify your concerns - up to and including allowing the return of the item and providing a full refund. Our industry is closely regulated and monitored. Every single item that passes through our stores is not only examined for function and serviceability, it also has its model and serial numbers reported to the police for a check against law enforcement databases. That should reassure you. After all, how many other auction sellers can guarantee that their merchandise has been screened in this way?   Buy with Confidence Payment PERSONAL CHECKS ARE NOT ACCEPTED AND WILL BE RETURNED. SALES TAX By law, we are required to collect sales tax on all auction items with a delivery address in Maryland. This applies to items which are picked up locally at one of our facilities. The tax rate will be 6%. Payment for all items is due within 5 days of the auctions ending date. An e-mail notice is sent from our Paypal account after the end of auction with a checkout link. Non paying bidders will be left negative feedback unless they contact me via email to advise of a delay. Shipping Shipping Information: Please Note- ALL shipping costs are non-negotiable. We will only ship to the PayPal-REGISTERED Address included with the PayPal payment. We ship 5 days a week which will sometimes vary. We try to get items out no later than 1-2 days after the auction ends. We DO NOT ship on weekends. Items with payment received on Friday through Sunday will not ship until the following Monday. If you choose Media Mail as your shipping option- please allow up to 14 days for delivery. SHIPPING AND INSURANCE Please use the Shipping Calculator located at the bottom of this listing. Shipping quote is based on the actual published rates currently charged by the USPS and UPS. If your package is returned to us because of an incorrect address or if you were not able to receive/accept your package you will be responsible for shipping, return shipping & re-shipping charges. SHIPPING DESTINATIONS At this time, we ship only to the USA from from our Annapolis, Maryland location. No shipments will be made outside of the USA nor to Puerto Rico. COMBINE SHIPPING We do offer combined shipping on multiple purchases in order to save our customers a great deal of money. The process of combining shipments can be difficult because of the extreme variation of the products that we sell (which range vastly in size, weight and fragility). We have developed a general system that usually works to everyone's satisfaction. After you win multiple auctions you will be allowed to combine your items automatically through our checkout system which will be e-mailed to you within 24 hours of winning any auction. For more detailed information on how our shipping and combined shipping work please click our calculate shipping icon located on every auction. PLEASE NOTIFY ME PRIOR TO PAYING FOR YOUR ITEMS, IF YOU WISH TO COMBINE SHIPPING. LOCAL PICK UP All customers are welcome to pick up their product in person at our store located in Annapolis, Maryland provided that prior arrangements with our eBay department have been made, which may include scheduling an appointment for your pickup. All local pick up customers will also be required to present a valid form of ID (drivers license or credit card) with the identical name that appears on their eBay account. This is so that no one else attempts to pickup your item if it has been paid via Paypal. Please remember that any purchased product that is not picked up after 30 days will remain the property of Fast Cash Pawnbrokers and you will be credited for your full purchase minus a $5 or 15% restocking fee (whichever is higher). Please remember, do not show up for your local pick up with out making prior arrangements through the eBay department, as the facility will not be prepared to handle your order. Unscheduled pickups will be turned away! Terms of Sale Returns/Refunds: REFUND POLICY GENERAL Please remember that Annapolisjewelryandloan sells items in various condition, from brand new and factory sealed to severely damaged and parts only. Please make sure you always read the condition of each item prior to bidding. All refund claims must be made within 14 days from receipt of product and all requests must be in writing (email). With the exception of a missing item all refunds will require a return authorization number (RMA) issued by annapolisjewelryandloan and the item must be shipped back to us for inspection and processing. Failure to obtain an RMA prior to returning an item will result in an Unauthorized Return which will incur additional penalties (see bellow for details). All returned items must be sent through the mail (UPS or Postal Service) and may NOT be dropped of in person. Any reimbursements will be made via the payment method chosen by the customer when the item was purchased (ie: if you paid with your Visa Card you will be refunded on your Visa Card). Please note that refunds take up to 7 days to post to your account and may not be visible until your next months billing statement. REFUND INCORRECT ITEM In the event that a customer receives an item different than the item that appeared at auction, the customer will be fully refunded for that item including all shipping costs and packing/handling fees related to that item as well as return shipping costs, up to the shipping amount originally charged for the item returned. REFUND SHIPPING DAMAGE In the event that an item is damaged, beyond the condition stated at auction, the customer may claim up to the amount of insurance purchased on the package. REFUND UNAUTHORIZED RETURN In the event that we receive any item that does not contain an RMA number (Return Merchandise Authorization) and to the extent that we can identify the item, we will refund the full purchase price for the item minus a 15% restocking fee. We will NOT refund any shipping, packing or handling fees. About Us About Us: FastCashPawnbroker is the eBay Division of Fast Cash Pawnbrokers, a company serving Annapolis, Maryland. We specialize in offering new and used merchandise for sale at bargain prices. Our stock is varied, constantly changing, and includes many limited-quantity items. We select items for auction that we feel will be attractive to the online buying audience. We hope you will enjoy bidding on the merchandise we offer for auction, and we will try to assure your satisfaction. Fast Cash Pawnbrokers is an established, licensed business with a reputation to maintain. We guarantee that the merchandise you receive from us is as represented. What does that mean? Well, we are human and can make mistakes. So if you are not satisfied due to an unrecognized or unreported product flaw or misrepresentation, we will work diligently to rectify your concerns - up to and including allowing the return of the item and providing a full refund. Our industry is closely regulated and monitored. Every single item that passes through our stores is not only examined for function and serviceability, it also has its model and serial numbers reported to the police for a check against law enforcement databases. That should reassure you. After all, how many other auction sellers can guarantee that their merchandise has been screened in this way? Images sell! Get Supersized Images & Free Image HostingCreate your brand with Auctiva's Customizable Templates. Attention Sellers - Get Templates Image Hosting, Scheduling at Auctiva.com. Track Page Views WithAuctiva's FREE Counter", "ItemID": "273549188429", "EndTime": "2018-11-12T23:21:04.000Z", "StartTime": "2018-11-07T23:21:04.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1960s-VOX-Phantom-VI-Electric-Guitar-6-String-Black-and-White-No-Reserve-/273549188429", "ListingType": "Chinese", "Location": "Annapolis, Maryland", "PaymentMethods": ["PayPal", "VisaMC", "Discover", "AmEx"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/2735491884298080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTAyNFg3Njg=/z/desAAOSwS6pb43PP/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg3Njg=/z/9JMAAOSw-tlb43PP/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg3Njg=/z/vUEAAOSweXFb43PP/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg3Njg=/z/HqgAAOSwH0Vb43PP/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg3Njg=/z/Fb4AAOSwNptb43PP/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg3Njg=/z/keoAAOSwn91b43PQ/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg3Njg=/z/OHYAAOSwrpJb43PQ/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg3Njg=/z/4csAAOSw-ghb43PQ/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg3Njg=/z/rkEAAOSw5Qtb43PQ/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg3Njg=/z/THkAAOSw0W9b43PQ/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg3Njg=/z/sFsAAOSwMO9b43PQ/$_1.JPG?set_id=880000500F"], "PostalCode": "21401", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "annapolisjewelryandloan", "FeedbackRatingStar": "Green", "FeedbackScore": 6739, "PositiveFeedbackPercent": 99.5}, "BidCount": 33, "ConvertedCurrentPrice": {"Value": 1225.55, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1225.55, "CurrencyID": "USD"}, "HighBidder": {"UserID": "h***r", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 2682}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "1960s VOX Phantom VI Electric Guitar 6 String Black and White **No Reserve**", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Vox"]}, {"Name": "MPN", "Value": ["Does not apply"]}]}, "HitCount": 457, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=5929758", "StoreName": "annapolisjewelryandloan"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 1250.55, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Good Condition", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}