{"BestOfferEnabled": false, "Description": "Powered by Frooition Shop CategoriesAccordionAmplifierBand & OrchestraBanjoCablesDJ & LightingDobro & Resonator GuitarDrum MachineDrums & PercussionDuplicator & RecorderGuitar & BassGuitar & Bass AccessoriesGuitar EffectsHanger & StandsHarp & DulcimerHeadphonesKeyboard & PianoMandolinMicrophoneOtherPickups & AccessoriesPower Supply & AdapterPro AudioSamplerSpeakerStringsTuner & MetronomeUkulele Charvel EVH Art Series Electric Guitar Item Description Previously owned 2002 Charvel EVH Art Series Electric Guitar in classic Red, Black & White Stripes Finish with Maple Fingerboard This guitar is in excellent condition with a few dings & scratches. The frets are in excellent condition. There is a small finish chip under the bridge. Includes hardshell case & tremolo bar. The case shows some cosmetic wear. Made in the USA. Serial #: US17063475. This guitar weighs approximately 7 pounds, 10 ounces. About Us About Us Payment Shipping Terms Returns About Us Welcome to Bill&apos;s Music! Bill&apos;s Music was started in 1965 and is celebrating over 52 years as one of the largest independent musical instrument dealers in the USA! Bill&apos;s Music is a family owned and operated full line musical instrument & gear store and is an authorized dealer & service center for many leading well known brands in the industry! Check out our huge selection of new and used guitars, basses, amps, power amplifiers, keyboards, digital pianos, electronics, brass, woodwind, bluegrass, pro audio, recording, DJ & lighting, drums, percussion, cymbals, parts & accessories! We provide fast, friendly, personal service with all items shipped the same day if paid by 3pm EST Mon-Fri. Bill&apos;s Music&apos;s retail store is located at 743 Frederick Road in Catonsville, Md 21228, just 10 minutes from downtown Baltimore and 45 minutes from Washington, DC. Payment Payment Payment must be made within 4 days! Payments accepted: PayPal, American Express, Master Card, Discover & Visa. You can pay with a major credit card directly by using PayPal. Shipping Shipping Domestic: For larger packages, we ship using UPS ground to the lower 48 states. However, we ship most small packages using USPS 1st Class or Priority Mail. UPS will NOT deliver to APO, FPO or P.O. Boxes! If you need items sent to these destinations we&apos;ll ship via USPS Priority mail. For larger packages shipped to Alaska, Hawaii & Puerto Rico we will ship via USPS Priority mail for an additional charge. Shipping insurance cost is included in all shipping quotes, for peace of mind and time savings. International: We ship internationally using USPS 1st Class International or Priority International airmail, usually 7-10 days delivery for most destinations. However, customs sometimes takes a considerable amount of time processing packages and it may take up to 3-4 weeks to actually receive your package especially using USPS 1st Class International Mail! If you want faster shipping we also use USPS Express Mail International. Please contact us for a shipping quote. We do not control Customs Duties and are not responsible for the duties your country imposes on you. ***Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer&apos;s responsibility. ***Please check with your country&apos;s customs office to determine what these additional costs will be prior to bidding/buying. Shipping insurance cost is included in all shipping quotes, for peace of mind and time savings. Terms Terms Payment must be made within 4 days after the auction ends or after the \"buy it now\" button is pressed! We will file a non-paying bidder claim with eBay if payment is not received after 2 days! If payment is not received or buyer has not contacted us about arranging payment after 4 days we&apos;ll close the non-paying bidder claim and re-list the item! In addition, the associated bidder id will be permanently blocked from bidding on all future items listed by Bill&apos;s Music! Bill&apos;s Music charges 6% Maryland sales tax to orders shipped to MD customers. Returns Returns Bill&apos;s Music wants you to be completely satisfied with your purchase! We&apos;re honest sellers with over 52 years in the music retail business! Customer satisfaction is very important to us and we&apos;ll try to resolve any problems that may arise. If you feel you&apos;ve received an item that was significantly not as described or was damaged in shipping please contact us immediately. New & Used items: If you&apos;re not 100% satisfied with your purchase of an item, please return it in its original condition within 30 days of receipt (see exceptions below) and we&apos;ll issue a full refund. If you received Free Shipping on your order, the original shipping cost will be deducted from your refund. New Returned items must be in original, brand-new condition, showing no signs of wear or use. Items must also include all original packaging, manuals, warranties and accessories or your return may be subject to a 20% restocking fee. Used Returned items must be in original sold condition, showing no additional signs of wear or damage! Items must also include all original packaging and accessories! Your return may subject to a 20% restocking fee. Exceptions: The following items are returnable only if defective OR unopened - tubes, speakers and pickups. You MUST contact us prior to shipping any returns! Send your returns to: If shipping via USPS: Bill&apos;s Music ATT: Leni/eBay PO Box 3157 Catonsville, MD 21228 If shipping via UPS, FedEx, DHS, etc: Bill&apos;s Music ATT: Leni/eBay 743 Frederick Road Catonsville, MD 21228 Helpful Links Add to Favorite Sellers Sign up to Newsletter View Feedback Contact Seller Visit seller&apos;s eBay Shop About Seller Page More Items!View more great items Powered by Frooition Frooition Frooition | No-js Template | eBay design, eBay store design, eBay shop design, eBay template design, eBay listing design (ver:froo_no_js) This listing is currently undergoing maintenance, we apologise for any inconvenience caused.", "ItemID": "332859773115", "EndTime": "2019-02-02T17:59:49.000Z", "StartTime": "2018-10-30T17:17:54.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Charvel-EVH-Art-Series-Electric-Guitar-/332859773115", "ListingType": "FixedPriceItem", "Location": "Catonsville, Maryland", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/3328597731158080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg1OTc=/z/JToAAOSwW7JbbGRy/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDI4/z/A~4AAOSwYwhbbGR0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/MDsAAOSwDu5bbGR2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/n8QAAOSwOMtbbGR4/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg4MDU=/z/f3EAAOSwHp5bbGR5/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDM1/z/bdoAAOSw1ktbbGR9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjA0/z/jzkAAOSwOD9bbGR~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg1ODM=/z/XSEAAOSwH2tbbGSD/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg4NTY=/z/YNIAAOSwzf9bbGSF/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg3NDg=/z/HgkAAOSwdT9bbGSG/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTcyWDE2MDA=/z/~OsAAOSw2fRb~DAG/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/pnYAAOSwPatcSyAI/$_57.JPG?set_id=8800005007"], "PostalCode": "21228", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "billsmusic", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 13458, "PositiveFeedbackPercent": 99.9}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 2049.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2049.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "n***n", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 111}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "Europe", "Asia", "CA", "AU"], "Site": "US", "TimeLeft": "PT0S", "Title": "Charvel EVH Art Series Electric Guitar ", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Red, Black & White Stripes"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Brand", "Value": ["Charvel"]}, {"Name": "Model", "Value": ["EVH Art Series"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Model Year", "Value": ["2002"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Fingerboard", "Value": ["Maple"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}]}, "HitCount": 1768, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=5064766", "StoreName": "billsmusic"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 0, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Central America and Caribbean", "Middle East", "Southeast Asia", "South America", "RU", "AL", "AD", "AT", "BY", "BA", "BG", "HR", "CY", "CZ", "EE", "GG", "HU", "JE", "LV", "LI", "LT", "MK", "MD", "MC", "ME", "PL", "RO", "SM", "RS", "SK", "SI", "SJ", "UA", "VA", "BM", "GL", "MX", "PM", "AF", "AM", "AZ", "BD", "BT", "CN", "GE", "IN", "KZ", "KR", "KG", "MV", "MN", "NP", "PK", "LK", "TJ", "TM", "UZ", "AS", "CK", "FJ", "PF", "GU", "KI", "MH", "FM", "NR", "NC", "NU", "PW", "PG", "SB", "TO", "TV", "VU", "WF", "WS"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "SKU": "2049", "NewBestOffer": false}