{"BestOfferEnabled": false, "Description": "Schecter Diamond Series Hellraiser Hybrid SGR C1FRS Ultra Violet Electric Guitar Item Description:You are bidding on a previously owned and in good playing condition Schecter Diamond Series Hellraiser Hybrid C1FRS Ultra Violet Electric Guitar. This auction is for the guitar and roadrunner case you see pictured. I am including two trem bars, one of them does not fit in the guitar and might be for a different one ( I do not know if either are original). Nothing else is included. It comes as pictured. Please take a moment to look at the pictures and get a better idea of what you are bidding on. One of the strings is cut and will need to be replaced. There are scuffs and scratches on the body from normal play wear. The neck is straight and the headstock is in good shape. The frets are in good shape as well with plenty of life in them. The back of the neck is smooth. The electronics have been tested and are in good working condition. This guitar is in good playing condition. The case has some dust, scuffs, and fraying from use. You might want to swap it out. We are including it for shipping safety. Please take a moment to check out my other great guitars! Thanks ccloan Shipping Information:California residents are required to pay sales tax of 7.75%. This will be automatically added to your eBay/Paypal invoice when the item is shipped within the state of California.We only ship to the lower 48 states and do not ship internationally. The ebay auction winner is required to pay $49.99 for shipping and handling.Shipping quote is for the continental domestic shipping. The shipping charge is fixed and non negotiable. The shipping costs cover the materials as well as postage to ship the item. We try our best to keep our rates very reasonable.We are located in Sacramento, CA . Shipping times from California to the east coast can be up to 6-7 business days. Ebay estimates are not always accurate. We do our best to ship all items within 1 business day of payment. Tracking will be uploaded to eBay so they can forward that information to you. This occurs within 2-3 hours after the item is received by the carrier. We do not ship on the weekends.We do combined shipping! Please message me prior to paying on your items and I will send you a combined invoice. Payment Information: Please make payment within one week of the auction. If you do not pay for the item within one week from the auction end we reserve the right to open a non-paying bidder claim. Hours of operation are from 10am to 5pm Monday - Friday. We are closed on Saturdays & Sundays. We offer local pick up for those who are located in the Sacramento Area. We do not accept Paypal for local pick up. We have to ship the item if you pay with paypal. You can save yourself the shipping but normal state sales tax applies. CA Business License #3400-0970. As an eBay seller, feedback is very important to US. We want to earn a positive rating from you, so please contact us if you have any issues. That positive rating also includes earning 5 Stars in all the Detailed Seller Ratings (DSR) categories. We try our hardest to give 5-Star Service by giving Clear, Accurate and Honest descriptions to the best of our abilities. We also clearly state our return policies and shipping terms up front so you know what to expect. If you are pleased with this transaction, please respond with all 5 Stars! If you are not pleased for any reason, Please contact us using the Contact Seller link on the auction page, and we'll try and make it a Five Star Sale! Give us 24 Hours during the work week and up to 48 hours on the weekends/holidays. Please do not open a case until you have contacted us first. We are here to help! Powered by SixBit's eCommerce Solution", "ItemID": "332980933498", "EndTime": "2019-01-04T01:46:49.000Z", "StartTime": "2018-12-28T01:46:49.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Schecter-Diamond-Series-Hellraiser-Hybrid-SGR-C1FRS-Ultra-Violet-Electric-Guitar-/332980933498", "ListingType": "Chinese", "Location": "Sacramento, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/3329809334988080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/RbQAAOSwF1tcHD5S/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/LKEAAOSwSs1cHD5V/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/19IAAOSwAbxcHD5Z/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/R9oAAOSwVH9cHD5b/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/HgMAAOSwpYxcHD5e/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/nA8AAOSw0wJcHD5g/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/4-IAAOSwa3FcHD5i/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/oRUAAOSwwPRcHD5l/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/yloAAOSwXI1cHD5o/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/okkAAOSwlThcHD5r/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/914AAOSwXGRcHD5u/$_57.JPG?set_id=880000500F"], "PostalCode": "95841", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "ccloan", "FeedbackRatingStar": "PurpleShooting", "FeedbackScore": 71905, "PositiveFeedbackPercent": 99.9, "TopRatedSeller": true}, "BidCount": 2, "ConvertedCurrentPrice": {"Value": 437.98, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 437.98, "CurrencyID": "USD"}, "HighBidder": {"UserID": "t***n", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 447}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Schecter Diamond Series Hellraiser Hybrid SGR C1FRS Ultra Violet Electric Guitar", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Schecter"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["C1FRS"]}, {"Name": "Model", "Value": ["C1FRS"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Color", "Value": ["Multicolor"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["Korea, Republic of"]}]}, "HitCount": 233, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=2011625", "StoreName": "Capital City Loan and Jewelry"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller"}, "MinimumToBid": {"Value": 442.98, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "TopRatedListing": true, "GlobalShipping": false, "ConditionDescription": "Please read the full description for more details.", "QuantitySoldByPickupInStore": 0, "SKU": "96091353222", "NewBestOffer": false}