{"BestOfferEnabled": true, "Description": "Epiphone Sheraton II PRO Ebony Finish With Gold Hardware Semi-Hollowbody Black Electric Guitar This guitar is in great condition. There is some minor cosmetic signs of use like some wear on the hardware, minor scratches, etc. Everything is fully functional and playable. We just restrung and did a basic set up on this guitar however we didn't need to do much besides make a very small tweak on the truss rod. The action on this guitar is awesome and it plays great all the way down. The current strings it has on it are the D'addario EXL110 10-46 electric guitar strings. Please view all provided photos for further reference on the conditon of this item. Factory description and specs are listed below. Featuring ProBucker™ pickups w/coil-splitting, Graphtech® NuBone XL™ nut plus new color finish! The Epiphone Sheraton™-II PRO honors Epiphone's most influential \"thin-line\" semi-hollowbody electric archtop, now offered in a beautiful new Midnight Sapphire finish plus critically acclaimed ProBucker™ pickups with coil-splitting and a Graphtech® NuBone XL™ nut. PRODUCT FEATURES Epiphone Sheraton-II™ PRO At A Glance Critically acclaimed ProBuckerTM Humbuckers with coil-splitting Traditional Mother of Pearl and Abalone Inlay Graphtech® NuBone XL and Grover® Rotomatics™ New Midnight Sapphire finish plus Ebony, Vintage Sunburst, and Wine Red SPECIFICATIONS Body MaterialLaminated Maple Top MaterialLaminated Maple Neck Material5-pc Hard Maple/Walnut Laminated Neck Shape1960's SlimTaper™ Neck JointGlued-In, Set Neck Scale Length24.75\" Fingerboard MaterialPau Ferro with \"block and triangle\" inlays w/Mother of Pearl and Abalone Fingerboard Radius12\" Frets22; Medium/Jumbo BindingTop: 5-ply (Ivory/Black), Back - 1-ply (Ivory), Neck - 5-ply (Ivory/Black), Headstock - 5-ply (Ivory/Black), \"F\" Holes - 1-ply (Ivory/Black) HeadstockVintage \"Large Clipped Ear\" with Mother of Pearl \"Vine\" Inlay NutGraphtech® NuBone XL Nut Width1-11/16\" HardwareGold Machine HeadsGrover® Rotomatics™; 18:1 ratio Neck PickupProBucker-2™ Bridge PickupProBucker-3™ ControlsBridge Volume with coil-splitting, Neck Volume with coil-splitting, Bridge Tone, Neck Tone, 3-way pickup selector (toggle); Ivory toggle cap BridgeEpiphone LockTone™ Tune-o-matic TailpieceEpiphone LockTone™ Stop Bar PickguardBound \"Tortoise\" Pickguard with metal \"E\" Truss Rod Cover2-ply; (Black/White); Vintage \"E\" in White KnobsTop Hats with metal inserts (Volume/Tone) StringsD'Addario® 10-46 gauge Immediate payment is required. Payable via PayPal, MasterCard, Discover, Visa, Amex. All payments by phone will ship next business day. Additional shipping charges apply to territories outside of the Lower 48 US (AL, PR, HI) - IN Residents pay sales tax. All packages ship Signature Required. Used Gear is sold as is. International buyers must pay immediately with Paypal. International buyer is responsible for any import taxes, custom fees, or duties due by their country. We will ship the most cost effective method which may include UPS, USPS or FedEx. All items $250 or above will be shipped signature required. No exceptions. drummersuperstore Company Policies; If you are not completely satisfied with any product, please contact us prior to leaving any feedback, we strive to make all transactions a GREAT experience! As with everything in life, we also have limits, here are a few.. If your item was purchased on eBay, please send all messages through eBay's my messages. Due to \"DNA\" and other things; The following items are returnable only if defective OR unopened or unused: strings, reeds, computers, tubes, earbuds, earplugs, recorders, tin whistles, flutophones, \"world\" wind instruments, harmonicas, raw-frame speakers, drumheads, drumsticks, turntable cartridges, fog fluid, clothing/footwear, body jewelry, sheet music, cleaners, polishes, and polishing cloths. Software/soundware, cassettes, books, CDs, DVDs, and videos may be returned for credit only if they are in their original, sealed packaging. If defective, these items will not be exchanged. Return Policy; A Return Authorization is needed to return any item to our store for any reason. Please contact your customer service representative prior to returning any item. You will need an RA# or Return Authorization Number in order to get a credit or replacement item. Items must be returned in the same condition as sold. If an item was purchased as new in the factory sealed box, it must be returned new in the factory sealed box. If an item has been used or played it is not eligible for a full refund. A 20% Restocking fee applies to all returns except warranty or shipping damage claims. Buyer pays all return shipping cost, unless it is a shipping damage claim. Although you may receive \"FREE SHIPPING\", there is no such thing as \"FREE SHIPPING\". All refunds are subject to a deduction of the original shipping cost we incurred. All Returns must be sent back with RA#, tracking and insurance, within 14 days. We are not responsible for any duties and taxes required by you country. Damaged Shipments? If an item was damaged during shipping, a shipping claim must be filed within 2 days of delivery. See instructions below for all shipping damage claims. For Shipping damage claims, please include photos and retain all original packaging. Send photos to us (Please call us for the email) and follow up with a phone call to ensure we haven't missed your email: ITEMS ARE NOT TO BE RETURNED WITHOUT AN RA#!! Claims & Warranties All new items have the manufacturer warranty. If you have a defective or non working item, which is covered under warranty, the buyer must pay return shipping back to the manufacturer after getting a return authorization number from DrummerSuperStore. You will also need include a copy of your invoice in the return. Do not send warrantied items back to our store. No warranty on any item(s) shipped Internationally or outside the lower 48 United States. All Used items carry no warranty, and are sold as is and there are no returns. Please ask any question you may have prior to purchasing a used item. Drummersuperstore reserves the right to refuse return for any reason. Sales Tax - We are required to collect sales tax on all orders shipped to Indiana.", "ItemID": "173730068178", "EndTime": "2019-01-11T11:28:08.000Z", "StartTime": "2019-01-08T19:58:11.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Epiphone-Sheraton-II-PRO-Ebony-Finish-Gold-Hardware-Electric-Guitar-/173730068178", "ListingType": "FixedPriceItem", "Location": "Clarksville, Indiana", "PaymentMethods": ["PayPal", "VisaMC", "Discover"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1737300681788080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/TjwAAOSwLeFcNPqM/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/uwQAAOSwj5BcNPqV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/zN4AAOSwZ8pcNPqd/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/PckAAOSwqLlcNPqy/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/bb4AAOSwsftcNPq8/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/SocAAOSwJOJcNPrI/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/FGEAAOSw7OdcNPrS/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/exMAAOSwWUBcNPro/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/dLwAAOSwPYRcNPrz/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/6mIAAOSw~odcNPsA/$_57.JPG?set_id=8800005007"], "PostalCode": "47129", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "drummersuperstore", "FeedbackRatingStar": "Green", "FeedbackScore": 9693, "PositiveFeedbackPercent": 99.7}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 499.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 499.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***a", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 7}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Epiphone Sheraton II PRO Ebony Finish With Gold Hardware Electric Guitar", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "Model", "Value": ["Sheraton-II"]}, {"Name": "Body Type", "Value": ["Semi-Hollow"]}, {"Name": "Body Color", "Value": ["Ebony Black"]}, {"Name": "MPN", "Value": ["Sheraton II PRO"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Features", "Value": ["Volume Knob", "With Pickup"]}]}, "HitCount": 66, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=94623712", "StoreName": "My-Music-Stores"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": true, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "AS", "GU", "KI", "MH", "FM", "NR", "NC", "NU", "PW", "PG", "SB", "TO", "TV", "VU", "WF", "WS", "RU", "BB", "BZ", "CR", "DM", "DO", "GD", "GP", "GT", "HT", "NI", "PR", "KN", "LC", "VC", "TT", "TC", "BN", "KH", "ID", "LA", "MO", "MY", "PH", "SG", "TW", "TH", "VN", "AR", "BO", "BR", "CO", "FK", "GF", "GY", "PY", "SR", "VE", "BH", "IQ", "IL", "JO", "KW", "LB", "OM", "QA", "SA", "AE", "YE", "AF", "AM", "AZ", "BD", "BT", "GE", "KR", "KG", "MN", "NP", "PK", "LK", "TJ", "TM", "UZ"], "GlobalShipping": false, "ConditionDescription": "This guitar is in great condition. There is some minor cosmetic signs of use like some wear on the hardware, minor scratches, etc. Everything is fully functional and playable. We just restrung and did a basic set up on this guitar however we didn't need to do much besides make a very small tweak on the truss rod. The action on this guitar is awesome and it plays great all the way down. The current strings it has on it are the D'addario EXL110 10-46 electric guitar strings. Please view all provided photos for further reference on the conditon of this item.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}