{"BestOfferEnabled": true, "Description": "Used Fender Jazzmaster in surf green nitro lacquer. This guitar is used, and has some marks to prove it. All electronics work perfectly and the guitar plays really nicely! Low action and the tuning is quite stable for a Jazzmaster. This is a pre-CITES guitar so it has the more desirable Rosewood fretboard. The lower bout has some dark marks in the lacquer, and the neck has a small finish chip that was filled in with what I think is rubber cement. It doesn’t look to go down to the wood, but I didn’t want to sand the neck finish to confirm. I am a hobbyist guitar player, not a store, so I cannot accept returns. Please ask any questions before you commit to purchase. If you buy the guitar, you must pay. I will not cancel orders. I ship all guitars fully insured and professionally packed. A previous owner was a smoker so there is a very light cigarette odor, mostly in the included hard case. I have aired the guitar and case out and the smell is all but gone, but I want to be up front about it. Tap into the Spirit and Tone of the '60s While you can certainly conjure iconic surf rock guitar tones with this sweet Fender '60s Jazzmaster Lacquer, its pair of American Vintage '65 Jazzmaster single-coil pickups, combined with powerful tone shaping and versatile switching, make this axe ready for virtually any musical task. On top of vintage tone, the '60s Jazzmaster Lacquer plays like a classic with its generous \"C\" neck profile and 7.25\" fretboard radius. No matter which guitar amplifier you plug into, the Fender '60s Jazzmaster Lacquer rewards you with epic tone and outstanding playability. Snappy, vivacious tone Fender equips the '60s Jazzmaster Lacquer with a pair of American Vintage '65 single-coil pickups. You'll be amazed at the balance of bark and bite you'll hear from your amplifier. It's one of the reasons you'll hear Jazzmasters in so many instrumental hits from the '60s — the tone is rich, balanced, and defined, the perfect foundation for many different musical styles. Offset waist for exceptional balance While it has a huge tonal range, many players love the Fender Jazzmaster simply because it feels great to wear and play, even for hours onstage. The offset waist on the '60s Jazzmaster Lacquer looks undeniably cool, but it also enhances the overall balance of the instrument. Whether you play sitting down or standing up, the Jazzmaster is one of the more comfortable guitars you'll find. Classic Jazzmaster tone shaping Lead and Rhythm tone circuits with individual tone controls give the '60s Jazzmaster Lacquer incredible flexibility. It's surprising that many of the most iconic Jazzmaster players often ignored the versatile switching options, but there's a whole world of tone to discover here. Between the wide tonal range of the '60s Jazzmaster Lacquer, your guitar amplifier, and your pedalboard, it's easy to sculpt your own unique tone. Fender '60s Jazzmaster Lacquer Solidbody Electric Guitar Features: Classic Jazzmaster guitar with vintage-accurate nitrocellulose lacquer finish Rich, snappy tone from dual American Vintage '65 Jazzmaster single-coil pickups Vintage looks and performance with the floating vibrato bridge/tailpiece Dual tone circuits give you a wide tonal range suitable for virtually any music style Comfortable maple neck capped with smooth-feeling and clear-sounding rosewood.", "ItemID": "233119332355", "EndTime": "2019-02-03T22:42:13.000Z", "StartTime": "2019-02-02T21:08:48.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fender-60s-Jazzmaster-Lacquer-Surf-Green-Rosewood-Fretboard-/233119332355", "ListingType": "FixedPriceItem", "Location": "Madison, Wisconsin", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2331193323558080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTU1MVg2NjA=/z/6AAAAOSwVAtcVgRH/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/bF4AAOSwR0dcVgQm/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTUzOFg1MjI=/z/7ToAAOSw6S9cVgQ7/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/TUEAAOSwALlcVgQW/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/3FcAAOSwEcdcVgQh/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/MhwAAOSwPXFcVgQd/$_12.JPG?set_id=880000500F"], "PostalCode": "53719", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "tgbrass", "FeedbackRatingStar": "Purple", "FeedbackScore": 886, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 750.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 750.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "s***6", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 1}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Fender '60s Jazzmaster Lacquer - Surf Green - Rosewood Fretboard", "ItemSpecifics": {"NameValueList": [{"Name": "Body Material", "Value": ["Rosewood"]}, {"Name": "Brand", "Value": ["Fender"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Jazzmaster"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Country/Region of Manufacture", "Value": ["Mexico"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Surf Green"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "MPN", "Value": ["0141210757"]}]}, "HitCount": 129, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}