{"BestOfferEnabled": true, "Description": "USA Auction Only! This is a RARE, all original, mint condition Charvel 2014 Super Stock SD1 guitar in the limited edition Sunset Orange Metal Flake. Only 125 of these were made worldwide! Included is a nice Fender deluxe padded gig bag, not a thin cheapo. *There are NONE of these currently for sale on eBay as they are VERY HARD TO FIND! I'm only selling this as I've decided to go in a different direction with the guitars I'm collecting. I'm willing to negotiate a little on the price but I don't need a quick sale so please don't send any low ball offers. Make the right offer and it's yours or buy it now before you miss it! Here's the original specs on this model from Charvel:Grab a Charvel Super Stock SD1 FR solidbody electric guitar and prepare to rock. Once you plug this classic-rock-ready axe into your favorite amp, you're going to be totally blown away. From the sound of its dual Seymour Duncan humbuckers resonating with its lightweight alder body to the feel of its fast neck and compound-radius fingerboard, there's nothing else quite like this Super Stock SD1 FR guitar. Add to that the amazing action of a Floyd Rose tremolo bridge, and you've got a rock-ready axe with the Charvel Super Stock SD1 FR guitar.Charvel San Dimas Custom Shop Solidbody Electric Guitar at a Glance:Killer combination of Seymour Duncan humbuckers deliver time-tested rock toneFloyd Rose tremolo bridge gives you serious bends and tuning stabilityA neck designed for stability and fast fretworkKiller combination of Seymour Duncan humbuckers deliver time-tested rock toneYou'll rarely come across a more broadly liked combination of pickups than the duo loaded into this Super Stock SD1 FR guitar. In fact, at Sweetwater, sticking a Seymour Duncan JB model at the bridge and one of their '59 humbuckers at the neck is a pretty popular mod. Why? Because these pickups come together to give you a wide range of amazing tone. When you rock a Charvel Super Stock SD1 FR guitar, you'll get the toothy grit you need for riffing plus the fat and smooth lead tones you love.Floyd Rose tremolo bridge gives you serious bends and tuning stabilityIn typical Charvel fashion, this incredible guitar was built with nothing but quality hardware onboard. That's why they gave the Super Stock SD1 FR guitar a real 2-point, double-locking Floyd Rose tremolo tailpiece. Floyd Rose bridges stay in tune, holding up to the abuse any hard-rocking guitarist dishes out. The lightweight Floyd Rose double-locking tremolo tailpiece gives you the real feel of an original Floyd Rose, adding to the Charvel Super Stock SD1 FR's amazingly responsive feel.A neck designed for stability and fast fretworkThe Charvel Super Stock SD1 FR features a 1-piece quartersawn maple neck. Usually only found on higher-end guitars, quartersawn necks provide extra strength and stability. Besides looking good, the straight grain of quartersawn necks is about 50% more stable than plain-sawn necks and less likely to warp, twist, or shrink. And whether you play smooth rhythms or furious leads, you'll love the feel of the Super Stock SD1 FR's compound radius fretboard. With a 12\" radius at the nut flattening to 16\" at the 12th fret, you've got the just-right feel you need to grab chords in the lower positions, while the flatter upper registers allow blazing fast fretwork.Charvel Super Stock SD1 FR Solidbody Electric Guitar Features:An amazing axe that gives you hot-rodded Fender style, Charvel feel, and classic-rock-style humbucker toneCombination of Seymour Duncan JB and '59 humbuckers delivers tried-and-true rock soundAlder body is lightweight and tone-packedBolt-on quartersawn maple neck provides you with super-fast actionCompound-radius maple fingerboard makes fretting chords and pulling off upper-fret runs easyFloyd Rose tremolo bridge delivers tight action and response without sacrificing tuning stabilityDeluxe gig bag includedGet the style, feel, and sound you've always wanted with a Charvel Super Stock SD1 FR! CONDITION:Please review the photos as they are a part of the description and show exactly the condition of the guitar and what you will receive. This guitar is in very clean condition with no signs of use that I can find. The pictures really don't do this guitar justice. The orange metallic flake finish is amazing and would look awesome under stage lights. Or if your buying it to collect it will stun you in your home lighting! The Fender deluxe gig bag is used but in great condition, all zippers work and there are no rips or tears. It does have some slight smoke odor that some Febreeze would probably take care of. Condition is very subjective but I describe everything as best I can and I do have a 100% positive seller rating. If you have any questions please ask. *Shipping indicated is for the lower 48 States. Please check my other auctions for more guitar and bass gear!", "ItemID": "223301232045", "EndTime": "2018-12-28T17:01:45.000Z", "StartTime": "2018-12-28T02:33:00.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Charvel-Pro-Mod-Sunset-Orange-Metallic-Flake-Guitar-1-125-Deluxe-Gig-Bag-MINT-/223301232045", "ListingType": "FixedPriceItem", "Location": "Jacksonville, Florida", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/2233012320458080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA2MVgxNjAw/z/AxcAAOSwOJZcJGHB/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/mZ4AAOSwZ2FcJGHF/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzA1WDE2MDA=/z/dJgAAOSwQqNcJGHI/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTEyMlgxNjAw/z/gP4AAOSwvERcJGHL/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzI1WDE2MDA=/z/UFMAAOSwW~JcJGHO/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwNFgxNjAw/z/ZtgAAOSwhu9cJGHS/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/CEkAAOSwMKFcJGHW/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/HXEAAOSwfhlcJGHZ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDc0/z/0JMAAOSw5wFcJGHd/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/Nzg3WDE2MDA=/z/juEAAOSwektcJGHg/$_57.JPG?set_id=8800005007"], "PostalCode": "32226", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "poprocks2004", "FeedbackRatingStar": "Red", "FeedbackScore": 4909, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1399.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1399.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "c***0", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 347}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Charvel Pro Mod Sunset Orange Metallic Flake Guitar 1 of 125 Deluxe Gig Bag MINT", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Charvel"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model", "Value": ["Pro Mod"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Sunset Orange Metal Flake"]}, {"Name": "Model Year", "Value": ["2014"]}, {"Name": "Country/Region of Manufacture", "Value": ["Mexico"]}]}, "HitCount": 59, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "mint condition", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}