{"BestOfferEnabled": false, "Description": "2011 Gibson Les Paul Gold Top Electric Guitar with Soft Bag Condition: Used Brand: Gibson Model: 2011 Les Paul Includes: soft gig bag DESCRIPTION: This guitar is in very good cosmetic condition. The body contains very minor signs of normal wear consistent with prior use and ownership. Very small ding on the corner and on the back of neck- pictured. The neck is straight and free of any splits or breaks in its surface. The control knobs move freely, without resistance or static. Please see images. 　 This item has been tested and the electronics are working properly. 　 Serial #116011303 USA *The stand is for display purposes and is not included* Please click \"See other items\" to see all the great items I have for sale. I'll gladly combine shipping on multiple purchases where possible, to save you money! But please, wait for an updated invoice before payment is sent. We have other ebay sellers if you would like to see the items they have for sale- Annapolisjewelryandloan, Fastcashpawnbroker3 & FastCashPawnbroker2. Payment We are unable to make changes to the shipping address after you have made payment and will only ship to the address provided at checkout. Online payments are accepted through PayPal ONLY. We do not accept any other forms of online payments. Payment for all items are due within 5 days of the auctions selling date, unless prior arrangements have been made. After the fifth day, an unpaid dispute will be opened and the item will be relisted. By law, we are required to collect sales tax on all auction items with a delivery address in Maryland. This applies to items which are picked up locally at one of our facilities. The tax rate will be 6%. All customers are welcome to pick up their product in person at our store located in Dundalk , Maryland. All local pick up customers will also be required to present a valid form of ID (drivers license or credit card) with the identical name that appears on their eBay account . This is so that no one else attempts to pickup your item if it has been paid via Paypal. Please bring a copy of your invoice with you. Shipping & Returns We ship items within 2 business days after receiving payment. We do not ship Friday-Sunday. Please use the Shipping Calculator located at the bottom of this listing. Shipping quote is based on the actual published rates currently charged by the USPS and UPS. If your package is returned to us because of an incorrect address or if you were not able to receive/accept your package you will be responsible for shipping, return shipping & re-shipping charges. At this time, we ship only to the USA from our Baltimore, Maryland location. No shipments will be made outside of the USA nor to Puerto Rico. Flat rate boxes are not used. We ship our items using UPS Ground & USPS. The buyer has 30 days to return an item if they are not satisfied for a full refund. Shipping refunds are only granted if the item was not as described. Please follow these steps if you would like to return an item, Go to your recent purchases, click on the item, then click on the returns option. There you will be able to print a pre-paid label. If you wish to return a new item, it MUST be in the same condition as it was sent. For our mutual protection, orders over $200.00 will be shipped \"Signature Required\"...no exceptions. Make note that all delivery times are estimates not guarantees. We have no control over delays caused by shipping carriers. Our AS IS items do not qualify for any refunds or returns. About Us FastCashPawnbrokers is the eBay Division of Fast Cash Pawnbrokers, a company serving Baltimore, Maryland. We are an established, licensed business with a reputation to maintain. We guarantee that the merchandise you receive from us is as represented. What does that mean? Well, we are human and can make mistakes. So if you are not satisfied due to an unrecognized or unreported product flaw or misrepresentation, we will work diligently to rectify your concerns - up to and including allowing the return of the item and providing a full refund. Our industry is closely regulated and monitored. Every single item that passes through our stores is not only examined for function and serviceability, it also has its model and serial numbers reported to the police for a check against law enforcement databases. That should reassure you. After all, how many other auction sellers can guarantee that their merchandise has been screened in this way? About Our Merchandise We specialize in offering new and used merchandise for sale at bargain prices. Our stock is varied, constantly changing, and includes many limited-quantity items. We select items for auction that we feel will be attractive to the online buying audience. We hope you will enjoy bidding on the merchandise we offer for auction, and we will try our best to assure your satisfaction. We test and describe each item to the best of our ability. There are some items that we cannot test, if so that is stated with in the listing. These items are listed “AS IS” and are sold as a final sale. Please feel free to ask any questions you may have. Photographs often describe an items condition better than any words can, so please check out our pictures. Actual photos of each item are shown in the auction. Our auctions start at 1 penny with no reserve price! Our top goal is making sure our customers are happy. If there is ever an issue with an item you have purchased, please contact us so we can fix any problems. Thank you for your business!", "ItemID": "372570078257", "EndTime": "2019-01-23T23:16:21.000Z", "StartTime": "2019-01-16T23:16:21.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2011-Gibson-Les-Paul-Model-Gold-Top-Electric-Guitar-Soft-Bag-/372570078257", "ListingType": "Chinese", "Location": "Dundalk, Maryland", "PaymentMethods": ["PayPal", "VisaMC", "Discover", "AmEx"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/3725700782578080_2.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMDI4/z/Ef4AAOSwWdNcP7sC/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDI5/z/wzcAAOSwiSVcP7sK/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg4NTA=/z/k3AAAOSwx9lcP7sS/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMTMx/z/oqIAAOSwaPpcP7sa/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDY3/z/fn8AAOSwsGpcP7xK/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg2MzE=/z/UjIAAOSw5bxcP7so/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDI3/z/glcAAOSw4SxcP7sw/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNDQy/z/aocAAOSwqrZcP7s3/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg3NDI=/z/KEoAAOSwVAtcP7s9/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg4NTA=/z/n-MAAOSwqztcP7tD/$_1.JPG?set_id=880000500F"], "PostalCode": "21222", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "fastcashpawnbroker.com", "FeedbackRatingStar": "TurquoiseShooting", "FeedbackScore": 31037, "PositiveFeedbackPercent": 99.3, "TopRatedSeller": true}, "BidCount": 39, "ConvertedCurrentPrice": {"Value": 630.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 630.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "l***a", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 40}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2011 Gibson Les Paul Model Gold Top Electric Guitar with Soft Bag", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Product Line", "Value": ["Gibson Les Paul"]}, {"Name": "Model", "Value": ["Les Paul Gold Top"]}, {"Name": "Model Year", "Value": ["2011"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}]}, "HitCount": 1740, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=31034115", "StoreName": "Fast Cash Pawnbrokers of Baltimore"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 640.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "SKU": "c4 293802-1 rzz", "NewBestOffer": false}