{"BestOfferEnabled": true, "Description": "Overview: Up for sale is this 1984 Fender USA AVRI Reissue of the 1962 Stratocaster. This is a Fullerton Stratocaster. It has real road rash from 34 years of real use. This guitar is not a “relic'd fake” it is the real deal, if you want a cheap fake look elsewhere. I am the original owner of this guitar, I bought it new in 1985, and the only reason I am selling it is because I smashed my left hand(my fret-board hand) in a car crash and cannot play anymore. Yes, it has seen live dive bar gigs, yes it has had mike stands fall on it, beer bottles smashed on it, and fallen off of guitar stands. Yes it has been double routed for double humbuckers, but it is still a tank and still plays, and sounds like a legit 62 Fullerton strat with the best Custom parts that money can buy. This guitar has been customized one screw at a time for Maximum tone, Maximum sustain, and Maximum capability to stay in tune. This is an alternate version of the original listing to include all of the original parts and case, but NONE of the new parts. This auction includes: Original Body(with battery box, Jack Plate, and Jack) (no other parts) Original Neck Plate and original neck mounting screws(4) Original Neck(no tuners, or nut) Original Case(with original manual, wiring diagram, humisorb) Extra Brass Nut that will fit the original neck Please read the information in this Description thoroughly before bidding. This is not an all original collectors item, with all original parts. This is a heavily modified players guitar. The original Electronics, bridge assembly and tuning keys were lost in a move year ago. I do not have them. Make no mistake this is not a “glass case” display guitar. This is the customized hot rod that plays and sounds better than the stock collectors items. In the automotive hot rod world this is not a “trailer queen” that the owner won't race because he doesn't want to scratch the paint job. This is the scary black primer car that shakes the ground when it starts, and everyone is afraid to race against. In the Metal Music world this guitar couldn't get more “brutal”, metal heads know what I'm talking about. Experienced Vintage contemporary players you know tone is king, and money can't buy better tone, regardless of your music style or pickup choice. This guitar has the \"Brown Sound\" if you know what I'm talking about. It DOESN'T MATTER that it has had the pickup holes routed(unless your only interested in a collectors piece). With the super high end custom parts it has on it, its sound amazing. Eddie Van Halen's Guitar had a side by side humbucker crooked pickup routed hole in it on the first Van Halen album and it is arguably that best guitar tone ever recorded. It is a Customized American Made Fender Stratocaster, with an Age Old Alder wood body any way you look at it. FAQ: It does not include any of the original pickups or electronics.(no I don't have them) It does not include the original tremelo bridge assembly or parts. (no I don't have it) It does not include the original tuning machines. (no I don't have them) It does not include the original nut. (no I don't have it) It does not include the original pickguard.(no I don't it) It does not include the new neck, or ay parts on the neck It doe not include the bridge assemlby or new parts. It does not inclcude the tremelo no or parts It does not include the new pickguard, pickup, pickguard screws. Yes you can set it up to use the tremelo-no not fixed, or put a vintage style tremelo working bridge on it. Yes you can put single coil tex mex or whatever single coil pickups in it and get that 1969 sound if that's what you want Yes you can put the original neck on it and it will be fine if that is what you want. There has been little use on the original neck since the frets were dressed last.(needs nut and tuning machines) Details * Factory Manufacturing date as penciled on neck (see pics) 4/16/84. * Factory Serial Number V006921.(see pics) * Original Age Old Alder body, with a tri-tone sunburst nitrocellulose finish. * Original Maple Neck with a Rosewood Fretboard, 7.25 radius 25.5 scale * Dimarzio Jack * Made in the Original Fender Plant Fullerton, California, USA 1984 by the original creators using age old wood, that the new re-issues do not have.Upgrades and Customizations: Body: It has had the neck, and bridge pickup routing, routed out by a pro to accommodate side by side humbucker pickups. It has had the end bridge mounting screw holes routed out to fit a Wilkinson tremelo. I had them replugged with mahagony plugs(they didn't have age old alder to plug them with). It is the original Neck Screws and Neck Plate. It has had a single battery box installed by a pro for an active bridge pickup I had in it(seymour duncan blackout)Neck: I had jumbo frets installed on the original neck years ago by a pro, and years later they were dressed by a pro. The original neck is fine, I simply preferred 9.5 radius. To the vintage 7.25 radius. It has had a behind the nut locking nut on it at one point.(see pics) It has had after market tuning machines on it at one point. Vintage size grovers I think but not sure. I measured the peg holes just short of 12/32, so they must be a comfortable 11/32. The smooth end of a 3/8 drill bit will barely fit very snugly. The back of the neck has been sanded smooth only because of the clear coat had some chips I could feel on my thumb and hand, and it was worn there already so I simply sanded the chips to be smooth with some 440 sandpaper.Setup: This guitar is currently setup in Low C tuning (every string 2 steps down) with .011 gauge jazz strings on it. If your a drop tuner you know the deal. Contemporary players, yes of course you can set it up in standard tuning or whatever with .009's just like any other guitar. The low E bridge saddle has been shortened on the back end(srew mounting side) so it could be move back more to accomidate intonation of the current de-tuned setup. Extras: Brass Nut (7.25 radius was on the original neck at one point) Stewart MacDonald Case latches (brand new still in the plastic) the left side lock on the case is broken off. I never got around to installing a new latch in its place. Original Tweed Case (with road rash, yes it has scratches and tears in it) Original Manual Original Made in USA Culligan Humi-Sorb moisture pack Original Tremelo Springs envelope. Original Fender 5-position pickup Selector Switch wiring Diagram. ************************************************************************************************ This will be professionally packaged by UPS and insured. ************************************************************************************************ Return Policy: Full Refund If the item is damaged in shipping. Keep the original packing material for return if the item is damaged in shipping. Do not send back until further instructions. Contact me and I will file a damage/insurance claim to get your money back to you. No return if you damage it yourself, or you change your mind, be sure this is what you want, I'm not walmart.", "ItemID": "264031787299", "EndTime": "2018-11-09T17:28:54.000Z", "StartTime": "2018-11-09T17:15:46.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1984-62-Fender-Stratocaster-American-Vintage-Fullerton-AVRI-Reissue-Sunburst-/264031787299", "ListingType": "Chinese", "Location": "Dandridge, Tennessee", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2640317872998080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/GHYAAOSw~G9b0fpM/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/tPUAAOSwHhRb0fpg/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/0I0AAOSwP9Jb0fpm/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/ALgAAOSwHORb0fpt/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/6yYAAOSwJ6Vb0frR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/UNMAAOSwBJVb0fqV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/nCcAAOSwfHdb0fvp/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Gz4AAOSwcABb0fwL/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/jxEAAOSweIlb0fwj/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/whEAAOSww7tb0fw9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/FnkAAOSwiE1b4Zp-/$_57.JPG?set_id=8800005007"], "PostalCode": "37725", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "aaron268", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 137, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 2000.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2000.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "e***j", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 207}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "1984 '62 Fender Stratocaster, American Vintage Fullerton AVRI Reissue. Sunburst", "ItemSpecifics": {"NameValueList": [{"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Modified Item", "Value": ["Yes"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Modification Description", "Value": ["see details"]}, {"Name": "Model Year", "Value": ["1984"]}, {"Name": "Body Material", "Value": ["Age Old Alder", "Alder"]}, {"Name": "Body Color", "Value": ["sunburst"]}, {"Name": "Model", "Value": ["62 Stratocaster"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Brand", "Value": ["Fender"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "MPN", "Value": ["V006921"]}]}, "HitCount": 4, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=22131267", "StoreName": "Aaron&#39;s Secondhand Goods"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 2025.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Customized, Plays and sounds amazing lots of custom parts.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}