{"BestOfferEnabled": false, "Description": "Selling this beautiful sounding and playing Les Paul! See pics for condition. Excellent shape with only a tiny nick on the back near the switch cover. The guitar is setup and ready to play with all documentation included! Raising the Bar on the Studio-standard Les PaulThe Les Paul Studio has always been a base model for guitarists who want the essence of the Les Paul without all the frills. That's why even the guitar geeks at Sweetwater weren't expecting the 2015 Les Paul Studio to be so incredibly cool. For starters, Gibson tricked this solidbody electric guitar out with a figured maple top and real mother-of-pearl inlays, which look amazing. But then they also outfitted it with a '57 Classic/'57 Classic Plus pickup combo (including coil splitting), so it sounds awesome, too. You'll love the feel of the Zero Fret Nut, and as if that weren't enough, this axe comes standard with a G-Force automatic tuning system that's out of this world!Gibson 2015 Les Paul Studio Solidbody Electric Guitar at a Glance:'57 Classic humbuckers deliver warmth, power, and tonal flexibilityG-Force automatic tuning system delivers perfect intonation and moreGibson's 2015 updates offer enhanced playability and customization'57 Classic humbuckers deliver warmth, power, and tonal flexibilityIf you love the warm and even tone of a traditional Alnico II PAF-style humbucker, then you're going to dig the pickups Gibson loaded with this 2015 Les Paul Studio. Up at the neck, there's a '57 Classic whose articulate and smooth voice is a perfect match for the bite and crunch of the slightly hotter '57 Classic Plus back at the bridge. Talk about old-school done right, too - these pickups offer the stable sound of wax-potted coils and orange drop capacitors. What's more, you can flip a mini toggle to tap into a world of coil-tapped tone.G-Force automatic tuning system delivers perfect intonation and moreIf you loved Gibson's Min-ETune tuning system, then you'll love their newly-developed G-Force even more. Thanks to G-Force, not only can you tune your 2015 Les Paul Studio solidbody electric guitar with a single strum, but you can also make use of alternate tunings without having to retune or switch guitars. You can also calibrate your guitar to an external source. Say you have a vintage piano that's not quite tuned to A440. Now, thanks to G-Force, the piano and your guitar can play together beautifully with no tuning hassles.Gibson's 2015 updates offer enhanced playability and customizationComfort and playability were two of Gibson's primary concerns when they were designing this 2015 Les Paul Studio solidbody electric guitar. This guitar's neck and fretboard are .050\" wider on each side, making bends and vibrato much easier on its outer strings. Speaking of this Les Paul Studio's silky-smooth fretboard, it's now sanded and buffed to perfection with an all-new oil treatment - an amazingly smooth feel for faster players. Also, Gibson's new patent-pending Zero Fret Nut can be easily adjusted with a hex key if your action is too high - no filing necessary. The Gibson Les Paul Studio plays like a well-worn classic, thanks to a new PLEK process and a new lower fret wire.Gibson 2015 Les Paul Studio Solidbody Electric Guitar Features:A revised Les Paul Studio model loaded with 2015 upgrades and appointmentsMahogany body with modern body rout and mahogany SlimTaper neck offers exceptional playing comfortFigured maple top, mother-of-pearl trapezoid fretboard inlays, and satin nickel hardware look great'57 Classic and '57 Classic Plus humbuckers offer classic PAF tone with coil splitting flexibilityZero Fret Nut lets you quickly adjust your guitar's actionG-Force automatic tuning system lets you tune faster, explore alternate tunings, and save your own custom tuningsLes Paul 100 signature and hologram celebrate Les's 100th birthdayMore robust wiring and improved jack design for a solid, uninterrupted signalHardshell case includedThe 2015 Les Paul Studio delivers LP style and a whole lot more!The reserve is set well below the Buy it now price!", "ItemID": "273667102088", "EndTime": "2019-01-28T15:46:11.000Z", "StartTime": "2019-01-21T15:46:11.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/USA-Wine-Red-Gibson-Les-Paul-100-Studio-2015-gold-OHSC-/273667102088", "ListingType": "Chinese", "Location": "Midlothian, Virginia", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2736671020888080_2.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/tkYAAOSw2zRcPKxg/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/iIcAAOSwcapcPKxx/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/HuIAAOSwSVNcPKxb/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/mm0AAOSwuZ9cPK2S/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Di0AAOSwGIZcPK08/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/1-UAAOSw4ohcPKxn/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/fI8AAOSwt0dcPK11/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/CUYAAOSwrHtcPK1V/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/AhcAAOSwHGJcPKyd/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/gkgAAOSwXgxcPK2E/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/YGAAAOSwK~BcPKyr/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/xZQAAOSwr~9cPK2-/$_32.JPG?set_id=880000500F"], "PostalCode": "23112", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "stevesguitarcave", "FeedbackRatingStar": "Purple", "FeedbackScore": 678, "PositiveFeedbackPercent": 100.0}, "BidCount": 4, "ConvertedCurrentPrice": {"Value": 799.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 799.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "2***_", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 70}, "ListingStatus": "Completed", "QuantitySold": 1, "ReserveMet": true, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "USA Wine-Red Gibson Les Paul 100 Studio 2015 with gold OHSC!", "ItemSpecifics": {"NameValueList": [{"Name": "Product Line", "Value": ["Gibson Les Paul"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model Year", "Value": ["2015"]}, {"Name": "Model", "Value": ["Les Paul 100"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Red"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}]}, "HitCount": 315, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "14 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 809.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}