{"BestOfferEnabled": false, "Description": "See how it sounds!! Click link below to hear in action. https://youtu.be/SbKOPZVKE2E 2017 model in excellent condition! No reserve! PRS McCarty Solidbody Electric Guitar at a Glance: Solid tonewoods and McCarty design deliver an amazing guitar 58/15 pickups deliver sweetened humbucker sound Pattern profile neck feels great and plays smoothly Solid tonewoods and McCarty design deliver an amazing guitar To give the PRS McCarty a rich and balanced sound, PRS began by choosing the tried-and-true combination of a mahogany body with a figured maple top. The mahogany body gives you natural tonal warmth, which is offset perfectly by the brighter tone of maple. And the slightly thicker McCarty body depth adds to this guitar's uniqueness and sustain. Together, these tonewoods and design give you an incredibly balanced sound. 58/15 pickups deliver sweetened humbucker sound Speaking of tone, playing with the PRS McCarty's 58/15 pickups alone is an inspiring experience. That's because Paul Reed Smith himself designed the 58/15 pickups to give you the sweetened sound you'd expect from real vintage humbuckers. If you want to replicate the best you should go right to the source. That's just what PRS did when they bought the same coil wire manufacturing machine that '50s-era guitar makers used to create some of the most iconic pickups in history. The 58/15 pickups give this PRS McCarty the classic humbucker tones you've been looking for. And a push/pull Tone control splits the pickup coils for sparkly single-coil tones. Take it from the Sweetwater crew - the PRS McCarty has the sounds and versatility you need for any gig. Pattern profile neck feels great and plays smoothly Guitarists know that neck shapes are critical to your playing experience. The McCarty is fitted with PRS's Pattern neck profile. Perfected after years of prototyping, the Pattern neck is an updated PRS Wide Fat neck style based on designs Paul Reed Smith did in the '70s and '80s for Carlos Santana, Peter Frampton, and Howard Leese of Heart. The McCarty's bound rosewood fingerboard offers smooth playability from headstock to body. And with bird inlays no one will mistake your axe for anything other than a PRS. PRS McCarty Solidbody Electric Guitar Features: Versatile electric guitar with McCarty appointments Deeper McCarty body depth increases sustain and tone Figured maple top and mahogany body offer classic electric guitar tones Splittable 58/15 pickups deliver vintage-style humbucker and single-coil sounds Bound rosewood fingerboard and Pattern shape mahogany neck play fast and smooth PRS adjustable stoptail bridge and locking tuners for reliable tuning and note bending Hardshell case included", "ItemID": "253988303807", "EndTime": "2018-11-25T17:51:10.000Z", "StartTime": "2018-11-18T17:51:10.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/PRS-McCarty-Figured-Top-Faded-Whale-Blue-Pattern-Regular-Neck-/253988303807", "ListingType": "Chinese", "Location": "Carol Stream, Illinois", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2539883038078080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/zyMAAOSw84Zb6GkS/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg3Njg=/z/DIQAAOSwn7Rb6Gpc/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg3Njg=/z/TakAAOSwqS5b6GrG/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg3Njg=/z/to4AAOSwOrpb6GrQ/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg3Njg=/z/pOIAAOSwI~Vb6GrX/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg3Njg=/z/zecAAOSw~llb6Grj/$_12.JPG?set_id=880000500F"], "PostalCode": "60188", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "schoen2525", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 135, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 1999.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1999.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "b***a", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 562}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "PRS McCarty Figured Top - Faded Whale Blue with Pattern Regular Neck", "ItemSpecifics": {"NameValueList": [{"Name": "Style 1", "Value": ["Faded Whale Blue"]}, {"Name": "Brand", "Value": ["PRS"]}, {"Name": "MPN", "Value": ["MCM2FTHFI6A_FW_H6-6M"]}, {"Name": "Body Color", "Value": ["Blue"]}]}, "HitCount": 121, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 2024.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}