{"BestOfferEnabled": false, "Description": "MIJ, made in japan, Gibson, Lespaul, White, SG, Höfner, Duesenberg, Ibanez, ATELIER Z, ARIA, ESP, Caparison, Killer, COMBAT GUITARS, GUYATONE, Greco, Sugi Guitars, TEISCO, DEVISERA, Nil, Bacchus, VANZANDT, Fernandes, Fender Japan, Fujigen, MOON GUITARS, momose, Yairi Guitar, YAMAHA, TOKAI, Zemaitis, VOX, B, C, Rich, Epiphone, Gibson, Gretsch, Suhr, Schecter, Charvel, Jackson, Dean, Tom Anderson, Fender, Paul Reed Smith, Melancon, Mosrite, Rickenbacker, Robert Benedetto, Washburn, Ibanez, kramer, EDWARDS, Burny, Grassroots, Edwards by ESP E-FR-140GT The FOREST ~ Neck Through ~Very Good+++ Condition !!Made in Japan Down from here. Photo is dent and scratches, etc.. About scratches that are hard to see. To make it easy to understand the condition of the scratches, I lighted the light strongly. Edwards by ESP E-FR-140GT The FOREST ~ Neck Through ~Very Good+++ Condition !!Made in Japan Body Top : Ash, Back : Alder. Neck Hard Maple and Walnut 7piece. Ebony Finger board. Frets 24Frets. 305R. Scale 25.5inch ( 648mm ). Fender long scale. Nut Width About 1.65 inch ( 42 mm ). Pickup Neck : Single 6.5KΩ. Bridge : Humbucker 15KΩ. Control 1Volume, 1Tone, 3way Toggle Switch. Bridge Floyd Rose. Machine heads GOTOH Japan. Color See-through RED. Weight About 8.29pound ( 3.76Kg ). This is Used Guitar. The Pickups has been changed. I changed the electric circuits to new one. It is 3way toggle switch and all pods and output jack and 1 capacitor and all wiring. Maybe the trussrod cover is not original. There are scratches and dents. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. It was manufactured in 2010. I have an impression that this guitar is not used much. The evidence is the amount of frets remaining. The Frets are Many remain. The deterioration of the metal parts is few, the state is very good ! The body shape is very stereoscopic. Heavy Metal music only !! It is such a shape. It looks is aggressive !! Thanks to neck-through, the high position is smooth like a slide. And the finger board of ebony is shining black. This FOREST is High-end model in Edwards, and made in Japan. Brand New price is about US$ 1,400 in japan. Making is very polite. You can feel the made in japan. About guitar play, Current state, the space between the strings and the frets is very narrow. And, remaining amount of the Frets is so many. Thanks to that, I feel very easy to play the guitar anyway. You can play the guitar with a light touch. This FOREST is neck neck-through structure. The Neck-through structure has high operability of high position. Playability is high. Un pluged sound is very loud. You can feel vibrations transmitted to the body. I am sorry, I do not know the pickups name. However it gives you a good distortion sound. In my impression, bridge pickup is a sound similar to the Seymour Duncan JB. It is very powerful and distortion sound. I recommend for Heavy Metal music !! And I recommend to technical guitar players. ESP EDWARDS is Great ! It is cleanliness. I polished with guitar exclusive polish, so it is in a very clean state. I cleaned the Fingerboard with Lemon Oil. Current neck condition, very good ! roughly straight ! There is no problem with the Truss rod and it can be adjusted. Remaining the frets are 98% on average. There remains many !! You can play immediately after it is delivered to you. I was set new strings. Regular tuning. ( Inch : 009, 011, 016, 024, 032, 042 ) Guitar playing, is comfortable. All is working well. It is in a very good condition. The GIG BAG include. Look at the photos, please verify by yourself! It will be professionally pack. Double air packing. And ships inside a sturdy cardboard box. This electric guitar is USED. Please consider it when bidding. Thank you. Payment I accept PayPal only. Please pay within 3 days after the auction closed. Shipping Worldwide shipping from Japan! EMS / Shipping includes a tracking number. / / / Destination cost Delivery time / / / Asia : $1004 ~ 7daysUS Canada : $1205 ~ 8 daysEurope : $1406 ~ 10 daysOceania : $1205 ~ 8 daysSouth America : $2408 ~ 12 days This item is shipped within 3 business days after payment is confirmed. Terms of Sale International buyers - Please Note: Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer's responsibility. Please check with your country's customs office to determine what these additional costs will be prior to bidding/buying. These charges are normally collected by the delivering freight (shipping) company or when you pick the item up -do not confuse them for additional shipping charges. Please contact us first with 30 working days for any returns, Buyer pays shipping cost from buyer's country to Japan when being returned. In case of return, the shipping cost won't be refunded. We sell various kinds of Japanese products to international customers. Our goal is to provide the best quality products and service and your satisfaction is the most important to us. Happy bidding!! Thank you !!", "ItemID": "254012642403", "EndTime": "2018-12-12T04:55:21.000Z", "StartTime": "2018-12-05T04:55:21.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Edwards-ESP-E-FR-140GT-FOREST-Neck-Through-Made-Japan-/254012642403", "ListingType": "Chinese", "Location": "Nagoya-shi,Kita-ku, Aichi", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2540126424038080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/-coAAOSwb15cBk94/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/sBsAAOSwZltcBk-S/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/ALQAAOSwRF1cBk-d/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/gjQAAOSwliFcBk-u/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/sykAAOSwcZ1cBk-k/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/OA8AAOSwrQxcBk-y/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg2OTY=/z/cvsAAOSwU65cBk~b/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg3ODA=/z/C3IAAOSw8L5cBk-4/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI1MVgxNjAw/z/zbwAAOSwXTVcBk~H/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/mwYAAOSwH1pcBk~Q/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/eGwAAOSwnfRcBk~Q/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/DhwAAOSwVHpcBlAH/$_57.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jguitar-shop", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 369, "PositiveFeedbackPercent": 100.0}, "BidCount": 2, "ConvertedCurrentPrice": {"Value": 304.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 304.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "o***r", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 234}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Americas", "Europe", "Asia", "AU"], "Site": "US", "TimeLeft": "PT0S", "Title": "Edwards by ESP E-FR-140GT. The FOREST. Neck Through. Made in Japan.", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Edwards by ESP"]}, {"Name": "Model Year", "Value": ["2010"]}, {"Name": "Modified Item", "Value": ["Yes"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["E-FR-140GT FOREST"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Modification Description", "Value": ["The Pickups has been changed. I changed the electric circuits to new one. It is 3way toggle switch and all pods and output jack and 1 capacitor and all wiring."]}, {"Name": "MPN", "Value": ["ED1027665"]}, {"Name": "Body Color", "Value": ["See-through RED"]}]}, "HitCount": 387, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "JP", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 309.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["APO/FPO", "Africa"], "GlobalShipping": false, "ConditionDescription": "Very Good+++ Condition. This is Used Electric Guitar. The electric guitar when connect to the amplifier, sound output is normal. There are scratches and Dents. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. Please Read the descriptions for details.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}