{"BestOfferEnabled": true, "Description": "Offered for sale; Used 2005 Gretsch G6119-1962HT Tennessee Rose serial number JT05106280. This guitar is in near mint condition showing little playing time. Originally known as the Tennessean, Gretsch has produced a variety of G6119 Tennessee Rose guitars over the years. The variations include different pickup options, simulated or real F-holes, different bridge options, Chet Atkins signature or not on the pickguard. The Tennessean got a huge amount of notoriety by George Harrison. First in late 1963, later at Carnegie Hall, and then on the For Sale album. He also used it on TV appearances well into 1965 as well as in the opening sequence of the film Help! and at the first Shea Stadium concert that August. It was used again on Sgt. Pepper. Gretsch states: “By any other name this guitar would still sound sweeter than honey. A throwback from the early era of rock ‘n’ roll, the G6119 Tennessee Rose Hollow Body with Bigsby is a solid performer with the sound and the style that have made Gretsch a household name. Highly resonant, the unique voice of this guitar cuts through any mix, standing out from the crowd with That Great Gretsch Sound!” Features include HiLo'Tron single-coil pickups, deep burgundy stain, simulated f-holes, and single-ply binding on the top and fingerboard. Neo Classic thumbnail inlay position markers, black headstock overlay, bound fingerboard, silver plexi pickguard, and knurled strap retainer knobs. Controls include a master volume, a volume for each pickup, a standby switch, a 3-way pickup selector switch, and a 3-position tone switch. This is a beautiful instrument, plays well and sounds like a “Gretsch”! Hard-shell case included. “We carefully inspect every instrument when we buy it and bring it up to our standards before we offer it for sale. We also do a full set up before we ship. If you decide to purchase this guitar, please let us know what gauge strings you prefer.” Gretsch G6119 1962HT Tennessee Rose Specifications Color: Deep Burgundy Stain Category: Hollow Body Guitars Body Style: Single Cutaway Scale Length: 24.6 inch (625mm) Top: Arched Laminated Maple Back and Sides: Laminated Maple Body, 16 Wide x 2 inches Deep Neck: 3-Piece Maple Pickups: 2 Hilo' Tron Pickups Pickup Switching: 3-Position Toggle: Position 1. Bridge Pickup Position 2. Bridge and Neck Pickups Position 3. Neck Pickup Controls: Volume 1. (Neck Pickup) Volume 2. (Bridge Pickup) Master Volume Standby Switch 3-Position Toggle Master Tone Switch: Position 1. Medium Level, High Frequency Roll Off Position 2. Switch Out of the Circuit, Pickup is Wide Open Position 3. Slight Level, High Frequency Roll Of Width at Nut: 1-11/16 inch (43mm) Fingerboard: Ebony, 12-inch Radius (305mm) Bridge: Rosewood Rocking Bar Bridge Tailpiece: Gretsch Bigsby B6C Vibrato Tailpiece Hardware: Chrome-Plated Finish: Gloss Urethane Frets: 22 (Plus Zero Fret) Weight: 7.2 lbs. *Please note: we do our best giving descriptions of used pieces. We have found it impossible to describe every mark on an instrument or amp that is not in the \"mint\" category. Also, what's important to you may not be important to someone else. For example, you may say, \"I don't care what it looks like as long as it plays or sounds well.\" Another person may say, \"Body cosmetics are very important to me so tell me about every scratch, nick and blemish.\" So, please ask the questions that are most important to you. If you ask they will be answered. They are free and there's no limit. Additional photos can also be made available. This is a specific item that is also being offered for sale in our brick & mortar location. It is possible that it has just been sold. Please ask if it is still available before purchasing. *It is our policy to require a signature on delivery of all musical instruments. Please let us know if you prefer no signature required when ordering or we will automatically require a signature. If you prefer your item to be sent without a required signature Imperial Guitar and the selected carrier can no longer be responsible for the security of the package once it has been delivered.", "ItemID": "283169542552", "EndTime": "2019-01-12T17:40:16.000Z", "StartTime": "2018-09-19T19:07:20.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gretsch-G6119-1962HT-Tennessee-Rose-2005-/283169542552", "ListingType": "FixedPriceItem", "Location": "New Paltz, New York", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2831695425528080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTQ0MFg1NDY=/z/~2oAAOSwoIpbop1l/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ0MFg1NDQ=/z/MOUAAOSw0YJbop1t/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ0MFgzMjI=/z/8toAAOSwbTtbop10/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ0MFgzODc=/z/YYQAAOSw8qZbop19/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ0MFgxMDEx/z/13sAAOSwi1Fbop2I/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ0MFgxMDY1/z/JHsAAOSwmixbop2X/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ0MFg4ODA=/z/zIsAAOSwr8tbop2n/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ0MFg3Mzk=/z/ioYAAOSw4Qdbop20/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ0MFg2ODk=/z/lEYAAOSwwKxbop2-/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ0MFg4NzE=/z/kJgAAOSwowtbop3G/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODIzWDE0NDA=/z/rWIAAOSwS0pbop3P/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjA5WDE0NDA=/z/IuUAAOSwD65bop3X/$_57.JPG?set_id=8800005007"], "PostalCode": "12561", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "imperialguitar", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 264, "PositiveFeedbackPercent": 93.8}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1675.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1675.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "r***r", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 14}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gretsch G6119-1962HT Tennessee Rose 2005", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Deep Burgundy Stain"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Gretsch G6119-1962HT Tennessee Rose"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Model Year", "Value": ["2005"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Brand", "Value": ["Gretsch"]}, {"Name": "Body Type", "Value": ["Hollow Body"]}]}, "HitCount": 396, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=16062828", "StoreName": "imperialguitar"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "ConditionDescription": "Used in excellent to near mint condition.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}