{"BestOfferEnabled": false, "Description": "DescriptionHello, I have been selling with eBay from Japan so I can provide you the best service. This item is sold out everywhere in Japan and very hard to get it!! First come, first served.◆ Cosmetic condition Please check the photos for detailed condition of the product. Excellent 1980s Tokai Japan SD653 PWR Custom Edition Electric GuitarBrand: TokaiModel No.: SD653 PWR, Custom Edition, Stratocaster TypeSerial No.: 207571There's \"65\" sticker found behind neck Bridge: AR-V / Ayers Rocker V (Floyd Rose license) Pickup: Single coil × 2 Ham bucking coil × 1 with L.WHITE notation Body Material: Ash or Alder Neck Material: Maple Color: PW (Pearl White) A custom edition series that appeared in the 1986 catalogNeck: StraightFret: 70％Truss Rod: Unknown3548 gThere are scratches, paint peelings, dents, dust, rust, discoloration, and feeling of usage Specification: 1 Volume, Tone, 5 step changeover Switch The body is pearl white, but depends on the angle it gets polarized and looks reddish There is a partial discoloration due to aging Gold parts have some dullness/rust and lacquer scraping Player's condition String height: 12 Fret, 6string about 2 mm Overall dimension: about 65 (W) × 330 (D) × 1000 (H) mm Strings had been replaced to new ones by former owner No particular noticeable chatter when playing, but buzz might come out with hard picking because the tension is loose Electrical system: No problem No buzzing noise on pickup, knob, and jack, and no problem on tuning Tremolo arm's color is black, and not genuine (former owner attached what fits the guitar) Lock nut cap and back cover are missing◆ Operational statusNormal◆IncludingsAll you can see on this photo will be included in a set of a package. You can enjoy playing music.★ This product is also available at other EC sites.We will update as soon as possible, but if this product is sold on another EC site before this is sold on eBay, we are very sorry, but we will cancel the transaction on this site.★ I have examined the item(s) and included my observations as accurate as I could in the description above. Please note that some descriptions may be based on my own opinion. Please read it carefully and understand the condition of the item(s) before bidding. PaymentPlease pay within 3 days after the auction closed.ShippingWorldwide shipping from Tokyo. For goods with hard cases we usually pack hard case and contents by cushioning material (usually bubble wrap). There has never been a problem with that shipping method so far. However, if you want a hard case to be included in cardboard, I can ship by that method if you pay additional $10. This applies only to products that originally have hard case.this item is shipped within 1 business days after payment is confirmed.(Sunday and public holidays is not business day)It takes 4-7 days to be delivered with insurance and trucking number.*We can not use EMS(Japan Post) service for some countries in Central Asia (Kazakhstan, Kyrgystan, Tajikistan etc.) If your shipping address is in these areas, please contact us before bidding. ReturnsReturns are accepted ONLY if the item was not the item described.International Buyers - Please Note: * Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer's responsibility. * Please check with your country's customs office to determine what these additional costs will be prior to bidding/buying. * These charges are normally collected by the delivering freight (shipping) company or when you pick the item up - do not confuse them for additional shipping charges. * We do not mark merchandise values below value or mark items as \"gifts\" - US and International government regulations prohibit such behavior. Feedback: Feedback is very important for everyone participating in community. Please kindly leave feedback once you get the package, we will leave same for you. Thanks! If things happened please contact us before you leave feedback, we will offer you a satisfactory result. We are serious seller and will respond asap.", "ItemID": "183657841280", "EndTime": "2019-02-02T20:13:46.000Z", "StartTime": "2019-01-28T06:23:26.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Excellent-1980s-Tokai-Japan-SD653-PWR-Custom-Edition-Electric-Guitar-RefNo-2026-/183657841280", "ListingType": "FixedPriceItem", "Location": "Gifu", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1836578412808080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/J0AAAOSwJOJcTnUt/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/qIYAAOSwoZJcTnVn/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/N4EAAOSw7wFcTnWF/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/hfIAAOSwgrZcTnWB/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/17sAAOSwT89cTnVe/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/Lf4AAOSwUWtcTnVq/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/PCoAAOSwu4dcTnVj/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/Fr8AAOSwLKhcTnVu/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/q8gAAOSwKSlcTnVz/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/g1kAAOSw7bxcTnV2/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/MdUAAOSwrXhcTnV5/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/sXAAAOSwd0pcTnV8/$_1.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "product-value", "FeedbackRatingStar": "Red", "FeedbackScore": 2445, "PositiveFeedbackPercent": 99.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 257.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 257.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "i***5", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 88}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "Excellent 1980s Tokai Japan SD653 PWR Custom Edition Electric Guitar RefNo 2026", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Black"]}]}, "HitCount": 81, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1097028905", "StoreName": "product-value"}, "Country": "JP", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller", "InternationalRefund": "MoneyBack", "InternationalReturnsWithin": "30 Days", "InternationalReturnsAccepted": "ReturnsAccepted", "InternationalShippingCostPaidBy": "Seller"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["DE"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}