{"BestOfferEnabled": false, "Description": "Gretsch G6118T-ISV Mint Anniversary Iridium Silver Azure Metallic Guitar 2018 SKU: SS2409 Brand: GRETSCH Condition: Used Body Type: Hollow String Configuration: 6 String Dexterity: Right-Handed Body Color: Iridium Silver Azure Metallic Country of Manufacture: Japan Model: G6118T-ISV MPN: 2401101824 Type: Hollow Body Hand: Right UPC: 885978770441 STREET SOUNDS THE LARGEST AUTHORIZED GRETSCH DEALER IS PROUD TO OFFER THIS: PLAYERS EDITION LMT EDITIONG6118T-ISV ANNIVERSARYFEATURING:LOCKING TUNERSPINNED ROCKING BAR BRIDGESTRAP LOCKSSTRING-THRU BIGSBYSUPER COMFORTABLE 2.25'' BODYGUITAR WEIGHT: 7LBS. 10OZ.2018 PRODUCTIONAt the intersection of innovation and tribute youll find the G6118T Players Edition Anniversary with String-Thru Bigsbya guitar that honors its inspirational past while remaining firmly rooted in the future of music. Engineered for optimum performance and responsiveness it reacts instantly to your every musical move, not just earning, but demanding a place in your sonic arsenal. A pair of High Sensitive FilterTron humbucking pickups responds to every note dynamicallysnarling or purring according to how hard you strike the strings. The control complementseparate bridge and neck volume controls, three-way pickup switching, no-load master tone and also a master volumeallows for near-infinite tonal variations. The all-new Gretsch Squeezebox paper-in-oil caps add smooth vintage tone while the treble bleed circuit lets your guitar retain all of its tasty clarity when rolling the volume control down. The standard U-shaped maple neck bears a 12-radius fingerboard with 22 durable medium jumbo frets for a memorable playing experience that works with any fret-hand style. A pinned rocking bar bridge reacts in concert with the Bigsby B6CP vibrato tailpiece for stable tuning while the teflon-coated GraphTech TUSQ XL nut lets the strings slide freely, without binding in the slots. A thinner, 2.25 body provides maximum comfort during long sets while the innovative Gretsch ML bracing allows the guitar to retain that rich, full hollow body sound. In a uniquely Gretsch touch, the Bigsby tailpiece is now string-through, making it quicker (and easier) to change strings as well as providing increased vibration transfer for enhanced sustain. A finely tuned modern music machine, this 2-tone guitar features a unique Iridium Silver finish on the body with an Azure Metallic finish on the back and sides, along with all of the appointments Gretsch fans desirenickel G-Arrow control knobs, white binding with black purfling, gloss urethane finish, pearloid Neo-Classic thumbnail inlays, vintage thick plexi pickguard in Azure with Gretsch logo and Gotoh locking tuning machines. Let loose the fury and power of rock with the G6118T Players Edition Anniversary with String-Thru Bigsbybig sound meets elegant style. Model Name G6118T Players Edition Anniversary with String-Thru Bigsby, Filter'Tron Pickups, 2-Tone Iridium Silver/Azure Metallic Model Number 2401101824 MSRP $3,049.00 Series Gretsch Professional Collection Color Iridium Silver/Azure Metallic Body Laminated Maple Body Shape Anniversary Bracing ML Bracing Body Binding White with Black Purfling Body Back Laminated Maple Body Top Laminated Maple Body Depth 2.25\" (57 mm) Neck Material Maple Neck Finish Gloss Neck Shape Standard \"U\" Scale Length 24.6\" (625 mm) Fingerboard Radius 12\" (305 mm) Number of Frets 22 Fret Size Medium Jumbo Nut Graph Tech TUSQ XL Nut Width 1.6875\" (42.86 mm) Position Inlays Pearloid Neo-Classic Thumbnail Neck Plate NA Bridge Pickup High Sensitive Filter'Tron Middle Pickup N/A Neck Pickup High Sensitive Filter'Tron Controls Volume 1. Neck Pickup, Volume 2. Bridge Pickup, Master Volume, Master Tone Pickup Switching 3-Position Toggle: Position 1. Bridge Pickup, Position 2. Bridge And Neck Pickups, Position 3. Neck Pickup Pickup Configuration Filter'Tron / Filter'Tron SPL Electronics N/A Bridge Rocking Bar Tuning Machines Gotoh Locking Pickguard Azure Plexi with White Gretsch Logo Control Knobs G-Arrow Orientation Right-Hand Strings Nickel Plated Steel .011-.049SUPER MINT CONDITION ALLCASE CANDY INCLUDED STREET SOUNDS30 DAY TRIAL PERIOD INCLUDED GRETSCHHARDSHELL CASE INCLUDED WARRANTY INCLUDEDSET UP INCLUDED FREE SHIPPING IN CONTINENTAL U.S. LOCATED IN BROOKLYN, JUST 4 MILES FROM THE ORIGINAL GRETSCH FACTORYCONTAINS ONE OF THE LARGEST INVENTORIES OF GRETSCHGUITARSANYWHERE IN THE WORLD. WE WOULD LIKE TO THANK FRED GRETSCH AND JOE CARDUCCIFOR THERE MULTIPLE VISITS TO OUR SHOP AND CONTINUED SUPPORT OF THE GREATEST GUITAR BRAND EVER PRODUCED ALL NEW GRETSCH GUITARS INCLUDE FACTORY WARRANTY ALL USED GRETSCH GUITARS INCLUDE STREET SOUNDS 1 YEAR WARRANTY ANY GUITARLISTED WITH FREE SHIPPING IS FOR CONTINENTAL U.S. ONLY Gretsch is a registered trademark of Fred W. Gretsch Enterprises.", "ItemID": "302976078094", "EndTime": "2018-12-26T01:45:34.000Z", "StartTime": "2018-11-28T16:53:04.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gretsch-G6118T-ISV-Mint-Anniversary-Iridium-Silver-Azure-Metallic-Guitar-2018-/302976078094", "ListingType": "FixedPriceItem", "Location": "Brooklyn, New York", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/3029760780948080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/ODAwWDUzMg==/z/QHEAAOSw~odb~sft/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODAwWDUzMg==/z/YlgAAOSwq6Vb~sft/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDYzOA==/z/CJoAAOSw1tJb~sfu/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODUwWDEyODA=/z/CKQAAOSwIw1b~sfu/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDYzOA==/z/zkQAAOSwxG9b~sfu/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODUwWDEyODA=/z/5AMAAOSwZNtb~sfu/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDYzOA==/z/hQIAAOSwcdxb~sfu/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDEyODA=/z/184AAOSwpFtb~sfu/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODQ5WDEyODA=/z/Y18AAOSwXI1b~sfu/$_12.JPG?set_id=880000500F"], "PostalCode": "11209", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "rockystreetsounds", "FeedbackRatingStar": "TurquoiseShooting", "FeedbackScore": 26916, "PositiveFeedbackPercent": 99.9, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1649.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1649.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "e***y", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 341}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "CA", "GB", "CN", "MX", "DE", "JP", "FR", "AU", "DK", "RO", "SK", "BG", "CZ", "FI", "HU", "LV", "LT", "MT", "EE", "GR", "PT", "CY", "SI", "SE", "KR", "ID", "TH", "BE", "HK", "IE", "NL", "PL", "ES", "IT", "AT", "BS", "IL", "NZ", "SG", "CH", "NO", "SA", "UA", "AE", "QA", "KW", "BH", "HR", "MY", "CO", "PA", "JM", "BB", "BD", "BM", "BN", "BO", "EG", "GF", "GG", "GI", "GP", "IS", "JE", "JO", "KH", "KY", "LI", "LK", "LU", "MC", "MO", "MQ", "MV", "NI", "OM", "PK", "PY", "RE"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gretsch G6118T-ISV  Mint Anniversary Iridium Silver Azure Metallic Guitar 2018", "ItemSpecifics": {"NameValueList": [{"Name": "UPC", "Value": ["885978770441"]}, {"Name": "Brand", "Value": ["GRETSCH®"]}, {"Name": "Body Type", "Value": ["Hollow"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Body Color", "Value": ["Iridium Silver Azure Metallic"]}, {"Name": "Country of Manufacture", "Value": ["Japan"]}, {"Name": "Model", "Value": ["G6118T-ISV"]}, {"Name": "MPN", "Value": ["2401101824"]}, {"Name": "Type", "Value": ["Hollow Body"]}, {"Name": "Hand", "Value": ["Right"]}]}, "HitCount": 472, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=157392609", "StoreName": "STREETSOUNDS NYC"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": true, "QuantitySoldByPickupInStore": 0, "SKU": "SS2409", "NewBestOffer": false}