{"BestOfferEnabled": false, "Description": "At top 40 guitarsour customers satisfaction is our first concern.All of out items have a 14 day return policy.If after 14 days you are not completely satisfiedwith your purchase, please return it for a full refund....Peace be with you... *all returned items must be in the same condition theywere at the time of sale. All original packing must be included. # Up for Sale is a2017 Fender Deluxe Stratocaster HSS! Tobacco Sunburst Finish! Made In Mexico! This is Really Cool. You are looking at a 2017 Fender Deluxe Stratocaster HSS. Beautiful Tobacco Sunburst Finish. This is the Deluxe model which gives it Locking Tuners, Noiseless Pickups and a S-1 Coil Switch. The HSS pickup configuration (Humbucker, Single, Single) gives this Strat that extra low end crunch yet still retains those classic single coil clean highs. Perfect for Blues or Rock. From The Web: Fat, hard-rockin’ sound and elegant Fender style unite in the Deluxe Strat HSS, a versatile tone machine with power to spare. The rich, warm humbucking bridge pickup adds a touch of thickness to the instrument’s voice, while special electronics ensure traditional Strat tone is close at hand; ready to go at a moment’s notice. A time-tested performer on stage and in the studio, this graceful performer with smooth, comfortable playing feel will easily handle any sonic needs that arise. Two noise-free, highly articulate Vintage Noiseless™ pickups inhabit the neck and middle positions, cranking out traditional, crisp Strat tones. The Twin Head Vintage humbucking pickup in the bridge position has moderate output, warm tone and even string response, as well as including a thick aluminum base plate to reduce magnetic interference. For traditional Strat tones, simply tap the S-1™ switch atop the volume knob to select the rear coil of the bridge pickup—voila, instant classic Strat sound. Enjoy smoother travel when using the tremolo bridge, thanks to the modern two-point synchronized design, which includes bent steel saddles for classic aesthetics. A contoured neck heel and 4-bolt asymmetrical neck plate make it easy to comfortably reach the upper registers of the neck. The flatter 12”-radius fingerboard makes it easy to play fast leads and perform deep bends without fretting out. Locking tuning machines provide enhanced tuning stability, along with quicker string changes. The alder body bears a highly durable gloss polyurethane finish that will easily stand up to hard playing, keeping the instrument like new for years to come. Classic aesthetic touches include nickel/chrome hardware and a three-ply mint green pickguard, along with aged white pickup covers, control knobs and switch tip. Sporting authentic Fender style and versatile sound, the Deluxe Strat HSS is the ideal instrument for players who need a variety of tones for the stage or the studio. Our luthier did a complete setup. Brand new strings were installed. Gig ready on Arrival! Serial Number: #MX17968876 Weight: 7.95 lbs. Case is NOT Included Due to CITES Treaty for Endangered Wood (Mahogany, Rosewood) We no longer ship out of the USA. Cosmetics: Excellent Condition. Some light strumming scratches on the pickguard. Top and Back are very clean. Neck, Fretboard and Headstock in great shape. Pristine. Dripping with \"Mojo\". It is used. Not perfect. Overall, a really nice guitar. Look at the pictures closely. They will tell the story. Top 40 guitars is a Veteran owned business. At top 40 guitarsour customers satisfaction is our first concern.All of out items have a 14 day return policy.If after 14 days you are not completely satisfiedwith your purchase, please return it for a full refund....Peace be with you... *all returned items must be in the same condition theywere at the time of sale. All original packing must be included. # Up for Sale is a 2017 Fender Deluxe Stratocaster HSS! Tobacco Sunburst Finish! Made In Mexico! This is really cool. You are looking at a 2017 Fender Deluxe Stratocaster HSS. Beautiful Tobacco Sunburst with Maple Neck and Fretboard. If you are into Blues or Classic Rock, this pickup configuration (Humbucker, Single, Single) plus the S-1 Coil Switch will give you any kind of tone you will ever need! From The Web: Fat, hard-rockin’ sound and elegant Fender style unite in the Deluxe Strat HSS, a versatile tone machine with power to spare. The rich, warm humbucking bridge pickup adds a touch of thickness to the instrument’s voice, while special electronics ensure traditional Strat tone is close at hand; ready to go at a moment’s notice. A time-tested performer on stage and in the studio, this graceful performer with smooth, comfortable playing feel will easily handle any sonic needs that arise. Two noise-free, highly articulate Vintage Noiseless™ pickups inhabit the neck and middle positions, cranking out traditional, crisp Strat tones. The Twin Head Vintage humbucking pickup in the bridge position has moderate output, warm tone and even string response, as well as including a thick aluminum base plate to reduce magnetic interference. For traditional Strat tones, simply tap the S-1™ switch atop the volume knob to select the rear coil of the bridge pickup—voila, instant classic Strat sound. Enjoy smoother travel when using the tremolo bridge, thanks to the modern two-point synchronized design, which includes bent steel saddles for classic aesthetics. A contoured neck heel and 4-bolt asymmetrical neck plate make it easy to comfortably reach the upper registers of the neck. The flatter 12”-radius fingerboard makes it easy to play fast leads and perform deep bends without fretting out. Locking tuning machines provide enhanced tuning stability, along with quicker string changes. The alder body bears a highly durable gloss polyurethane finish that will easily stand up to hard playing, keeping the instrument like new for years to come. Classic aesthetic touches include nickel/chrome hardware and a three-ply mint green pickguard, along with aged white pickup covers, control knobs and switch tip. Sporting authentic Fender style and versatile sound, the Deluxe Strat HSS is the ideal instrument for players who need a variety of tones for the stage or the studio. Tech Specs Body Type: Solidbody Body Shape: Stratocaster Left-/Right-handed: Right-handed Number of Strings: 6 Body Material: Select Alder Body Finish: Gloss Polyurethane Color: Tobacco Sunburst Neck Material: Maple Neck Shape: Modern C Radius: 12\" Fingerboard Material: Maple Fingerboard Inlay: Dots Number of Frets: 22 Scale Length: 25.5\" Nut Width: 1.650\" Nut Material: Synthetic Bone Bridge/Tailpiece: Two-point Vintage-Style Synchronized Tremolo Tuners: Locking Number of Pickups: 3 Neck Pickup: Vintage Noiseless Single-coil Middle Pickup: Vintage Noiseless Single-coil Bridge Pickup: Twin Head Vintage Humbucker Controls: 1 x master volume (S-1 humbucker coil-split switch), 2 x tone, 5-way blade pickup switch", "ItemID": "132921988184", "EndTime": "2019-01-28T02:05:55.000Z", "StartTime": "2019-01-18T02:05:55.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2017-Fender-Deluxe-Stratocaster-HSS-Strat-Tobacco-Sunburst-Finish-NO-RESERVE-/132921988184", "ListingType": "Chinese", "Location": "Santee, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1329219881848080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTQ4MVg5MDE=/z/35cAAOSwSixbRo3b/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjgxWDU0OQ==/z/fZoAAOSw7P5bRo2W/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/WhkAAOSwZtBbRo1M/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ3Nlg5Mjc=/z/sD8AAOSwLLZbRo0x/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTUyMFg5MjM=/z/7WEAAOSwAspbRoy5/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzI1WDUzMQ==/z/J~QAAOSwCyFbRoxx/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/X8AAAOSwUq9bRopa/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ0Nlg4Nzk=/z/t3UAAOSwBrlbRom8/$_57.JPG?set_id=8800005007"], "PostalCode": "92071", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "top40powertrio", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 13196, "PositiveFeedbackPercent": 99.7}, "BidCount": 38, "ConvertedCurrentPrice": {"Value": 684.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 684.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "u***u", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 33}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2017 Fender Deluxe Stratocaster HSS Strat! Tobacco Sunburst Finish! NO RESERVE!!", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Tobacco Sunburst"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Stratocaster HSS"]}, {"Name": "Country/Region of Manufacture", "Value": ["Mexico"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["2017"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Brand", "Value": ["Fender"]}, {"Name": "Body Type", "Value": ["Solid"]}]}, "HitCount": 822, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=47416021", "StoreName": "Top 40 Guitars"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 694.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "2017 Fender Deluxe Stratocaster HSS Electric Guitar, Excellent Condition, See ad below for Full Description", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}