{"BestOfferEnabled": true, "Description": "USACG Stratocaster Here is a special guitar in absolutely pristine, ungigged condition. All white korina as a tribute to the GIbson Firebird that inspired it; Firebird tone with Strat playability (including the sculpted heel for high note access). I hand-picked all the wood for its weight, tap-tone and evenness of grain. Why weight? Ever notice how heavy Les Pauls sound bright and even thin? The distinctive sounds of the different wood types only come out when you are comparing pieces of similar density; more weight (in general) equals more density and a brighter guitar. The tap-tone is the final judge, but the weight points you in the right direction... besides, who wants to wear a brick around their neck all night? It was also sustainably sourced from already-fallen trees working with indigenous peoples in Africa if that sort of thing is important to you. USA Custom Guitars then fashioned the neck for me as follows: - Quartersawn white korina stock- Offset profile for all-night comfort, .84\" depth at the first fret; right between an SRV and Wolfgang profile- Pau Ferro board 10-16\" compound radius- 6150 stainless steel frets- Graph Tech nut- Gotoh locking tuners (like Suhr uses) The body was CNC carved to my specifications so that I could have the option of hand-carving the heel as shown: - Standard '62 Strat contours- 4.2 pounds unequipped weight (perfect balance and tone)- Side jack plate (like Suhr)- Swimming pool route under the pickguard so you can switch the pickups to P-90’s (or anything else!) if you wish- Steel block traditional 6 pin tremolo The acoustic tone of this guitar is amazing; balanced and ringing with an almost acoustic quality—if you have heard what I am talking about, you know what I mean. Electronics: The pickups were custom wound for me by Cablegram Way of Montana. These are true Firebird pickups, not mini humbuckers in a Firebird cover; they have alnico rail poles, not bar magnets. I had them rewound after the first iteration because the first set were actually TOO bright and transparent; they lacked some of the classic Firebird grit (listen to Johnny Winter). This set is still clear as a bell, but with push in the lows as well; as they should, they sit perfectly between a single coil and a humbucker and positions two and four have great quack for Knopfler-esque or SRV “king tone” sounds. (Unlike traditional Firebird pickups, the bridge is a bit hotter than the neck for volume balance.) The tone control is a push-pull for reversing the order of the neck and middle pickups on the 5-way switch so that you can get the neck and bridge together for Chet Atkins, Tele-esque tones as well. You will love this guitar. Why am I selling? I have come to the conviction that I have too many guitars and there is too much need in the world that I could be helping to supply… and of all my guitars (all homemade), this one is in the most pristine condition. In fact, is absolutely pristine as it has never been out of the house and has never taken a shop ding. The only mark is a slight rub mark on the pickguard, which can be clearly seen in the photo. Sorry the photos have so much shine, but that is the finish, and I wanted to get the color right so you have a good representation of the guitar. The body finish is multiple layers of Tru-Oil gloss gunstock oil; super-durable and even more “breathing” than nitrocellulose lacquer for better tone as instrument ages. My “number 1” has the exact same finish over swamp ash, and has never taken the slightest bit of hand oil stain despite hard use for 24 years. The neck is finished in satin polyurethane for durability and a super-fast feel.Shipping cost listed is for the lower 48 ONLY. Others pay actual cost. Check my feedback and bid with confidence. Guitar will ship in a used hardshell case.", "ItemID": "332876434870", "EndTime": "2018-12-17T00:12:05.000Z", "StartTime": "2018-11-10T21:37:59.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/ALL-KORINA-Stratocaster-Firebird-hybrid-w-USACG-and-Warmoth-parts-/332876434870", "ListingType": "FixedPriceItem", "Location": "Saylorsburg, Pennsylvania", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/3328764348708080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIyOVg1MjY=/z/5dMAAOSw9~5bvfkB/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI5MFg1OTg=/z/5~4AAOSwtYJbvfkm/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/u70AAOSwvx1bvfja/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTE0WDE0MTU=/z/Zz8AAOSwGI9bvflA/$_57.JPG?set_id=8800005007"], "PostalCode": "18353", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "bijaquinas", "FeedbackRatingStar": "Purple", "FeedbackScore": 509, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 800.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 800.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "w***a", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 470}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "ALL KORINA Stratocaster/Firebird hybrid w. USACG and Warmoth parts", "ItemSpecifics": {"NameValueList": [{"Name": "Model", "Value": ["Stratocaster"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Body Color", "Value": ["Amber"]}, {"Name": "Brand", "Value": ["Fender"]}, {"Name": "Body Material", "Value": ["Ash", "Alder"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["131002357", "F0131002303"]}, {"Name": "MPN", "Value": ["131002357"]}]}, "HitCount": 455, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "ProductID": {"Value": "78617785", "Type": "Reference"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}