{"BestOfferEnabled": true, "Description": "1981 Kramer 6 String Axe Guitar. 25 In The World. Signed Gene Simmons OHSC. KISS. MADE IN THE USA.Awesome Axe. Most are sitting in museums. The other one of these I had just went to a museum as did the bass version I had.This will probably end up in museums as well unless you want to flip for good money when Gene's time is up on this planet. 1981 Kramer Gene Simmons Axe 6 String Guitar. Number 17. Aluminum neck. Removable blade. I've seen each of them that still exist online and keep track of the numbers on them (basses and guitars.....there is also a registry for them and I've put all of mine on there). This is the the VERY LAST instrument of my HUGE KISS guitar and bass collection. This particular signed Axe is from a very limited run, and although this is \"17/1000\" they never actually made 1000. Some were never released because of bad quality control, others were modified heavily or broken. Gene and Kramer parted ways very early in the production of the Axe instruments, so only 25 guitars and 175 basses were actually produced. The signatures are UNDER the clear coats. So all REAL Kramer Axes will have a signature, it will be under the clear coats and the blade will be removable. Beware of fakes! One tiny nick on the bottom tip of the BLADE, then a bit bigger one on the very top of the body (not on the front). It was there when I bought it. It has either been painted or colored in with a marker to black again (shown). I would never touch up an instrument this rare. All works great and there is NOTHING MISSING or unoriginal. Two scanned letters from the owner of another one of these guitars to Kramer are included in the case which state that they only made 25 guitars and 175 basses. I'll send you letters from Kramer that verify this. Ebay don't allow many pictures, so...just hit me up and I'll send you a lot more. Original Hardshell Case has one latch that is missing the hook (shown). Also the blueish ink spot???? on the front of the case. It is a bit ragged in 2 places on the inside (shown) but can easily be glued or sewn to make it look nearly perfect again. The straps that hold the case open are not there....so, it just stays open all the way when open. This is an excellent collector's piece!SummaryBody: Two-pieceNeck: Aluminum neck and ebanol fretboard with dot inlaysPickups/Hardware: One Dimarzio Super Distortion humbucker with volume and tone controls with 1980 potentiometers.Cosmetic Condition: The body is very clean overall. All of the aluminum hardware looks great. This rare collector's piece is in nice condition.Modifications: None If you want a TON more pics, since Ebay doesn't allow room for hardly any pics, just ask and I'll get a zip file of pics to you and any other pics that you want me to take. Finally, this axe will HAVE TO BE SHIPPED VIA UPS. THEY WILL PACK IT. That is the ONLY way that any failed insurance claim would actually be paid out. Plus, UPS will insure it for the full value and the Postal Service will only insure for half of this Axe's value. No Fedex location anywhere near me. Since the fingerboard is \"EBANOL\" and not the protected Rosewood that is illegal to ship out of the country....you MIGHT be able to talk me in to shipping out of the country......but ask WAY BEFORE THE AUCTION ENDS so that I can verify that I am allowed to ship to your country.......plus, you had better have some awesome feedback and more that 20 transactions on Ebay where you bought something that cost more than a bag of balloons. lol GOOD LUCK ALL. Weight: 8lbs 14oz", "ItemID": "382436633380", "EndTime": "2019-01-14T20:37:30.000Z", "StartTime": "2018-04-15T03:34:34.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1981-Kramer-6-String-Axe-Guitar-25-World-Signed-Gene-Simmons-OHSC-KISS-/382436633380", "ListingType": "FixedPriceItem", "Location": "Mesquite, Nevada", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/3824366333808080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/U64AAOSw17payYu6/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/AAIAAOSw~JRayYu8/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/VLcAAOSwt21ayYu-/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/384AAOSwPoZayYvA/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Oh0AAOSwdGJayYvC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/fZwAAOSwkhNayYvE/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/9XIAAOSwlrFayYvG/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/W0AAAOSwB6NayYvI/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/-TYAAOSwISFayYwA/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/9~kAAOSwOyJayYwq/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/otEAAOSwLhBayYws/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/4eIAAOSwOtVayYwu/$_57.JPG?set_id=8800005007"], "PostalCode": "89027", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "groovy_music_lessons", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 18515, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 7995.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 7995.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "c***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 756}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "1981 Kramer 6 String Axe Guitar. 25 In The World. Signed Gene Simmons OHSC. KISS", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Black/Silver"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["AXE"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["1981"]}, {"Name": "Body Material", "Value": ["Wood/Aluminum"]}, {"Name": "Brand", "Value": ["Kramer"]}, {"Name": "Body Type", "Value": ["Solid"]}]}, "HitCount": 3203, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=9286140", "StoreName": "Groovy Music Lessons"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}