{"BestOfferEnabled": false, "Description": "MIJ, made in japan, Gibson, Lespaul, White, SG, Höfner, Duesenberg, Ibanez, ATELIER Z, ARIA, ESP, Caparison, Killer, COMBAT GUITARS, GUYATONE, Greco, Sugi Guitars, TEISCO, DEVISERA, Nil, Bacchus, VANZANDT, Fernandes, Fender Japan, Fujigen, MOON GUITARS, momose, Yairi Guitar, YAMAHA, TOKAI, Zemaitis, VOX, B, C, Rich, Epiphone, Gibson, Gretsch, Suhr, Schecter, Charvel, Jackson, Dean, Tom Anderson, Fender, Paul Reed Smith, Melancon, Mosrite, Rickenbacker, Robert Benedetto, Washburn, Ibanez, kramer, EDWARDS, Burny, Grassroots, 1980s Greco SS63-55 Deep joint / All Original The Mint Collection Very Good++ condition.Made in Japan Down from here, Photo is dent and scratches etc.. About scratches that are hard to see. To make it easy to understand the condition of the scratches, I lighted the light strongly. 1980s Greco SS63-55 Deep joint / All Original The Mint Collection Very Good++ condition.Made in Japan Body Mahogany. Neck Mahogany. Deep joint. Frets 22F. Scale 24.75inch (628mm) Gibson Scale. Nut Width About 1.69 inch (43mm). Pickup SCREAMIN x 2. Control 2 Volume, 2 Tone, 3-Way PU Toggle switch. Bridge Tune O Machic. Stop Tailpiece. Color Black. Weight About 6.53 Pound ( 2.96 Kg ). This is Used Guitar. There are scratches and dents. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. This SS63-55 of black color is my first display. It was manufactured in the mid to late 1980's by Fujigen. It's the Mint Collection, most popular series in Greco. The Mint Collection, I feel Greco's policy very much. Accuracy of the product is high, It is deep joint. The Cherry color and White color is listed in the Greco's japanese catalog at that time. But the body of black color is not listed. Therefore, the Black body may be a Limited model. In Japanese used guitars market, it is rare to see. I can say that it is rare color model. The remaining amount of the Frets are many. You do not have to change the new frets for some time. \" The High quality guitars at a Low price \". It is brand concept of Greco at the time. And current... It has became high price. 1980, Gibson filed a lawsuit. The cause is copyright issues. And more than anything, Greco's ( Fujigen's ) high degree of perfection. Perhaps Gibson had a feeling of crisis. I think this Greco is very good. Make of Greco (Fujigen) is very polite. Accuracy of the product is high. About guitar play, Current state, the space between the strings and the frets is standard. And, remaining amount of the Frets are many. Thanks to that, I feel easy to play the guitar. This Greco is Deep joint. Therefore Un pluged sound is very loud. You can feel vibrations transmitted to the body. The Pickups is original installed SCREAMIN. This SCREAMIN Pickup is excellence. And worldwide assessment is high. I feel the good Over drive and Distortion sound. The clean sound is also wonderful. Greco is Great !! It is cleanliness. I polished with guitar exclusive polish, so it is in a very clean state. I after the finger board cleaning, painted beeswax. The aim is moisturizing and and protection. Current neck condition, very good ! roughly straight ! There is no problem with the Truss rod and it can be adjusted. Remaining Frets are 95% on average. You can play immediately after it is delivered to you. I was set new strings. Regular tuning. ( Inch : 009, 011, 016, 024, 032, 042 ) Guitar playing, is comfortable. All is working well. It is in a very good condition. The Truss rod Wrench is not included. All Original.Note : The hard case key has been lost. Note : The Strap pin has been changed to lock type. Look at the photos, please verify by yourself! It will be professionally pack. Double air packing. And ships inside a sturdy cardboard box. This electric guitar is USED. Please consider it when bidding. Thank you. Payment I accept PayPal only. Please pay within 3 days after the auction closed. Shipping Worldwide shipping from Japan! EMS / Shipping includes a tracking number. / / / Destination cost Delivery time / / / Asia : $1004 ~ 7daysUS Canada : $1205 ~ 8 daysEurope : $1406 ~ 10 daysOceania : $1205 ~ 8 daysSouth America : $2408 ~ 12 days This item is shipped within 3 business days after payment is confirmed. Terms of Sale International buyers - Please Note: Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer's responsibility. Please check with your country's customs office to determine what these additional costs will be prior to bidding/buying. These charges are normally collected by the delivering freight (shipping) company or when you pick the item up -do not confuse them for additional shipping charges. Please contact us first with 30 working days for any returns, Buyer pays shipping cost from buyer's country to Japan when being returned. In case of return, the shipping cost won't be refunded. We sell various kinds of Electric guitars to international customers. Our goal is to provide the best quality products and service and your satisfaction is the most important to us. Happy bidding!! Thank you !!", "ItemID": "254081357953", "EndTime": "2019-01-26T05:00:13.000Z", "StartTime": "2019-01-19T05:00:13.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/80s-Greco-SS63-55-Deep-joint-All-Original-Mint-Collection-Made-Japan-/254081357953", "ListingType": "Chinese", "Location": "Nagoya-shi,Kita-ku, Aichi", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/2540813579538080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMTU3/z/cnAAAOSwIkNcQqnq/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/udEAAOSw-k5cQqoB/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/eiAAAOSwQAdcQqpm/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/ELEAAOSwL-1cQqoW/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/YQYAAOSweI1cQqoZ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNTk5/z/XVEAAOSwoN5cQqoa/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/HzkAAOSwlt9cQqor/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU5OVgxNjAw/z/DcgAAOSwNphcQqow/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/o4wAAOSw6CRcQqoy/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTUxN1gxNjAw/z/DO8AAOSwqztcQqo9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/KSIAAOSw~llcQqpR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQxNFgxNjAw/z/4ugAAOSwWUBcQqpY/$_57.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jguitar-shop", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 369, "PositiveFeedbackPercent": 100.0}, "BidCount": 2, "ConvertedCurrentPrice": {"Value": 304.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 304.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "2***i", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 130}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Americas", "Europe", "Asia", "AU"], "Site": "US", "TimeLeft": "PT0S", "Title": "80s Greco SS63-55. Deep joint. All Original. The Mint Collection. Made in Japan.", "ItemSpecifics": {"NameValueList": [{"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Brand", "Value": ["Greco"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Series", "Value": ["Original"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "Model", "Value": ["SS63-55"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Model Year", "Value": ["1980s"]}]}, "HitCount": 385, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "JP", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 309.99, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["APO/FPO", "Africa"], "GlobalShipping": false, "ConditionDescription": "Very Good++ Condition. This is Used Electric Guitar. The electric guitar when connect to the amplifier, sound output is normal. There are scratches and Dents. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. Please Read the descriptions for details.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}