{"BestOfferEnabled": true, "Description": "Fender American Vintage Thin Skin Nitro special lacquer ’52 Telecaster with Keith Richards Micawber mods. Butterscotch blonde with maple neck, made in the USA, with original hardshell case & extras. Being sold by original owner. I purchased this beauty from Wildwood Guitars in Louisville, CO in May of 2006 when I lived in Austin, TX. Her name is Charlotte. :-) This 12-year old guitar is an excellent, resonant player in played condition with a straight neck and no serious cosmetic issues. Due to the thinskin nitrocellulose paint job, the body has worn naturally (e.g., pick scratches). See pictures for some minor flaws, none serious. There’s no fake relicing here. The frets have some pitting but still have lots of play left in them. There's a tiny chip in the nut that doesn't affect play. The color of the butterscotch is rich and warm due to the nitrocellulose paint. The guitar’s tone is superb. Inspired by Keith Richards’ Tele nicknamed Micawber, the guitar has been modded. The bridge pickup is a Don Mare 0038 (10k \"Keefer”) which gives a Stonesy rock and roll tone. The neck pick is a Lollar Imperial Low Wind humbucker, a great match for the Keefer bridge pickup. This humbucker was installed — with the body professionally routed — by Mark Erlewine in Austin, TX in February of 2010. Note: the two original American Vintage Tele single-coil pickups that were removed are included in this auction. I will include my receipt for the work by Erlewine with the sale of the auction. When the humbucker was installed, the pickguard was switched out to a black bakelite-style pickguard I purchased from WD Music (the original 1-ply black pickguard that was removed is included in this auction). Additionally, the saddles were replaced with RS compensated steel saddles to improve intonation. The 3 brass saddles that were removed (I did use ‘em for a while) are also included in this auction, as well as a modern six-saddle bridge and ash tray bridge cover (both unused). The guitar has also been updated to a modern standard switching circuit. The case pictured is the original vintage-style USA-made G&G tweed case (the case has some wear but nothing bad; all latches work, and its key is included). The “case candy” is also included in the auction: the vintage-style strap and cable (both unused); certificate of authenticity dated 2/2/06 (or 2/7/06?); another certificate that acknowledges this ’52 Telecaster was from a “limited run” of 140 instruments (stating production date of 3/16/06); owner’s registration card (not filled out); owner’s manual; wiring diagram; installation manual for six section bridge; lacquer finishes info card; and hang tags (including unpeeled sticker). I am also including a cool advertisement for “Thin Skin Nitro” guitars from a magazine that I saved. It will be boxed well and shipped safely and insured from Los Angeles. This beauty has a premium ash body, 1-piece maple “U” shaped neck with \"Thin Skin Nitro\" lacquer finish, Fender/Gotoh vintage style tuning machines, 7.25” radius maple fingerboard, 21 6105 frets, 25.5” scale length, and 1.650” nut width. Before the mods, she weighed 7.64 Lbs. The back neck plate states \"Fender Limited Edition.\" From a 2008 post on sweetwater.com: “Today, many of the finest Fender guitars get a special nitrocellulose lacquer finish that the company is calling ‘thin-skin nitro.’ This finish is amazingly close to the original lacquers that Fender used during its early years (an exact match is not possible because some of the solvents used for finishes in the 1950s and ’60s are now banned by the EPA, but most people would never be able to see the difference in any case). The lacquer is applied in a manner that enhances the look of the ash or alder body whether it’s stained or a solid color. What’s more, by keeping the finish to a minimal thickness, it allows the instrument to resonate much more freely. Nitro finishes are also popular because of the way in which they age; quite different from polyurethane and polyester finishes, which change very little over time. Depending upon the stain or solid color, a nitrocellulose finish gradually ages over the years and takes on a warm amber hue. The older the guitar, the deeper (and richer) the finish will look.” Artists known for playing a Tele are Syd Barrett (Pink Floyd), Jeff Beck (The Yardbirds), James Burton (Ricky Nelson, Elvis Presley), Mike Campbell (Tom Petty and the Heartbreakers), Steve Cropper (Booker T. & the MGs), John 5 (Marilyn Manson), Jimmy Page (Led Zeppelin), Brad Paisley, Robbie Robertson (The Band), Bruce Springsteen, Joe Strummer (The Clash), Andy Summers (The Police), Clarence White (The Byrds), and of course Keith Richards (The Rolling Stones). Shipping only within continental United States; this auction is limited to lower 48 U.S. residents only. It is the buyer’s responsibility to make sure the address they provide directly or via their Paypal account is correct and up-to-date. Please ask any and all questions before bidding. Thank you!", "ItemID": "233068919559", "EndTime": "2019-01-08T17:16:34.000Z", "StartTime": "2018-12-26T04:46:15.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2006-Fender-Thin-Skin-52-Telecaster-butterscotch-USA-extras-Keith-Richards-/233068919559", "ListingType": "FixedPriceItem", "Location": "Van Nuys, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2330689195598080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/0eAAAOSwPVFb-3e3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/9tAAAOSwe9Fb-3e0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/likAAOSwfQ9b-3fB/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/zu4AAOSw-iZb-3e5/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/VckAAOSw6CRb-3e7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/4-EAAOSw6dhb-3e~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/y1AAAOSw9m5b-3e9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/QYYAAOSwa3lb-3fI/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/noUAAOSwy3Jb-3fE/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/6YQAAOSwdLhb-3fG/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODAyWDExMDA=/z/p6QAAOSwiwZb-3fL/$_57.PNG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjM2/z/THoAAOSw1hJb-3fN/$_57.JPG?set_id=8800005007"], "PostalCode": "91401", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "alexanderbeetlebungalow", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 201, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1799.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1799.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "w***3", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 163}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2006 Fender Thin Skin ’52 Telecaster, butterscotch, USA, extras - Keith Richards", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender USA"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Model Year", "Value": ["2006"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Color", "Value": ["butterscotch blonde"]}, {"Name": "Model", "Value": ["Telecaster"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Material", "Value": ["Ash"]}, {"Name": "Modified Item", "Value": ["Yes"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Modification Description", "Value": ["Keith Richards Micawber mods"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}]}, "HitCount": 205, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}