{"BestOfferEnabled": false, "Description": "You are bidding on a Roland GC-1 GK-Ready Stratocaster guitar. Part of the V-Guitar Series, this is an authentic Fender Stratocaster guitar equipped with a special Roland divided pickup with a 13-pin output. The GK-Ready Stratocaster GC-1 can be used with both standard guitar equipment and revolutionary Roland V-Guitar category products like the Boss GP-10, the Roland GR-55 and Roland VG-99. (***CHECKOUT MY OTHER AUCTION FOR A BOSS GP-10S Boss GP-10 Guitar Processor with multi-effects and guitar-to-MIDI conversion). Roland V-Guitar category products like the GP-10, GR-55, and VG-99 put the unlimited potential of digital technology into the hands of guitarists everywhere. To harness this power, Roland developed the GK Divided Pickup, a special pickup that allows each of a guitar's strings to be processed independently. Connecting the GC-1 guitar to a V-Guitar System opens up a world of magical music expression to the guitarist, including instant alternate tunings, transforming the guitar sound into another instrument entirely, and much, much more. As a guitar, the GK-Ready Stratocaster GC-1 is a 100% authentic Fender Strat guitar, with the same legendary sound and feel that players have loved for over 50 years. It features a solid contoured alder body, maple neck (with rosewood or maple fingerboard), three single-coil pickups with 5-way switching, a Fender synchronized tremolo bridge, a 3-ply pickguard, American in-line tuners, and chrome hardware. FEATURESAlder contoured body25.5\" scale maple neckRosewood or maple fretboard22 Medium jumbo frets3 Fender single-coil pickups5-Way pickup selectorMaster volume controlTone control for neck and middle pickupsEmbedded/Equipped with Roland GK hex-divided pickup13-pin output connectorFender synchronized tremolo bridge3-ply pickguardChrome hardwareAmerican inline tuning keysFuturize Your Guitar PlayingThe Roland GC-1 GK-Ready Stratocaster is the top of the line within Roland's guitar synth controllers. Sporting all the features of a standard Stratocaster—including a fast-action maple neck, comfort-contoured body, three single-coil pickups, and synchronized trem—the GC-1 adds the convenience of a built-in Roland GK-3 pickup system, letting you drive Roland's guitar synth and modeling modules directly from the guitar's controls via the onboard 13-pin connector. If you're a guitar who's been wanting to check out guitar synthesis, now's the time—with the Roland GC-1 GK-Ready Stratocaster. Roland GK-Ready Stratocaster at a Glance:Open your playing up to the world of synthesis: The Roland GC-1 GK-Ready Stratocaster is your vehicle to explore a world that's been inhabited primarily by keyboardists. Roland has aggressively pioneered guitar synthesis since their groundbreaking GR-500 guitar synth in 1977. Equipped to drive their GR-55 and VG-99 synths, the GC-1 gives players legendary Stratocaster tone and playability - with the added benefit of onboard control for synthesis. It's a Strat: The Roland GC-1 has been developed in coordination with Fender, so you get all the classic Stratocaster sounds, playability, and functionality you'd expect. With its comfort-contoured alder body, maple neck with rosewood fingerboard and medium jumbo frets, three single-coil pickups, and vintage-style Synchronized Trem, the GC-1 is pure Stratocaster. The only inkling that there's high-technology lurking under the bonnet is the (barely-noticeable) Roland divided pickup sitting at the bridge and a small white button. Upstage your keyboard player with outrageous synth sounds: The Roland GC-1 is your ticket to reclaiming the spotlight. As a guitarist, you've owned onstage physical theatrics. But keyboardists have long been the gatekeepers of unique, breathtaking sounds - until now. With your GC-1 driving a Boss GP-10, GR-55 or VG-99 synth, you can conjure up strings, a horn section - or a swirling, synthetic aural landscape every bit as ethereal as anything the keyboardist in your band. It's all possible, with the Roland GC-1 GK-Ready Stratocaster! Not only that, but as your guitar is now a midi controller (when used with one of Roland/Boss's audio to midi multi-effects products) you can trigger any sound or virtual instrument that you'd be able to trigger with regular keyboard controller.", "ItemID": "264068928747", "EndTime": "2018-12-10T02:00:23.000Z", "StartTime": "2018-12-03T02:00:23.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Roland-GC-1-GK-Ready-Fender-Stratocaster-Electric-Guitar-Midi-Controller-w-case-/264068928747", "ListingType": "Chinese", "Location": "Los Angeles, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2640689287478080_2.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/OTUAAOSwezRcBGk7/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/5ikAAOSwusdcBGk9/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/NFYAAOSwaIpcBGk2/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/VqYAAOSwEONcBGky/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/gDkAAOSwJ31cBGk0/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/T44AAOSwHrlcBGk5/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/3-sAAOSwnv9cBGkv/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/sE0AAOSwCK1cBGkw/$_12.JPG?set_id=880000500F"], "PostalCode": "90046", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "willpete45", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 243, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 650.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 650.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "e***c", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 86}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Roland GC-1 GK Ready Fender Stratocaster Electric Guitar Midi Controller w/ case", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "Custom Bundle", "Value": ["Yes"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Stratocaster"]}, {"Name": "Bundle Description", "Value": ["Includes black hard case"]}, {"Name": "Body Color", "Value": ["Black"]}]}, "HitCount": 227, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 660.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 5, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}