{"BestOfferEnabled": false, "Description": "electric guitar, 1987 YAMAHA RGX-611S Maniac Series / Super Edition ~ All Original ~ Very Good+ condition.Made in Japan Down from here, Photo is dent and scratches etc.. About scratches that are hard to see. To make it easy to understand the condition of the scratches, I lighted the light strongly. 1987 YAMAHA RGX-611S Maniac Series / Super Edition ~ All Original ~ Very Good+ condition.Made in Japan BodyBass wood.NeckMaple Oil finish.Frets 24F. 350R.Scale24.75inch (628mm) Gibson Medium Scale.Nut WidthAbout 1.59 inch (40.5mm).Pick upFront = YGS - A1BO / Rear =YGH-A1BO, YAMAHA Original.Control1 Volume, 1 Tone, 3-Way PU Selector. Push to the TONE, Can select to Single or Humbucker for rear.BridgeRockin Magic II with Unit lock system.WeightAbout 7.63 Pound ( 3.46Kg )ColorIt became Cream color from white color by aging. This is Used Guitar. The Whammy bar is not original. The volume knob and tone knob has been changed to silver color. The back spring cavity plate was lost. There are scratches and dents. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. It was manufactured in 1987. At the time, Heavy Metal Music was popular in japan and RGX has been release. The combination of single and Humbucker, it is my most favorite RGX. I recomended to short fingers player. Because, It is Gibson medium scale and narrow neck. The back of neck is oil finish. Therefore you can move your hand very smoothly. Old Japanese guitar uses the good wood. RGX will be compared with Ibanez RG. But I think that I resemble an ESP guitars. You can coil-tap with Tone. You can select to Single or Humbucker. And, another characteristic of this guitar is tremolo system. You can fix the bridge completely by turning the body black knob. This guitar can respond to a variety of genres of music. Current, Some High end model guitars are made in Japan, but others are produced in Yamaha's own factory in China. It may be the cause, but currently in Japan, Yamaha's electric guitar is not popular. This is a Yamaha guitar of a very popular era. Produced by Kasuga musical instrument manufacture. Kasuga musical instrument manufacture was producing acoustic guitar, banjo, violin. Representative brands are \"Heerby\" \"ELECTRA\" \"Gaban\" \"Ganson\" \"RK Herby\" \"The KASUGA\" etc. Currently, it is all evaluated as Japan Vintage. About guitar play, Current state, the space between the strings and the frets is narrow. Thanks to that, I feel very easy to play the guitar. YAMAHA UNIT LOCK System. Very convenient !! I think the pickups is very very good ! I feel very good distortion sound. Of course, Clean sound is very well. I recommend Heavy Metal Music or Hard Rock music !! Old YAMAHA is Great !! It is cleanliness. I polished with guitar exclusive polish, so it is in a very clean state. I after the finger board cleaning, painted beeswax. The aim is moisturizing and and protection. Current neck condition, very good ! roughly straight ! There is no problem with the Truss rod and it can be adjusted. Remaining the frets are 84% on average. You can play immediately after it is delivered to you. I was set new strings. Regular tuning. ( Inch : 009, 011, 016, 024, 032, 042 ) All is working well. It is in a very good condition. The Truss rod Wrench is not included. All Original.Note : The Whammy bar and the volume knob and tone knob are not original. Look at the photos, please verify by yourself! It will be professionally pack. Double air packing. And ships inside a sturdy cardboard box. This electric guitar is USED. Please consider it when bidding. Thank you. Payment I accept PayPal only. Please pay within 3 days after the auction closed. Shipping Worldwide shipping from Japan! EMS / Shipping includes a tracking number. / / / Destination cost Delivery time / / / Asia : $1004 ~ 7daysUS Canada : $1205 ~ 8 daysEurope : $1406 ~ 10 daysOceania : $1205 ~ 8 daysSouth America : $2408 ~ 12 days This item is shipped within 3 business days after payment is confirmed. Terms of Sale International buyers - Please Note: Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer's responsibility. Please check with your country's customs office to determine what these additional costs will be prior to bidding/buying. These charges are normally collected by the delivering freight (shipping) company or when you pick the item up -do not confuse them for additional shipping charges. Please contact us first with 30 working days for any returns, Buyer pays shipping cost from buyer's country to Japan when being returned. In case of return, the shipping cost won't be refunded. We sell various kinds of Electric guitars to international customers. Our goal is to provide the best quality products and service and your satisfaction is the most important to us. Happy bidding!! Thank you !!", "ItemID": "253999240206", "EndTime": "2018-12-03T04:00:10.000Z", "StartTime": "2018-11-26T04:00:10.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1987-YAMAHA-RGX-611S-Super-Edition-All-Original-Made-Japan-/253999240206", "ListingType": "Chinese", "Location": "Nagoya-shi,Kita-ku, Aichi", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2539992402068080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMDY3/z/6NwAAOSwwqVb96bk/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/AV0AAOSw5cZb96bw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/7w4AAOSwa3lb96b5/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNTk5/z/MhsAAOSwcs1b96b3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/UPQAAOSwEJZb96cA/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/ehoAAOSwu9Jb96cT/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/5MIAAOSwtvZb96ca/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg2MTk=/z/QuoAAOSw~2Vb96cd/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg2MjY=/z/C-oAAOSwa1hb96ch/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTMzOFgxNjAw/z/34kAAOSw4Vpb96c1/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/WSIAAOSwcapb96c7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU2MlgxNjAw/z/RWIAAOSwZddb96dD/$_57.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jguitar-shop", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 369, "PositiveFeedbackPercent": 100.0}, "BidCount": 2, "ConvertedCurrentPrice": {"Value": 200.5, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 200.5, "CurrencyID": "USD"}, "HighBidder": {"UserID": "k***a", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 29}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Americas", "Europe", "Asia", "AU"], "Site": "US", "TimeLeft": "PT0S", "Title": "1987 YAMAHA RGX-611S. Super Edition. All Original. Made in Japan.", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Yamaha"]}, {"Name": "Model Year", "Value": ["1987"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["RGX-611S"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Series", "Value": ["Original"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["It became Cream color from white color by aging."]}, {"Name": "MPN", "Value": ["5N09057"]}]}, "HitCount": 307, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "JP", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 203.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["APO/FPO", "Africa"], "GlobalShipping": false, "ConditionDescription": "Very Good+ Condition. This is Used Electric Guitar. The electric guitar when connect to the amplifier, sound output is normal. There are scratches and Dents. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. Please Read the descriptions for details.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}