{"BestOfferEnabled": false, "Description": "https://www.tutti.ch/de/vi/zuerich/musik/instrumente/e-gitarre-westone-thunder-ii-a-1983/24883276I have Thunder II that has a traditional set neck, and believe the neck motif is a feature that distinguishes the Thunder I (bolt-on), II (set), and III (neck-thru). This web site shows a neck-thru motif on a purported Thunder IIA similar this listed guitar, but I believe it is a mislabeled Thunder III version 3. I have a Thunder 11A and it looks nothing like this guitar. Condition-wise, it is in good but not perfect shape. The main issue is a shallow crack at the neck/headstock volute consistent with an impact at some point, sort of a “splinter crack” (see photo). The impact dislodged some of the finish, and the crack was sealed with epoxy and is completely solid. There is no evidence of any more damage since I’m confident this is the original finish (no evidence of other finishes in the control cavity). The frets have wear, but have life left in them. There are a bumps and scratches typical of a nearly 40-year old used instrument. It plays great with very low action! Unplugged, the guitar has a nice ringing tone and exceptional sustain, but when it’s amplified it is one of the better rock-n-roll instruments I ever played, with an amazing variety of tonal options. All the electronic signals are strong, but a bit “scratchy”; cleaning and contact treatment should clear this up. The guitar comes with a functional 1980s Fender hard clamshell case in good but funky (painted; see photos) condition. From a purported “Westone” internet site: Westone Thunder III There are at least 3 versions of this model Specs from the 1981 catalog. Body - Canadian Ash, Hard Maple and Walnut Neck - through neck, Hard Maple and Walnut 5 piece laminate Ebony fingerboard, brass nut. 25.5 inch scale, 24 frets Steel tailpiece and bridge with brass saddles Metal backplates (Presumably like those on the Thunder II and III basses - anodised aluminium, not brass) 2 Magnet-F530 pickups Controls - Master volume, tone, equalizer volume: coil tap, phase and active EQ switches, 3 way pickup selector Active EQ is + or - 25 db with a centre zero position, gain is adjustable up to 13db. Available in Walnut and Sunset Red Optionally available with an XLR connector instead of the more usual jack socket. Script logo on headstock Version 2 (1982-3) As shown in the 1982-1983 catalog. Differences from the earliest version: HF530G pickups More ornate Swiftlok tailpiece Controls - master volume, tone, equalizer tone (Active gain is not adjustable) Version 3 (1983-?) As shown in the 1983 catalog. This version does not have active tone controls. Body - solid Maple Neck - 3 ply Maple, heelless built in Rosewood fingerboard, bone nut 25.5 inch scale, 22 frets Black plastic backplates S/H/S pickups (Super II/Hammer I/Super II) Precision tremolo tailpiece Controls - Master volume and two tone, 3 way pickup selector for the single coil pickups, 'mix sound' switch for centre pickup, 3 way coil tap switch for centre pickup, phase switch 'Bird' W logo on headstock - the logo is inlaid Mother of Pearl. Available in Onyx and Pearl Silver If shipping is less than $45, I will refund the difference. A full refund provided with no questions asked. I will return 100% of the bid price + 50% of return shipping after the guitar is returned. Yes, this means the buyer takes a small risk (50% of return shipping) when bidding on this guitar. No partial refunds.", "ItemID": "323651369084", "EndTime": "2019-01-21T03:15:13.000Z", "StartTime": "2019-01-16T03:15:13.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Westone-Thunder-III-Version-3-/323651369084", "ListingType": "Chinese", "Location": "Bridgeton, New Jersey", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/3236513690848080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTI4N1gxNjAw/z/-qgAAOSwdxVcN1hj/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTI3MFgxNjAw/z/KMYAAOSwlx9cN1h2/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTE2M1gxNjAw/z/LF0AAOSw7wFcN1iH/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/LHcAAOSw7wFcN1iY/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIyNFgxNjAw/z/xrgAAOSwZ8pcN1iy/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTE3NlgxNjAw/z/-D0AAOSwfTlcN1jE/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1NlgxNjAw/z/rp0AAOSw2sxcN1jR/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/HI8AAOSw651cN1jn/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTExOFgxNjAw/z/xw0AAOSwZ8pcN1jx/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/4KEAAOSwNqxcN1qE/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTE2MlgxNjAw/z/qOAAAOSwXHxcN1qO/$_32.JPG?set_id=880000500F"], "PostalCode": "08302", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "orton0231", "FeedbackRatingStar": "Red", "FeedbackScore": 1141, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 230.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 230.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "t***z", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 136}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Westone Thunder III Version 3", "ItemSpecifics": {"NameValueList": [{"Name": "Body Material", "Value": ["Maple"]}, {"Name": "Brand", "Value": ["Westone"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Thunder III"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Pearl silver"]}]}, "HitCount": 101, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 232.5, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}