{"BestOfferEnabled": false, "Description": "Original owner. In excellent to near mint condition. US sales only. Gibson Slash LP Standard Rosso CorsaAfter saving big rock riffs from the electronic mainstream with Guns N' Roses, and tearing it up big time with Snakepit, Velvet Revolver, and numerous solo and side projects, Slash truly needs no introduction. His Gibson Les Paul Standard Rosso Corsa Electric Guitar, though, is something you do want to hear about. Commemorative details include a distinctive Slash graphic on the headstock, echoed in a silkscreen on the included black Gibson USA hardshell case. Add a pair of Seymour Duncan(TM) Slash Signature(R) humbucking pickups, a TonePros(TM) Tune-o-matic bridge and stopbar tailpiece, and top it all off with unparalleled Gibson build quality, and the Slash Signature Rosso Corsa Les Paul sounds every bit as killer as it looks. Body and NeckThe Slash Signature Rosso Corsa Les Paul is built on a foundation of the same traditional tonewood combination that helped to make the Les Paul Standard legendary when it first arrived six decades ago. A carved solid Grade-AAA figured maple top lends bite and articulation to the sound, while a select mahogany back--treated with Gibson's traditional weight relief to increase playing comfort and enhance resonance--contributes superb warmth and depth. A solid, quarter-sawn mahogany neck is glued in and carved in the fast '60s SlimTaper profile that Slash prefers, and topped with a Grade-A rosewood fingerboard featuring 22 medium-jumbo frets and traditional trapezoid inlays. Both the body top and fingerboard are bound in vintage cream; to avoid concealing any of this luscious Rosso Corsa finish, the guitar carries no pickguard.Pickups and ElectronicsSlash -- always particular about pickup tone--has teamed up with Seymour Duncan(TM) to produce the Slash Signature(R) humbuckers to his precise requirements. These are made in the image of the hallowed Gibson PAF humbuckers of the late 1950s, with genuine Alnico II magnets, but with a few extra turns of wire for a richer, throatier tone in the neck position and plenty of crunch and wail in the bridge. They are wired in the traditional four-knob control complement with three-way selector switch, and include \"orange drop\" tone capacitors on the tone pots. HardwareA high-quality TonePros(TM) set including a Tune-o-matic bridge and lightweight aluminum stopbar tailpiece ensure solid sustain and precise intonation, while a set of vintage-style tuners retains a traditional look at the headstock. Strap locks ensure that your Slash Signature Rosso Corsa Les Paul stays secure throughout the most rockin' performance you can throw at it. Case and ExtrasThe Slash Signature Rosso Corsa Les Paul comes protected in a plush-lined Gibson USA hardshell case with black exterior and Slash artwork silkscreen. It includes an owner's manual and adjustment literature, and Gibson's Limited Lifetime Warranty, and 24/7/365 Customer Service.", "ItemID": "163426877379", "EndTime": "2018-12-19T18:22:21.000Z", "StartTime": "2018-12-12T00:33:44.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-Les-Paul-Slash-Signature-Corsa-Limited-Edition-/163426877379", "ListingType": "FixedPriceItem", "Location": "Las Vegas, Nevada", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1634268773798080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/1N8AAOSwIABcAsXI/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/ITMAAOSwcttcAsXY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/pZwAAOSwabRcAsX9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/AV4AAOSwqlxcAsXn/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/xTcAAOSwip5cAsX0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/-scAAOSwuQhcAsXi/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/gXUAAOSwKOZcAsa0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/kTYAAOSw9m5cAsa5/$_57.JPG?set_id=8800005007"], "PostalCode": "89130", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "hgwy407", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 370, "PositiveFeedbackPercent": 96.8}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 2200.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2200.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "d***o", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 130}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson Les Paul Slash Signature Corsa Limited Edition", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Color", "Value": ["Corsa"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Model Year", "Value": ["2013"]}]}, "HitCount": 144, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "In excellent condition. Includes original case and paperwork. Near mint.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}