{"BestOfferEnabled": false, "Description": "Up for grabs... Weber Minimass 50w Attenuators (For use with 35w and lower tube amps). ***Please read all information listen below my description from the manufacturer. I bought this brand new (MADE TO ORDER) about 2 months ago to use with my EVH 5150 LBXII for silent recording - I no longer use an amp, so my loss is your gain. When I bought this, I was required to read the FAQ per the website, basically absolving them of any liability for how you decide to use this attenuator. If you are reading this, you more than likely know how to use one - All tube amps require a load/speaker to be plugged in during use or you can really mess some things up - this attenuator goes in between the head and the cabinet so you can lower the volume for various applications. Please do due diligence and research this brand, look up manuals on Ted Weber’s site, or ask any and all questions prior to bidding on this attenuator - I will not be liable for misused applications with this! No international shipping! DESCRIPTION (From the manufacturer): This attenuator has a main volume knob and 3-position treble compensation switch which affect the signal to the speaker. The line out signal is dependent on your amplifier settings. Impedance selector for 4, 8, 16 ohms, 3-position treble compensation switch, MASS bypass switch, unbalanced line out. The MiniMASS employs an actual speaker motor for realistic interaction between the attenuator and the output circuit of the amplifier. The attenuation is continuously adjustable from about -3dB to over -50dB. By turning the speaker control to minimum (maximum attenuation), the unit may be used as a dummy load for testing or for DI use. 5.5” x 5.5” footprint (add 1” in front for knob). 3.75” tall. 3.35 lbs basic. Line Out jack has no volume control and is dependent on your amp volume setting. ATTENUATOR FAQ (From the manufacturer) WHY WEBER? Our MASS attenuators use an actual moving speaker motor for the load, and our Load Dumps are purely resistive like all of the other attenuators on the market. All MASS products use an actual moving speaker motor for the load and are more interactive with the output circuit of the amp, thus providing a more realistic load to the amp. We believe our attenuators are the most transparent on the market. We feel that any tone loss is minimal, and that it is more a function of how your ear perceives sounds at lower volumes, rather than the device actually eliminating frequencies. That is why our attenuators have treble compensation controls. HOW DO I HOOK IT UP? COMBO AMP: When using an attenuator with a combo amp, place the unit between the amp's speaker out and the speaker itself. Most combo amps have internal speakers that can be unplugged from the amp chassis using a 1/4\" phone plug. UNPLUG the speaker from the amp. Run a short speaker cable from the output of the amp to the INPUT of the attenuator. You may then plug the speaker directly into the SPEAKER OUTPUT (not \"Line Out\") of the attenuator, or use a male-to-female extension cable if the speaker's wire won't reach. You should use speaker cable only, and short cables work best to prevent signal loss. HEAD/CABINET: When using an attenuator with a 'piggyback' arrangement, place the unit in line between the amp head's speaker out and the cabinet. Run a cable from the amp head's speaker jack to the INPUT of the attenuator. Then run a cable from the OUTPUT (not \"Line Out\") to the cabinet. You should use speaker cable only, and short cables work best to prevent signal loss. WHERE DO I PLUG MY GUITAR IN? You should plug your guitar into the input of your amp, or through pedals, or however you normally have it. Using an attenuator does not change where you plug in your guitar. BYPASS: This switch bypasses the attenuator entirely, as if it is not connected between the amp and speakers. It is the same as a true bypass on an effects pedal. RANGE SWITCH: This is a fixed amount of attenuation in addition to the setting of the main speaker volume (attenuation) control. It has the effect of extending the range of the main speaker control. The fixed amount of attenuation depends on the impedance of the amp and speaker, but is typically 6db. The Range Switch is really the difference between coarse-tuning and fine-tuning. In other words, if you are only attenuating a little bit, you might find you have better control in the High range setting. If you are attenuating down to much quieter volumes, you might find you have better control on the Low range retting. WHY ARE THERE TWO SPEAKER OUTPUT JACKS? The two speaker output jacks are in parallel. With all Weber attenuators, once you have selected the proper impedance to match the output impedance of the amp, the actual speaker impedance isn't critical. That's because the actual load to the attenuator becomes the speaker impedance plus the output section of the attenuator, while the amp continues to see the correct nominal impedance from the input section of the attenuator. That's why, on the MASS, we provide two speaker output jacks. Feel free to experiment with different impedance speakers, cabinets, etc. (this only means that the impedance will be matched when you have the attenuator engaged. if the unit is on bypass, it will not do any impedance correction.) WHAT IS THE LINE OUT FOR? the LINE OUT jack is there to run a direct signal to a PA mixer or recording device, etc. you don’t have to use this, but it’s there in case you want to do that. the LINE OUT is always active, and is not affected by attenuation. it is completely separate. WILL THE UNIT GET HOT? There will be some heating because we use a combination of power resistors, wirewound rheostats, and a speaker motor in the attenuators. Our attenuators use rheostats to control the attenuation and distribute the power to the speaker motor or other load and the speaker. Rheostats are made of vitreous ceramic, nichrome wire (like your toaster), and are coated with a hard coat epoxy paint. Therefore, when new, rheostats can emit a slight smell and even a little smoke until the rheostats are aged. This is normal and not an issue. The smell and smoke will subside after two or three hours of use. Adhesives are also employed to mount certain heat dissipating devices in the enclosure. They too will emit a slight smell when new. WHAT KIND OF CABLES SHOULD I USE? You need to use speaker cable only. I prefer at least 16ga wire with very good quality 1/4\" phone plugs on the ends. I would not go over 4ft for the cable length. If you get feedback or squealing from the speakers, you may need to relocate the attenuator and use shorter cables. For the Line Out, you will want to use instrument cable. WHAT LEVEL IS THE LINE OUT SIGNAL? The line out signal is typically 1/10 (-20db) the level of the amp's speaker output signal level. On attenuators that don't have a line out volume control, the level is controlled directly by the volume of your amp. WHY IS THE MAIN ATTENUATOR CONTROL HARD TO TURN? To explain why the volume control doesn't have the same \"feel\" as you may be used to, it is useful to know that the knob is not a normal potentiometer like you'd find on an amp or guitar. the knob is actually a ceramic wire-wound rheostat, which by the nature of its operation feels somewhat gritty and has a physical sound to it. using a rheostat is actually the only way the attenuator design will work. most pots have about a 2 watt power handling before they melt. since the design of the attenuator requires the power of the amplifier to go through the control knob, a much more stout component must be used. the rheostat has a power handling rating of 50 watts (or more depending on the attenuator chosen). on the upside, the rheostat offers some consistency for you, in that once you find the volume setting that works for you, you can leave it and feel reasonably comfortable that the knob won't drift on its own because of the high friction of the rheostat. I WANT TO RACKMOUNT MY ATTENUATOR. WHERE SHOULD I PUT IT IN THE RACK? Since heat rises, I would either locate the attenuator in the top position of the rack, or in a lower position that has an empty space above it. WHY DO SOME UNITS HAVE IMPEDANCE-SELECTORS, BUT OTHERS DO NOT? On our attenuators that have two (or three) knobs for adjusting the highs and lows, it would be very difficult and impractical to implement an impedance switch. Because impedance varies with frequency, and we are splitting the frequencies into two components (high and low) a global impedance switch would actually interfere with the tone-shaping function. The unit is designed around an 8 ohm speaker motor, but with all the components of the unit working together, it is safe to use on 4 8 or 16 ohm amps. * POWER LEVEL: You should select an attenuator that can handle at least as much power as your amp puts out. When choosing an attenuator for multiple amps, you should pick one that can easily handle the highest power level of amp that you have. Our attenuators do not have sonic differences that come along with higher power ratings, so it is fine to use a 200w attenuator on a 30w amp, for instance. In other words, a 50w attenuator will sound the same as a 200w attenuator on smaller amps. DUMMY LOAD USE / HEADPHONE TAP OPTION: All Weber attenuators may be turned to maximum attenuation and then the speaker may be disconnected so the attenuator may be used as a dummy load for DI or Headphone use (if Headphone Tap option is selected) When the attenuator is turned all the way down, you may still hear some signal out of your speaker. Well, the design of the attenuator is such that it would be harmful to your amp if the signal were to completely short to ground the way a normal volume control is at 0. This means even with the volume set at 0, you may still hear a tiny bit of signal. The solution is that when you have it turned all the way down to 0, you can unplug the speaker. the attenuator is giving the full load to the amp, so it is safe to use this way. (just be sure you don't flip the bypass switch and present your amp with no load!) FOOTSWITCH OPTION: The footswitch is for turning the attenuator on and off. Take this scenario for instance: You play both rhythm and lead parts, and say you want to have it louder for lead parts. You set your amp to the lead volume, and then use the attenuator to set your rhythm volume. Then you can use the footswitch to change between them. (we install a relay to handle the switching so there is no momentary lapse of load to your amp, and this requires external power. an AC plug is included). BALANCED LINE OUT: It really comes down to how long your cable is going to be from the Line Out. The longer the cable, the more chance of noise interference. Here is an article that will help you understand the difference between the standard Unbalanced Line Out versus the Balanced Line Out option: CLICK HERE TO READ. Note: since the balancing requires using a transformer, the Balanced Line Out will have a low end rolloff. Any time a transformer is involved, low end is the first thing to suffer - unless the iron is physically massive, and it isn't.", "ItemID": "132891931023", "EndTime": "2018-12-24T06:30:35.000Z", "StartTime": "2018-12-20T01:00:01.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Weber-MiniMass-50w-Attenuator-/132891931023", "ListingType": "Chinese", "Location": "McGregor, Texas", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1328919310238080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/iWwAAOSwzqtcGF22/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/xbwAAOSwlThcGF2x/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/S0kAAOSwGUpcGF20/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/vuMAAOSwx1FcGF2v/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/ICoAAOSw~D5cGF2y/$_12.JPG?set_id=880000500F"], "PostalCode": "76657", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "dutchudsondesigns", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 214, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 100.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 100.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "n***t", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 65}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Weber MiniMass 50w Attenuator", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Weber"]}]}, "HitCount": 59, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 102.5, "CurrencyID": "USD"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}