{"BestOfferEnabled": true, "Description": "Gibson Blackwater bought in 2012 from a Guitar Center in Chicago. Only 200 made. This Guitar will Sell - NO RESERVE. Buy it now and it's for sure yours! Owned by a country fella in Nebraska. Primarily used at church services. Always taken home and never left out of the case. The strings were always loosened when not playing within roughly a weeks time. In the pictures you will see on the back of the neck where the guitar hangs from a mount. The \"Hercules\" mount dug into the neck there and I was unaware until it was too late. Nicks are not very noticeable. I bought the guitar with a ding on the front right below the control knobs. I tried to get the right angle in the pictures so you can see it. It also is not noticeable from standing distance. I'm very positive this nick is not deep enough that it got past the nitro lacquer. To the best of my eye sight I believe the maple top is not scuffed at all. The screw holding on the top strap button is not original. The original failed and a slightly wider screw I used to re-attach the button. It is not much longer than the original, I didn't want it to damage any internal parts of the body. The body has normal blemishes from normal playing use. The plastic is still on the battery box plate (that's why it looks funny). I handled this thing like a baby. The guitar case has a couple tiny dings as well as you can see in the pictures. The outside material on these things aren't the thickest/toughest. The white \"specks\" you see on any black of the guitar are reflections from the sun off the swirl-like reflections in the lacquer. I always cleaned the guitar with a microfiber cloth and Gibson's pump polish. The guitar may need to be \"set-up\". I am not a pro with the specs on this so I haven't touched the bridge or truss rod since it came from Guitar Center. It comes with original owners manual, warrantee card and original receipt when I bought it new. It will ship in it's original box with bubble wrap outside of the guitar case. If you have any questions or would like a few more pictures I will do my best to get them to you via e-mail in the evenings. The guitar was kept inside in a smoke free home. Thanks for looking! Google the specs on this guitar and check out some good audio youtube on the piezo pickups. They are really cool, and yes you can get awesome acoustic clean stringy sounds from these alone. A very versatile guitar. SHIPPING::::::::: I will only ship to the United States of America - contiguous 48 states. Standard shipping from Nebraska to the outer parts of the US was around $85.00. Be prepared for higher shipping costs! I will put insurance on the standard shipping which may be extra than what ebay is quoting you!!! You pay any extra shipping if you would like expedited. I will ship within 3 business days after payment is received. I will only ship UPS. I will deliver 200 miles from the 69033 area code on my schedule, contact for details! PAYMENT:::::::::: Due within 2 days after auction has ended. A negative feedback shall be expected if full payment is not received within 48 hours after auction has ended. Please contact me ahead of time if you think your going to be a tiny bit late, only then we'll discus a late payment. I know we are all human but please pay on time. Please look at all the pictures and know you are purchasing the Gibson Les Paul, paperwork and case. Sold AS IS with no warrantee of any kind. I am not responsible for shipping damages. The guitar stand is not included. Thank you. God Bless!", "ItemID": "332877842406", "EndTime": "2018-11-18T19:25:55.000Z", "StartTime": "2018-11-11T20:09:48.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-Les-Paul-Blackwater-Piezo-saddles-only-200-made-/332877842406", "ListingType": "Chinese", "Location": "Imperial, Nebraska", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/3328778424068080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA2M1gxNjAw/z/QOcAAOSwoM5bsAKe/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDYz/z/3RYAAOSwkshbsAKl/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2M1gxNjAw/z/P4EAAOSwW4dbsALg/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2M1gxNjAw/z/WTMAAOSwgG5bsALz/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2M1gxNjAw/z/yDgAAOSwiHRbsAL6/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2M1gxMzky/z/IRAAAOSwd49bsQdW/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2M1gxNTE3/z/ssMAAOSwFXdbsSN-/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2M1gxNjAw/z/3igAAOSwU~FbsSOI/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjU3WDc4Ng==/z/fvIAAOSwx5hbsSOO/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODA1WDE2MDA=/z/eY8AAOSwF2FbsSOT/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzM0WDEzNDg=/z/m-UAAOSwfEdbsSOb/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2M1gxNjAw/z/cAoAAOSwiJhbsAN9/$_32.JPG?set_id=880000500F"], "PostalCode": "69033", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "100wild_horses", "FeedbackRatingStar": "Yellow", "FeedbackScore": 43, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 1497.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1497.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 595}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson Les Paul - Blackwater - Piezo saddles - only 200 made", "ItemSpecifics": {"NameValueList": [{"Name": "Body Material", "Value": ["Maple"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Product Line", "Value": ["Gibson Les Paul"]}, {"Name": "Model Year", "Value": ["2010"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Blackwater"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Body Type", "Value": ["Chambered"]}, {"Name": "Features", "Value": ["Piezo Saddles"]}]}, "HitCount": 189, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 1522.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}