{"BestOfferEnabled": true, "Description": "CALL OR TEXT G-BRAT’S GUITARS ANYTIME; (972)816-7736 You're looking at a 2009 Gibson Les Paul Supreme with a Heritage Cherry Sunburst finish, on a gorgeous maple flamed top and back, with and gold hardware. If that’s not enough, this is also equipped with a real EBONY fretboard, which you will not see on the newer ones. The action is fast and low... 490R & 498T pups really crank! Notice that there are no back plates? That's because the electronics were configured through the extra large jack plate. The back is carved and flamed, just as the top. Just a killer guitar all the way! She's 100% original and ready to rock!Here is the lowdown on all the features:Model: Les Paul SupremeFinish: Heritage cherry sunburst, glossTop: Carved AAAA mapleBack: Carved AAAA maple, with no back plates, chambered bodyFretboard: EbonyFret Inlays: Split parallelagram, mother-of-pearlScale Length: 24-3/4\"Neck: Mahogany, set neckNeck Profile: 50's roundedHardware: GoldTuners: Grover gold metal tulipHeadstock Inlay: \"Supreme\", with pearl, abalone globeBridge: Nashville tune-o-matic, with stop tailPickups: Gibson 490R & 498T humbuckersControls: 2 volume, 2 tone and 3-way pickup selectorKnobs: Gold speed knobsWeight: 8.5 lbs.Serial # 019090401 She was born in 2009 and has been played, but well cared for… until UPS decided to crack the headstock. Yes, this arrived in my shop with a cracked headstock, which we then took to the world famous Charlie’s Guitar Shop in Dallas, who proceeded to do an excellent job of repairing this. The guitar is now in great and stable playing condition… even stronger than before! Aside from the above mentioned important disclosure, the hardware has a fair amount of gold wear, particularly on the tail-piece, and there is some hazing below the treble strings. Regardless, as you can see in the pics, the guitar still looks amazing despite these flaws. Also included is the original Gibson hard shell case with the white interior and satin shroud, along with completed set of strap locks and the Gibson booklet, just as shown in the last picture! Whoever brings this baby home is gonna be STOKED!! LET'S GO!! WHILE YOU ARE HERE, GO AHEAD AND LOOK AT MY OTHER LISTINGS!! OUR CLIENTS ARE THE BEST IN THE WORLD!! Me- I have a 100% positive feedback rating, and intend to keep it that way! So please don't worry! You're in good hands here!! Shipping- We take pride in packing our guitars well, and shipping them quickly. Please note, if you are paying with Pay Pal, we will only ship to the address that is listed in Pay Pal. Here are the shipping rates, covering the planet earth:USA - $49 with UPSCanada, Hawaii, Alaska, Puerto Rico - $119Brazil, Argentina - $159Australia, New Zealand, Switzerland - $219 USPS Express or $249 UPSAll Other Worldwide Shipping - $219 - UPS Worldwide Expedited (in most cases); However, if UPS is more costly in certain countries, USPS will then be used instead. Payment Methods- Pal Pal is preferred!! We do also accept direct payment with Mastercard, Visa, American Express and even Discover! ~ TEXAS RESIDENTS ARE REQUIRED TO ADD 8.25% SALES TAX ~ Factory Warranty- We are an authorized dealer for: Knaggs, Ken Smith, F Bass, Trussart, Warwick, Breedlove and Warrior, so for these instruments, if listed as NEW, there is a full factory warranty. For all other brands, or if listed as USED, there is no warranty available. Return Policy- We do accept returns up to 14 days from the point of the initial sale, which means that the guitar must be back in our possession within this 14 day period. However, please be aware of the following conditions: If for any reason you wish to return the guitar, just call or email me directly, within 24 hours of your receiving the item, and let me know that you want to return it. Once we receive the guitar back, in the same condition, you will receive a refund, less a $50 restock fee. Also be aware that the initial shipping fee is not refundable under any circumstances. International Bidders- We, at G-Brat's Guitars, are HONORED to do business with anybody on the planet earth... So international buyers are VERY welcome here! That being said, please observe the following conditions: If you are paying with Pay Pal, please be completely registered with Pay Pal, prior to the purchase; this will help avoid shipment delays, and will assure that you will get your guitar as quickly as possible!International shipments usually require additional \"Customs Fees\" or \"Import Taxes\". These fees will vary, depending on the country, and are the responsibility of the buyer. If you want more information on what these fees entail, please contact your local customs office for this information. THANK YOU SO MUCH FOR LOOKING!!! _gsrx_vers_827 (GS 7.0.13 (827))", "ItemID": "273621200702", "EndTime": "2019-01-13T19:48:28.000Z", "StartTime": "2018-12-21T20:20:38.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2009-GIBSON-LES-PAUL-SUPREME-FLAME-TOP-BACK-w-REAL-EBONY-FRETBOARD-CH-SUNBURST-/273621200702", "ListingType": "FixedPriceItem", "Location": "Red Oak, Texas", "PaymentMethods": ["PayPal", "VisaMC", "Discover", "AmEx"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2736212007028080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/PusAAOSwqj9bfua5/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/QlQAAOSwQxxbfua5/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/H3AAAOSwjkxbfua6/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/bG0AAOSwuMRbfua~/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/po8AAOSwJJtbfua7/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/bCwAAOSwDehbfua8/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/5s0AAOSwNJpbfua9/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/exIAAOSwfHFbfua~/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/pqQAAOSwJJtbfubA/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/VbUAAOSwXF9bfubA/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/ROAAAOSwJnRbfubB/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/k1cAAOSwRhVbfubB/$_3.JPG"], "PostalCode": "75154", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "guitarbrat1", "FeedbackRatingStar": "Red", "FeedbackScore": 3672, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1999.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1999.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "o***m", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 287}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "2009 GIBSON LES PAUL SUPREME FLAME TOP & BACK w REAL EBONY FRETBOARD CH SUNBURST", "ItemSpecifics": {"NameValueList": [{"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Body Color", "Value": ["Heritage Cherry Burst"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Les Paul Supreme"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Body Type", "Value": ["Chambered"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Model Year", "Value": ["2009"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}]}, "HitCount": 903, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=43416548", "StoreName": "guitarbrat1"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Nicks, dings and scratches here ~ See description for details", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}