{"BestOfferEnabled": false, "Description": "This auction is for a Paul Reed Smith, PRS SE Custom 24, Electric Guitar and matching PRS SE Soft Case with a Trampas Green finish. It weighs 8 pounds. Solidbody Electric Guitar with Mahogany Body, Maple Top, Maple Neck, Rosewood Fingerboard, and 2 Humbucking Pickups - Trampas Green The Paul Reed Smith SE Custom 24 offers premium and affordable PRS tone. Value-packed Version of PRS's Iconic Custom 24 The Paul Reed Smith SE Custom 24 solid body electric guitar puts the sound, playability, and gorgeous looks of the Custom line into a high-quality and affordable instrument. The SE Custom 24's mahogany body and maple top hold two great-sounding PRS-designed SE 85/15 humbucking pickups. Its 3-piece maple neck features a wide-thin shape for very easy playing, and the rosewood fingerboard is adorned with classic PRS bird inlays. The headstock has been redesigned to now sport Paul Reed Smith's signature, adding extra \"cool\" factor. This guitar is a true PRS through and through, as well as being a great value. You don't have to be a rock star to enjoy the SE Custom 24. Paul Reed Smith SE Custom 24 Solidbody Electric Guitar at a Glance: Exceptional components PRS-designed SE 85/15 humbucking pickups PRS quality in every guitar Exceptional components The combination of a mahogany body and maple top gives the SE Custom 24 a perfect balance of rich midrange and bright snap (and the beautiful flame maple top veneer helps make this instrument a real looker). Add a pair of PRS-designed humbuckers in the bridge and neck positions, and you've got a recipe for thick, sustaining tones. Pull up on the tone pot, and you'll access chiming, bell-like single-coil sounds. And the SE Custom 24's maple neck has a wide-thin carve, making it very fast and playable. PRS-designed SE 85/15 humbucking pickups The two humbucking pickups in this SE Custom 24 are Paul Reed Smith-designed SE 85/15s. An update on PRS's original humbuckers, the 85/15s are designed to sound terrific whether used in humbucking or single-coil modes. They offer you plenty of output for driving your amp hard, while sounding clear and detailed when you want. These SE humbucker closely resemble the tones of the U.S.-made versions found in the solid body electric guitars crafted at PRS's Maryland factory. PRS quality in every guitar All Paul Reed Smith guitars are designed for performance, right out of the case - and the SE Custom 24 is no exception. Constructed from high-quality tonewoods and components, PRS instruments carry on a commitment to quality that's been the brand's hallmark since 1985, when Paul Smith began crafting guitars for some of the most elite players in the world. In fact, you'll often see a PRS SE in the touring rigs of the most well-respected PRS artists in the world. Paul Reed Smith SE Custom 24 Solidbody Electric Guitar Features: Full-featured Paul Reed Smith at a great price Legendary PRS quality and playability Beautiful flame maple gives the guitar an elegant look Mahogany body for punchy tone and long sustain PRS-designed tremolo maintains tuning under heavy use PRS SE 85/15 pickups sound great humbucking or single-coil Push-pull tone knob accesses great single-coil-type tones Wide-thin maple neck is comfortable and fast Used, very good condition, a few small dings/scratches and very minor fret wear. Checked and tested. Ohio residents must add 7.5% sales tax. Buyer pays shipping. PayPal, MC and VISA accepted. OH PB Lic. #100051 S", "ItemID": "232980002353", "EndTime": "2018-11-01T17:54:19.000Z", "StartTime": "2018-10-25T17:54:19.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/PRS-SE-Custom-24-Electric-Guitar-Case-Trampas-Green-/232980002353", "ListingType": "Chinese", "Location": "Dayton, Ohio", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/2329800023538080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTI1NFg2Mjc=/z/9-kAAOSwezRb0f8I/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI2MFg0ODM=/z/FowAAOSwOYRb0f8L/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwM1g5OTY=/z/ZoIAAOSwihVb0f8Q/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTExOFgxNjAw/z/1qgAAOSw21Rb0f8U/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA5NVgxNTMw/z/5HIAAOSwLKNb0f8Y/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODkzWDE2MDA=/z/ZO4AAOSwQrVb0f8e/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA5OFgxNjAw/z/KeAAAOSwETJb0f8m/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAwNVgxNjAw/z/0YQAAOSwqe1b0f8v/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIyMVgxNDQ2/z/p54AAOSwwRVb0f82/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTkwWDE2MDA=/z/kNoAAOSwZ3pb0f9d/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI3NVg5Nzg=/z/kWMAAOSwPxRb0f9i/$_57.JPG?set_id=8800005007"], "PostalCode": "45406", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "ohioloan", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 11675, "PositiveFeedbackPercent": 99.4, "TopRatedSeller": true}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 499.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 499.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "d***d", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 5}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "PRS SE Custom 24 Electric Guitar & Case - Trampas Green", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["PRS"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Color", "Value": ["Trampas Green"]}, {"Name": "Model", "Value": ["SE Custom 24"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}]}, "HitCount": 380, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=22273396", "StoreName": "ohioloan"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 504.99, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}