{"BestOfferEnabled": false, "Description": "  Fender American Standard Telecaster 1998 Electic Guitar     This auction is for a Fender American Standard Telecaster 1998 Electic Guitar. These markings are on the item which may help in correctly identifying it: SN:N8344484 Sunburst Color Rosewood Fretboard Extra White Pickguard Made in USA SKB Hard Case This guitar is used. It was made in 1998. It has an extra white pickguard. It comes with the original purchase paperwork. A key to the SKB Hard case is included. The neck on this guitar is very straight. This guitar is very nice and plays extremely well. There is a blemish on the edge of the body of the guitar. There are some very small dents on the back of the neck. There are some smaller scuffs on the body of the guitar from regular use. We took lots of pictures of this guitar to show the condition. Click on a picture below for larger images.   Customer Service   Customer service is available Thursday - Monday 8:30 AM - 4:30 PM Mountain Time Phone: (406) 866-0210Fax (406) 866-0210. If you have specific questions about items you will need to contact the First National Pawn location directly where this item is located.   Payment Methods Accepted   Our mailing address: FNP Outlet 1101 13th St. S. Great Falls, MT 59405 USA If you have any questions as to which payment methods we accept give us a call at: 406-866-0210   Policies   Descriptions We deal in a wide variety of used merchandise.  So, we are very frequently less knowledgeable about the items that we are selling than our customers are.  To help correctly identify the items in an auction, we will include a description of any markings on them that appear to be meaningful.  We will describe any specific defects that we have found.  We will provide the results of any research that we did into the item's value.  The pictures in the auction are of the item(s) that will ship, so if the pictures provide more detail than we have in the auction title and description, then the pictures are correct. Domestic Shipping Only We will ship this item only within the United States and its territories. Any items marked \"free shipping\" being shipped to Alaska or Hawaii will accrue an extra surcharge depending on the weight and dimensions of the package. We will not ship this item to any other countries.  We will use UPS ground for shipments to US states and to Puerto Rico.  We will use the USPS for shipments to other territories and to FPO and APO boxes.  The shipment will be insured against loss/damage for the amount of the winning bid.  If a customs declaration is necessary (e.g. for territorial and FPO/APO boxes), the amount declared will be the amount of the winning bid. Please refrain from using a Freight Forwarding company as we will cancel any order with a shipping address to one of these companies. Feedback We expect our customers to be free and candid in leaving feedback about the transaction at their leisure. We will send a feedback reminder three weeks after we have received payment for the item, we will reply to feedback that we receive if we think that further explanation is necessary. We will post positive feedback after we have shipped the item. Payments Payment must be in US dollars.  We accept PayPal, MasterCard and VISA.We trust our customers to pay for auctions they have won, which is why we allow 21 days if the customer contacts us within 7 days from the time of the auction ending and makes arrangements for a late  payment. During that time, we will email payment reminders every seven days.  If we receive payment while a dispute is open, we will close it, ship the item and leave positive feedback. Questions Questions about items will be forwarded to our store where the item is located.  It may take a few days for a response, so please ask early. Returns And Refunds We think that basically good people in an honest and open environment, who treat each other as they would like to be treated, can work out returns and refunds.  We've structured our return policy to be fair all around.  If we make an error, then we will make it good if you let us know about it quickly. Inspection Period In order to be eligible for any refund, we must hear from you within fourteen days of the date of delivery of the merchandise. Our Refund Offer If the item differs substantially from how we described it, then we will offer you either a full refund (you send the item back) and/or a partial refund (you keep the item). If the item is as we described it, and you want to send it back anyway at your expense, then we will offer to refund you eighty-five percent of the purchase price. If the item was damaged during shipment, we will offer a full refund.  It may or may not be necessary to return the item to us, depending upon the extent of damage and insurance requirements of the carrier. Sending The Item Back To Us Any item that you send back to us must have a Return Merchandise Authorization (RMA) number.  The RMA number (and the address to send the item back to) will be provided in our refund offer.  In order to issue a refund, we must receive the item within fourteen days of issuing the RMA number. Sending The Money If you paid via PayPal your refund will be issued through PayPal, if you paid via different method we will issue you a check. Refunds will be issued within 7 days of either receiving the item back or agreeing on a partial refund. Time Line We will complete the refund within thirty days from first hearing of the problem.  This allows for a few days of emailing, time for the item to be returned to us if necessary, and time for us to get the check mailed. Shipping And Handling Since we cannot personally hand items to our on-line customers, we must rely on a shipper to deliver them. We want one that is fast and reliable and that can provide as much information as possible about the delivery. We and our customer must be able to track the shipment. The shipment must be insured against loss and/or damage. The item must be packaged so that it can survive bumps during the journey. And we must know when our customer received it (a signature will be required for items with a winning bid of or more than $250.00). Most of our auctions use dynamic shipping. Some use flat-rate shipping. Flat-rate shipping and handling fees will be specified in the auction description. For auctions that us dynamic shipping, a link to a shipping calculator will be included within the auction description so that potential buyers can determine what shipping and handling will be.  The final amount is calculated when the buyer checks out and usually does not differ from estimated amounts by more than a few cents.  Freight, insurance and handling are all included in the amount show by the shipping calculator. We use UPS ground for shipments within the United States--including Alaska, Hawaii and Puerto Rico, but these 3 will accrue an additional charge when the auction is marked as \"free shipping\". For customs, the declared value of a shipment will be the amount of the winning bid. Because we use UPS, we cannot ship to post office boxes (except for shipments to FPO and APO boxes and to U.S. territories where UPS ground is not offered). The item description will contain the shipping details. We must receive payment in full for the item before we will ship it. Once we receive payment, we ship items in the most prompt manner possible. At First National pawn, your complete satisfaction is our goal, and we will do everything possible to ensure that your purchase arrives quickly and undamaged.", "ItemID": "113364017707", "EndTime": "2018-11-15T23:41:15.000Z", "StartTime": "2018-11-10T23:41:15.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fender-American-Standard-Telecaster-1998-Electic-Guitar-/113364017707", "ListingType": "Chinese", "Location": "Shelby, Montana", "PaymentMethods": ["PayPal", "VisaMC", "Discover", "AmEx"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1133640177078080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/xoQAAOSwlINbtpF4/$_57.JPG?set_id=8800005007"], "PostalCode": "59474", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "fnp_outlet", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 20229, "PositiveFeedbackPercent": 99.2, "TopRatedSeller": true}, "BidCount": 7, "ConvertedCurrentPrice": {"Value": 750.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 750.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": ".***e", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 6}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Fender American Standard Telecaster 1998 Electic Guitar", "ItemSpecifics": {"NameValueList": [{"Name": "Product Line", "Value": ["American Standard"]}, {"Name": "Brand", "Value": ["Fender"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Model Year", "Value": ["1998"]}, {"Name": "Series", "Value": ["American Standard"]}, {"Name": "Model", "Value": ["American Standard Telecaster"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}]}, "HitCount": 463, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=7616972", "StoreName": "FNP Outlet"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 760.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["US Protectorates", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}