{"BestOfferEnabled": true, "Description": "Jackson Pro Series King V KV 6-String Guitar / Gloss/ Deep Black SKU: 1031782 Item Condition E+ Excellent Plus - May have slight wear, but only visible under close up inspection. Item Description The king of high-performance guitars, Jackson's been designing instruments that exceed the requirements and expectations of modern metal players for more than three decades now. And with the Pro KV, Jackson takes the regal King V to even more majestic heights. A guitar created for giant, crushing tone with head-banging, flamboyant style, the Pro Series King V KV offers premium features including a mahogany body with bevels and an ultra-fast one-piece maple neck with a scarf joint and pair of graphite rods for reinforcement against the assaults of temperature and humidity. The 12\"-16\" compound radius ebony fingerboard hosts 24 jumbo frets and alumiloid sharkfin inlays and is designed for highly technical light speed playing-more curved by the nut for comfortable chording, it flattens out as you move up the speedy neck for increasingly fast playing speed and wide bends without fretting out. With a commanding sound powered by brawny Seymour Duncan JB/'59 humbucking pickups, this brutally powerful instrument delivers powerful punch while retaining clarity with enhanced note definition, a critical component for modern metal. About us Adorama is one of the nation's largest photo, video and electronic retail and mail order suppliers. For over 30 years we have been serving professionals as well as amateurs in the photographic, video, digital imaging, lighting and telescope fields, as well as a vast inventory of used equipment. We offer the best combination of quality services, selection, knowledgeable staff, and competitive pricing. Customers investing in used products benefit by spending less to buy equipment and accessories. We pay top dollar for your used photo, video, audio & lighting equipment. If you are ready to upgrade your system, or you have equipment that you would like to turn into cash, send us the equipment or Bring it to our superstore to have it evaluated and we will give you an honest and fair offer. If you accept the offer, we will send you a check right away, or you can use it as a credit toward any purchase. If a deal is not made, we will return the merchandise to you, fully insured, at our expense. We buy all models of photography equipment (from old half-frames to the new digital format), lenses, and accessories. We also buy video & cinema equipment, lighting, audio, binoculars, and scopes. Nothing is too big or too small for us to handle. Remember, your used or unwanted equipment might be worth might much more than you expect! Please submit your equipment listing to us to receive a free prepaid fully insured shipping label to send in your equipment for evaluation. Equipment trade-ins can also be brought into our store. We are located at 42 West 18th Street New York, NY 10011. Policies Payments After successfully winning the auction, you can either wait for an email from Adorama or use the checkout option right there on the item page. You will be redirected to our secure order process for fast and secure checkout. PayPal is the only option offered for payment. Sales taxes will be added to all orders shipping within New York & New Jersey. Auction Info Bid & All items have a Buy with Confidence! All items have a 100% Satisfaction guarantee and 30 day return policy (money back). Orders will be processed and shipped during normal business hours. All orders over $100 will need to have the payment address verified before the item is shipped. Adorama reserves the right to cancel a transaction if payment has not been received within 3 days. Adorama reserves the right to cancel a transaction if you have \"0\" feedback. Good luck and have fun! Feedback is a powerful tool. It gives sellers a reason to conduct business at the highest level of honesty and respect. If you feel that you have reason to leave neutral or negative feedback, please contact us beforehand. I'm sure we can work it out. Returns If for any reason you are not 100% satisfied within the first 30 days after the receipt of your purchase, you may return the merchandise for exchange or a full money back refund, excluding any shipping charges. All merchandise that was received damaged from UPS / USPS beyond what was described in the item listing must be reported within 3 days of receipt of your purchase. You may return the merchandise for a full refund of the purchase price including shipping charges, or exchange at no additional cost. TVs and monitors 20\" and higher: Upon delivery, please inspect the TV and insure that it is not physically damaged and in operable condition. DO NOT SIGN the delivery manifest until you have inspected the TV. Once you sign for the item, you are signing acceptance of the product as is. If the merchandise is damaged, please make the notation on the delivery manifest, and have the person delivering the merchandise sign as a witness to the damages and contact us immediately to report the damage. Notebooks, Netbooks, Tablets, iPads and Computers Sold in NEW condition cannot be returned or exchanged once opened. Shipping info Adorama's eBay store ships to the 48 Contiguous United States including Military APO & FPO and Puerto Rico. Items with \"free shipping\" are only shipped free to the 48 contiguous United States. Combined shipping is available by using the Add-to-Cart button and making sure the shipping Carrier is the same for all items BEFORE making the Payment. eBay's new checkout will then offer you the consolidated shipping rates. All orders must be shipped with a printed invoice included. We can not ship orders without the invoice or a lower value invoice. Shipment errors due to a bad address entered by the buyer and will not be credited for shipping charges if returned or at all if lost or abandoned by the carrier. We supply tracking information directly to your eBay account within 24 hours after the shipment leaves our warehouse. Please make sure to read your email messages that you ebay account is registered at and that they do not go into spam or junk. Approved change requests may not be updated on eBay, please check the emails we send you. No store pick-ups for eBay orders. All carriers now require a phone number so please provide a phone number. Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer's responsibility. Please check with your country's customs office to determine what these additional costs will be prior to bidding/buying, These charges are normally collected by the delivering freight (shipping) company or when you pick the item up - do not confuse them for additional shipping charges. All shipping prices include handling and insurance to their destination. We DO NOT ship to China, Brazil, Vietnam, Russia, Indonesia, Malaysia, Bolivia, Afghanistan, Pakistan, Anguilla, Niue, Greece, Svalbard and Jan Mayen, Algeria, Comoros, Democratic Republic of the Congo, Ghana, Kenya, Mayotte, Nigeria, Somalia, Western Sahara. Tracking Info An automated email will be sent with tracking info. If you did not receive a tracking number, please check the email address associated with your PayPal account and any spam filters, or contact us and we will be sure to respond.", "ItemID": "332942703560", "EndTime": "2018-12-28T20:58:41.000Z", "StartTime": "2018-12-11T18:28:44.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Jackson-Pro-Series-King-V-KV-6-String-Guitar-Gloss-Deep-Black-/332942703560", "ListingType": "FixedPriceItem", "Location": "Elizabeth, New Jersey", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/3329427035608080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxMjAw/z/24UAAOSwWrxb6XTr/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/MTIwMFgxMjAw/z/Ce8AAOSwdW5b6XTt/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/MTIwMFgxMjAw/z/mC4AAOSwFu1b6XTv/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/MTIwMFgxMjAw/z/OC8AAOSw9m5b6XTx/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/MTIwMFgxMjAw/z/Fq8AAOSwyodb6XTs/$_1.JPG?set_id=2"], "PostalCode": "07206", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "adorama", "FeedbackRatingStar": "TurquoiseShooting", "FeedbackScore": 29649, "PositiveFeedbackPercent": 99.8, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 769.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 769.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "s***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 55}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "Europe", "CA", "AU"], "Site": "US", "TimeLeft": "PT0S", "Title": "Jackson Pro Series King V KV 6-String Guitar / Gloss/ Deep Black", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Jackson"]}, {"Name": "MPN", "Value": ["2914413503"]}]}, "HitCount": 200, "Subtitle": "90 DAYS WARRANTY!! 30 DAYS RETURN POLICY!!", "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=18568566", "StoreName": "Adorama"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller", "InternationalRefund": "MoneyBack", "InternationalReturnsWithin": "30 Days", "InternationalReturnsAccepted": "ReturnsAccepted", "InternationalShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["AF", "CN", "PK", "RU", "NU", "GR", "SJ", "AI", "ID", "MY", "VN", "BO", "BR", "KE"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "SKU": "US   1031782", "NewBestOffer": false}