{"BestOfferEnabled": true, "Description": "CALL OR TEXT G-BRAT’S GUITARS ANYTIME; (972)816-7736 You're looking at a 2008 Gibson Les Paul Custom 1968 Historic, with a Triburst finish on a killer flamed Maple top, and Gold hardware! If you like the way this one looks... you're going to freak when you play her! She actually plays and sounds even better than she looks! By the way; this is a real Ebony fretboard on this guitar, and not the “Richlite” that Gibson uses on newer models. No disappointments here. The action is fast and low... and the sound is awesome! She's 100% original and I just put on a fresh new set of 10-46’s, so she’s all dressed up and ready to rock! Here's the lowdown on the features:Model: Les Paul Custom 1968 FFinish: Triburst, glossTop: Carved flamed mapleBody: MahoganyBinding: Top, back, fretboard & headstockNeck: Mahogany, long tenonNeck Profile: Rounded, mediumFretboard: Ebony, 22 fretsFret Inlays: Mother-of-pearl, blocksHardware: GoldBridge: Gibson ABR-1 bridge with stop barTuners: Grover kidney, goldPickups: Gibson 57 Classic bass & treble humbuckersControls: 2 volume, 2 tone, 3-way toggleKnobs: 60's style black top-hats w gold insertsWeight: 10.3 lbs.Serial # 081978 She just celebrated her 10th birthday amd has been very well cared for. The guitar is in excellent condition, with only a tiny light pin-head sized surface impression on the top, and some pick-scratches, which can only be seen with direct reflective light. The neck is straight, with no cracks or repairs... the frets are excellent, with plenty of life ahead of them... and she sounds like a great Les Paul should! Also included is the original Gibson Historic case, the candy and certificate, just as shown in the last picture! Whoever brings this baby home is gonna be completely STOKED!! LET'S GO!! If you have any questions, please call anytime at; (972)816-7736 WHILE YOU ARE HERE, GO AHEAD AND LOOK AT MY OTHER AUCTIONS!! OUR CLIENTS ARE THE BEST IN THE WORLD!! Me- I have a 100% positive feedback rating, and intend to keep it that way! So please don't worry! You're in good hands here!! Shipping- We take pride in packing our guitars well, and shipping them quickly. Please note, if you are paying with Pay Pal, we will only ship to the address that is listed in Pay Pal. Here are the shipping rates, covering the planet earth:USA - $49 with UPSCanada, Hawaii, Alaska, Puerto Rico - $119Brazil, Argentina - $159Australia, New Zealand, Switzerland - $219 USPS Express or $249 UPSAll Other Worldwide Shipping - $219 - UPS Worldwide Expedited (in most cases); However, if UPS is more costly in certain countries, USPS will then be used instead. Payment Methods- PaY Pal is preferred!! We do also accept direct payment with Mastercard, Visa, American Express and even Discover! ~ TEXAS RESIDENTS ARE REQUIRED TO ADD 8.25% SALES TAX ~ Factory Warranty- We are an authorized dealer for: Knaggs, Ken Smith, F Bass, Trussart, Warwick, Breedlove and Warrior, so for these instruments, if listed as NEW, there is a full factory warranty. For all other brands, or if listed as USED, there is no warranty available. Return Policy- We do accept returns up to 14 days from the point of the initial sale, which means that the guitar must be back in our possession within this 14 day period. However, please be aware of the following conditions: If for any reason you wish to return the guitar, just call or email me directly, within 24 hours of your receiving the item, and let me know that you want to return it. Once we receive the guitar back, in the same condition, you will receive a refund, less a $50 restock fee. Also be aware that the initial shipping fee is not refundable under any circumstances. International Bidders- We, at G-Brat's Guitars, are HONORED to do business with anybody on the planet earth... So international buyers are VERY welcome here! That being said, please observe the following conditions: If you are paying with Pay Pal, please be completely registered with Pay Pal, prior to the purchase; this will help avoid shipment delays, and will assure that you will get your guitar as quickly as possible!International shipments usually require additional \"Customs Fees\" or \"Import Taxes\". These fees will vary, depending on the country, and are the responsibility of the buyer. If you want more information on what these fees entail, please contact your local customs office for this information. THANK YOU SO MUCH FOR LOOKING!!! _gsrx_vers_841 (GS 7.0.16 (841))", "ItemID": "362515003730", "EndTime": "2018-12-26T17:20:34.000Z", "StartTime": "2018-12-21T20:10:25.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2008-GIBSON-LES-PAUL-CUSTOM-1968-HISTORIC-FLAME-TOP-w-REAL-EBONY-BOARD-TRIBURST-/362515003730", "ListingType": "FixedPriceItem", "Location": "Midlothian, Texas", "PaymentMethods": ["PayPal", "VisaMC", "Discover", "AmEx"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/3625150037308080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/hHIAAOSwwZxcHUip/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/DLQAAOSwZbVcHUip/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/tnQAAOSwJ7RcHUir/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/FNAAAOSwIbtcHUir/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/ui8AAOSwGD1cHUis/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/8m8AAOSw6KxcHUis/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/u8QAAOSwjiZcHUit/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/MS8AAOSw4bhcHUit/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/kyYAAOSwZNtcHUiu/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/NAoAAOSwsRVcHUiu/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/z7YAAOSwOWdcHUiv/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/k~UAAOSweX5cHUiw/$_3.JPG"], "PostalCode": "76065", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "guitarbrat1", "FeedbackRatingStar": "Red", "FeedbackScore": 3672, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 3499.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 3499.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "3***7", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 83}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "2008 GIBSON LES PAUL CUSTOM 1968 HISTORIC FLAME TOP w REAL EBONY BOARD ~TRIBURST", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Model", "Value": ["LES PAUL CUSTOM 1968"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Color", "Value": ["Triburst"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Model Year", "Value": ["2008"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}]}, "HitCount": 69, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=43416548", "StoreName": "guitarbrat1"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "14 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Clean condition with some mild wear ~ See description for details", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}