{"BestOfferEnabled": false, "Description": "Dave Mustaine Signature Zero Dean Guitars Angel Of Deth II Dave Mustaine Angle Of Deth II electric guitar by Dean. The overall condition of the guitar is pretty good, it does have a few chips and scratches that are shown in the pictures, it has to good size chips in the finish that are shown. On the back of the neck is a crack that looks to only be in the finish. The neck is straight and the frets are in decent condition. 25-1/2\" Scale 1-11/16\" Nut Dave Mustaine Spec. Set \"D-Shaped\" Neck Pearl Dot Inlays Mini Grover Tuners Black Hardware Tune-O-Matic Bridge DMT Design Humbucker Pickups Finish: \"Angel of Deth II\" Graphic **** We want Positive feedback ********We want our customers 100% satisfied****We are trying to achieve FIVE STARS in all areas of customer satisfaction. We are committed to satisfaction of your purchase. If you are not satisfied with yourpurchase for any reason. PLEASE give us an opportunity to make it right before leaving feedback.Bid with confidence we have over 33,000 positive feedbacks with a 99% customer satisfaction rating and a money back guarantee Our mailing address is DESERT FUNDING 10620 N 19th AVE Phoenix, AZ 85029 Shipping - NOTE FOR INTERNATIONAL BUYERS: Before bidding please contact us to see if we can ship to you. Buyers are responsible for all Customs & brokerage fees. Please be aware that items may be held up in customs causing a delay in delivery. PAYMENTS MADE USING PAYPAL WILL BE SHIPPED TO THE PAYPAL CONFIRMED ADDRESS ONLY!!!! We WILL NOT ship to any other country without a Paypal confirmed address. The shipping method and or carrier may not be the one listed in the ad and is only a suggestion and is totally at our discretion based on cost, insurance, where the item is shipping to and safety. Buyer to pay stated price for shipping, handling & insurance in the 48 contiguous United States, for shipping to Alaska, Hawaii, Puerto Rico and Canada there will be an additional charge. Shipments made using USPS to POST OFFICE BOXES may also incur additional charges so please contact us to verify the shipping cost before payment is made. Payment - Payment is due within 7 days from close of auction. All sales in Arizona are subject to state sales tax. We accept PayPal payments ONLY. PAYMENTS MADE USING PAYPAL WILL BE SHIPPED TO THE PAYPAL CONFIRMED ADDRESS ONLY. Return Policy - If for any reason you are unhappy with your purchase please contact us about returning your item for a refund. Our office hours are Monday to Friday 9:00 am to 2:00 pm Closed on weekends. Emails will be received and answered during this time All items must be returned within 14 days in the same condition that they were sent. If your item arrives damaged please make sure that you keep all the original packing materials and contact us so that we can start a claim with the shipping company. Our return address is: DESERT FUNDING10620 N 19th AVE Phoenix Arizona 85029 Local Pick-Up - Local pick up is available on most items at our above listed address. State and local sales tax plus a $5.00 service fee per item will be charged in place of shipping. The item must be paid for at the time of pick up. Please contact us for the details. Items may be picked up Monday through Friday 9:00 AM to 5:00 PM. PLEASE KNOW YOUR AUCTION NUMBER. General - Email will be answered, and items will be shipped Monday through Friday 9:00 AM to 2:00 PM Arizona time. Powered by SixBit's eCommerce Solution", "ItemID": "323546628586", "EndTime": "2018-11-19T20:26:03.000Z", "StartTime": "2018-11-12T20:26:03.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Dave-Mustaine-Signature-Zero-Dean-Guitars-Angel-Deth-II-/323546628586", "ListingType": "Chinese", "Location": "Phoenix, Arizona", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/3235466285868080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/~bsAAOSwXbFb6aok/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/GbYAAOSwoxpb6aom/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/4LAAAOSwqkRb6aop/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/edUAAOSwuWJb6aor/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/WxAAAOSwVMJb6aou/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/PMIAAOSw-sVb6aow/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/LZkAAOSwEtRb6aoz/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/wBkAAOSwPeVb6ao2/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/7KMAAOSwEKpb6ao5/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/0SgAAOSwNUlb6ao7/$_57.JPG?set_id=880000500F"], "PostalCode": "85029", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mb$4toys", "FeedbackRatingStar": "TurquoiseShooting", "FeedbackScore": 35045, "PositiveFeedbackPercent": 99.5, "TopRatedSeller": true}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 119.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 119.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "1***a", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1592}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Dave Mustaine Signature Zero Dean Guitars Angel Of Deth II", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Dean Guitars"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["Angle Of Deth II"]}, {"Name": "Model", "Value": ["Angle Of Deth II"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}]}, "HitCount": 174, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=2565078", "StoreName": "mb$4toys"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 122.49, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}