{"BestOfferEnabled": true, "Description": "< 21st Century Music & Collectibles ITEM DESCRIPTION - PLEASE READ ALL DISCLAIMERS AND POLICIES BELOW BEFORE PLACING YOUR BID/OFFERWE HAVE DESCRIBED THIS ITEM TO THE BEST OF OUR ABILITY. BY PLACING A BID ON THIS ITEM YOU ARE ACKNOWLEDGING AND ACCEPTING OUR AUCTION TERMS AND CONDITIONS. WE OFFER WORLDWIDE SHIPPING! ***PLEASE DO NOT PAY UNTIL WE HAVE SENT YOU AN INVOICE!*** ALL OF OUR ITEMS THAT OFFER FREE SHIPPING ONLY APPLY TO THE LOWER 48 STATES, EXCLUDES: ALASKA,HAWAII, PUERTO RICO PLEASE REQUEST A SHIPPING RATE. CANADA, MEXICO AND ALL OTHER OVERSEAS BIDDERS, PLEASE NOTE OUR POSTAGE SCALE AT THE BOTTOM OF THIS AUCTION PAGE. THANK YOU! OUR SHIPPING & NOTIFICATION POLICY: WE DO NOT SHIP WITHIN 24 HOURS! EBAY REQUIRES US TO SHIP WITHIN 5 BUSINESS DAYS,EXCLUDES SATURDAY & SUNDAY. ALL ORDERS ARE GUARANTEED TO SHIP WITHIN 5 BUSINESS DAYS! . ALL DOMESTIC SHIPMENTS INCLUDE TRACKING REGARDLESS OF VALUE. DOMESTIC USPS TRACKING NUMBERS AND FOREIGN CUSTOMS NUMBERS ARE AUTOMATICALLY UPLOADED TO EBAY WHEN PARCEL IS PROCESSED. ALL ACTIVE MILITARY PERSONNEL WITH A VALID A.P.O. ADDERESS WILL RECEIVE FREE USA SHIPPING ON ALL RECORDS, CDS & DVDS. THEY DESERVE OUR SUPPORT!!! - ALL SHIPMENTS: (NO EXCEPTIONS) WHEN PAYING WITH PAYPAL, WE WILL SHIP ONLY TO THE REGISTERED PAYPAL ADDRESS! PLEASE DO NOT ASK US TO SHIP YOUR PARCEL TO AN ADDRESS OTHER THAN THE ADDRESS REGISTERED WITH PAYPAL. PLEASE ADD ANY NEW ADDRESS TO YOUR PAYPAL ACCOUNT AND REQUEST A NEW INVOICE. WE WILL GLADLY COMBINE SHIPMENTS. WE DO NOT COMBINE SHIPMENTS ONCE A PAYPAL PAYMENT HAS BEEN MADE. PLEASE WAIT UNTIL YOU HAVE FINISHED BIDDING BEFORE PAYING WITH PAYPAL. ALL PURCHASES MUST APPEAR ON THE SAME PAYPAL INVOICE IN ORDER TO SHIP TOGETHER. - ALL PAYPAL PENDING AND ECHECK PAYMENTS ARE HELD FOR 7 DAYS REGARDLESS OF WHEN THEY CLEAR. - ALL RECORDS AND COMPACT DISCS ARE CAREFULLY & VISUALLY INSPECTED, WE DO NOT PLAY GRADE THE OVER 9,000 RECORDS AND CDS WE SHIP OUT EACH YEAR. *SORRY NO SOUND CLIPS - OVERSEAS BIDDERS: (NO EXCEPTIONS) DUE TO THE HIGH VOLUME OF CUSTOMS THEFT AND LOSS WE HIGHLY RECOMMEND THAT YOU HAVE YOUR VALUABLE ITEMS SHIPPED VIA PRIORITY MAIL INTERNATIONAL OR VIA REGISTERED MAIL WITH A TRACKING NUMBER FOR SAFETY. - USA POST OFFICE REQUIRES THAT ALL OVERSEAS SHIPMENTS (INCLUDING CANADA AND MEXICO) WITH A WEIGHT OF 4 POUNDS OR MORE INCLUDING PACKING MATERIAL) MUST SHIP VIA USPS PRIORITY AIRMAIL INTERNATIONAL WITH A TRACKING NUMBER. THE U.S. POST OFFICE NO LONGER OFFERS OVERSEAS ECONOMY/SURFACE MAIL. ALL OVERSEAS SHIPMENTS (INCLUDING CANADA AND MEXICO) VALUED AT $75.00 OR MORE MUST SHIP VIA USPS PRIORITY MAIL INTERNATIONAL WITH TRACKING, NO EXCEPTIONS! - ALL 7\" RECORDS & COMPACT DISCS SHIPPED OVERSEAS, VALUED OVER $50.00 TOTAL MUST BE SHIPPED VIA USPS PRIORITY AIRMAIL SMALL PACKET WITH TRACKING NUMBER AT A COST OF $35.00 AIRMAIL POSTAGE, NO EXCEPTIONS! - EBAY'S UPS CALCULATED SHIPPING SCALE FOR DOMESTIC SHIPMENTS IS ESTIMATED BY WEIGHT AND DISTANCE ONLY. THE PRICE FOR DOMESTIC SHIPMENTS MAY DIFFER DUE TO THE SIZE OF THE PARCEL FROM EBAY'S ESTIMATE AT TIME OF INVOICE ON LARGE OVER SIZED SHIPMENTS. PLEASE WAIT FOR OUR INVOICE BEFORE PAYING WITH PAYPAL. WE FEEL FEEDBACK IS VERY IMPORTANT FOR BOTH THE SELLER AND THE BUYER. DUE TO THE HIGH VOLUME OF LISTINGS WE SOMETIMES ARE UNABLE TO GIVE FEEDBACK RIGHT AWAY. PLEASE SEND US A LINK TO YOUR WINNING ITEM WITH A FEEDBACK REQUEST AND WITHIN 24 HOURS WE WILL GLADLY LEAVE POSITIVE FEEDBACK. THANK YOU! ABOUT 21ST CENTURY MUSIC & COLLECTIBLES 21st Century Music & Collectibles, located in Northern New Jersey, specializes in high end collectibles such as records, cds, dvds, comic books, sports cards, old toys, old magazines, post cards, action figures, stamps, coins, Barbie dolls, movie posters, matchbox/hot wheels, sci-fi/horror, political items, pulps, autographs, paperbacks, trains and many other pop-culture collectibles. We travel for large collections. We have paid over $300,000 last year for the above listed material. Finders' fees available. Contact us at e-bay with any questions regarding material you have for sale. Good luck bidding!!!! To VeRO members or other copyright owners: we only list authorized items, and many of our auctions are VeRO pre- approved! We do our very best to list only authorized items, and we do support the VeRO program. If you believe this is not an authorized item, please email us and we will gladly remove the item. Thanks. \"the first sale doctrine\" ruling of 1908 and 2008 states that the sale of promotional media such as books, cds, records, dvds, does not infringe copyright laws. Record/CD note: Sale of this item is specifically allowed under the copyright laws of the United States {17 USC 109 (a)} which states that \"the owner of a particular copy or phonorecord lawfully made...is entitled, without the authority of the copyright owner, to sell or otherwise dispose of possession of the copy or phonorecord and other media related material\". 21st Century Music does not sell bootlegs, CD-Rs, fakes/copies! Some CDs may have a \"cut-out\" mark, bar code or promotional hold punch on the case or booklet. If you have any questions or suggestions regarding the auction or about our store, please do not hesitate to contact us at our toll free number. We look forward to hearing from you. - Sincerely, John M. Jabra President NEW JERSEY RESIDENTS MUST ADD 6.875% SALES TAX ON THE TOTAL PURCHASE INCLUDING SHIPPING & HANDLING. LOCAL PICKUP IS ACCEPTED. SHIPPING AND HANDLING United States * Once shipped, please wait up to 14 business days for Media Mail packages to arrive. ONE CD $3.00 (+$1.00 per disc) ONE DVD $4.00 (+$1.00 per disc) ONE 12\" Album/LaserDisc Priority Mail $8.00 (+$2.00 per disc) Media Mail $4.00 (+$1.00 per disc) ONE 7\" 45rpm Record $2.99 (+$0.50 per disc) ONE Postcard $2.00 ONE Comic Book $4.50 (+$0.50 per book via media mail) Canada/Mexico ONE CD $16.00(+$1.00 per disc) ONE DVD $16.00(+$1.50 per disc) ONE 12\" Album/LaserDisc $18.00 (+$2.00 per disc) ONE 7\" 45rpm Record $10.00(+$1.00 per disc) ONE Postcard $2.50 ONE Comic Book $7.50 (+$1.00 per book) Foreign ONE CD $14.00(+$3.00 per disc) ONE DVD $18.00 (+$3.00 per disc) ONE 12\" Album/LaserDisc $22.00 (+$4.00 per disc up to four lbs.) ONE 7\" 45rpm Record $15.00(+$2.00 per disc) ONE Postcard $6.00 (RIGID MAILER USED) ONE Comic Book $16.00 (+$2.00 per book) &nbs Powered by eBay Turbo Lister The free listing tool. List your items fast and easy and manage your active items.", "ItemID": "382685020292", "EndTime": "2018-12-21T18:21:16.000Z", "StartTime": "2018-12-20T21:40:34.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Circa-1970s-Left-Handed-Gibson-ES-335TD-6-String-Electric-Guitar-/382685020292", "ListingType": "FixedPriceItem", "Location": "Bogota, New Jersey", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/3826850202928080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/iv4AAOSwdxVcEr98/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/jjUAAOSwNepcEr9i/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/nlMAAOSwujJcErkY/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/epIAAOSwCVtcErkM/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/82QAAOSwsPNcErkB/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/m28AAOSwDlRcErkG/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/z2kAAOSwOVlcErkJ/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/YO8AAOSws99cErkb/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/84QAAOSwsPNcErkg/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/38kAAOSwzqtcErkj/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/CfgAAOSw-rxcErj9/$_1.JPG?set_id=8800005007"], "PostalCode": "07603", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "21stcenturymusic", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 22348, "PositiveFeedbackPercent": 99.9, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 2999.98, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2999.98, "CurrencyID": "USD"}, "HighBidder": {"UserID": "w***1", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 3938}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Circa 1970s Left Handed Gibson ES-335TD 6-String Electric Guitar", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Product Line", "Value": ["Gibson Les Paul"]}, {"Name": "Body Color", "Value": ["Red"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Les Paul Studio"]}, {"Name": "Model Year", "Value": ["1963"]}, {"Name": "Right-/ Left-Handed", "Value": ["Left-Handed"]}, {"Name": "Exact Year", "Value": ["197?"]}, {"Name": "Dexterity", "Value": ["Left-Handed"]}]}, "HitCount": 45, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=141493169", "StoreName": "COLLECTIBLES TOYS RECORDS AND MORE"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalRefund": "MoneyBack", "InternationalReturnsWithin": "30 Days", "InternationalReturnsAccepted": "ReturnsAccepted", "InternationalShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 5, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "Africa", "BH", "IQ", "JO", "KW", "LB", "OM", "QA", "SA", "TR", "AE", "YE"], "GlobalShipping": false, "ConditionDescription": "Serial # 614718.  There are no cracks or damage.  One nick on side, One gouge on back of neck as seen in photos.  A few light scratches.  Strings have been loosened and one string has been removed. **** serial number dates this guitar as being manufactured during the year 1963, but gibson recycled serial numbers which may date this guitar as late as 1971. This is in used condition.  Sold as is as pictured.  Review all photos.  No returns.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}