{"BestOfferEnabled": false, "Description": "MIJ, made in japan, Gibson, Lespaul, White, SG, Höfner, Duesenberg, Ibanez, ATELIER Z, ARIA, ESP, Caparison, Killer, COMBAT GUITARS, GUYATONE, Greco, Sugi Guitars, TEISCO, DEVISERA, Nil, Bacchus, VANZANDT, Fernandes, Fender Japan, Fujigen, MOON GUITARS, momose, Yairi Guitar, YAMAHA, TOKAI, Zemaitis, VOX, B, C, Rich, Epiphone, Gibson, Gretsch, Suhr, Schecter, Charvel, Jackson, Dean, Tom Anderson, Fender, Paul Reed Smith, Melancon, Mosrite, Rickenbacker, Robert Benedetto, Washburn, Ibanez, kramer, EDWARDS, Burny, Grassroots, 2008 Burny FERNANDES RLC-80S/WH 2 MODE SUSTAINER ~ All Original ~Excellent ConditionMade in China Down from here. Photo is dent and scratches, etc.. About scratches that are hard to see. To make it easy to understand the condition of the scratches, I lighted the light strongly. 2008 Burny FERNANDES RLC-80S/WH 2 MODE SUSTAINER ~ All Original ~Excellent ConditionMade in China Body Top : Maple. Back : Mahogany. Neck Mahogany. Frets 22 Frets. Scale 24.75inch (628mm) Gibson Medium Scale. Nut Width About 1.69 inch ( 43mm ). Pickup HPD-300, FVH-2002 Sustainer. Control 1Volume, 1Tone, 3Way Toggle-SW, with Sustainer Controls. Bridge FRT-11. Color White. Weight About 9.24 Pound ( 4.19 Kg ). This is Used Guitar. The Whammy bar is not original. There is trace where one sticker peeled off on the top of the body. The painting has been partially discolored from white to cream color. There is graffities on the hard case, it has deteriorated. I was shooting a lot of photos. Please confirm with a photograph. The Batterie not included, because export is prohibited. Please purchase and set up the batterie. PRE-LOVED. Long time, Maybe has not been used. Maybe was sleep in warehouse. I have an impression that this guitar is not used much. The evidence is the amount of Frets remaining. Frets are Many remain. However, Although it is an old guitar, I think that the scratch is little on the body. It keeps Excellent condition. It was manufactured in 2008. Mr Zakk Wylde and Mr Steve Vai use Sustainer. Many other famous guitar players are using sustainer. SUSTAINER is very interesting!! 100% perfect working with 2 mode sustainer system. The sound continues to sustain until the remaining battery level becomes zero. For more information on sustainer, please refer to Fernandes's website. And equipped with \" Floydrose Licensed FRT-11 \" to bridge. Sound variation is Wealthy ! When I get this guitar all the time, I go crazy and play. Burny RLC equipped with FRT - 11, I can say that it is a Rare model. It is made in china, but very popular in japan. About guitar play, Current state, the space between the strings and the frets is standard. And, remaining amount of the Frets are many. Overall averaging, the remaining amount is about 95%. Thanks to that, I feel very easy to play the guitar. The Pickups gives very good distortion sound and clean sound. Burny is GREAT !! In 2018, it will be over in a little while. I want to enjoy an auction. Therefore I will start this auction from $10. Everyone please enjoy !! (^.^)/ And HAPPY NEW YEAR 2019 !! It is cleanliness. I polished with guitar exclusive polish, so it is in a very clean state. I after the finger board cleaning, painted beeswax. The aim is moisturizing and and protection. Current neck condition, very good ! roughly straight ! There is no problem with the Truss rod and it can be adjusted. Remaining Frets are 95% ! You can play immediately after it is delivered to you. I was set new strings. Regular tuning. ( Inch : 009, 011, 016, 024, 032, 042 ) Guitar playing, is comfortable. All is working well. It is in a very good condition. The Truss rod Wrench is not included. All Original.Note : The Whammy bar is not original. The Hard Case Included. Note : Key was lost. Look at the photos, please verify by yourself! It will be professionally pack. Double air packing. And ships inside a sturdy cardboard box. This electric guitar is USED. Please consider it when bidding. Thank you. Payment I accept PayPal only. Please pay within 3 days after the auction closed. Shipping Worldwide shipping from Japan! EMS / Shipping includes a tracking number. / / / Destination cost Delivery time / / / Asia : $1204 ~ 7daysUS Canada : $1405 ~ 8 daysEurope : $1606 ~ 10 daysOceania : $1405 ~ 8 daysSouth America : $2608 ~ 12 days This item is shipped within 3 business days after payment is confirmed. Terms of Sale International buyers - Please Note: Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer's responsibility. Please check with your country's customs office to determine what these additional costs will be prior to bidding/buying. These charges are normally collected by the delivering freight (shipping) company or when you pick the item up -do not confuse them for additional shipping charges. Please contact us first with 30 working days for any returns, Buyer pays shipping cost from buyer's country to Japan when being returned. In case of return, the shipping cost won't be refunded. We sell various kinds of Japanese products to international customers. Our goal is to provide the best quality products and service and your satisfaction is the most important to us. Happy bidding!! Thank you !!", "ItemID": "254040121591", "EndTime": "2019-01-05T05:00:36.000Z", "StartTime": "2018-12-26T05:00:36.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2008-Burny-FERNANDES-RLC-80S-WH-2-MODE-SUSTAINER-All-Original-Excellent-/254040121591", "ListingType": "Chinese", "Location": "Nagoya-shi,Kita-ku, Aichi", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2540401215918080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/12oAAOSwnKFcIvMw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/HqAAAOSwEphcIvMq/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE2MlgxNjAw/z/IXoAAOSwIbtcIvM7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/kmsAAOSwvwRcIvNJ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/XXsAAOSwsftcIvNa/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/RuUAAOSwisxcIvNl/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/Kk8AAOSwI9FcIvNq/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE4NlgxNjAw/z/d6MAAOSwXGRcIvNx/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNTk5/z/qzsAAOSws2RcIvN5/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/mFcAAOSwjNdcIvOE/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/GCsAAOSwC85cIvOL/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/7s8AAOSwAFFcIvOb/$_57.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jguitar-shop", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 369, "PositiveFeedbackPercent": 100.0}, "BidCount": 54, "ConvertedCurrentPrice": {"Value": 825.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 825.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "3***l", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 5}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Americas", "Europe", "Asia", "AU"], "Site": "US", "TimeLeft": "PT0S", "Title": "2008 Burny FERNANDES RLC-80S/WH. 2 MODE SUSTAINER. All Original. Excellent.", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Burny Fernandes"]}, {"Name": "Model Year", "Value": ["2008"]}, {"Name": "Model", "Value": ["RLC-80S/WH"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Bundle Description", "Value": ["The Hard Case included."]}, {"Name": "Country/Region of Manufacture", "Value": ["China"]}, {"Name": "Body Color", "Value": ["White"]}, {"Name": "Custom Bundle", "Value": ["Yes"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Series", "Value": ["Original"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["FG08121270"]}]}, "HitCount": 1378, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "JP", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 835.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["APO/FPO", "Africa"], "GlobalShipping": false, "ConditionDescription": "Excellent Condition. This is Used Electric Guitar. The electric guitar when connect to the amplifier, sound output is normal. There are scratches and Dent. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. Please Read the descriptions for details.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}