{"BestOfferEnabled": false, "Description": "MIJ, made in japan, Gibson, Lespaul, White, SG, Höfner, Duesenberg, Ibanez, ATELIER Z, ARIA, ESP, Caparison, Killer, COMBAT GUITARS, GUYATONE, Greco, Sugi Guitars, TEISCO, DEVISERA, Nil, Bacchus, VANZANDT, Fernandes, Fender Japan, Fujigen, MOON GUITARS, momose, Yairi Guitar, YAMAHA, TOKAI, Zemaitis, VOX, B, C, Rich, Epiphone, Gibson, Gretsch, Suhr, Schecter, Charvel, Jackson, Dean, Tom Anderson, Fender, Paul Reed Smith, Melancon, Mosrite, Rickenbacker, Robert Benedetto, Washburn, Ibanez, kramer, EDWARDS, Burny, Grassroots, 1978 Greco EG450B Les Paul Standard type ~ All Original ~ Very Good++ condition.Made in Japan Down from here, Photo is dent and scratches etc.. About scratches that are hard to see. To make it easy to understand the condition of the scratches, I lighted the light strongly. 1978 Greco EG450B Les Paul Standard type ~ All Original ~ Very Good++ condition.Made in Japan Body Birch top, Mahogany back. Semi Hollow body. Neck Maple. Frets 22F. Scale 24.75inch (628mm) Gibson Medium Scale. Nut Width About 1.69 inch (43mm). Pickup Greco UD Pickups. Control 2 Volume, 2 Tone, 3-Way PU Toggle switch. Bridge Tune O Machic. Stop Tailpiece. Machine Heads Greco MH810. Color Black. Weight About 7.63 Pound ( 3.46 Kg ). This is Used Guitar. Tha shafts of machine heads 4th and 3th are slightly bent. _However, it can do normal tuning, and there is no problem. There are scratches and dents. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. It was manufactured in 1978 about 40 years ago. Although it is an very old guitar, I think that the scratches and dents are little. This guitar is Semi-hollow body. State of remove the plug, sound is loud. Old japanese guitar used good wood. It is made very polite. The EG450B has the dignity of vintage guitar. This Greco EG450B is All Original state. Of course, All made in Japan. Greco is Great. \" The High quality guitars at a Low price \". It is brand concept of Greco at the time. And current... It has became high price. 1980, Gibson filed a lawsuit. The cause is copyright issues. And more than anything, Greco's high degree of perfection. Perhaps Gibson had a feeling of crisis. I think this Greco is very good !! About guitar play, Current state, the space between the strings and the frets is standard. The accuracy of the product is high. Therefore Un pluged sound is very powerful. You can feel vibrations transmitted to the body. This EG450B is equipped with Greco original UD pickup. I am always impress about Greco's pickup. There are many Greco's pickup collectors in Japan. I can understand the feelings to collect of the Greco's pickup collectors. It is difficult to convey sounds in text. I like this UD pickups. I feel the very good distortion sound. I recommend for Heavy Metal music or Hard Rock music !! Of course, Clean sound is very well. Old Greco is Great !! It is cleanliness. I polished with guitar exclusive polish, so it is in a very clean state. I after the finger board cleaning, painted beeswax. The aim is moisturizing and and protection. Current neck condition, very good ! roughly straight ! There is no problem with the Truss rod and it can be adjusted. Remaining the frets are 75% on average. You can play immediately after it is delivered to you. I did regular tuning to it. ( Inch : 009, 011, 016, 024, 032, 042 ) All is working well. It is in a very good condition. The Truss rod Wrench is not included. All Original.Note : The Lock nut and the Whammy bar are not original. Look at the photos, please verify by yourself! It will be professionally pack. Double air packing. And ships inside a sturdy cardboard box. This electric guitar is USED. Please consider it when bidding. Thank you. Payment I accept PayPal only. Please pay within 3 days after the auction closed. Shipping Worldwide shipping from Japan! EMS / Shipping includes a tracking number. / / / Destination cost Delivery time / / / Asia : $1004 ~ 7daysUS Canada : $1205 ~ 8 daysEurope : $1406 ~ 10 daysOceania : $1205 ~ 8 daysSouth America : $2408 ~ 12 days This item is shipped within 3 business days after payment is confirmed. Terms of Sale International buyers - Please Note: Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer's responsibility. Please check with your country's customs office to determine what these additional costs will be prior to bidding/buying. These charges are normally collected by the delivering freight (shipping) company or when you pick the item up -do not confuse them for additional shipping charges. Please contact us first with 30 working days for any returns, Buyer pays shipping cost from buyer's country to Japan when being returned. In case of return, the shipping cost won't be refunded. We sell various kinds of Electric guitars to international customers. Our goal is to provide the best quality products and service and your satisfaction is the most important to us. Happy bidding!! Thank you !!", "ItemID": "254033007956", "EndTime": "2018-12-25T05:03:45.000Z", "StartTime": "2018-12-20T05:03:45.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1978-Greco-EG450B-Les-Paul-Standard-type-All-Original-Made-Japan-/254033007956", "ListingType": "Chinese", "Location": "Nagoya-shi,Kita-ku, Aichi", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2540330079568080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/NJQAAOSwNUlcGvik/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTMwM1gxNjAw/z/5jYAAOSwHGJcGvip/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU5OVgxNjAw/z/ILQAAOSwvNVcGvi0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/UjgAAOSwwSJcGvi5/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/lGYAAOSwUMBcGvjD/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/7sMAAOSwaPpcGvjL/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/egMAAOSw2~NcGvjR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/mCEAAOSwAopcGvjW/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE2MVgxNjAw/z/ho4AAOSwSs1cGvjb/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE0M1gxNjAw/z/yJ4AAOSwM5tcGvji/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg2MDM=/z/3M0AAOSwzgtcGvjl/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/SyUAAOSwzwVcGvjy/$_57.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jguitar-shop", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 369, "PositiveFeedbackPercent": 100.0}, "BidCount": 2, "ConvertedCurrentPrice": {"Value": 355.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 355.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "k***5", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 181}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Americas", "Europe", "Asia", "AU"], "Site": "US", "TimeLeft": "PT0S", "Title": "1978 Greco EG450B. Les Paul Standard type. All Original. Made in Japan.", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Greco"]}, {"Name": "Model Year", "Value": ["1978"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["EG450B"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Exact Year", "Value": ["1978"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Series", "Value": ["Original"]}, {"Name": "Body Type", "Value": ["Semi-Hollow"]}, {"Name": "MPN", "Value": ["J787336"]}, {"Name": "Body Color", "Value": ["Black"]}]}, "HitCount": 520, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "JP", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 360.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["APO/FPO", "Africa"], "GlobalShipping": false, "ConditionDescription": "Very Good++ Condition. This is Used Electric Guitar. The electric guitar when connect to the amplifier, sound output is normal. There are scratches and Dents. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. Please Read the descriptions for details.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}