{"BestOfferEnabled": false, "Description": "Up for bids here is my Zakk Wilde Bullseye Les Paul Custom Electric Guitar w/ EMG Active Humbuckers mounted in the twilight zone swirling stripe body. Action is very nice as seen in pics, the C shaped neck has sweet satin finish on the back with nice rosewood fingerboard. Check out the inlays on this amazing neck, which I tried to show in the pics. And the Zakk decal completes the backside of the signature head stock which is adorned with 6 authentic gold Grover tuners. Guitar is very complete and functional, with all switch positions and pots working fine. I have been playing it for about 3 years and it does everything I need it to do for all my Rock songs, and of course can handle all ‘Da Metal you can eat!! Plays great clean or distorted and easy to hit those killer Zakk Wilde harmonics, I would love to keep this guitar since it plays so great with those EMG’s humming, but this thing is heavy as a forging anvil… seriously, it probably weighs 10-11 lbs. , and I have 5 other guitars right now and have been playing my Hohner LP59 til I get my 50’s Tribute LP out of the pawn shop. Neck is straight, all tuners work, intonation is set pretty good, action is workable could be adjusted down a bit, gold hardware in tact and is nice touch and ooh those EMG pickups are like Butta Jerry!! Of special note about the neck of this guitar, it looks like an older made in china version which has a 4 piece neck design, where the headstock and heel are bonded there is a seam, check the pics for where I showed it in the close-up of the lower rear headstock directly adjacent to the orig QC sticker which is a glue seam from when the neck is assembled and is another piece with seam at the heel of the neck, one drawback of the Epi makers of the day So I am ready to pass this guitar on to a pro that can play it the way it deserves to be played and manage the 9V DC battery duties. Remember, don’t leave this guitar plugged into the amp chord, or it will drain the battery for the active pickups. I am selling guitar “as is” ready to plug and play in a “no reserve” low opening bid auction, with a decent “Buy It Now” price so anyone has the chance to snag this amazing Metal Gods Axe!! Here is a great review of the guitar from ebay: Bring out the Randy Rhodes in you with the signature Epiphone Zakk Wylde Bullseye guitar. The hard maple neck with a smooth satin finish allows you to play this Epiphone Les Paul guitar smoothly and quickly. The neck of the Epiphone electric guitar is attached to the body using a TiteBond adhesive which provides a firm and hard feel. The Epiphone's LockTone - tune-o-matic bridge / stopbar tail piece combination and the Zakk Wylde Bullseye is great for effortless string and tone adjustment. With a 9-Volt battery power, this Active EMG equipped Epiphone electric guitar delivers high-output rock music tone. The all-round Epiphone Les Paul guitar produces classic rock, metal, and bluesy tones based on your varied moods. I will answer any questions to the best of my ability. Please ask all of your questions before bidding, all sales final. Guitar will come packed in a nice sturdy cardboard box filled with packing, and wrapped up snuggly in a brand new Allen Eden Gator guitar case. I offer no returns and usually ship via UPS Ground or USPS (more affordable to non-urban buyers) to anywhere in the United States. These are my default shipping choices, although winning bidder has right to select other methods at their own risk, I will gladly pay for tracking, insurance and shipping confirmation. Winning bidder is expected to make payment within 5 days, your bid is a binding commitment to purchase and pay in a timely manner. Good Luck bidding and check out my other auctions for more cool collectibles and electronics. 8^)=", "ItemID": "143077370552", "EndTime": "2019-01-03T05:30:32.000Z", "StartTime": "2019-01-03T03:02:22.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Epiphone-Zakk-Wylde-Les-Paul-Custom-Bullseye-Electric-Guitar-EMG-Acitve-Pickups-/143077370552", "ListingType": "Chinese", "Location": "Austin, Texas", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1430773705528080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/vyEAAOSw5bxcLXnw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/E4UAAOSwa1ZcLXla/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/ycwAAOSwdHpcLXli/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/yRIAAOSwn6JcLXlo/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/N0gAAOSwWz5cLXlw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/JuEAAOSwa3lcLXl4/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/E2AAAOSwzwVcLXmo/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/IzwAAOSwlelcLXmP/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/Q7UAAOSwN3NcLXma/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/D2UAAOSwxDJcLXm2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/QDcAAOSwZupcLXmA/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/AA8AAOSw5r1cLXnF/$_57.JPG?set_id=8800005007"], "PostalCode": "78727", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mopar_muscleman", "FeedbackRatingStar": "Purple", "FeedbackScore": 932, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 455.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 455.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "n***n", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 19}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Epiphone Zakk Wylde Les Paul Custom Bullseye Electric Guitar EMG Acitve Pickups", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Yellow"]}, {"Name": "Features", "Value": ["Single Cut"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Custom"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Soundboard Style", "Value": ["Archtop"]}, {"Name": "Size", "Value": ["Full Size"]}, {"Name": "Product Line", "Value": ["Zakk Wylde Bullseye"]}]}, "HitCount": 28, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 460.0, "CurrencyID": "USD"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "ConditionDescription": "Very clean and well cared for Les Paul Custom made by Epiphone with the Wizard of Ozzy Land Zakk Wylde carrying the signature status on this bad-ass axe!  Gold Hardware, Grover Tuners, and those yummy EMG's... rock on Beto!!", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}