{"BestOfferEnabled": false, "Description": "Steve Vai autographed it at the evo experience tour✌️ Built to the highest standards, Ibanez's UV71P Steve Vai Premium Signature solidbody electric guitar delivers total 7-string playability with tone like no other instrument. For starters, you get the awesome playability of a 5-piece maple/walnut Premium Wizard-7 neck, easily one of Ibanez's fastest neck designs ever. A trio of DiMarzio Blaze pickups up the ante with epic bass, clearly articulated highs, and gently scooped mids, giving your UV71P a pre-EQ'ed hi-fi tone. Wrap it up with a performance driven Edge Zero II-7 tremolo bridge, and you're in business! Don't settle for compromises; get your Ibanez UV71P guitar from Sweetwater! Ibanez UV71P Steve Vai Premium Signature Solidbody Electric Guitar at a Glance: DiMarzio Blaze pickups dish out hard-hitting rock tone Your fingers will fly down this Premium Wizard-7 neck Edge Zero II-7 tremolo bridge gives you solid performance and stability DiMarzio Blaze pickups dish out hard-hitting rock tone When DiMarzio's Blaze pickups came onto the scene in the dawning days of the 1990s, the sound of virtuoso rock changed forever. This Ibanez UV71P gives you that same groundbreaking sound in all its classic glory. The bass response is absolutely fantastic, giving your low B thunderous overtones. At the same time, the UV71P delivers sparklingly clear highs that cut nicely when distorted and shine when clean. And with a pronounced midrange scoop, this trio of DiMarzio Blaze pickups deliver the front-and-center hi-fi sound any lead guitarist can get into. Your fingers will fly down this Premium Wizard-7 neck One of Ibanez's fastest necks to date, the 5-piece maple/walnut Premium Wizard-7 neck on the UV71P is an absolute pleasure to play. This slim and super-comfortable neck lets you pull off lighting-fast runs and arpeggios with ease, but still gives you the substance you need for fretting chords when you need to. And feel free to crank on this neck, it's reinforced with KTS titanium reinforcement rods for absolutely unstoppable stability. The rosewood fretboard sports jumbo frets and the classic Disappearing Pyramid inlays. From the first time you put your hands on the UV71P's Premium Wizard-7 neck, you'll know that you have a guitar that was built with a real guitar legend in mind. Edge Zero II-7 tremolo bridge gives you solid performance and stability The UV71P's Edge Zero II-7 bridge was designed by Ibanez to give you the fast tremolo response and snap you need to pull off sharp bends and flutters. The extreme stability of this knife-edge-style trem's stud lock function is also one of the many reasons it's a favorite among many of today's top shredders. If you're looking for a guitar that can stand up to long playing sessions without losing its tuning, you're going to love the Ibanez UV71P Steve Via Universe 7-string! Ibanez UV71P Steve Vai Premium Signature Solidbody Electric Guitar Features at a Glance: A hot rod 7-string solidbody electric guitar built to deliver unbeatable playability and tone Lightweight basswood body feels great on your shoulder and adds resonance to your sound KTS titanium reinforced Premium Wizard-7 5-piece maple/walnut neck provides awesome speed and stability Rosewood fretboard sports jumbo frets with premium fret edge treatment and classic Disappearing Pyramid inlays Trio of DiMarzio Blaze pickups give you punchy lows, ultra-clear highs, and scooped mids for a killer pre-EQ'ed sound Edge Zero II-7 bridge with Zero Point System provides access to dive-bomb drops, flutters, and other extreme trem techniques Locking nut ensures that you won't go out of tune Hardshell case included", "ItemID": "232984903374", "EndTime": "2018-11-05T16:08:54.000Z", "StartTime": "2018-10-29T16:08:54.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Ibanez-UV71P-White-Autographed-Universe-Great-Condition-original-case-/232984903374", "ListingType": "Chinese", "Location": "Portland, Oregon", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2329849033748080_2.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/r2YAAOSwmLZbzfXl/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMTk0/z/ZsAAAOSwHgRbzfXu/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjAwWDYwMA==/z/PZcAAOSwrFZbzfXr/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMTk0/z/-LYAAOSwxPNbzfXy/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMTk0/z/qb4AAOSwqCJbzfXw/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMTk0/z/XXIAAOSwe2xbzfXn/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MzU5WDY0MA==/z/ZqoAAOSwHgRbzfXh/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDk2MA==/z/pY4AAOSwXi9bzfXi/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg4OTg=/z/koMAAOSw40hbzfXp/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTEzOVg2NDA=/z/SY0AAOSwRhFbzfXv/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTEzOVg2NDA=/z/iFUAAOSw0RlbzfXs/$_12.JPG?set_id=880000500F"], "PostalCode": "97222", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "rexxrider90", "FeedbackRatingStar": "Yellow", "FeedbackScore": 31, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 1000.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1000.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "e***c", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 71}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Ibanez UV71P White Autographed Universe in Great Condition with original case.", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Ibanez"]}, {"Name": "String Configuration", "Value": ["7 String"]}, {"Name": "Model", "Value": ["UV71P"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["White"]}]}, "HitCount": 101, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 1025.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}