{"BestOfferEnabled": true, "Description": "lightly used jtv-59, the gibson model. everything in fine working order. frets have no wear, fretboard shows no wear. Included are battery and charger and VDI (variax digital interface) cable to connect to pod; usb connector. manual and nice padded gig bag with pockets. Line 6 JTV-59 Single Cut Electric Guitar (Gloss Black) James Tyler Variax is the only guitar in the world that can sound like an entire collection of vintage instruments. No more dragging multiple guitars to recording sessions. Thanks to Variax HD technology, each instrument inside the JTV-59 guitar offers exceptional sonic detail plus organic feel and response—allowing you to capture a wide range of classic tones in pristine sound quality. JTV-59 also eliminates many common recording challenges: Stay in the creative flow instead of finding, tuning and acclimating to the feel of a new instrument. Track acoustic guitars with ease. Switch between alternate tunings on the fly. Banish pickup noise from your recordings forever. Find inspiration in the collection of eclectic instruments. It's the guitar you've always wanted in the studio. Create Custom Instruments with Variax Workbench HDVariax Workbench HD is your own personal guitar custom shop—with a twist. The software takes you far beyond what’s possible in the physical realm so you can build virtually any guitar imaginable. Using the powerful and easy-to-use interface, you can mix and match a wide variety of instrument body and pickup models to create unique guitar tones or celebrated classics. You can also set up your guitars with Open G, DADGAD, Drop D or any other custom tuning. Record with Amazing HD Acoustics and EclecticsWith instant access to the world’s greatest acoustic and exotic instruments, JTV-59 ensures you’ll always get a great acoustic guitar sound in the studio. Each HD model delivers the tone of a professionally miked instrument in breathtaking depth and detail, capturing the subtle nuances of string vibration through the soundboard and the tonewoods of the original guitar body. It’s never been easier to record pristine acoustic takes—without setting up mics, preamps and EQ, or worrying about a barking dog or nearby lawnmower. HD Electric GuitarsWhen it comes to electrics, we’ve included a broad collection of the world’s most revered vintage and modern guitars—taking you from classic rock sounds to blues, country, metal and more. Featuring meticulous HD models based on historic Strat, Les Paul and Rickenbacker guitars, among others, your James Tyler Variax provides instant access to the guitar tones favored by the world’s most famous players. Whether you’re recording or performing, JTV-59 gives you an amazing breadth of guitar sounds for all styles of music. Access Alternate Tunings—InstantlyImagine switching instantly between Open G, DADGAD and Standard tunings without interrupting your recording session. JTV-59 provides immediate access to 11 alternate tunings, so you can stay in the creative moment instead of spending quality time with your tuner. You can mix and match any tuning with any instrument—and also create your own tunings on the fly with Virtual Capo. It’s easy to save your custom tunings, either to the open Model slot on the Alt Tune knob, or to one of the other alternate tuning slots. Record Without HumHum, crackle and other noises can easily ruin a perfectly good take. While all guitars—especially single-coil models—are susceptible to this problem, vintage instruments are particularly notorious. With JTV-59 you can enjoy these classic guitars without the distraction of noisy electronics. Thanks to Variax HD technology, every instrument in JTV-59 is free of hum—so you can enjoy great-sounding, consistent tone when the record light is on. Legendary CraftsmanshipDesigned by master luthier James Tyler, JTV-59 is a supreme player’s instrument. The innovative design features a mahogany body with a carved maple top, and a 22-fret mahogany set neck with a rosewood fingerboard. The two alnico humbucking pickups are wound to James Tyler's specs along the lines of classic PAFs, but with a little extra punch in the bridge position. From the body and neck to pickups and electronics, each James Tyler Variax guitar is built to exacting specifications—ensuring exceptional playability. Precision ComponentsJames Tyler has made a career of understanding what makes vintage instruments so phenomenally playable, and applied this expertise to the James Tyler Variax guitar series. Knowing that the components of a guitar have an impact on feel and durability as well as tone, Tyler chose only the best neck, pickups, bridge, nut and tuners for JTV-59. Thanks to these premium components, JTV-59 sounds and feels as good as it looks. The Dream RigIndividually, the JTV-59 guitar, DT25 or DT50 amplifier and POD HD500 multi-effect processor are powerful sonic tools. Collectively, they form the ultimate integrated Dream Rig—and provide limitless sonic possibilities. With the press of a single footswitch, you can change sounds, routing, instruments, effects and tuning—instantly transforming your setup into virtually any rig. Specifications:Body: Mahogany body, carved maple top with flame maple veneerNeck: Set mahogany neck with rosewood fingerboard and dot inlays (Tyler '59 neck shape)Scale Length: 24-9/16\"Frets: 22 medium-jumbo fretsNut: 1-11/16\" Graph Tech Black TUSQ XL self-lubricating nutTuners: Sealed tuners (16:1 turn ratio)Hardware: Chrome hardwareBridge: Fully adjustable Tyler-designed wraparound bridgePickups: Vintage-voiced alnico neck and bridge humbuckers wound to Tyler's specs, L. R. Baggs Radiance Hex piezo pickup systemKnobs: Master Volume and Tone knobsPickup Selector: 3-way selector switchVariax Control: Model and Alt Tune knobs for easily accessing instrument sounds and alternate tuningsOutputs: 1/4” out, VDI (Variax Digital Interface) for integration with Line 6 POD HD500 and POD HD Pro, and limited compatibility with POD xt, POD X3, Vetta II amplifier and other legacy Line 6 productsBattery: Lithium-ion battery (12 hours of play time) and international wall charger (also functions as standard electric guitar without batteries)Software: Variax Workbench HD software and USB interfaceCase: Includes high-quality padded gig bagAvailable Accessories: Additional battery, charger and cable kit available separatelyFinish: gloss black", "ItemID": "183595296694", "EndTime": "2018-12-20T03:14:00.000Z", "StartTime": "2018-12-20T02:59:21.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/line-6-Variax-jtv-59-modelling-guitar-black-excellent-w-cords-batt-charger-bag-/183595296694", "ListingType": "Chinese", "Location": "Burnet, Texas", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1835952966948080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/WPgAAOSwq6VcCx8H/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/K8cAAOSwFSNcCx8n/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/FasAAOSw29JcCx9V/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/dV8AAOSwsGpcCx9l/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/xrkAAOSwdzhcCx97/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/xGMAAOSwoDFcCx-D/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/oCQAAOSwfplcCx-P/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/fnUAAOSwFURcCx-Z/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/9rwAAOSwjNdcCx-x/$_57.JPG?set_id=8800005007"], "PostalCode": "78611", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "onahndshk", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 497, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 675.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 675.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "b***k", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 1}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "line 6 Variax jtv-59 modelling guitar black excellent w/cords & batt/charger/bag", "HitCount": 5, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "14 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 685.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "very good to excellent condition  with extras.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}