{"BestOfferEnabled": true, "Description": "Previously Loved and cared for Epiphone Sheraton II Semi-Hollow Electric GuitarHard Shell Case Black with \"Tortoise\" Pickguard Okay... I wish I could tell you more specifics about this guitar however, I am not a guitar guy or musician. Based on a little online research, the serial number suggested manufactured 2015 In addition, I am not the original owner of the guitar so I don't know the history of this guitar.There may be various surface imperfections, scratches, small nicks you may find... but really, basically in very good condition. We take many detailed photos so you can make the fairest evaluation of the item's physical condition using your own skilled observation; independent of ours yet subjective, opinion. Ebay only allows 12 photos so we attempted to take the correct angles. There may be additional blemishes, dings and scratches but nothing major.This item has been tested and working... But may need a set-up by a professional upon receiving, such as a tuned up, tightened, cleaned, and or adjusted to your liking. It's not as bad as it seems, I just want anyone who buys it to be aware this is a used guitar. It may not liking or expectations right of the go, so just in case you may want to show it some love. It has been sitting in its case these past 2 years unplayed in a non smoking, climate controlled room. If you are unsure about the condition of any item, or need clarification, you are more than welcome to contact us to request more data or specific photos to satisfy any questions you might have. Our information is at the bottom of the listing. You will receive item exactly as shown in the pictures. Please understand, this listing only contains what is described. Don’t assume it comes with something if not stated in the listing description. If you aren’t certain, send us a note thru eBay messaging system. Stand in photo not included.If an identifying mark, inclusion or defect is visible in the images it is considered disclosed to the buyer.Pay attention to the details, Ebay’s defaulted detail catalog is not always correct. Many times Ebay product catalog does not have the correct photo of the item we have for sale may look different. In addition, I have found many of Ebay defaulted catalogues have certain models, MPN, and other specs wrong from previous listers. Double check to see if it is accurate. Most times the buyer knows more than we do. Please ask if there is something specific you need to know. Purchase of the item represent agreement on the terms and conditions of this ebay listing. This listing is offered and sold as is. Uptown Pawn dba. UptownSalesUSA, a brick and mortar pawnshop located in the heart of the Twin Cities metro area. We are licensed and bonded by the city of Minneapolis and registered with Minnesota Secretary of State since 2002. Check out our feedback and buy with confidence.You can find contact information at the bottom of our Ebay Payment Policy tab in listing. If you have any questions or need to discuss more descriptions, special shipping arrangements, additional photos, or local pick up.Uptown Pawn dba. UptownSalesUSA makes no express or implied warranties or representations regarding the condition or suitability of the goods and to the extent allowed by law, specifically disclaims any express or implied warranties, including but not limited to any warranty of merchantability or fitness for purpose.We do not offer a warranty on any merchandise: Ebay has a Square Trade program may work. We are not a distributor for any brand. Warranties on the items that I sell may or may not be valid on a non-retail purchase. Indemnity: Buyer shall, at no expense to the Seller, indemnify, defend and hold the Seller harmless against any and all losses, damages and expense (including punitive damages, multiple damages, attorney fees and other costs of defending any action) Seller may incur as a result of any claim made against the seller by any person, including without limitation, Buyer, it's successors, assigns, representatives, agents, employees, insurers, and customers, actually or allegedly arising out of the regarding the transportation, installation or use of the equipment sold hereunder by Seller or out of any products manufactured or sold by Buyer, including, without limitation, any claim which in whole or in part actually or allegedly arises out of (a) Seller's negligent or other wrongful act or omission, (b) danger or default in any equipment sold by Seller to Buyer, (c) infringement by Seller of any patent, copyright, or trade secret relating to any equipment sold by Seller to Buyer.", "ItemID": "192812107610", "EndTime": "2019-02-03T20:36:19.000Z", "StartTime": "2019-02-02T00:18:30.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Epiphone-Sheraton-II-Semi-Hollow-Electric-Guitar-Hard-Shell-Case-/192812107610", "ListingType": "FixedPriceItem", "Location": "Minneapolis, Minnesota", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1928121076108080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTExMlgxMTg2/z/1A4AAOSwmaJcVNv2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/~goAAOSwCYJcVNsR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/OogAAOSwQXlcVNwB/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/8JsAAOSw651cVNtr/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTMzMVgxMDk0/z/oboAAOSwu4dcVNuH/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/5ykAAOSwEqVcVNt2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTM1OFgxMTg2/z/uYwAAOSwB0lcVNvH/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/oK4AAOSwEHhcVNsm/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQyNFgxMTg2/z/vN0AAOSwpaVcVNur/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ1NFgxMTM0/z/c08AAOSwRfxcVNvj/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/JPAAAOSw6CNcVNvU/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE4MlgxMTg2/z/53EAAOSwTxJcVNtb/$_57.JPG?set_id=8800005007"], "PostalCode": "55408", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "uptownsalesusa", "FeedbackRatingStar": "Red", "FeedbackScore": 3020, "PositiveFeedbackPercent": 99.5}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 390.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 390.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "g***t", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 383}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Epiphone Sheraton II Semi-Hollow Electric Guitar with Hard Shell Case ", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "Model", "Value": ["Sheraton-II"]}, {"Name": "Body Type", "Value": ["Semi-Hollow"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Material", "Value": ["Laminated Maple", "Mahogany"]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Model Year", "Value": ["2015"]}, {"Name": "Features", "Value": ["Abalone Inlay", "Gold Hardware", "2-Tone", "Volume Knob"]}, {"Name": "Soundboard Style", "Value": ["Archtop"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Product Line", "Value": ["Epiphone Sheraton II"]}]}, "HitCount": 54, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1105760823", "StoreName": "Uptown Pawnstars"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "Very Good Shape... lightly played and well cared for. We take many detailed photos so you can make the fairest evaluation of the item's physical condition using your own skilled observation; independent of ours yet subjective, opinion. Make sure to zoom in due to some reflections can be misleading. In addition… please sort out the difference between the “REFLECTIONS” because at times, from afar they could look like flaws.", "QuantitySoldByPickupInStore": 0, "SKU": "228915-1 MAS JSX", "NewBestOffer": false}