{"BestOfferEnabled": true, "Description": "THIS ITEM IS FROM AN ESTATE, IT DOES HAVE DUST AND VERY FEW SCRATCHES ON IT. WE WILL SHIP FED EX ONLY TO THE U.S. VERY HEAVY GUITAR!!!! THERE IS NO CASE FOR THIS GUITAR!!!! PLEASE READ - Regarding our business with you & our obligations to you. eBay is our main business. It is not our side business. It is not home-based operation. Our items range from small watersport parts to large entertainment systems and furniture. We have sold antique buttons and we have sold vehicles. Because we never know what we will have in stock - if you see an item that only has a Qty of 1 listed, it is very likely that is the only one we have and we will not be able to tell you when we have another. Communication between the buyer and seller is a VERY important step to assuring that all transactions run smoothly. If you have any questions, comments or concerns, PLEASE contact us directly through eBay. Questions sent through Paypal will NOT be answered. We will not see them. We have listed all model information that we have available. We strive to provide all information that we have on hand and do our best to describe and photograph every part. In the case of vehicle, appliance, and watersport parts: we cannot guarantee that this part will fit, only an authorized dealership can do that. Please make sure that this is the correct part that you need BEFORE you buy. The best way to do this is to call a dealership and have them verify that this is the appropriate part number for your application. The overwhelming majority of what we sell is used. If we say the item works, then it was tested to the best of our ability. All items and contents are described to the best of our ability. We examine all items and supply all available make/model information. If you have ADDITIONAL QUESTIONS, please ask before buying or placing a bid. We will try to answer all questions in a timely manner. Our eBay messaging system is the best way to get ahold of us. SHIPPING & HANDLING For normal orders, orders ship between 1 to 3 business days after payment is made. We cannot control shipping time after we ship. Most items are shipped through USPS, with a tracking number. If an item ships via any other method, shipping/tracking information, as well as the carrier will be provided. RESIDENTS OF ALASKA, HAWAII AND PUERTO RICO WILL NEED TO EMAIL US FOR AN ACCURATE SHIPPING QUOTE. IT WILL BE AN ADDITIONAL COST. LARGE ITEMS OVER 34 LBS WILL NOT BE SHIPPED OUT OF CONTINENTAL USA. WHEN CONTACTING US FOR INTERNATIONAL SHIPPING, PLEASE PROVIDE A POSTAL CODE FOR THE FASTEST RESPONSE. PAYMENT All payment is due immediately with the \"Buy It Now\" feature. All payments are processed for fulfillment immediately, through PayPal's policy. If you pay by PayPal, we will ONLY ship to the PayPal confirmed or approved shipping address that you choose at the time of payment. If the purchase is a gift and needs to be sent to a different address please contact us BEFORE paying so we can make sure to send it to the correct address.", "ItemID": "332960405245", "EndTime": "2018-12-19T00:16:15.000Z", "StartTime": "2018-12-17T16:52:51.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/VINTAGE-Univox-Electric-Guitar-Heavy-Wood-Estate-Find-Item-/332960405245", "ListingType": "FixedPriceItem", "Location": "Murphy, North Carolina", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/3329604052458080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/gjoAAOSwnh9cF9Q4/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/jz4AAOSw8kVcF9Pv/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/STkAAOSwC8pcF9P0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/4fwAAOSwo1lcF9P2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/LOoAAOSwNX1cF9P4/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/L3IAAOSw4VpcF9P6/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Be4AAOSwxHlcF9P8/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/RZcAAOSwT2hcF9P-/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/5QcAAOSw0wJcF9QA/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/CI4AAOSwFs1cF9QC/$_57.JPG?set_id=8800005007"], "PostalCode": "28906", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "c2cbrokers", "FeedbackRatingStar": "Red", "FeedbackScore": 1540, "PositiveFeedbackPercent": 99.1}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 225.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 225.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "h***s", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 339}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "VINTAGE Univox Electric Guitar Heavy Wood Estate Find Item ", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Univox"]}, {"Name": "Body Color", "Value": ["Black"]}]}, "HitCount": 86, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1198883692", "StoreName": "tradersknifencoins"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "SKU": "12172018", "NewBestOffer": false}