{"BestOfferEnabled": false, "Description": "Cascio Music's scratch & dent items have been deemed to no longer be sellable in new condition due to customer return, shipping damage or normal use. We are offering this playable and great sounding guitar at a discount. This guitar is in very good original clean condition. It may show minor signs of playing/handling from inspection. This guitar displays no scratches or dents and is in very clean cosmetic condition. The guitar has had no modifications or repairs. The electronics are in excellent working condition and work as intended. The pictures with this listing are from the actual guitar for sale. This item is sold AS-IS and does not include warranty. The inspiring sound of a Stratocaster is one of the foundations of Fender. Featuring this classic sound—bell-like high end, punchy mids and robust low end, combined with crystal-clear articulation—the Player Stratocaster is packed with authentic Fender feel and style. It’s ready to serve your musical vision, it’s versatile enough to handle any style of music and it’s the perfect platform for creating your own sound. Features:Alder body with gloss finishThree Player Series single-coil Stratocaster pickups“Modern C\"-shaped neck profile9.5\"-radius fingerboard2-point tremolo bridge with bent-steel saddlesSpecs:Body Material: AlderBody Finish: Gloss PolyesterNeck Material: MapleNeck Finish: Satin Urethane Finish on Back of Neck with Gloss Urethane Headstock FaceNeck Shape: Modern \"C\"Scale Length: 25.5\" (648 mm)Fingerboard Material: Pau FerroFingerboard Radius: 9.5\" (241 mm)Number of Frets: 22Fret Size: Medium JumboNut Material: Synthetic BoneNut Width: 1.650\" (42 mm)Position Inlays: White DotsTruss Rod: StandardTruss Rod Nut: 3/16\" Hex AdjustmentBridge Pickup: Player Series Alnico 5 Strat® Single-CoilMiddle Pickup: Player Series Alnico 5 Strat Single-CoilNeck Pickup: Player Series Alnico 5 Strat Single-CoilControls: Master Volume, Tone 1. (Neck/Middle Pickups), Tone 2. (Bridge Pickup)Switching: 5-Position Blade - Position 1. Bridge Pickup, Position 2. Bridge and Middle Pickup, Position 3. Middle Pickup, Position 4. Middle and Neck Pickup, Position 5. Neck PickupConfiguration: SSSBridge Hardware: 2-Point Synchronized Tremolo with Bent Steel SaddlesHardware Finish: Nickel/ChromeTuning Machines: Standard Cast/SealedPickguard: 3-Ply ParchmentControl Knobs: Parchment PlasticSwitch Tip: ParchmentNeck Plate: 4-Bolt \"F\" StampedStrings: Fender® USA, NPS, (.009-.042 Gauges) Payment Cascio Music accepts PaypalShipping Please allow a handling time of 1-3 business days after receiving payment (Monday-Friday).Free Shipping on qualifying orders within the lower 48 United StatesUPS Next Day Air Saver, UPS 2nd Day Air and UPS 3 Day Select orders placed prior to 1p CST (M-F) will ship out on the same business day.We provide tracking on all orders. Tracking will post as soon as we receive it from our distribution center. In the very unlikely event that your item is lost or damaged during shipping, please contact us and we will be happy to assist you. Communication The eBay messaging system allows you to securely communicate with us regarding future and existing orders. In order to provide the best possible service to you on eBay, we ask that all communication be done directly through the eBay messaging system. ReturnsIf you are not satisfied with your purchase, you may return the product for a full refund or exchange. We proudly offer a 30 day return policy. If you are not satisfied, simply contact us within 30 days of receipt in order to obtain a return authorization number and instructions. Items sent back to us without a return authorization will be refused.Returns must be sent back in the same condition as received and should include all of the manufacturer's packaging. Items sent back that have been used or are missing the original manufacturing packaging (warranty card, accessories, etc.) may be subject to up to a 20% restocking fee. Please be sure to save the packaging until you know you are happy with your purchase. WarrantyThis purchase includes the manufacturer's warranty.", "ItemID": "173628878037", "EndTime": "2018-11-12T23:21:11.000Z", "StartTime": "2018-11-07T23:21:11.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fender-Player-Stratocaster-Electric-Guitar-w-Pau-Ferro-Fingerboard-Sunburst-/173628878037", "ListingType": "Chinese", "Location": "New Berlin, Wisconsin", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1736288780378080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/XL0AAOSw0Btb43AS/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/SZ0AAOSwC~Bb42~d/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/n-gAAOSwpYxb42~q/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/6AIAAOSw7fxb42~w/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/nuUAAOSwALBb43AB/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/BaMAAOSwW~pb43AG/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/xcgAAOSwWB5b43BC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/WLIAAOSwuUlb43BI/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/3IAAAOSwiE1b43BV/$_57.JPG?set_id=8800005007"], "PostalCode": "53151", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "casciointerstate", "FeedbackRatingStar": "TurquoiseShooting", "FeedbackScore": 27624, "PositiveFeedbackPercent": 99.5}, "BidCount": 3, "ConvertedCurrentPrice": {"Value": 416.5, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 416.5, "CurrencyID": "USD"}, "HighBidder": {"UserID": "s***r", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 81}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Fender Player Stratocaster Electric Guitar w/ Pau Ferro Fingerboard, Sunburst", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "MPN", "Value": ["0144503500"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Model", "Value": ["Player Stratocaster"]}, {"Name": "Body Color", "Value": ["3 Color Sunburst"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}]}, "HitCount": 288, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=39833061", "StoreName": "Cascio Music"}, "Country": "US", "ReturnPolicy": {"Refund": "Money back or replacement (buyer's choice)", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 421.5, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "South America", "PO Box"], "GlobalShipping": false, "ConditionDescription": "Cascio Music's scratch & dent items have been deemed to no longer be sellable in new condition due to customer return, shipping damage or normal use. We are offering this playable and great sounding guitar at a discount. This guitar is in very good original clean condition. It may show minor signs of playing/handling from inspection. This guitar displays no scratches or dents and is in very clean cosmetic condition. The guitar has had no modifications or repairs. The electronics are in excellent working condition and work as intended. The pictures with this listing are from the actual guitar for sale. This item is sold AS-IS and does not include warranty.", "QuantitySoldByPickupInStore": 0, "SKU": "GTS014450350QQ5-MX18052827", "NewBestOffer": false}