{"BestOfferEnabled": false, "Description": "Cascio Music's scratch & dent items have been deemed to no longer be sellable in new condition due to customer return, shipping damage or normal use. These items are given a very basic inspection and testing prior to listing. We are offering this playable and great sounding guitar at a discount. This guitar is in original clean condition. This guitar shows minor signs of playing/handling. There is a small crack on the top of the headstock of the guitar. The small crack does not affect the playability of the guitar. The guitar has had no modifications or repairs. The electronics are in excellent working condition and work as intended. The pictures with this listing are from the actual guitar for sale. This item is sold AS-IS and does not include warranty. D’Angelico's flagship archtop returns in the all-new Premier Series. Crafted from John D’Angelico’s original design, the Premier EXL-1's balanced, organic tone recalls the sound of a classic New York jazz box. Couple that with signature D'Angelico features in the Stairstep tailpiece, Skyscraper truss rod cover, and iconic headstock, the EXL-1 embodies elegance. Its single floating mini-humbucker highlights its naturally punchy mids and warm acoustic edge. Designed for jazz players worldwide, the Premier EXL-1 is a staple. Specs:Specific Model: Premier EXL-1 WhiteHardware Color: ChromeHead Logo (Front): Mother of Pearl Premier Shield LogoHead Logo (Back): Serial NumberMachine Head: Rotomatic StairstepString: D'Angelico Electrozinc Jazz 12's (12-52)Truss Rod Cover: Aluminum SkyscraperNut Width: 1 11/16\"Nut Material: PPSFingerboard Material: RosewoodFingerboard Binding: 1-Ply CreamFretwire: MediumFingerboard Scale: 25.5\"Fingerboard Radius: 14\"Position Inlay Top: White Perloid BlockPosition Side Marker: YesFret Number: 22Frets Clear: N/ANeck Material: MapleShape of Neck Back: C-ShapeNeck Joint Type: Set-ThruThickness 1F: 21mmThickness 12F: 23mmTrussrod: Dual ActionBody Style: HollowbodyBody Depth: 3\"Body Width: 17\"Body Color: WhiteBody Shape: Single CutawayBody Top Material: Laminated SpruceBody Back Material: Laminated MapleBody Side Material: Laminated MapleBody Binding Top: 1-PlyBridge: RosewoodTail & Tailpiece: D'Angelico StairstepPickguard: ScaliniStrap Button: 2 ChromeElectronics Overview: 1 Floating Mini-Humbucker / 1 Volume / 1 TonePickup (Neck): 1 D'Angelico Floating Mini-HumbuckerPickup (Bridge): N/ACase: Gig Bag Payment Cascio Music accepts PaypalShipping Please allow a handling time of 1-3 business days after receiving payment (Monday-Friday).Free Shipping on qualifying orders within the lower 48 United StatesUPS Next Day Air Saver, UPS 2nd Day Air and UPS 3 Day Select orders placed prior to 1p CST (M-F) will ship out on the same business day.We provide tracking on all orders. Tracking will post as soon as we receive it from our distribution center. In the very unlikely event that your item is lost or damaged during shipping, please contact us and we will be happy to assist you. Communication The eBay messaging system allows you to securely communicate with us regarding future and existing orders. In order to provide the best possible service to you on eBay, we ask that all communication be done directly through the eBay messaging system. ReturnsIf you are not satisfied with your purchase, you may return the product for a full refund or exchange. We proudly offer a 30 day return policy. If you are not satisfied, simply contact us within 30 days of receipt in order to obtain a return authorization number and instructions. Items sent back to us without a return authorization will be refused.Returns must be sent back in the same condition as received and should include all of the manufacturer's packaging. Items sent back that have been used or are missing the original manufacturing packaging (warranty card, accessories, etc.) may be subject to up to a 20% restocking fee. Please be sure to save the packaging until you know you are happy with your purchase. WarrantyThis purchase includes the manufacturer's warranty.", "ItemID": "382652901533", "EndTime": "2018-12-07T22:34:57.000Z", "StartTime": "2018-11-30T22:34:57.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/DAngelico-Premier-EXL-1-Hollow-Body-Electric-Guitar-w-Gig-Bag-White-/382652901533", "ListingType": "Chinese", "Location": "New Berlin, Wisconsin", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/3826529015338080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/siwAAOSwE~ZcAbhr/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/SBcAAOSwi3xcAbhv/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/XXYAAOSwXx9cAbh3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/GN8AAOSwEVlcAbiN/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/LbkAAOSwRbJcAbiI/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/4MsAAOSw5UFcAbik/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/voIAAOSwqLRcAbiR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/BVwAAOSwBqZcAbif/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/2WwAAOSwhrpcAbiX/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTEwMVgxMjc4/z/se8AAOSwXc9cAbi6/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODY0WDEzNDY=/z/fSoAAOSw5iRcAbjf/$_57.JPG?set_id=8800005007"], "PostalCode": "53151", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "casciointerstate", "FeedbackRatingStar": "TurquoiseShooting", "FeedbackScore": 27615, "PositiveFeedbackPercent": 99.5}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 299.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 299.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***0", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 260}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "D'Angelico Premier EXL-1 Hollow-Body Electric Guitar w/ Gig Bag, White", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["White"]}, {"Name": "Brand", "Value": ["D'Angelico"]}, {"Name": "Model", "Value": ["Premier EXL-1"]}, {"Name": "MPN", "Value": ["DAPEXL1SWHCT"]}, {"Name": "Body Type", "Value": ["Hollow"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["Indonesia"]}]}, "HitCount": 252, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=39833061", "StoreName": "Cascio Music"}, "Country": "US", "ReturnPolicy": {"Refund": "Money back or replacement (buyer's choice)", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 304.99, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "South America", "PO Box"], "GlobalShipping": false, "ConditionDescription": "Cascio Music's scratch & dent items have been deemed to no longer be sellable in new condition due to customer return, shipping damage or normal use. These items are given a very basic inspection and testing prior to listing. We are offering this playable and great sounding guitar at a discount. This guitar is in original clean condition. This guitar shows minor signs of playing/handling. There is a small crack on the top of the headstock of the guitar. The small crack does not affect the playability of the guitar. The guitar has had no modifications or repairs. The electronics are in excellent working condition and work as intended. The pictures with this listing are from the actual guitar for sale. This item is sold AS-IS and does not include warranty.", "QuantitySoldByPickupInStore": 0, "SKU": "GTSPEXL1SWHCQQ5-US13025", "NewBestOffer": false}