{"BestOfferEnabled": false, "Description": "At top 40 guitarsour customers satisfaction is our first concern.All of out items have a 14 day return policy.If after 14 days you are not completely satisfiedwith your purchase, please return it for a full refund....Peace be with you... *all returned items must be in the same condition theywere at the time of sale. All original packing must be included. # Up for Sale is a2018 Fender Jim Adkins JA-90 Telecaster Thinline! Crimson Red Transparent! This is really cool. You are looking at a 2018 Fender Jim Adkins JA-90 Telecaster Thinline. A collaboration between Jim Adkins and Fender, the Jim Adkins JA-90 Telecaster Thinline is a re-creation of Adkins' old TC-90 - with some special touches specifically for this new model. The Jim Adkins JA-90 Telecaster Thinline's semi-hollow ash body is joined to a set maple neck with a rosewood fingerboard - a great combination that produces a warm tone with a nice edge. Pickups are Seymour Duncan soapbars, and a Adjusto-matic bridge with anchored tailpiece round out the hardware. The Jim Adkins JA-90 Telecaster Thinline is a sweet axe for any style! From The Web: Fender Jim Adkins JA-90 Telecaster in Crimson Red Transparent This popular Tele, the JA-90, is now offered in a new Crimson Red Transparent finish. The Jim Adkins Tele JA-90 is very specifically crafted to suit the Jimmy Eat World frontman's sound. The combination of a semi-hollow body and Seymour Duncan soapbars means a classic look with modern nuances. Jim Adkins says... \"I used the prototype [of this guitar] to track most of our new album. Probably not a first guitar, but definitely in the zone of a second guitar; someone wanting to move up from their starter guitar. The sound is more single cutaway Deluxe than Tele, but the Seymour-Duncan pickups make it unlike them both as you're used to it.\" Here's what Fender say about the Jim Adkins JA-90 When Jim Adkins, guitarist and frontman for platinum-selling Jimmy Eat World, cheerfully challenged Fender with designing his perfect guitar, a collaboration began that resulted in the new JA-90. We sat down with Adkins and went over his old Fender TC-90 spec by spec, making some important changes that subsequently produced this unique new model. Features include a mahogany neck set into a semi-hollow ash body, Seymour Duncan soapbar pickups, independent volume and tone controls, an Adjusto-Matic bridge and anchored tailpiece. SpecificationsBody Material: Semi-Hollow Ash Body Finish: Urethane Body Finish Neck Shape: Modern \"C\" Shape Number of Frets: 22 Fret Size: Medium Jumbo Position Inlays: Pearloid Dot Inlay Position Markers Fingerboard: Rosewood Fingerboard Radius: 9.5\" Radius (241 mm) Fretboard: Rosewood Neck Material: Mahogany Neck Finish: Gloss Urethane Finish Nut Width: 1.650\" (42 mm) Scale Length: 24.75\" (648 mm) Headstock: Matching Painted Headstock Pickup Configuration: S/S Bridge Pickup: Seymour Duncan SP90-3B Vintage P-90 Bridge Pickup Neck Pickup: Seymour Duncan SP90-1NRWRP Vintage P-90 Neck Pickup Pickup Switching: 3-Position Toggle: Position 1. Bridge Pickup, Position 2. Bridge and Neck Pickups, Position 3. Neck Pickup Controls: Volume 1. (Neck Pickup), Tone 1. (Neck Pickup), Volume 2. (Bridge Pickup), Tone 2. (Bridge Pickup) Hardware Finish: Chrome Bridge: Vintage Style Adjusto-Matic Bridge with Anchored-Tailpiece Tuning Machines: Standard Cast/Sealed Tuning Machines String Nut: Synthetic Bone Switch Tips: Black Switch Tip Strings: 250L, NPS, (.009-.042 Gauges) Unique Features: Matching Painted Headstock, Jim Adkins Signature on Back of Headstock, Black Plastic Parts, Knurled Dome Knobs, White Pearloid Dot Position Inlays, Graphite Nut, Oversized Strap Buttons Pickguard: 3-Ply Black Control Knobs: Skirted Amp Knobs Our luthier did a complete setup. Frets are in great shape. Neck is Straight. Brand new strings were installed. Gig ready on Arrival! Serial Number: #ICF17001390 Nut Width: 1.65\" Weight: 6.90 lbs. Case is NOT Included Cosmetics: Excellent Condition. Both Top and Back are very clean. Neck, Fretboard and Headstock are in fine condition. Pristine. Dripping with \"Mojo\" It is used. Not perfect. Look at the pictures closely. They will tell the story. We are here to help! Top 40 guitars is a Veteran owned business.", "ItemID": "392181674632", "EndTime": "2018-12-10T02:05:38.000Z", "StartTime": "2018-11-30T02:05:38.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2018-Fender-Jim-Adkins-JA-90-Telecaster-Thinline-Crimson-Red-NICE-NO-RESERVE-/392181674632", "ListingType": "Chinese", "Location": "Santee, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/3921816746328080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTQ5OFgxMDUw/z/jXcAAOSwg5Fb~ds~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjY4WDUwOQ==/z/TtYAAOSwkHFb~dr3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTUyOVg5NzU=/z/0iwAAOSwEp5b~dug/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTM5M1gxMDU5/z/TasAAOSwcs1b~dvp/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTY3WDQ0OA==/z/S-0AAOSwi3xb~dwl/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ4MVg5NzU=/z/IhYAAOSwYh9b~d1B/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQzMlg4NDM=/z/WaQAAOSwBMpb~dz3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTM0MFg5OTM=/z/j2YAAOSwgotb~dzD/$_57.JPG?set_id=8800005007"], "PostalCode": "92071", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "top40powertrio", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 13195, "PositiveFeedbackPercent": 99.7}, "BidCount": 41, "ConvertedCurrentPrice": {"Value": 640.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 640.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "u***u", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 33}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2018 Fender Jim Adkins JA-90 Telecaster Thinline! Crimson Red! NICE! NO RESERVE!", "ItemSpecifics": {"NameValueList": [{"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Body Color", "Value": ["Crimson Red Transparent"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Country/Region of Manufacture", "Value": ["Indonesia"]}, {"Name": "Model Year", "Value": ["2018"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Brand", "Value": ["Fender"]}, {"Name": "Body Type", "Value": ["Semi-Hollow"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model", "Value": ["Jim Adkins JA-90 Thinline"]}]}, "HitCount": 1105, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=47416021", "StoreName": "Top 40 Guitars"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 650.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "2018 Fender Jim Adkins JA-90 Telecaster Thinline Electric Guitar, Excellent Condition, See ad below for Full Description", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}