{"BestOfferEnabled": false, "Description": "BC RICH DARK ARTS WARLOCK NECK THRU BODY ELECTRIC GUITAR PROJECT. IT HAS SIGNS OF WEAR SUCH AS SOME CHIPS ON THE HORNS, DINGS ON THE BACK OF THE BODY, FEW CHIPS AROUND THE HEADSTOCK AND NORMAL PLAY WEAR. I DID PLAY IT BEFORE REMOVING THE PICKUPS AND EVERYTHING FRETTED FINE AND PLAYED CHORDS FINE. I REMOVED THE PICKUPS FOR SOMETHING ELSE I'M WORKING ON. IT'S NOT ALL THAT BAD JUST PUTTING EVERYTHING OUT THERE FOR NO SURPRISES TO THE BUYER. I'D SAY INSTALL ALL NEW ELECTRONICS-STRING IT UP AND JAM. IT COMES AS SHOWN AND WILL BE BUBBLE WRAPPED AND PACKED WELL FOR SHIPPING. BC Rich Warlock Dark Arts NT Electric Guitar Project Neck Thru Husk W/ Hardware BC Rich Warlock Dark Arts NT Electric Guitar Project Neck Thru Husk W/ Hardware Click images to enlarge Description BC RICH DARK ARTS WARLOCK NECK THRU BODY ELECTRIC GUITAR PROJECT. IT HAS SIGNS OF WEAR SUCH AS SOME CHIPS ON THE HORNS, DINGS ON THE BACK OF THE BODY, FEW CHIPS AROUND THE HEADSTOCK AND NORMAL PLAY WEAR. I DID PLAY IT BEFORE REMOVING THE PICKUPS AND EVERYTHING FRETTED FINE AND PLAYED CHORDS FINE. I REMOVED THE PICKUPS FOR SOMETHING ELSE I'M WORKING ON. IT'S NOT ALL THAT BAD JUST PUTTING EVERYTHING OUT THERE FOR NO SURPRISES TO THE BUYER. I'D SAY INSTALL ALL NEW ELECTRONICS-STRING IT UP AND JAM. IT COMES AS SHOWN AND WILL BE BUBBLE WRAPPED AND PACKED WELL FOR SHIPPING. The B.C. Rich Dark Arts Warlock Electric Guitar offers a unique arched top and neck-through construction. Black hardware, string-through-body construction over a tune-o-matic style bridge and 2 high output direct mounted humbucker pickups combine to make a heavy rock talisman of great tone. The glassy, high gloss finish and black hardware are worthy adornments for this Warlock. Basswood Body Hard Maple Neck Neck-thru Construction Rosewood Fingerboard Widow Headstock 25.5\" Scale 24 Jumbo Frets Large Diamond Inlays Black Hardware Dual BCR Humbucker Pickups Tune-O-Matic Bridge String Through Body Design PLEASE CHECK OUT ALL THE PICTURES IN SUPERSIZE AND ASK ANY QUESTIONS BEFORE PURCHASE. SOLD AS IS. NO RETURNS. PAYMENT DUE WITHIN 48 HOURS OF PURCHASE. ONLY ACCEPT PAYPAL AT THIS TIME. PLEASE CHECK OUT OUR STORE J'S MUSIC AND MORE FOR MORE GREAT DEALS AND RARE ITEMS!! Get images that make Supersized seem small.Tailor your auctions with Auctiva's Listing Templates! THE simple solution for eBay sellers. Track Page Views With Auctiva's FREE Counter", "ItemID": "253953008928", "EndTime": "2018-11-03T20:44:20.000Z", "StartTime": "2018-10-27T20:44:20.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/BC-Rich-Warlock-Dark-Arts-NT-Electric-Guitar-Project-Neck-Thru-Husk-W-Hardware-/253953008928", "ListingType": "Chinese", "Location": "Lumberton, North Carolina", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2539530089288080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTAyNFg2ODI=/z/D-kAAOSwJuZby5Eg/$_1.JPG?set_id=880000500F"], "PostalCode": "28359", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "diceman_28358", "FeedbackRatingStar": "Red", "FeedbackScore": 3579, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 99.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 99.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 163}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "BC Rich Warlock Dark Arts NT Electric Guitar Project Neck Thru Husk W/ Hardware", "HitCount": 368, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=40224839", "StoreName": "J&#39;s Music and More"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 100.99, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Pre-Owned Project", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}