{"BestOfferEnabled": false, "Description": "At top 40 guitarsour customers satisfaction is our first concern.All of out items have a 14 day return policy.If after 14 days you are not completely satisfiedwith your purchase, please return it for a full refund....Peace be with you... *all returned items must be in the same condition theywere at the time of sale. All original packing must be included. # Up for Sale is a2017 Fender Standard Stratocaster! Gloss Black Finish! Made In Mexico! This is Really Cool. You are looking at a 2017 Fender Standard Stratocaster. This is the Iconic Guitar that really started it all. Versatility. Blues, Rock, Country, Surf the Strat can do it all. Every player needs a Strat in his arsenal. From The Web: When Leo Fender introduced the world to his newest creation, the Stratocaster, nobody could possibly have known it would change the face of contemporary music forever. Now, it's back to the basics! Between the fast-action maple neck, comfort-contoured alder body, three single-coil pickups, and standard synchronized tremolo - this is where the tradition began, and it still carries on today in the surprisingly playable and affordable Standard Series Stratocaster. Fender Standard Stratocaster Features at a Glance:Lightweight alder body with 3-ply white pickguard and shielded body cavities Vintage-style tremolo with high mass bridge block Three standard, single-coil Strat pickups Maple neck and Pau Ferro fingerboard with modern C-shape and satin polyester finish Lightweight alder body with 3-ply white pickguard and shielded body cavities It doesn't get any more basic than this. The Standard Series Stratocaster features a lightweight, comfort-contoured alder body which has actually changed very little since the first Strats rolled off the production lines in 1954. However, this new version actually has shielded body cavities for reduced hum and quieter operation than you'd get with a vintage 1950s Strat. A 3-ply white pickguard completes the classic look. Oh, and that low sticker price is pretty nice, too. Vintage-style tremolo with high mass bridge block While there's no denying the fact that Leo Fender's guitar designs were an amazing blend of art and engineering, it was the erroneously named synchronized tremolo (it's actually a vibrato) that may well have been his most inspired bit of engineering. With it you could bend notes or even entire chords up or down without throwing the guitar out of tune. Even though Fender has continued to improve upon the tremolo, many players simply prefer the look and feel of the original. The Standard Strat comes with that vintage-style tremolo, but it also adds a high mass bridge block for improved sustain and tone. Three standard, single-coil Strat pickups The Stratocaster was the first production line guitar with three pickups, and it's no surprise that this basic configuration is just as popular today as it was in 1954. So your new Standard Stratocaster comes from the factory with three standard Strat single-coil pickups with vintage-style ceramic magnets. Way back in the 1950s and 1960s, players had to carefully fiddle with their 3-position blade switch to get those in between pickup combinations. Don't worry. Your new Standard Strat comes with a modern 5-way blade switch for instant access to all the cool Strat tones. Maple neck and Pau Ferro fingerboard with modern C-shape and satin polyester finish Leo Fender wasn't a guitar player. In fact, he got his start repairing radios. So he had no idea that guitars weren't supposed to have maple necks. This Standard Strat has a maple neck and Pau Ferro fingerboard that helps deliver the classic Strat spank and sparkle. In keeping with contemporary tastes, this Strat has a more modern C-shaped maple neck with a satin polyester finish. Fender Standard Series Stratocaster Features:Brown sunburst color with polyester finish Maple C-shaped neck Alder top Fender/Ping standard machine heads 25 1/2\" scale length Pau Ferro fingerboard 21 medium-jumbo frets Dot inlays 3 standard Strat single-coil pickups Master volume and 2 tone controls 5-position blade for pickup switching Vintage style tremolo with high-mass bridge block Chrome hardware Our luthier did a complete setup. Brand new strings were installed. Gig ready on Arrival! Serial Number: #MX17928034 Weight: 7.95 lbs. Case is NOT Included Due to CITES Treaty for Endangered Wood (Mahogany, Rosewood) We no longer ship out of the USA. Cosmetics: Excellent Condition. Some light strumming scratches on the pickguard. Top and Back are very clean. Neck, Fretboard and Headstock in great shape. Pristine. Dripping with \"Mojo\". It is used. Not perfect. Overall, a really nice guitar. Look at the pictures closely. They will tell the story. Top 40 guitars is a Veteran owned business. At top 40 guitarsour customers satisfaction is our first concern.All of out items have a 14 day return policy.If after 14 days you are not completely satisfiedwith your purchase, please return it for a full refund....Peace be with you... *all returned items must be in the same condition theywere at the time of sale. All original packing must be included. # Up for Sale is a2017 Fender Standard Stratocaster! Brown Sunburst Finish! Made In Mexico! This is really cool. You are looking at a 2017 Fender Standard Stratocaster. Beautiful Brown Sunburst with Maple Neck and Fretboard. This is the Iconic Model that started it all. Versatility is the Key. Blues, Rock, Surf, Country, Pop nearly any kind of music, A Strat will get the job done! From The Web: When Leo Fender introduced the world to his newest creation, the Stratocaster, nobody could possibly have known it would change the face of contemporary music forever. Now, it's back to the basics! Between the fast-action maple neck, comfort-contoured alder body, three single-coil pickups, and standard synchronized tremolo - this is where the tradition began, and it still carries on today in the surprisingly playable and affordable Standard Series Stratocaster. Fender Standard Stratocaster Features at a Glance:Lightweight alder body with 3-ply white pickguard and shielded body cavities Vintage-style tremolo with high mass bridge block Three standard, single-coil Strat pickups Maple neck and fingerboard with modern C-shape and satin polyester finish Lightweight alder body with 3-ply white pickguard and shielded body cavities It doesn't get any more basic than this. The Standard Series Stratocaster features a lightweight, comfort-contoured alder body which has actually changed very little since the first Strats rolled off the production lines in 1954. However, this new version actually has shielded body cavities for reduced hum and quieter operation than you'd get with a vintage 1950s Strat. A 3-ply white pickguard completes the classic look. Vintage-style tremolo with high mass bridge block While there's no denying the fact that Leo Fender's guitar designs were an amazing blend of art and engineering, it was the erroneously named synchronized tremolo (it's actually a vibrato) that may well have been his most inspired bit of engineering. With it you could bend notes or even entire chords up or down without throwing the guitar out of tune. Even though Fender has continued to improve upon the tremolo, many players simply prefer the look and feel of the original. The Standard Strat comes with that vintage-style tremolo, but it also adds a high mass bridge block for improved sustain and tone. Three standard, single-coil Strat pickups The Stratocaster was the first production line guitar with three pickups, and it's no surprise that this basic configuration is just as popular today as it was in 1954. So your new Standard Stratocaster comes from the factory with three standard Strat single-coil pickups with vintage-style ceramic magnets. Way back in the 1950s and 1960s, players had to carefully fiddle with their 3-position blade switch to get those in between pickup combinations. Don't worry. Your new Standard Strat comes with a modern 5-way blade switch for instant access to all the cool Strat tones. Maple neck and fingerboard with modern C-shape and satin polyester finish Leo Fender wasn't a guitar player. In fact, he got his start repairing radios. So he had no idea that guitars weren't supposed to have maple necks. In time, those blonde maple necks and fingerboards became a Fender trademark, though the company eventually offered rosewood fingerboards on most of its models. This Standard Strat has a maple neck and fingerboard that helps deliver the classic Strat spank and sparkle. In keeping with contemporary tastes, this Strat has a more modern C-shaped maple neck with a satin polyester finish. Fender Standard Series Stratocaster Features:Brown sunburst color with polyester finish Maple C-shaped neck Alder top Fender/Ping standard machine heads 25 1/2\" scale length Maple fingerboard 21 medium-jumbo frets Dot inlays 3 standard Strat single-coil pickups Master volume and 2 tone controls 5-position blade for pickup switching Vintage style tremolo with high-mass bridge block Chrome hardware", "ItemID": "392207222102", "EndTime": "2019-01-14T02:05:13.000Z", "StartTime": "2019-01-04T02:05:13.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2017-Fender-Standard-Stratocaster-Gloss-Black-Finish-MINTY-NO-RESERVE-/392207222102", "ListingType": "Chinese", "Location": "Santee, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/3922072221028080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTM4MFg5NTM=/z/Qt4AAOSw3thbUSlD/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjQxWDUwNQ==/z/Vp0AAOSwQxpbUSkW/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/CTEAAOSwhilbUSjn/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjE5WDQ3NA==/z/dyQAAOSwvylbUSgB/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTM4OVg5NDU=/z/A08AAOSwbOtbUSio/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/kJcAAOSwKjlbUScZ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ3Nlg5Mjc=/z/8mAAAOSwLMJbUSjS/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ5NFg5ODQ=/z/4KwAAOSwBChbUSbz/$_57.JPG?set_id=8800005007"], "PostalCode": "92071", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "top40powertrio", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 13196, "PositiveFeedbackPercent": 99.7}, "BidCount": 62, "ConvertedCurrentPrice": {"Value": 489.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 489.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***4", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 247}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2017 Fender Standard Stratocaster! Gloss Black Finish! MINTY! NO RESERVE!!!!!!!!", "ItemSpecifics": {"NameValueList": [{"Name": "Style", "Value": ["Stratocaster"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Body Color", "Value": ["Gloss Black"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Standard Stratocaster"]}, {"Name": "Country/Region of Manufacture", "Value": ["Mexico"]}, {"Name": "Model Year", "Value": ["2017"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Brand", "Value": ["Fender"]}, {"Name": "Body Type", "Value": ["Solid"]}]}, "HitCount": 918, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=47416021", "StoreName": "Top 40 Guitars"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 494.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "2017 Fender Standard Stratocaster Electric Guitar, Excellent Condition, See ad below for Full Description", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}