{"BestOfferEnabled": false, "Description": "Even though we've listed this item as \"used,\" it is simply an open-box unit that has been used temporarily for demonstration purposes or returned from another customer.This is an open-box deal. Please read this for product condition notes:There are light scratches on the body top near the pickguard on the bass side. There is also a light blemish on the back edge of the treble side horn. There is another light blemish in the treble side neck pocket. There are fine scratches on various parts of this guitar that are not shown in the pictures. These fine scratches do not show up well in pictures. Sweetwater is an Authorized Schecter Dealer Sweetwater's 2-year warranty Fast, Free Shipping! Nearly every order received by 3PM Eastern ships the SAME DAY! FREE shipping to lower 48 states. Our central location reaches most states in 1-4 business days 99.95% warehouse accuracy Expedited shipping available We are proud to provide some of the fastest turnaround times on eBay. We use FedEx or UPS for most items, and USPS for smaller items. Residents of Hawaii, Alaska, and Puerto Rico should contact us for a shipping quote.In order to ensure you receive your valuable shipment, all orders over $500 will require a delivery signature. Buy with confidence! Sweetwater's been selling on eBay since 2001, with 99.9% positive feedback! More than 30 years in business World-class customer service Fast, FREE shipping Free 2-year warranty on nearly every product Free tech support from audio experts Solidbody Electric Guitar with Alder Body, Hard Maple Neck and Fingerboard, 2 Humbucking Pickups, and Floyd Rose - Satin Black RETURN INFORMATION We want you to be completely happy with your purchase from Sweetwater. If you are not satisfied with your product, you may return it for a refund of the purchase price within 30 days. If your purchase was eligible for Free Shipping, the shipping cost will be deducted from your credit or refund. Returns must be in the complete and original packaging with all accessories and complete documentation (Owner's Manual, warranty card, quick start guides, etc.), show no signs of wear or use, and include a Return Authorization number or be subject to a restocking fee. Some products are not returnable, including: Special orders Software Oversized or overweight items Discontinued products, closeouts, and used products Cymbals Tubes Speakers Drumsticks Guitar strings Personal items (earphones, harmonicas, mouthpieces, etc.)", "ItemID": "173748756334", "EndTime": "2019-01-29T23:50:24.000Z", "StartTime": "2019-01-19T00:37:39.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Schecter-PT-FR-Sustainiac-Sweetwater-Exclusive-Satin-Black-Open-Box-/173748756334", "ListingType": "FixedPriceItem", "Location": "Fort Wayne, Indiana", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1737487563348080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NzUwWDUwMA==/z/3cQAAOSwlINcQm~i/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/NzUwWDUwMA==/z/u1gAAOSwIdVcQm~j/$_1.JPG?set_id=2"], "PostalCode": "46818", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "sweetwatersound", "FeedbackRatingStar": "RedShooting", "FeedbackScore": 275226, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 791.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 791.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "e***h", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 78}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Schecter PT FR Sustainiac Sweetwater Exclusive - Satin Black (Open Box)", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Schecter"]}, {"Name": "MPN", "Value": ["3075"]}]}, "HitCount": 80, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=36121123", "StoreName": "Sweetwater Sound"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 0, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["US Protectorates", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "Oceania", "Southeast Asia", "South America", "BM", "GL", "MX", "PM"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "SKU": "PTFRSSBd2", "NewBestOffer": false}