{"BestOfferEnabled": false, "Description": "Godin xtSA Guitar Trans Black WITH Roland GR-20 Synth, Case, Extras! Elec/Ac/Synth This is a complete package which will make you ready to play/gig immediately! The Godin xtSA has Electric, Acoustic piezo, and synth all in one guitar. It has three outputs - the 13 pin MIDI that goes to the GR-20 synth, an Electric only, and an Acoustic/Electric mix. You can plug into all three separately and isolate acoustic, electric, and synth. I usually used the acoustic mix to my Fender acoustasonic amp and adjusted the mix with the volume knob and acoustic faders on the guitar, and then ran the synth to the GR-20 and to the PA half of my Fender acoustasonic amp.  Instant coffee shop setup. Note that the MIDI out of the Godin does not go direct into a MIDI in for a DAW - you must have a guitar synth like the GR-20. The GR-20 has an expression pedal that is programmable on each synth patch. The 13 pin cable is fairly new - I replaced it a couple of years ago. Extras - a hardshell case! (Godins usually come with gig bag). The bridge pickup was replaced with a Dimarzio Steve Lukather Transition pickup with work professionally done by the luthier shop at Mass Street Music in Lawrence, KS. Much better, slightly hotter classic rock voiced pickup similar to PAF. The guitar is a 2013 year model - According to the serial number it was built in October/November 2012. I bought it new. Note that it is NOT a factory second in any way. This is a used guitar and has been played in gigs, though not professionally. There are light finish scratches on the back and light fretwear - mostly at the second fret under the G string. The GR-20 was used when I bought it, but is solid and is reset to factory default. It comes with the long 13 pin cord between the GR-20 and the guitar and a power supply. It does not come with the extra GR-20 MIDI pickup - don't need it because all of the MIDI pickup tracking is on board the Godin. The GR-20 doesn't have a manual but it is available as a PDF online. The Godin tracks better than any synth option I have tried, and much better than an added Roland pickup on your guitar. It obviously tracks better on the 1st through 4th strings because the 5th and th strings vibrate in and out of the field more than the other strings.  I used this mostly for pads, swells, and organ patches. I have since switched to using EHX B3, C3, synth9 pedals. Auction specifics: I will NOT accept offers, so don't waste my time by asking. Continental US/lower 48 states only. No International. This is Buy It Now so payment is required immediately. No returns. It will be shipped Fed Ex Ground. Because of the size, the Godin case and the GR-20 will have to ship separately, hence the higher shipping price. Price it out - you ain't gonna find a used Godin in VG condition, with a case, extras AND a Roland synth on ebay for this price! Specs: - Body - Silver Leaf Maple center with Poplar wings - Fingerboard - Ebony - Neck - mahogany - Scale - 25½\"  - Electronics - Godin humbucker-single-humbucker, tremolo bridge with RMC transducers,   custom pre-amp with 3 band EQ for acoustic sound (bridge pickup replaced with Dimarzio Steve Lukather Transition pickup) - 3 outputs - electric, acoustic/mix, 13-pin for Roland GR synths & most other 13-pin devices - Color : Trans Black HG", "ItemID": "153337793996", "EndTime": "2019-01-14T16:16:47.000Z", "StartTime": "2019-01-12T21:56:37.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Godin-xtSA-Guitar-Trans-Blk-Roland-GR-20-Synth-Case-Extras-Elec-Ac-Synth-/153337793996", "ListingType": "FixedPriceItem", "Location": "Perry, Kansas", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1533377939968080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/OTY4WDEyOTY=/z/NsQAAOSwMQ1cOltd/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTY4WDEyOTY=/z/BaEAAOSwe7ZcOltk/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTY4WDEyOTY=/z/MiYAAOSwhexcOltp/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTY4WDEyOTY=/z/2u4AAOSwvapcOltw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTY4WDEyOTY=/z/EpgAAOSwHglcOlt1/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTY4WDEyOTY=/z/KK8AAOSwwqVcOlt8/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTY4WDEyOTY=/z/gGUAAOSwKwhcOluz/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTY4WDEyOTY=/z/xCMAAOSwcXhcOltY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTY4WDEyOTY=/z/qZYAAOSwPrdcOltU/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTY4WDEyOTY=/z/x9MAAOSwlINcOluQ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTY4WDEyOTY=/z/8SEAAOSwN11cOluj/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTY4WDEyOTY=/z/Lm0AAOSwvpVcOltO/$_57.JPG?set_id=8800005007"], "PostalCode": "66073", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "s-miller", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 441, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 750.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 750.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "c***4", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 87}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Godin xtSA Guitar Trans Blk WITH Roland GR-20 Synth, Case, Extras! Elec/Ac/Synth", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Black"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Brand", "Value": ["Godin"]}, {"Name": "Model", "Value": ["xtSA"]}]}, "HitCount": 74, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Very good condition, some light finish scratches on back. Some light fret wear, mostly on 2nd fret G string.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}