{"BestOfferEnabled": false, "Description": "This VINTAGE GUITARS V6 re-issue sunburst stratocaster is in EXCELLENT \"Like-New\" condition with absolutely NO issues to mention. It actually shows NO signs of ever being played it is that clean & crisp !! It has the Wilkinson WVC original specification vibrato featuring authentic bent steel saddles for that classic sparkle and tone, precision machined pivot points for total return to pitch accuracy and a stagger-drilled sustain block to prevent string hang-up. An adjustable, vintage bend \"push-in\" arm completes this definitive vibrato system. SPECIFICATIONS: Body: American Alder Neck: Hard Maple Bolt on Fingerboard: Rosewood Scale: 25.5\" (648mm) Frets: 22 Neck Inlays: Pearloid Dot Tuners: Wilkinson WJ55 E-Z-LOK Vibrato: Wilkinson WVC Pickups: Wilkinson Single Coil x 3 WVS Hardware: Chrome Controls: 1-Volume - 2-Tone - 5-position switch A Brief History of VINTAGE guitars: Back in the mid-1960's a desire for independence in business led to John Skewes forming a small musical instrument agency and wholesale business based at his home near Leeds, England. Over time, his new business steadily began to take off and soon included some self-branded lines of musical merchandise. That effective early decision to carry self-branded merchandise continues to this day with their signature Vintage A acoustic and electric guitars and basses which were first produced and sold in 1985. Today, Skewes is the largest family-owned independent musical merchandise distributor in the U.K. and the Vintage family includes Fret King electric guitars, Pilgrim Banjos and Mandolins, Laka Ukuleles, Encore elecyric and acoustic guitars and Kinsman cases. About Legendary Designer: Trev Wilkinson: The central idea behind Vintage A is to offer accessibly proced vintage-looking guitars with great finishes, quality parts and features that are typically found on guitars costing upward of a thousand dollars. So, to design an industry-leading line of professional but affordable guitars, Trev Wilkinson joined forces with JHS over a decade ago. These instruments now include class-leading WilkinsonA designed hardware. Certain features make VINTAGE guitars a bigger bang for the buck. Subtle changes to traditional guitar designs have been made so they perform much better. For instance, on the spring block, the holes are staggered in a way that allows the strings to leave the block and pass over the saddles at a consistent angle that helps keep those strings in tune. Trev also developed tuning keys called EZ-LOK that work like a locking tuner but actually don't require any mechanical manufacturing. There's nothing to unwind when you're slacking the strings using the vibrato and they always come back to pitch. The same goes for the pickups. Trev doesn't have a high dollar pickup range to protect so he can produce pickups that will sound as good as any company can wind anywhere in the world ! This fine VINTAGE re-issue is a excellent example of ALL the improvements and quality parts designed to give the player an extraordinary instrument for a very affordable price ! The FREEDOM by SKB hard shell case included has a beautifully black plush interior and fits the contours of this guitar perfectly. It is in very good, clean condition with handle and all closures intact and firmly attached. Please note that the guitar stand pictured is NOT included. Please e-mail me before bidding if there are any questions or additional info needed. Thanks for looking and \"Good Luck\" !", "ItemID": "273591465689", "EndTime": "2018-12-10T00:25:57.000Z", "StartTime": "2018-12-03T00:25:57.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/VINTAGE-GUITARS-Reissued-Series-V6SSB-Wilkinson-Stratocaster-w-HSC-/273591465689", "ListingType": "Chinese", "Location": "South Kent, Connecticut", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/2735914656898080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/OTY0WDE1MzU=/z/a8YAAOSw87Jb-t81/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU2Mlg3MDY=/z/zP4AAOSwHu5b-t9u/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDYy/z/NBcAAOSwUMBb-t-P/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDYy/z/gokAAOSwJ3Rb-t-q/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODQ4WDE1NTk=/z/smkAAOSw851b-t~n/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTI0WDE1NTE=/z/YIMAAOSwlINb-uAu/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU4NFg4ODI=/z/VM8AAOSwl29b-uBV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ0OFgxMDQw/z/~EQAAOSwqLRb-uB2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/PSYAAOSwfcNb-uCA/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzE5WDE1Nzk=/z/j6sAAOSwIJFb-uCd/$_57.JPG?set_id=8800005007"], "PostalCode": "06785", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "zzbop", "FeedbackRatingStar": "Purple", "FeedbackScore": 964, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 349.95, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 349.95, "CurrencyID": "USD"}, "HighBidder": {"UserID": "b***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 44}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "VINTAGE GUITARS Reissued Series V6SSB Wilkinson Stratocaster w/ HSC", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Vintage Guitars"]}, {"Name": "MPN", "Value": ["V6SSB"]}, {"Name": "UPC", "Value": ["Does not apply"]}, {"Name": "Body Color", "Value": ["Sunset Sunburst"]}, {"Name": "Body Material", "Value": ["Solid Wood", "Alder"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Country/Region of Manufacture", "Value": ["Indonesia"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Model", "Value": ["V6SSB"]}, {"Name": "String Configuration", "Value": ["6 String"]}]}, "HitCount": 63, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 354.95, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "EXCELLENT \"Like New\" original condition w/ FREEDOM hard shell case.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}