{"BestOfferEnabled": false, "Description": "Newsletter | Add to FavoritesQuestions? Call us at: 520.325.3376 Store Home About UsShipping DepartmentStore PoliciesContact Rainbow Guitars, Tucson Arizona Pre-Owned Gibson SG Deluxe Orange Burst 3PU 2013 Item: USGB131920319 This rather dressed up 2013 Gibson SG Deluxe adds all the fun features like a Grade-AA figured maple top to a versatile feature set that includes an Orange Burst Nitro finish, three humbucking pickups, Bigsby™ tailpiece, bound headstock, and bound 24-fret rosewood fingerboard with Deluxe split-diamond inlays, along with locking Grover™ tuners. The control setup looks traditional, but hides a clever “TogPot” around the three-way pickup selector, which let’s you blend in the middle pickup as desired, enabling myriad sonic variations. The guitar is in excellent shape while it did have a slight headstock repair on the back of the neck she's all ready to get up and go now. Serial# 131920319 Weight 7lbs. 10 oz. Pre-Owned Gibson SG Deluxe Orange Burst 3PU 2013 Features: Orange Burst Finish Solid Mahogany Body Grade-AA Figure Maple Top Mahogany Neck with Fast, Slim '60's Profile Bound Rosewood Fingerboard with Split Diamond Inlays 24 Frets 3 Classic '57 Humbucking Pickups Bigsby Vibrato Locking Grover Tuners Includes: Gibson Hard Shell Case Other Resources: Manufacture Warranty, Rainbow Warranty --> Payment We prefer Paypal for all payments. Please include a phone number with your order just in case we need to contact you directly. Shipping and Handling We use Fedex for most shipments and we also use in some instances USPS. If you live outside the lower 48 states, please email us in advance to obtain a shipping quote. *Shipping rates to Alaska, Hawaii, and Puerto Rico will be higher. We ship most orders the same day we receive the payment. Orders received on Friday after 3PM PST will ship the following Monday. No sales tax if you live outside Arizona! AZ residents please add 8.6% International orders We do welcome your business so please read carefully the following. Please contact us before you bid with your country and postal code. All shipping charges do not include import taxes, fees, charges, or duties and those are solely the buyers responsibility. We cannot send any item declared as a gift or at a low value. All product warranties are valid in the USA only. If you receive a product that is defective you must pay for all shipping back to the US and to your country again. Shipping time estimates do not include potential delays as a result of border customs. Return policy We accept defectives item for return within 30 days of the purchase date for exchange for the same item or store credit only. No cash refunds will be given. All returns must include all original packaging, manuals, software, and accessories and are subject to a restocking fee . No returns will be accepted on opened software, headphones, or microphones. Defective microphones will be sent for warranty repairs only. If you have any questions or concerns about any order, please do not hesitate to contact us. We strongly advocate direct communication to resolve any issues that may arise during the course of your order and we strive to make every customer satisfied. \"Real\" Outgoing shipping charges are Non-Refundable even if the listing states \"Free Shipping\". Store Home About UsShipping DepartmentStore PoliciesContact © 2009 Rainbow Guitars. All Rights Reserved Questions? Call us at: 520.325.3376", "ItemID": "153310432296", "EndTime": "2018-12-20T16:03:15.000Z", "StartTime": "2018-12-19T22:32:53.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-SG-Deluxe-Orange-Burst-3PU-2013-P-P-/153310432296", "ListingType": "FixedPriceItem", "Location": "Tucson", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1533104322968080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NzA2WDkwMA==/z/pmYAAOSwLKhcGscP/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTEwMFg0MDE=/z/yhUAAOSwuvFcGscQ/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTEwMFgzOTQ=/z/duwAAOSwVcZcGscR/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjQ3WDkwMA==/z/rYQAAOSwlfNcGscS/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjAwWDkwMA==/z/~JoAAOSwaiBcGscT/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjAwWDkwMA==/z/2CEAAOSwtQNcGscT/$_12.JPG?set_id=880000500F"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "harveys_rainbow_guitars", "FeedbackRatingStar": "Red", "FeedbackScore": 4652, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1199.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1199.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "s***-", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 9}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson SG Deluxe Orange Burst 3PU 2013 <P></P>", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Pre-Owned Gibson"]}, {"Name": "MPN", "Value": ["GB131920319"]}]}, "HitCount": 43, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=258324680", "StoreName": "rainbow_guitars_pro_audio"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Europe", "RU", "ID", "DZ", "AO", "BJ", "BW", "BF", "BI", "CM", "CV", "CF", "TD", "KM", "CD", "CG", "CI", "DJ", "EG", "GQ", "ER", "ET", "GA", "GM", "GH", "GN", "GW", "KE", "LS", "LR", "LY", "MG", "MW", "ML", "MR", "MU", "YT", "MA", "MZ", "NA", "NE", "NG", "RE", "RW", "SH", "SN", "SC", "SL", "SO", "SZ", "TZ", "TG", "TN", "UG", "EH", "ZM", "ZW", "YE"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}