{"BestOfferEnabled": false, "Description": "This is a top of the line custom made guitar. Brian Moore was founded in 1992 as a manufacturer of high end, custom made electrics guitars, blending art with technology.The first instrument design was the MC/1, a joint design effort between Brian Moore and Patrick Cummings, that featured an ergonomic neck thru design. It blended the strength and sustain of advanced composite material with the tone and beauty of wood Brian Moore guitars is a descendant of Steinberger Sounds. Brian Moore was the assistant to Ned Steinberger at the original Steinberger guitar shop in Brewster, NY. He assisted Ned Steinberger in his tooling and design shops. Patrick Cummings was hired by Gibson Guitars in 1991 as General Manager of 'Gibson Labs' which included the Tobias, Oberheim and Impulse divisions as well as Steinberger. He was a skilled and versatile guitarist with a background in Electrical Engineering and Business Management. When Gibson decided to move manufacturing out of NY Brian Moore decided he did not want to go and proposed building a new guitar with Cummings that took what they learned about composite material from Steinberger and blend them with more traditional guitar making with wood. The original vision was to manufacture high end custom made electric guitars that blended the \"strength and sustain\" of advanced composite materials with \"tone and beauty\" of wood, specifically, highly figured wood tops. The first instrument design was the MC/1 (this guitars model), a joint design effort between Moore and Cummings, (hence the \"MC\" model name). Brian created an ergonomic neck thru 'form' made of advanced composite materials with a simple curved top. The goal was to refine the design of the guitar for the most discriminating players. Only the highest figured tops were used and only using the finest components such as Seymour Duncan pickups, Sperzel tuners and Wilkinson vibratos. Other design refinements include the \"innovative rear output jack\" and \"sculpted headstock\". Beyond the innovations in the design of the MC/1, the company was also a driver of early adoption of guitar technology and innovation. Late in 1996 the company introduced the RMC Piezo and Polydrive system. This 13pin system uses the piezo pickups as the MIDI or hex pickup for use with the Roland type 13 pin guitar jacks. The MC/1 was their first instrument and their top of the line custom model. They eventually stopped making them because they were too expensive to manufacture profitably and demand grew for less expensive and more traditional wooden instruments. This pre-owned MC-1 model is number 804, built in 2000 in Brewster, NY. There were less than 1000 MC/1s ever made. This guitar features a gorgeous quilt maple top over composite body for a unique tone and sustain. The integrated carbon fiber neck is topped with a 24-fret ebony fretboard. The headstock is inlaid with an Abalone \"M\" logo for a classy look. Dual humbuckers provide everything from jazz to rock to metal and everything in between! The guitar is in extremely good condition with very little wear to the body, and the original case included. Harmony Central Reviews: https://www.harmonycentral.com/reviews/product/brian-moore-guitars-mc--1", "ItemID": "163425556192", "EndTime": "2018-12-18T05:57:29.000Z", "StartTime": "2018-12-11T05:57:29.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Brian-Moore-MC-1-Guitar-ROLAND-13-Pin-jack-/163425556192", "ListingType": "Chinese", "Location": "Lexington, Massachusetts", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1634255561928080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/UM4AAOSwiSVcBg76/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/UPIAAOSwiSVcBg8U/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/aZwAAOSw2bFcBg79/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/RUQAAOSw0~pcBg8V/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/hqQAAOSw~bhcBg71/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/1sYAAOSw-2hcBg78/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/97gAAOSwpppcBg7y/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/AbcAAOSwi3xcBg73/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/IJsAAOSwMKxcBg74/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/o4QAAOSwsPNcBg72/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/AxwAAOSwusdcBg70/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/hRkAAOSwrAFcBg8j/$_12.JPG?set_id=880000500F"], "PostalCode": "02420", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jfschumacher", "FeedbackRatingStar": "Blue", "FeedbackScore": 74, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 1999.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1999.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "s***i", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 40}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Brian Moore MC-1 Guitar With ROLAND 13 Pin jack", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Brian Moore"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}]}, "HitCount": 134, "Subtitle": "Custom made in 2000,  Brian Moore’s top of the line gui", "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 2024.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 5, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}