{"BestOfferEnabled": true, "Description": "Line 6 JTV-69 in Lake Placid Blue. This guitar is a rare gem with custom ad ons from the factory like locking tuners and stainless steel frets. Professionally set up and ready to play. Guitar is in like new condition with no scratches or blemishes or signs of wear. ***Includes Fender Hard Shell Case. 29 Amazing Instruments in OneBy combining patented, industry-leading Line 6 digital modeling technology with boutique-style craftsmanship, James Tyler Variax delivers a complete collection of instruments within a single guitar - 28 vintage instrument models, plus the James Tyler-designed guitar itself. No more dragging piles of instruments to gigs or recording sessions. JTV-69 gives you an endless variety of guitar sounds - from classic acoustic and vintage electric tones all the way to sitar and banjo, plus the onboard SSH pickup configurationin a double-cutaway, 25-1/2 scale-length guitar designed by one of the worlds finest luthiers.Access Alternate Tunings - InstantlyImagine going from Brown Sugar in Open G to Kashmir in DADGAD with the twist of a knob. JTV-69 provides immediate access to 11 alternate tunings, so you can stay in the creative moment instead of spending quality time with your tuner. You can mix and match any tuning with any instrument - and also create your own tunings on the fly with Virtual Capo. Its easy to save your custom tunings, either to the open Model slot on the Alt Tune knob, or to one of the other alternate tuning slots. 1 Finely Crafted GuitarDesigned in the tradition of the classic 25-1/2 scale, bolt-on neck, three-pickup solidbody, JTV-69 features an alder body, a 22-fret maple neck carved to a comfortably rounded Tyler '59 profile and a rosewood fingerboard. This time-tested design yields the bright, percussive snap and bite that characterize this breed of guitar, with plenty of bluesy warmth when required.Specifications:Alder bodyBolt-on solid maple neck with rosewood fingerboard25-1/2\" scale lengthTyler '59 neck shape22 medium-jumbo frets and dot inlays1-5/8\" Graph Tech Black TUSQ XL self-lubricating nutSealed locking/staggered tuners (16:1 turn ratio)Chrome hardwareFully adjustable Tyler-designed tremolo bridgeL. R. Baggs Radiance Hex piezo pickup systemAlnico bridge humbucker and vintage-style neck and middle single-coil pickups wound to Tyler's specsMaster Volume and Tone knobsModel knob and Alt Tune roller knob for easily accessing 28 vintage instrument sounds and 11 alternate tunings5-way selector switchVDI (Variax Digital Interface) for integration with Line 6 POD HD500 and POD HD PRO, and limited compatibility with POD xt, POD X3, Vetta II amplifier and other legacy Line 6 productsLithium-ion battery (12 hours of play time) and international wall charger (also functions as standard electric guitar without batteries)", "ItemID": "202561227633", "EndTime": "2019-01-18T04:26:09.000Z", "StartTime": "2019-01-09T06:03:59.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Line-6-JTV-69-VARIAX-Guitar-Lake-Placid-Blue-/202561227633", "ListingType": "FixedPriceItem", "Location": "Sarnia, Ontario", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/2025612276338080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/38cAAOSwGD1cNYJS/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/o54AAOSw2zRcNYJg/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/8t8AAOSwFGNcNYJy/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/QvgAAOSwIvBcNYKI/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/PMwAAOSwmPlcNYKc/$_12.JPG?set_id=880000500F"], "PostalCode": "N7W1C1", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "dedochs-0", "FeedbackRatingStar": "None", "FeedbackScore": 1, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 979.71, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1299.0, "CurrencyID": "CAD"}, "HighBidder": {"UserID": "a***a", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 129}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["CA", "US"], "Site": "Canada", "TimeLeft": "PT0S", "Title": "Line 6 JTV-69 VARIAX Guitar Lake Placid Blue", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Line 6"]}, {"Name": "Model", "Value": ["jtv-69"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Blue"]}, {"Name": "Features", "Value": ["Built-in Effects"]}]}, "HitCount": 63, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "CA", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}