{"BestOfferEnabled": true, "Description": "This is a Limited Edition 2018 Fender 60th Anniversary Jazzmaster in Vintage Blonde with a Pau Ferro fretboard and nitrocellulose lacquer finish. Aside from some light signs of handling and a couple scratches on the pickguard, this guitar is MINT. \u2028\u2028Due to the popularity of the last two 60th Anniversary Jazzmasters I sold last month, I've been having a lot of fun with these and figured I'd do a similar overhaul on yet another one but in the Vintage Blonde color. If you missed out on the last two, I present you with a chance at another one :)\u2028\u2028These Classic series vintage style \"Offsets\" from Fender sit on a great foundation, but I'm really surprised how they sell any of them because they're setup so horribly from the factory and buzz like crazy with anything less than a set of 12s. Even many of the American made offsets have this same problem because of the same original location of the tremolo (further back), vintage style floating bridge and the lack of break angle on them. This on top of some mediocre hardware and electronics choices from the factory, I decided I would overhaul many of these issues so you can enjoy this guitar with a set of 10s and not have to string it up with bridge cables or use one of those Buzz Stops that not only changes the look of the guitar but the feel and tone as well. I already have an American Vintage '65 Jazzmaster which I love (as well as too many guitars in general) and it's seriously taken a lot to fight the urge to keep this guitar as it came out so great and looks absolutely gorgeous! \u2028\u2028Please read further to see the list of upgrades as well as how the guitar was setup:\u2028\u2028Light weight at just 7.48 lbs\u2028\u2028-Genuine Fender American Vintage 3 ply Eggshell White pickguard replacing the stock tortoise one. Tortoise is cool but I think it doesn't look as good on Vintage Blonde. This is a huge improvement aesthetically in my opinion\u2028\u2028-Fender American Vintage aged white pickup covers. The stock covers were Vintage White (for covers and knobs, this is in-between parchment and aged white) and gave a weird contrast to the stock aged white knobs. This is a lot more cohesive and gives you a more uniform look\u2028\u2028-American Professional Jazzmaster Tremolo with lock and screw-in bar with aged white tip ($100 upgrade). This allows you to lock the tremolo if you break a string\u2028\u2028-American Vintage bridge thimbles. These have the wider standard diameter and are constructed better than the import version it came with stock (these are wide enough to fit a Mastery bridge if for whatever reason you prefer those without worrying about changing the thimbles because it's already been done)\u2028\u2028-Revised 2018 American Professional Jazzmaster narrow spacing 9.5\" radius bridge with Mustang style saddles ($80 upgrade). This is the current updated version of the American Professional bridge that has the modern 2-1/16\" (52mm) string spacing that brings the strings further away from the fretboard edge and a lot more comfortable to play. The original version of the Amerian Professional bridge (and stock bridge) had the vintage 2-3/16” (56mm) spacing and was almost unplayable in my opinion. Fender quietly made this update over the last couple months and essentially makes this a lot more like a Staytrem bridge, which is no longer available outside of the UK (same spacing as the Mastery bridge too). Like the original, it still has the Mustang style saddles and tighter threading screw posts so it doesn't sink down overtime when you play\u2028\u2028-CTS 500K split shaft volume and tone pots. The stock \"Classic 60s\" pickups are great vintage style Jazzmaster pickups (these are really just '65 American Vintage pickups with a different name) but with the stock 1meg pots can sound a little shrill, so I bumped them down to 500K which make them a lot smoother sounding but still plenty of highs on tap\u2028\u2028-Treble bleed circuit (.001uf cap and 1/4w 150k resistor in parallel) to allow the highs to remain when you turn the volume pot down and not get muddy. \u2028\u2028-Orange Drop .022uf tone cap. This allows you to keep more of the mid-highs when you roll the tone back over the stock .1uf value which would get muddy too quickly\u2028\u2028(Luckily these models already have good quality CTS pots for the rhythm circuit and Switchcraft output jack so I did not need to touch those)\u2028\u2028-Lock washer added to the 3-way switch and also turned the switch 45 degrees so it's at an angle and easier to switch\u2028\u2028-Fender/Schaller strap locks and buttons (locks inside case compartment)\u2028\u2028-Fender American Vintage tuner bushings replacing the narrower and cheaper stock ones\u2028\u2028-Kluson Supreme 18:1 Staggered tuners ($50 upgrade). These are the best vintage style Kluson replacement tuners out right now and still retain that same classic look, but with a much finer tuning adjustment over the stock 14:1 tuners and also a better break angle over the nut on the D and G strings for better sustain. Not to mention these are genuine Klusons while the stock ones are not\u2028\u2028-StewMac 0.25 degree full wood neck pocket shim. This is one of the main reasons why these guitars are never setup right from the factory and buzz like crazy and don't sustain with lighter gauge strings. This allows the bridge height to move up and increase the break angle after the bridge and give you enough tension to use lighter gauge strings without having to use a Buzz Stop or heavier strings while still retaining that classic Jazzmaster feel. The problem with using a Buzz Stop is that it increases the string tension so much that it starts to feel and sound more like a Strat or Tele and that more loose Jazzmaster magic is gone. You can also easily move up to 11s or 12s no problem\u2028\u2028-Fender G&G Deluxe hard case from a Johnny Marr Jaguar in grey speckle tolex, black leather ends and blue plush interior. This is a major upgrade over the cheap stock Pro Series case it came with stock. It’s not only built better but slimmer and sleeker and $200 upgrade alone. Key included in the compartment \u2028\u2028Included in the case compartment is all of the original hang tags and literature as well as some extras I included such as a genuine vintage style Fender leather strap, instrument cable, Fender flatwound strings (11s) and Fender zipper pouch usually only from American models\u2028\u2028I also wanted to mention that the 60th Anniversary commemorative neck plate is lightweight aluminum and is 1/4 the weight of your standard steel neck plate (about 0.5 oz vs 2 oz)\u2028\u2028On top of these upgrades, it has also been cleaned, polished, oiled and conditioned the pau ferro fretboard and fully setup with brand new D'Addario EXL110 (10-46) strings with enough relief in the neck balanced for both lead and rhythm and a light touch (5/64\" string height on both the low and high E strings). The saddles have been perfectly intonated and the bridge already has the 9.5\" fretboard radius. The nut slots have been cleaned and filed for optimal contact and take off points for better sustain. The neck and bridge pickup heights are adjusted to 5/64\" on the bass side and 4/64\" on the treble side. \u2028\u2028I fully stand by the work and believe this guitar is going to feel and play better than any other 60th Anniversary Jazzmaster you're going to pull off the shelf new at the store and I'd even argue than any of the American Vintage versions as well, all because of things like the roughly $500 worth in upgrades (which doesn’t even include the labor) and attention to detail in the setup. You're just not going to get that from a new model unless you perform all of these upgrades and do or pay for the work yourself. A brand new current model with inferior hardware and setup costs $1199 without all the upgraded hardware, labor and case. Why not just be done with it, have all the upgrades already completed with an awesome hard case and come out ahead with a better feeling, playing and sounding guitar? :) \u2028\u2028\u2028Below are the stock specs:\u2028Tech Specs\u2028• Body Type:Solidbody\u2028• Body Shape:Jazzmaster\u2028• Left-/Right-handed:Right-handed\u2028• Number of Strings:6\u2028• Body Material:Alder\u2028• Body Finish:Nitrocellulose Lacquer\u2028• Color:Vintage Blonde\u2028• Neck Material:Maple\u2028• Neck Shape:C\u2028• Radius:9.5\"\u2028• Fingerboard Material:Pau Ferro\u2028• Fingerboard Inlay:Pearloid blocks\u2028• Number of Frets:21, Tall Narrow\u2028• Scale Length:25.5\"\u2028• Nut Width:1.650\"\u2028• Nut Material:Synthetic bone\u2028• Bridge/Tailpiece:6-saddle vintage-style adjustable with floating tremolo tailpiece\u2028• Tuners:Vintage-Style\u2028• Number of Pickups:2\u2028• Neck Pickup:Classic Series 60s pickups\u2028• Bridge Pickup:Classic Series 60s pickups\u2028• Controls:1 x volume (bridge), 1 x tone, 2 x thumbwheels (neck volume, tone), 2-way slide switch (rhythm/lead tone), 3-way toggle switch\u2028• Case Included:Hardshell case", "ItemID": "303022721780", "EndTime": "2019-01-10T13:32:34.000Z", "StartTime": "2019-01-08T05:18:17.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2018-Fender-60th-Anniversary-Jazzmaster-Vintage-Blonde-MAJOR-Upgrades-G-G-Case-/303022721780", "ListingType": "FixedPriceItem", "Location": "Washington, District Of Columbia", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/3030227217808080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/OTU4WDE2MDA=/z/XIsAAOSwRbpcNDFy/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/SPQAAOSwaiBcNDJn/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/1PkAAOSw8DpcNDF8/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/r4cAAOSwHAxcNDJY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/K4IAAOSwjMtcNDGD/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/x40AAOSw6JhcNDJR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/RSAAAOSwFtNcNDJH/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/IiMAAOSwjkZcNDI-/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/YUUAAOSwdHpcNDI1/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/KfYAAOSwU65cNDIr/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/uL0AAOSwUWtcNDIf/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTU1WDE2MDA=/z/vxUAAOSwydZcNDGg/$_57.JPG?set_id=8800005007"], "PostalCode": "20001", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "radar-music", "FeedbackRatingStar": "Red", "FeedbackScore": 2003, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1199.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1199.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "-***s", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 46}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2018 Fender 60th Anniversary Jazzmaster Vintage Blonde MAJOR Upgrades G&G Case", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "Model Year", "Value": ["2018"]}, {"Name": "Body Color", "Value": ["Vintage Blonde"]}]}, "HitCount": 140, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}