{"BestOfferEnabled": true, "Description": "Please feel free to contact us with any questions you may have about this listingor any other items that we carry in our store! Thank you for taking the time to visit Blues Angel Music's eBay store! Blues Angel Music, est. in 1997 in Pensacola, Florida, has been named by NAMM (National Association of Music Merchants) as one of the \"TOP 100\" music stores in the USA since 2011!!! Your satisfaction is our #1 objective! 2004 Epiphone Les Paul Electric Guitar, '56 Gold Top w/hsc, Excellent #U04104847 *Please read shipping information at the bottom of the listing* Today, we're very pleased to offer this 2004 Epiphone Les Paul '56 Electric Guitar! It has been very gently owned and is in excellent condition with minimal wear! There are some light scratches on the back of the body. The neck is straight as an arrow and frets show little to no wear. Looks, plays and sounds fantastic! We ask that you observe its pictures closely and invite you to contact us with any questions you may have. There's nothing cooler than wielding a limited-edition axe like the Epiphone Limited Edition Wildkat Royale Electric Guitar. Now you don't have to be a rock star to own one. Epiphone Hardware Can't Be BeatEpiphone always uses all-metal hardware including a 3-way toggle switch, a nickel LockTone™ Tune-O-Matic StopBar bridge, full function volume and tone knobs using full-size 500K O potentiometers, and premium die-cast 14:1 tuners. Les Paul 1956 GoldtopThe Epiphone Les Paul ’56 Goldtop is an incredible reincarnation of the guitar heard ‘round the world. When it was released in 1952, original advertisements for the Goldtop Les Paul read \"designed by Les Paul and enthusiastically approved by top guitarists everywhere.\" Time has proven that to be an understatement! The Les Paul Goldtop was a radical design for its time. Even Gibson was so unsure of the model that at first, they hesitated putting the company name on the headstock. Whenever Les visited Epiphone, he always got a kick out of telling us that story, especially since the hard work and sweat that went into his design was originally done under the roof of Epiphone in New York City. Many musicians choose Epiphone for all their acoustic and electric needs thanks to our pioneering Limited Lifetime Warranty and Gibson 24/7/365 customer service. Make history today with the Les Paul ’56 Goldtop. Classic Styling for the AgesThe ultra classic Les Paul ’56 Goldtop starts with the iconic Les Paul shape, still cut from the same legendary tooling specs as it was in the early days with a mahogany body and hand-set mahogany 24.75” scale neck. Like the original, the Epi Les Paul '56 Goldtop features a rosewood fingerboard with pearloid trapezoid inlays, a 1.68” nut, 22 jumbo medium frets, and Les’ iconic signature on the headstock and truss-rod cover. The Roar of the Original P-90Over the years, Les Paul enthusiasts have become so obsessed with the ‘Burst they often forget that many players first fell for the Goldtop during the guitar's \"P-90\" era. Just like the original, the Epiphone ’56 Goldtop features 2 cream soapbar P-90 Classic pickups that when combined with the mahogany body, give the Les Paul a familiar yet still totally unique timbre. Epiphone Hardware Can't Be BeatEpiphone always uses all-metal hardware including a 3-way toggle switch, a nickel LockTone™ Tune-O-Matic StopBar bridge, full function volume and tone knobs using full-size 500K O potentiometers, and premium die-cast 14:1 tuners. PRODUCT FEATURESHistoric original Les Paul designP90 soapbar pickupsExclusive to selected retailers SPECIFICATIONSBody mahoganyNeck mahoganyNeck Profile SlimTaper™Fingerboard rosewood with 22 medium jumbo fretsScale 24.75Nut 1.68”PickupsBridge LockTone™ Tune-O-MaticTailpiece StopBarControls Full function volume and tone knobs for each pickup using full-size 500K O potentiometersColor Metallic Gold (MG)Strings (Recommended) D’Addario® 10, 13, 17, 26, 36, 46Actual Weight: 8.14Lbs *Shipping Information*We use Fed Ex or USPS for our shipping services. Expedited shipping is available for an additional cost. \"ALL\" orders over $50.00 require a signature.If you do not wish to have a signature for your item you must submit to us that you do not wish to have a signature on your item and that you assume any and all responsibility in the event your purchased item is lost during shipment or stolen from your home. ALL shipped items include insurance\"Free Shipping\" applies only to the contiguous 48 states, and not to Alaska and Hawaii.Large Packaged Items such as Guitars, Basses, Amps, Drums, and Keyboards being shipped to Post Office Boxes will incur additional charges.We ship most of our new items in custom-made, double-walled boxes, as many original manufacturer's shipping boxes are not strong enough to withstand multiple shipments, and have already been used at least once to ship to us. As such, your item may not come in the original manufacturer's box. We do our very best to ensure that your instrument arrives safely and securely. See our feedback for positive comments on how well we ship!Packaging: Our items no matter the size or shape are professionally packed by our expert shipping department. Please see our feedback for what customers say about shipped items. ALL of our guitars at Blues Angel Music are professionally detailed and set up to factory specifications by our very own Master Luthiers! We want your guitar to arrive in the best condition possible and ready to play! Please note that temperature and humidity changes occurring during shipping may affect setup, and the responsibility of any desired changes to setup resides with the buyer. Rest assured that most customers are satisfied with setup upon arrival! If you're ever passing through Northwest Florida, be sure to stop by and say hello! We're home of the World's only full-scale Drum Set Fish Tank created by Animal Planet's hit TV show \"Tanked!\" WANT MORE? SEE OUR OTHER LISTINGS #EAM#01.18.19", "ItemID": "323655674650", "EndTime": "2019-01-20T22:58:20.000Z", "StartTime": "2019-01-18T21:38:06.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2004-Epiphone-Les-Paul-Electric-Guitar-56-Gold-Top-w-hsc-Excellent-ISS4302-/323655674650", "ListingType": "FixedPriceItem", "Location": "Pensacola, Florida", "PaymentMethods": ["PayPal", "VisaMC", "Discover", "AmEx"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/3236556746508080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTI0M1gxNjAw/z/hvkAAOSwDYdcQkGe/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/Nzc4WDE2MDA=/z/k40AAOSwD1pcQkGb/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTEzMlgxNjAw/z/fuYAAOSwNqxcQkGm/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODc0WDE2MDA=/z/4GwAAOSw5cZcQkGo/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA3NVgxNjAw/z/2Z0AAOSwsTJcQkGs/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/Njc2WDE2MDA=/z/gb4AAOSw-V1cQkGq/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwNFgxNjAw/z/RIgAAOSwyn1cQkGj/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIxN1gxNjAw/z/HVEAAOSwr~9cQkGx/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTY1WDE2MDA=/z/VO4AAOSwseFcQkGg/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODkxWDE2MDA=/z/FosAAOSwnWpcQkGu/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNDE5/z/BhoAAOSwCXxcQkG0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNDMx/z/NggAAOSwlfNcQkG2/$_57.JPG?set_id=8800005007"], "PostalCode": "32507", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "bluesangelmusic850", "FeedbackRatingStar": "Red", "FeedbackScore": 4320, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 549.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 549.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "l***-", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 3755}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2004 Epiphone  Les Paul Electric Guitar, '56 Gold Top w/hsc, Excellent #ISS4302", "ItemSpecifics": {"NameValueList": [{"Name": "Size", "Value": ["Full Size"]}, {"Name": "Body Color", "Value": ["Gold Top"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Country/Region of Manufacture", "Value": ["Korea, Republic of"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["2004"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "Body Type", "Value": ["Les Paul"]}, {"Name": "Model", "Value": ["Les Paul '56"]}, {"Name": "Body Material", "Value": ["Mahogany", "Maple"]}, {"Name": "Soundboard Style", "Value": ["Archtop"]}]}, "HitCount": 15, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=13970765", "StoreName": "Blues Angel Music"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["BR", "RU"], "GlobalShipping": false, "ConditionDescription": "This guitar has been very gently owned and is in excellent condition with little wear!", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}