{"BestOfferEnabled": false, "Description": "We are offering a VERY limited edition Dean Guitar, produced in the 1980’s. This listing is for one guitar only (the Busch) guitar is being offered in a seperate listing. Budweiser Dean Guitar:The Dean Budweiser Bow-Tie guitar. A classic eye catching design. This guitar was only around for a very short time (it was a limited edition to begin with) and the story has it that Dean was sued by none other than Bo Diddley because he had a similar guitar body style… and he (Bo Diddley) won, and production was immediately stopped. Very Rare indeed. This guitar also comes with a even rarer fitted hard-shell (fender style) case. I have only seen a couple of these ever offered for sale with the case. Neil Young recently announced that he is selling off a number of items from his personal collection, Trains, Cars, and guitars! One of the guitars he is selling is his Budweiser Dean guitar. It’s said that Neil partly got the idea for his song “This Note’s For You” from this guitar! Now that’s pretty cool! Condition: The Dean Budweiser guitar has been played, and it has a couple of minor marks/chips here and there, none are visable on the front of the guitar, (see close up photos). The neck is straight, the tuners are tight like new. The hard shell case has a few very minor bumps and dings on the outside, and a little wear on the inside from the guitar rubbing through the years. This guitar should be set up before playing. Over all in excellent condition. I’ve kept this guitar stored for years in its respective case in a tempeture controled atmosphere. More photos can be available upon request for serious buyers. If you are outside the United States, please contact me for shipping rates. PAYMENTS: Unless otherwise arranged, we expect payment to be made within 72 hours (3 days) after purchase. So, if you win the bid or purchase the item on Sunday at 8 pm, we would expect payment by Wednesday at 8 pm. Thank you in advance for your cooperation! TERMS OF SALE: Items are sold \"as is\" according to the pictures and descriptions. I have endeavored to photograph and accurately describe every item as to its condition and authenticity to the best of my ability. Photographs are part of the description - I take multiple photographs and in most cases, photos are better than what you would find in a Sotheby's catalog. I am happy to answer any questions during the run of the sale. If you are still not sure about the item, please DO NOT bid until you are. SHIPPING: I have made the shipping Priority Mail so that it's handled less and gets there faster. COMBINED SHIPPING COSTS: We do offer a discount on shipping for additional items. The more the merrier! SALES TAX TO OHIO PURCHASERS: We must charge 7.5% sales tax to all Ohio purchasers. INTERNATIONAL BIDDERS/BUYERS: Before Bidding, we expect you to request a quote for shipping. Shipping fees for international buyers will vary. Items will be marked as merchandise, and the actual price will be stated on the customs form. NEW MERCHANDISE: We add many new items each week from estate and tag sales. We hope to see you again and again! Check out our other items! Be sure to add me to your favorites list! Unless otherwise arranged, we expect payment to be made within 72 hours (3 days) after purchase. So, if you win the bid on Sunday at 8 pm, we would expect payment by Wednesday at 8 pm. Thank you in advance for your cooperation! _gsrx_vers_837 (GS 7.0.15 (837))", "ItemID": "323358962551", "EndTime": "2019-01-13T20:49:10.000Z", "StartTime": "2018-07-20T17:41:19.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Budweiser-Dean-Guitar-w-Case-Neil-Young-Very-Rare-/323358962551", "ListingType": "FixedPriceItem", "Location": "Columbus, Ohio", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/3233589625518080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTU5OVgxMDYz/z/LL4AAOSwa~NbUh64/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2M1gxNTk5/z/1M4AAOSwxDhbUh64/$_3.JPG", "https://i.ebayimg.com/00/s/MTU5OVgxMDYz/z/hNkAAOSwZNVbUh66/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2M1gxNTk5/z/-LoAAOSw3TJbUh65/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2M1gxNTk5/z/404AAOSwefRbUh67/$_3.JPG"], "PostalCode": "43201", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jerryhasitandmargo2", "FeedbackRatingStar": "Red", "FeedbackScore": 1477, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 699.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 699.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "1***h", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 249}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Budweiser Dean Guitar w/Case Neil Young Very Rare!", "ItemSpecifics": {"NameValueList": [{"Name": "Size", "Value": ["Full Size"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Body Color", "Value": ["Multi-Color"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Brand", "Value": ["Dean"]}]}, "HitCount": 574, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=62857569", "StoreName": "jerryhasitandmargo2"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 5, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Mint", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}