{"BestOfferEnabled": false, "Description": "--> Motor City Pawn Brokers 99.9% Positive Feedback eBay store About Us Listings Contact US WEBSITE Gibson \"Flying V\" Made In U.S.A - 1997 - Black - Right Handed - Electric Guitar Gibson \"Flying V\" Made In U.S.A - 1997 - Black - Right Handed - Electric Guitar Brand: Gibson Model : \"Flying V\"Includes : Gibson \"Flying V\" Electric Guitar And Gibson Branded Case DESCRIPTION This Electric Guitar is in Good cosmetic condition and would be considered a \"players\" guitar. The headstock has couple small nicks and light scratches. The tuning machines move and hold tune as intended. The neck is straight with no signs of truss rod issues but has a few indentations near the middle. The fingerboard is clean with little wear to the frets. The top has some scratches and signs of wear which is typical from prior use and ownership. The sides and edges have a couple scratches as well however, they are free of chips and dings. The knobs and toggle switch are moving smoothly and properly as intended. The back has light signs of buckle rash. Please see images.This item has been tested and the electronics are working properly.Features:Top: MahoganyBack & Sides: MahoganyNeck: MahoganyFingerboard: RosewoodFret count: 22Dexterity: Right HandedSerial #: 90307796Made in U.S.AThis auction does NOT include any additional accessories, straps, product literature, or original packaging. Please note that we do not have a guitar tech or luthier on staff. Buyer should presume that the guitar will have to be restrung and/or set up. Payment Shipping & Returns About Us About The Merchandise Payment Online payments are accepted through PayPal ONLY. We do not accept any other forms of online payments. Payment for all items is due within 5 days of the auctions selling date, unless prior arrangements have been made to set a longer time frame. All Michigan sales are subject to 6% sales tax. We ship items within 1 business day after receiving payment. Shipping & Returns We offer FREE returns so you can bid with total confidence. The buyer has 30 days to return a purchase for a full refund if they are not satisfied. Our AS IS items do not quality for any refunds or returns. They are Final Sale purchases. Automobile purchases do not qualify for any type of refunds or returns. They are Final Sale purchases. Shipping is available within the continental United States. We offer combined shipping for your multiple purchases. Flat rate boxes are not used! We ship our items using UPS Ground & USPS for smaller items. If a package is returned to us because of an incorrect address or if someone was not there to accept the package, the buyer is responsible for any additional shipping charges. If prior arrangements are made, we will also ship to Hawaii and Alaska but additional fees/charges will apply. Please contact us for more information prior to bidding. We ship items within 1 business day after receiving payment. About Us We are Motor City Pawn Brokers. We have been serving the Metro Detroit area and eBay customers around the world for over 26 years. We are very proud to be an eBay Seller with over 35,000 feedback and a positive feedback rating of 99.9%. You can bid with confidence. We look forward to serving you soon! About The Merchandise All of our items up for auctions are items that we purchased from customer or loans that were forfeited. We test and describe each and every single item to the best of our ability. There are some items that we cannot test, if so that is stated within the listing. These types of items are listed “AS IS” and are sold as a final sale. We will always disclose any necessary information about each individual item, whether its condition is excellent and working or is flawed or if the item just simply does not work. We will make effort to disclose any imperfections or defects of an item, if there are any. Please feel free to ask any questions. Photographs often describe an items condition better than any words can, so please don’t forget to check out the pictures. Actual photos of each item are shown in the auction.Our top goal is making sure YOU are happy. We strive for excellence. We never attempt to sell anything different than what is described. If there is any issue, please contact us immediately so we can fix the situation.Thank you for your continued business! CATEGORIES Art Automobiles/Motorcycles Camera Camera Accessories Coins & Paper Money Collectibles Computer Accessories & Software Desktop Computers DJ Equipment DVD/Blu-Ray/Season Sets Electronics iPads & Tablets Laptops & Netbooks Musical Equipment Musical Instruments Smartphones Sporting Goods Tools/Equipment Video Game Consoles Video Games & Accessories Other Why Buy FROM US? We are Motor City Pawn Brokers. We have been serving the Metro Detroit area and eBay customers around the world for over 26 years. We are very proud to be an eBay Seller with over 28,000 feedback and a rating of 99.9%. Bid with confidence. We look forward to serving you! Sell Smarter with Kyozou.Inventory and Ecommerce Management", "ItemID": "202513947695", "EndTime": "2018-12-01T21:58:38.000Z", "StartTime": "2018-11-24T21:58:38.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-Flying-V-Made-U-S-A-1997-Black-Right-Handed-Electric-Guitar-/202513947695", "ListingType": "Chinese", "Location": "Roseville, Michigan", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2025139476958080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTAyNFg2ODM=/z/IysAAOSwr-Bb-cmQ/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg2ODM=/z/PPgAAOSwrpJb-cmQ/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg2ODM=/z/3ksAAOSwHSdb-cmQ/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg2ODM=/z/tCoAAOSw~flb-cmQ/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg2ODM=/z/7NgAAOSwKM1b-cmQ/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg2ODM=/z/1OYAAOSwHORb-cmQ/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg2ODM=/z/7P8AAOSwDAdb-cmQ/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg2ODM=/z/n5gAAOSw11Bb-cmQ/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg2ODM=/z/-0AAAOSwSzpb-cmR/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg2ODM=/z/4W0AAOSwtFxb-cmQ/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg2ODM=/z/-uIAAOSwA29b-cmR/$_1.JPG?set_id=880000500F"], "PostalCode": "48066", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "motorcitypawn", "FeedbackRatingStar": "TurquoiseShooting", "FeedbackScore": 38779, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 21, "ConvertedCurrentPrice": {"Value": 710.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 710.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "z***r", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 66}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson \"Flying V\" Made In U.S.A - 1997 - Black - Right Handed - Electric Guitar", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Model", "Value": ["Flying V"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "Body Material", "Value": ["Mahogany"]}, {"Name": "Model Year", "Value": ["1997"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}]}, "HitCount": 709, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=51929889", "StoreName": "Motor City Pawn Brokers"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 720.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "TopRatedListing": true, "GlobalShipping": false, "ConditionDescription": "This Electric Guitar is in Good cosmetic condition and would be considered a \"players\" guitar. The headstock has couple small nicks and light scratches. The tuning machines move and hold tune as intended. The neck is straight with no signs of truss rod issues but has a few indentations near the middle. The fingerboard is clean with little wear to the frets. The top has some scratches and signs of wear which is typical from prior use and ownership. The sides and edges have a couple scratches as well however, they are free of chips and dings. The knobs and toggle switch are moving smoothly and properly as intended. The back has light signs of buckle rash. Please see images.", "QuantitySoldByPickupInStore": 0, "SKU": "E36BC45D-9AA9-4281-8E06-6E7F76F985A0", "NewBestOffer": false}