{"BestOfferEnabled": true, "Description": "Flawless set-up, mint condition. Both body cavities have been shielded when the set-up was done. The circuit is all hand wired no PCB in this guitar. This Les Paul has no weight relief, the tone is unreal, the guitar resonates and vibrates in your hands. It sounds fantastic unplugged and the '57's are tone monsters. Here is a link to a video on YouTube made by Musicians Friend about the Gibson Les Paul Traditional Pro IV - https://youtu.be/C00UkkA3-FA Taking design and visual cues from the Les Paul models of the '80s and '90s, the Les Paul Traditional Pro IV features powerful pickups with push/push for coil splits, coil selector and boost circuit, , Rounded neck profile: The true feel of a Les Paul from the golden era, antique binding, period-correct pickguard, vintage Gibson top hat knobs, and the revolutionary Plek set up. With all the fat, sweet, snarling Les Paul tone that purists love, the Gibson Les Paul Traditional Pro IV sports a mahogany body with a thick maple cap for the perfect blend of warmth and clarity. The finish is in high-gloss nitro lacquer that feels great and lets the wood resonate fully. Each Les Paul Traditional also comes with Gibson USA's brown traditional hardshell case and Gibson's Limited Lifetime Warranty. Period-Correct Pickguard The cream-colored pickguard has been a Les Paul staple dating back to the models of the late 1950s and the early 1960s. Many players, however, removed the pickguard from their Les Pauls to show off the beauty of the flame maple tops, prompting Gibson to stop installing the pickguard altogether. During the 1980s and 1990s, Gibson began reinstalling the pickguard in the factory, and the Les Pauls from this era once again arrived in stores bearing the classic, cream-colored pickguard. The Les Paul Traditional Pro IV comes equipped with a period-correct pickguard, designed to protect the maple top. Pickups: Neck: '57 A3R; Bridge: '57 A3T Specially selected for the Trad Pro IV, the new '57 A3R and '57 A3T pickups combine the specs of the 57 Classic pickup with vintage-output alnico III magnets, resulting in the power and warmth of vintage pickups with added articulation and sparkle. These new pickups feature nickel-plated pole pieces, nickel slugs, maple spacers and 4-conductor wiring. Both pickups offer coil-splitting for single-coil sounds with a coil-selector switch and a boost circuit all activated via push/push switching in the volume and tone controls. The user-adjustable 10 dB boost circuit injects added power and frequency range for solos, single-note picking and dirty chording (depending on amp settings) and features true bypass that disengages the boost completely, ensuring pure passive Les Paul tone. Revolutionary Plek Set Up The Plek is a German-made, computer-controlled machine that carefully measures each fret, along with the fingerboard height under each string, and then automatically dresses each fret to tolerances within .001, virtually eliminating string buzz and greatly improving the overall playability of the guitar. This pioneering process does in minutes what it takes a luthier several hours—sometimes even days—to accomplish. Every fret is accurately aligned, and the guitar is properly intonated, leaving the instrument \"Plek'd\" and amazingly playable. Antique Binding To see the process of putting the binding on the Les Paul Traditional is to really appreciate the effort and attention that Gibson puts into each instrument. A lone craftsman will carefully glue and fit two pieces of binding around the entire body of a Les Paul. He then winds a single, very long piece of narrow cloth around the entire body until the entire surface is nearly covered. The body is then hung to dry for a full 24 hours before it is unwrapped and moved into the next phase of production. It has been done the same way for over 100 years. Some question the value of adding binding, but Gibson believes it is a fundamental part of our rich guitar-making history. The binding adds elegance to the Les Paul Standard, and helps protect the edges of the body. The neck binding is installed over the fret ends, which eliminates sharp fret edges and provides for a smooth neck and easier playability. Features Body Body shape: Single cutaway Body type: Solid body Body material: Solid wood Top wood: A-grade Carved maple Body wood: Mahogany Body finish: Gloss top, back and sides Orientation: Right handed Neck Neck shape: Rounded neck profile: The true feel of a Les Paul from the golden era Neck wood: Mahogany Joint: Set-in Scale length: 24.75\" Truss rod: Standard Neck finish: Gloss Fretboard Material: Bound rosewood Radius: 12\" Fret size: Medium jumbo Number of frets: 22 Inlays: Trapezoid Nut width: 1.69\" (43mm) Pickups Configuration: HH Neck: '57 A3R (DC resistance 8.0k) Middle: Not applicable Bridge: '57 A3T (DC resistance 8.5k) Brand: Gibson Active or passive: Passive Series or parallel: Series Piezo: No Active EQ: No Special electronics: User-adjustable 10dB boost (push/push neck pickup tone pot); coil-splitting (push/push neck and bridge pickup volume pots); coil selector (push/push bridge pickup tone pot) Controls Control layout: Volume 1, volume 2, tone 1, tone 2 Pickup switch: 3-way Coil tap or split: Coil split Kill switch: No Hardware Bridge type: Fixed Bridge design: Tune-o-matic Tailpiece: Stopbar Tuning machines: Traditional tuners Color: Chrome Other Number of strings: 6-string Special features: Pickups Case: Hardshell case Accessories: None Country of origin: United States", "ItemID": "183576460268", "EndTime": "2018-12-18T02:14:29.000Z", "StartTime": "2018-12-09T18:02:33.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2017-Gibson-Les-Paul-Traditional-Pro-IV-Mint-Condition-Iced-Tea-Burst-/183576460268", "ListingType": "FixedPriceItem", "Location": "Naples, Florida", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1835764602688080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/XSAAAOSw7thb~uqt/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/IAAAAOSwMQ1b~urM/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/TTcAAOSwTiVb~uqv/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/UukAAOSwzGBb~uq1/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/AoEAAOSwWz5b~uqw/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/EU4AAOSwnfRb~urw/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/qQkAAOSwzd9b~uq8/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/puIAAOSwz05b~usK/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/px8AAOSwteFb~usV/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/8I8AAOSw-4Jb~usm/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Wb8AAOSw7Odb~us~/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/cLcAAOSwVP5b~uqz/$_12.JPG?set_id=880000500F"], "PostalCode": "34109", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "ecigvape", "FeedbackRatingStar": "Red", "FeedbackScore": 1309, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1549.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1549.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "w***9", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 16}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2017 Gibson Les Paul Traditional Pro IV Mint Condition Iced Tea Burst", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model Year", "Value": ["2017"]}, {"Name": "Model", "Value": ["Les Paul Traditional"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Soundboard Style", "Value": ["Maple Top"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Body Color", "Value": ["Iced Tea Burst"]}, {"Name": "Features", "Value": ["See Description", "Built-in Effects"]}, {"Name": "Body Material", "Value": ["Mahogany"]}, {"Name": "Product Line", "Value": ["Gibson Les Paul"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Size", "Value": ["Full Size"]}]}, "HitCount": 560, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 0, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Mint condition, no signs of use, I only played it in my smoke free home. Pretty close to brand new condition.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}