{"BestOfferEnabled": true, "Description": "Weight: 1 lb. 9 oz.Dimensions: 16.4 x 3.5 x 1.8Power: 3.6v Lithium replaceable and rechargeable batteryBattery Life: 8+ hours (approx.) Manufacturing: Made in USAManufacturer's DescriptionJamstik+ The SmartGuitarThe jamstik+ is a BluetoothSmart enabled digital guitar with real strings and real frets. It works with your iPad®, iPhone® or Mac® and a multitude of music apps, including an interactive guitar lessons app series, so anyone from beginners to pros can just play. The jamstik+ is hands-down the easiest and most fun way to learn guitar.You’ve always wanted to learn to play guitar. The jamstik+ can bring that vision to life. It fits your lifestyle because it’s portable and easy to get started. You learn at your pace, and on your schedule. No prior music experience and no tuning needed. There’s nothing else like it. Why? Because the jamstik+ can sense your fingers and display on your favorite Apple device right from wrong, in real-time. It’s like having your personal music instructor at your side every time you play.The only guitar that can sense the placement of your fingers and display them in real-time, on screen, to show right from wrong. The instant feedback changes the game for anyone that wants to become a guitar player. No musical experience required.The included software makes it fun to play like Guitar Hero or Rock Band, but with the jamstik+, you'll actually learn how to play guitar for real. You'll never have to tune the jamstik+ so you can get to playing your favorite songs fast.As a fast and versatile MIDI controller, the jamstik+ can take you further than a standard guitar, allowing any sound like synths, keys, drums and more. Compatible with 100's of MIDI apps and DAW's like GarageBand, Logic Pro, and Ableton Live. Features:Worlds first digital SmartGuitar with wireless connectivity to iPhone®, iPad® & Mac®.A finger sensing fretboard that shows you how to play chords.Included interactive teaching apps that make learning fun.Perfect portable size for travel, fits in any bag, briefcase, or carry-on.Versatile and Accurate MIDI controller that can play any sound.", "ItemID": "292888599974", "EndTime": "2018-12-25T00:35:31.000Z", "StartTime": "2018-12-24T22:54:44.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/ZIVIX-jamstik-SMART-GUITAR-Portable-Bluetooth-App-Enabled-MIDI-/292888599974", "ListingType": "Chinese", "Location": "Summerville, South Carolina", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2928885999748080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NjQzWDgyMg==/z/u18AAOSwfTlcHR33/$_57.JPG?set_id=8800005007"], "PostalCode": "29485", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "bbtyner1961", "FeedbackRatingStar": "Blue", "FeedbackScore": 80, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 47.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 47.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "_***d", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 60}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "ZIVIX jamstik+ SMART GUITAR, Portable Bluetooth App Enabled MIDI.", "ItemSpecifics": {"NameValueList": [{"Name": "Body Material", "Value": ["Acrylic"]}, {"Name": "Brand", "Value": ["ZIVIX"]}, {"Name": "Model", "Value": ["Jamstik+"]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "Features", "Value": ["MIDI device"]}]}, "HitCount": 15, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 48.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Jamstik got this as a B-day present hooked and tried it out, it works like it is supose too but just not my cup of tea.  would be great for  a composer or a more serious Guitarist", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}