{"BestOfferEnabled": false, "Description": "Hi, thanks for visiting my auction. For auction today is one Suhr Classic Pro Surf Green / Alder Body / Maple Neck-Fretboard / SSS SSCII Noise-Cancelling Pickups / One Volume - Two Tone Knob / Suhr Locking Tuners in Almost Mint Condition (Save for some dust and light pick guard wear, if any. Please view the images for a closer look). This example was played for only a handful of times in a smoke-free / no pets home. Has never been gigged outside of the home. The reason for the sale is that on occasion, I sometimes feel the urge to buy single-coil guitars thinking I'd enjoy them more than my humbucker guitar. Have almost always been a humbucker type guy and just can't get used to single-coil guitars, no matter how nice or playable they are. And this example plays remarkably well, neck action is smooth and fast, with no ambient 60 Hz hum because of Suhr's noise-cancelling system. WHAT'S IN THE BOX? - The Suhr guitar listed in the description above, along with any Suhr inspection paperwork and case candy, the Suhr original tremolo arm, and a Suhr Classic Pro Gig Bag with gig bag backstraps. CONDITION - This example is quite clean with hardly any noticeable wear, knowing that the guitar was purchased new in early 2018 from a reputable online retailer. Any wear would be possible pick guard strum marks, or dust in and around the pickups, bridge or tuner areas. TERMS OF AUCTION / SHIPPING - This auction is being provided to the CONUS (Contiguous 48 United States) only. All international bidders, please do not ask a question nor place a bid, your bid will be cancelled for reason of violation of terms of auction. All CONUS bidders, please feel free to ask a question by contacting the seller via eBay channels, place a bid, or use the Buy It Now feature. This auction is offered via PayPal only. SHIPPING rates vary according to your shipping location, and will be shipped via FedEx Ground or Home Delivery. Delivery times also vary according to your location, but are usually within 7 business days of completed payment. Please allow 1 business day for handling / initial shipment. Items that have completed payments typically ship out the same business day. In case of inclement weather or hazardous road conditions, the winning bidder will be notified ASAP with shipment updates. Please note that this item cannot be shipped to an APO box. PLEASE NOTE: ALL SALES ARE FINAL. Seller's Note - It is my desire that all of my eBay clients be treated with respect and dignity, so that every eBay deal I conduct with you be enjoyable, and so that you are satisfied with your purchase. If for any reason your item fails to meet the item description listed above once you've inspected the item upon arrival, please contact the seller immediately so that any corrections can be conducted prior to providing eBay feedback. Please feel free to view my feedback page for your reassurance of my eBay record. Thank you for visiting my auction, and I hope we can do business together soon!On Jan-07-19 at 11:06:29 PST, seller added the following information: EDIT: Most of the images display light and room reflection within the surf green body surface. These are not swirl or smudge marks, but merely camera image reflection.On Jan-09-19 at 09:39:58 PST, seller added the following information: ADDT'L EDIT: Since this auction will close on Saturday the 12th at 5 PM, FedEx, which also closes at 5 PM Saturday, can receive this item at their depot on Monday the 14th. A FedEx label will be printed upon completion of PayPal payment, so the winning bidder can be apprised of the initial shipping process. Shipment will occur on Monday, contingent of completion of PayPal payment.", "ItemID": "223313082945", "EndTime": "2019-01-12T22:00:01.000Z", "StartTime": "2019-01-05T22:00:01.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Suhr-Classic-Pro-2018-Surf-Green-Maple-SSS-Strat-Electric-Guitar-/223313082945", "ListingType": "Chinese", "Location": "Granby, Connecticut", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/2233130829458080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTI4MFgxMDI0/z/rkUAAOSwJOJcMRKA/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDEyODA=/z/cdgAAOSwO7dcMRKL/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTE1WDEyODA=/z/kH4AAOSwZ2FcMRKQ/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTE0WDEyODA=/z/On8AAOSwNqxcMRKY/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODUzWDEyODA=/z/VgMAAOSwpLdcMRKj/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/Nzc5WDExNjg=/z/e7AAAOSwkelcMRMi/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzQ0WDExMTY=/z/9c4AAOSwfYpcMRMp/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDEyODA=/z/hmcAAOSwQZdcMRSL/$_32.JPG?set_id=880000500F"], "PostalCode": "06035", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "rsgilbert3", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 266, "PositiveFeedbackPercent": 100.0}, "BidCount": 11, "ConvertedCurrentPrice": {"Value": 1576.1, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1576.1, "CurrencyID": "USD"}, "HighBidder": {"UserID": "t***d", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 276}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Suhr Classic Pro 2018 Surf Green Maple SSS Strat Electric Guitar", "ItemSpecifics": {"NameValueList": [{"Name": "Body Material", "Value": ["Alder"]}, {"Name": "Brand", "Value": ["Suhr"]}, {"Name": "Model Year", "Value": ["2018"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Classic Pro"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Green"]}, {"Name": "Features", "Value": ["Maple Neck/Noise-Cancelling Pickups"]}]}, "HitCount": 610, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 1601.1, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}