{"BestOfferEnabled": false, "Description": "At top 40 guitarsour customers satisfaction is our first concern.All of out items have a 14 day return policy.If after 14 days you are not completely satisfiedwith your purchase, please return it for a full refund....Peace be with you... *all returned items must be in the same condition theywere at the time of sale. All original packing must be included. # Up for Sale is a 2018 Gretsch G5622T ! Electromatic Center Block Double Cut Away w / Bigsby! This is really cool. You are looking at a 2018 Gretsch G5622T Electromatic Center Block Double Cut Away w / Bigsby. Beautiful Georgia Green Finish. Great Playing and Sounding Guitar. From The Web: Awesome Sustain Plus Semi-hollowbody Tone Alive and loud, Electromatic Center Block guitars are designed for that pure and powerful Gretsch sound at high volume. Painstakingly crafted with essential Gretsch sound, style and playability, these all-new models deliver the fearless and electrifying authenticity that has set Gretsch apart for decades. It’s the sound of honor itself—play proud.Craft amazing tone with Super HiLo'Tron humbuckers The Gretsch G5622T semi-hollowbody electric guitar certainly doesn't scrimp on tone, thanks to a pair of Super HiLo'Tron dual-coil pickups. These special humbuckers were engineered to give your G5622T a pre-EQ'd tone, with lots of high-end sparkle and low-end punch to fill out your sound. Add to that a flexible pickup switching circuit that lets you quickly jump between your favorite configurations, and you're in for a world of tone.Long spruce center block enhances your sound You get a lot of tonal bang for your buck with the Gretsch G5622T, thanks to its long spruce center block. Running the full length of the body, the center block allows the otherwise hollow body to resist resonant-frequency feedback. That means you can rock out louder with more gain, without your amplifier squealing out of control. Spruce is a snappy tonewood too, and since the center block connects with the bridge, the note definition and clarity of the G5622T are amazing.Smooth vibrato action, courtesy of a real Bigsby tailpiece Nothing beats the character and vintage vibe that a real Bigsby tailpiece adds. It's particularly easy to pull off slow, subtle bends and fast flutters with the G5622T, thanks to its Bigsby-licensed vibrato tailpiece.Gretsch G5622T Electromatic Center Block Semi-hollowbody Electric Guitar Features: Double-cutaway semi-hollowbody electric guitar with classic Gretsch style and extremely broad tone Laminated maple top, back, and sides add snap and definition to your sound Chambered spruce center block enhances your sustain and note definition 2 Super HiLo'Tron dual-coil pickups provide sparkling highs, punchy lows, and tons of tonal combinations Treble Bleed circuit maintains clarity when rolling the Master Volume back Graph Tech Nubone nut eliminates string binding for better tuning stability Binding on fingerboard and sound holes adds class, comfort, and distinction Bigsby-licensed vibrato tailpiece lets you pull off smooth and subtle bendsTech Specs Body Type: Semi-hollowbody Body Shape: Doublecut Left-/Right-handed: Right-handed Number of Strings: 6 Body Material: Laminated Maple with Spruce center block Top Material: Laminated Maple Body Finish: Gloss Polyurethane Color: Georgia Green Neck Material: Maple Neck Shape: Standard U shape Radius: 12\" Fingerboard Material: Rosewood Fingerboard Inlay: Pearloid Thumbnail Number of Frets: 22, Medium Jumbo Scale Length: 24.6\" Nut Width: 1.6875\" Nut Material: Nubone Bridge/Tailpiece: Anchored adjusto-matic bridge with Bigsby-licensed B70 tailpiece Tuners: Nickel die-cast Neck Pickup: Super HiLo'Tron Dual-coil Bridge Pickup: Super HiLo'Tron Dual-coil Controls: 2 x independent volumes, 1 x master volume, 1 x master tone, 3-way toggle pickup switch Strings: 10-46 Our luthier did a complete setup. Brand new strings were installed. Gig ready on Arrival! Serial Number: #KS17093884 Nut Width: 1.68\" Weight: 7.85 lbs. Case is NOT Included Due to CITES Treaty for Endangered Wood (Mahogany, Rosewood) We no longer ship out of the USA. Cosmetics: Excellent Condition. Pristine. Dripping with \"Mojo\". It is used. Not perfect. Overall, a really nice guitar. Look at the pictures closely. They will tell the story. Top 40 guitars is a Veteran owned business.", "ItemID": "132880228350", "EndTime": "2018-12-17T02:12:38.000Z", "StartTime": "2018-12-07T02:12:38.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2018-Gretsch-G5622T-Electromatic-Center-Block-Double-Cut-w-Bigsby-NO-RESERVE-/132880228350", "ListingType": "Chinese", "Location": "Santee, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1328802283508080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTMxNFgxMDA2/z/wgEAAOSwUZlbotrL/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTM3MVg5ODk=/z/-KgAAOSwQRVbotsI/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU2NFg5Mjc=/z/P8QAAOSwfLpbotvf/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjYzWDQ2MQ==/z/biQAAOSwqsxbotxV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTMzMVg5NzE=/z/OiYAAOSwrwJboty4/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ1NFg5MDU=/z/o~4AAOSwLTpbotzz/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTMxOFg3Nzg=/z/CR8AAOSwF1dbot2h/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTUyOVgxMTI1/z/cP8AAOSwoRtbot08/$_57.JPG?set_id=8800005007"], "PostalCode": "92071", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "top40powertrio", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 13195, "PositiveFeedbackPercent": 99.7}, "BidCount": 48, "ConvertedCurrentPrice": {"Value": 745.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 745.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "u***u", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 33}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2018 Gretsch G5622T Electromatic Center Block Double Cut w / Bigsby! NO RESERVE!", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Georgia Green"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["G5622T"]}, {"Name": "Country/Region of Manufacture", "Value": ["Korea, Republic of"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["2018"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Brand", "Value": ["Gretsch"]}, {"Name": "Body Type", "Value": ["Semi-Hollow"]}]}, "HitCount": 482, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=47416021", "StoreName": "Top 40 Guitars"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 755.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "2018 Gretsch G5622T Electromatic Center Block Double Cut Away Electric Guitar, Excellent Condition, See ad below for Full Description", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}