{"BestOfferEnabled": false, "Description": "Fender 2011 Hot Rod '52 TelecasterDESCRIPTIONSuper cool and wonderful sounding 2011 Fender '52 American Vintage Hot-Rod Telecaster. The Hot Rod '52 Reissue featured a big chunky neck profile and Seymour Duncan mini humbucker in the neck position giving this instrument a different vibe. Classic transparent blonde finish. Overall in excellent condition less some finish dings (please see photos). Normally, I don't notice them and I am very OCD about my instruments. With super-nice tweed case. Condition: Excellent condition less some minor dings.Modifications: None.Review:The Hot Rod '52 has a 'premium ash' three-piece body finished in butterscotch blonde, the 'premium' tag hinting at a more stringent selection process than the Baja Tele's plain ol' 'ash'.This timber is considered 'best' for fifties-style Teles thanks partly to its appearance and also to its relatively scooped-mid, rich and lively twangin' tone when compared with alder. Premium tag or not, there are still some pretty ugly, dark-coloured knots on the bass side of the guitar.The American guitar gets treated to Fender's thin-skin nitro-cellulose 'lacquer' coat, which shows signs of sinking into the ash's grain here and there.So while it doesn't offer a flawlessly flat finish, it's generally considered to be better for tone than being too thick - just like with high-end acoustic guitars. At 8.5lbs, the Hot Rod '52 is no lightweight either.The Baja Tele arguably gets the prettier pieces of ash in this case - up to four to make up the body by the looks of things - though the grain is only just visible through the milky blonde, gloss polyester finish.This poly coat is thicker and flatter than the Hot Rod's sure-to-age-gracefully cellulose, and will still be this shiny when all that's left is Keef and the cockroaches.As for contouring there's nothing in it: both bodies have that substantial slabby feel for which Teles are loved and loathed in equal measure.Moving to the necks, both guitars receive two important tweaks to vintage spec in the form of a flatter-than-vintage 9.5-inch radius fingerboard and medium-jumbo frets.The fret jobs are uniformly tidy and well executed, making the most of the flatter 'board radius for problem-free bends anywhere on the neck.Aesthetically, the fact that the 12th-fret dots are positioned 'wrongly' too close together is an annoyance to this reviewer, but much more importantly, the neck profiles are inviting; a soft 'V' behind the first couple of frets for the Baja Tele, and a marginally clubbier 'U' in the case of the Hot Rod.As we said last month in the Vintage Hot Rod Strats review, the satin-backed nitrocellulose finish is a qualified success for the Hot Rod series as it still feels stickier than the Baja Tele's full-on gloss polyurethane.Also, for some reason the Hot Rod has an unusually ungainly contour where neck meets headstock on the rear - it doesn't affect tone or playability one bit, but it looks too squared off nonetheless.Both guitars have vintage-style Tele bridges with brass barrel saddles - again considered tonally 'best' for fifties Telecasters.Potential intonation issues are addressed in the case of the Hot Rod by slanting the threads in the saddles so they sit slightly at an angle, lengthening the G string in relation to the D string for example, which is what you need to do to set the intonation correctly.It's hardly an exact science on the single-saddle set-up, but it is a theoretical improvement over the Baja Tele's straight saddles.In practice, there's really very little in it - you could even argue that the intonation fight with this style of bridge is all part of the classic Tele tone and vibe. As it is, only the endlessly fussy will be bothered by intonation niggles on either guitar.More noticeable is that the Baja Tele's bridge and saddles feel marginally less substantial than the Hot Rod's. Whether that's down to the materials used or how well it's coupled to the body isn't clear, but when you tap them, the Hot Rod's bridge sounds fuller, meatier and more solid.There's very little discernible difference between the slot-head machineheads on either guitar; they do their job with stoic understatement and reliability if the myriad examples that have passed through our hands over recent years are anything to go by.The Hot Rod '52 Tele gets a pair of uprated pickups; a 'Custom Vintage Tele' single-coil for the bridge, and a Seymour Duncan Vintage Mini Humbucker at the neck, which is a relatively low output, Alnico V design.It's the kind of pickup you'd find in Gibson Firebirds or Les Paul Deluxes and is a popular mod for Tele players who want more balls from the front pickup (Keef and Ronnie fans in particular). They're controlled via a three-way switch that selects bridge, neck or both, as you'd expect.Also worth a mention are the black pickguards. It might seem like an insignificant thing to some, but the Vintage Hot Rod's guard is made of a high quality material and has lovely bevelled edges.SoundsIf you're in the market for a high-quality, traditional sounding Tele, the American Vintage '52 Reissue should always be your first port of call.It has balls where lesser models can be weedy, and underlines just how fundamental a decent piece of ash, nitro-cellulose lacquer, and top hardware and pickups are to Leo's seminal plank.Good news then that the Hot Rod bears these characteristics, with a full, resonant fundamental tone.Many players find a Tele bridge pickup just too unruly, but if you've got the guts to attack a Fender Bassman or Marshall 'Plexi' you'll soon realise why so much rock 'n' roll rhythm guitar has come from this very set-up.You can knock the tone back to tame some of the high end with more drive, or simply dive in loud and proud for anything from country spank to searing Buchanan-inspired leads.The Seymour Duncan neck pickup adds girth as you'd expect, but thanks to the mini-humbucker design, keeps a good degree of sparkle and chime.Again, knock back the tone pot if you want the feel of a full-size 'bucker, but there's something uniquely musical about a mini-humbucker that begs for tasteful, lightly driven, bluesy leads and big ol' chunky chords.It's a good choice for this guitar, partnering well with the bridge in terms of output, so you get the customary mid-position sound, just with a little extra grunt.", "ItemID": "332895868351", "EndTime": "2018-11-21T21:55:08.000Z", "StartTime": "2018-11-21T21:47:40.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fender-2011-Hot-Rod-52-Telecaster-Tele-Electric-Guitar-U-shape-neck-HSC-/332895868351", "ListingType": "Chinese", "Location": "New York, New York", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/3328958683518080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/nx0AAOSwtKlb9dFa/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/BcUAAOSwKtlb9dFe/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/d8cAAOSwsPNb9dFm/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/D3wAAOSwE9Bb9dFp/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/zBgAAOSw~2Vb9dFs/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/gJsAAOSwYh9b9dFv/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/WRsAAOSw0xtb9dFy/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/C0IAAOSw8Mxb9dF0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/D68AAOSwEphb9dF3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/lpIAAOSwOsFb9dF6/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/mZoAAOSw5cZb9dF8/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/AJwAAOSwKSlb9dF~/$_57.JPG?set_id=8800005007"], "PostalCode": "10022", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "willisis2010", "FeedbackRatingStar": "Purple", "FeedbackScore": 549, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 799.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 799.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "r***i", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 348}, "ListingStatus": "Completed", "QuantitySold": 1, "ReserveMet": true, "ShipToLocations": ["US", "CA", "GB", "DK", "RO", "SK", "BG", "CZ", "FI", "HU", "LV", "LT", "MT", "EE", "AU", "GR", "PT", "CY", "SI", "JP", "CN", "SE", "KR", "ID", "TW", "TH", "BE", "FR", "HK", "IE", "NL", "PL", "ES", "IT", "DE", "AT", "BS", "IL", "MX", "NZ", "SG", "CH", "NO", "SA", "UA", "AE", "QA", "KW", "BH", "HR", "MY", "CL", "CO", "CR", "PA", "TT", "GT", "HN", "JM", "BB", "BD", "BM", "BN", "BO", "EG", "GF", "GG", "GI", "GP", "IS", "JE", "JO", "KH", "KY", "LI", "LK", "LU", "MC", "MO", "MQ", "MV", "NI", "OM", "PK", "PY", "RE"], "Site": "US", "TimeLeft": "PT0S", "Title": "Fender 2011 Hot Rod '52 Telecaster Tele Electric Guitar with U-shape neck + HSC", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "Model", "Value": ["Telecaster Custom Shop"]}, {"Name": "Model Year", "Value": ["2011"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}]}, "HitCount": 2, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 809.0, "CurrencyID": "USD"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": true, "ConditionDescription": "Very good", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}