{"BestOfferEnabled": false, "Description": "Hello eBay,What you are looking at is a customized Fender Floyd Rose Classic Stratocaster Guitar originally manufactured circa 1994 or so (back when shred guitar was quite popular). The serial number is on the headstock so you can check the date of manufacture if you so desire. The previous owner informed me that the FN at the beginning of the serial number meant that it was intended for foreign markets even though it was made and sold in the USA. Hence the \"accidental FN\" placed on this headstock makes it unique, sort of as a \"one off\" in production. That aside, this guitar has been slightly modified from the original HSS versions. As you can see it has an upgraded HS pickup system with two optional pickguard configurations (3 ply tortoise shell and black/w/b). The Humbucker is none other than the Seymour Duncan JB (Jeff Beck) Trembucker (meaning F spaced for Floyd Rose Bridges) in Zebra. The JB was a popular pickup for the 80s guitar shredders, e.g. Vito Bratta of White Lion. The Neck has a single coil Tex Mex (which has a higher output to balance better with the humbucker). The Toggle switch is Gibson style giving you 3 positions only, Bridge, Neck, and Combined. It has only a Volume knob, just the way EVH liked it (no need to dial down it's delicious tone). This guitar screams and squeals with high gain distortion. Another unique upgrade is the brass tremolo block (from killerguitarcomponents.com) which gives you more sustain and tone, better than those crappy pot metal blocks that Fender issues from the factory. The Floyd Rose Bridge is an original, not a copy. I also upgraded the machine heads to the classic Gotoh vintage locking tuners (redundant as far as locking the neck but that's what I had available). You'll notice in the photos that neck (one piece Maple) has a vintage Amber stain that is only wearing at the top of the headstock. What may not show up well in the photos are small micro cracks to the clear coat of the neck due to aging (only on the back of the headstock), the neck and fret boards are mostly unblemished with little to no fret wear. The neck is straight and very smooth to play. Last upgrade is the body (Alder) which unlike all Floyd Rose Strats has a recessed cavity to allow the Tremolo to dip below the plane allowing you to tremolo to a higher pitch (similar to Steve Vai guitars). The best upgrade to this body is the contoured heel (which you will see standard on the Deluxe Strats). Why Fender doesn't make this standard on all their newly manufactured Strats is beyond my comprehension. When you feel the comfort of that heel reaching for the higher frets, it reminds you of cupping a woman's small breast. The body has been repainted in an aged white (known as cool vanilla). Included in the auction is the guitar strap which attaches via Fender/Schaller Strap-lock ready strap buttons (never again worry about dropping your Strat due to strap failure). Also, the case and some of the original parts are included (what you see pictured). As a long time eBay seller, I normally provide free shipping, however, due to the weight, I have no choice but due charge $40 (which is less than it will cost me to ship it, so consider that a discount). Sorry for the lengthy description but I wanted the prospective buyer to understand that he is getting a Strat unlike no other. I'm only selling this because I can no longer find the time to play and want this guitar to go to a good home where it can be enjoyed. No Reserve on this auction. Happy bidding and good luck.", "ItemID": "123513184386", "EndTime": "2018-12-04T02:18:15.000Z", "StartTime": "2018-11-27T02:18:15.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fender-American-Floyd-Rose-Stratocaster-HS-Electric-Guitar-/123513184386", "ListingType": "Chinese", "Location": "Wakefield, Rhode Island", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1235131843868080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/6IsAAOSwwXRb~Jql/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/irAAAOSwrAFb~Jqk/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/oRUAAOSwPmVb~Jqh/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/7voAAOSwH1pb~Jqi/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/1TwAAOSwVHpb~Jqi/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/cpoAAOSw~5db~Jqj/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/tRwAAOSwRbpb~Jqj/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/YZkAAOSwkjJb~Jqi/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/CQgAAOSwPrdb~Jqj/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/3cMAAOSwVXdb~Jqk/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/A3YAAOSwtYZb~Jqj/$_32.JPG?set_id=880000500F"], "PostalCode": "02879", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jjambrad", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 354, "PositiveFeedbackPercent": 100.0}, "BidCount": 8, "ConvertedCurrentPrice": {"Value": 542.05, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 542.05, "CurrencyID": "USD"}, "HighBidder": {"UserID": "0***v", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 747}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Fender American Floyd Rose Stratocaster HS Electric Guitar", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "Body Color", "Value": ["Pink"]}]}, "HitCount": 748, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 552.05, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}