{"BestOfferEnabled": false, "Description": "A Great-looking LP with Classic Standard Feel and Tone The Gibson Les Paul Traditional solidbody electric guitar gives you the construction quality, performance, and great sound offered by the Standard models from the 1980s and '90s. The Les Paul Traditional features a beautiful figured maple top, non-chambered, weight-relieved mahogany body and a mahogany neck with a comfortable '50s rounded shape. It's loaded with '57 Classic and '57 Classic Plus humbuckers for maximum tone and ample output. Set up and ready to go for maximum playability, the Les Paul Traditional lets you create your own musical history! Gibson Les Paul Traditional Solidbody Electric Guitar with Plus Top at a Glance: Classic tone, time-tested tonewoods Plek system setup Powerful, punchy pickups Classic tone, time-tested tonewoods Taking design and visual cues from the Les Pauls of the '80s, the Les Paul Traditional starts with an un-chambered mahogany body with traditional weight-relief holes for a beefy tone that maintains the resonance of modern Les Pauls. The body is capped with a carved maple top and the hand fitted neck tenon sports the rounded, C-shape profile common on the Les Pauls of the '80s and '90s. Plek system setup The Les Paul Traditional is Gibson USA's first model to utilize the revolutionary Plek system - a computer-controlled set-up that carefully measures and dresses each fret, accurately measuring the height between the fingerboard and each string, virtually eliminating string buzz and providing unbeatable playability. And of course your guitar will go through Sweetwater's setup process as well, ensuring a flawless playing instrument the moment you get it in your hands. Powerful, punchy pickups Two of Gibson's best-loved humbuckers - a '57 Classic in the neck position, and a '57 Classic Plus in the bridge - give the Traditional the power, punch, and clarity of Gibson's legendary PAF pickups. Other traditional appointments include vintage-style Gibson speed knobs, classic Kluson-style tuners by TonePros, which offer period-correct looks with a higher tuning ratio, and a chrome Nashville Tune-o-matic bridge and stopbar. Gibson Les Paul Traditional Solidbody Electric Guitar with Plus Top Features:\"Traditional\" weight-relieved mahogany body reduces weight while maintaining sustain Top: Maple plus top Neck: Mahogany, '50s rounded style Fingerboard: Rosewood Pickups: '57 Classic Plus (bridge) and 57' Classic (neck) Controls: Two volume, two tone, 3-way pickup selector switch Bridge: Chrome Nashville Tune-0-matic Tailpiece: Chrome stopbar Tuners: TonePros Kluson-style Condition : Mint Condition and Great Sound !!! Payment We accept PayPal only. Payment is due within 1 days of the auction end. We will ship the item within 7 business day after your payment clears. Shipping We will ship the item by DHL,FedEx. It will be attached a tracking number. Please bid it without worrying. The product received within 5-7 days. Shipping is only available to the address registered in PayPal. Please note that any address not registered in PayPal is not acceptable to ship. Items purchased simultaneously at our store can be shipped in the same box. In that case, refund or discount may be possible because the actual shipping fee may be more reasonable than the total of each shipping fee. Please inquire in detail. Returns Customer service and satisfaction are very important to us. We have an unconditional return policy if notified within 30 days of the receipt of the item. All returned items must be the original condition. All return or refund requests must be made within 30 days of the receipt of the item. Please contact us first for return before you ship it back to us. The postage of the return items is a buyer burden. International Buyers - Please Note: Import duties, taxes, and charges are not included in the item price or shipping cost. These charges are the buyer's responsibility. Please check with your country's customs office to determine what these additional costs will be prior to bidding or buying. These charges are normally collected by the delivering freight (shipping) company or when you pick the item up - do not confuse them for additional shipping charges. We do not mark merchandise values below value or mark items as \"gifts\" Because declared value is insured value.　- Besides US and International government regulations prohibit such behavior.", "ItemID": "163352916186", "EndTime": "2018-11-13T14:36:55.000Z", "StartTime": "2018-11-03T14:36:55.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-Les-Traditional-2016-Heritage-Cherry-Sunburst-3-500-No-Reserve-/163352916186", "ListingType": "Chinese", "Location": "Briarcliff Manor, New York", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1633529161868080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/OXUAAOSwFu1bzcCC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/SocAAOSwredbzcBm/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/fjwAAOSwLKNbzcBw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/V9EAAOSwIaRbzcB5/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/w0MAAOSwI-dbzcCL/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/mucAAOSw3S5bzcCS/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/XCkAAOSwmUFbzcCh/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/5BQAAOSwgA1bzcAV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/8KoAAOSw1ZNbzcAc/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/Od4AAOSwFu1bzcC9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/OC0AAOSwmFhbzcAq/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/lJIAAOSwX0dbzcDM/$_57.JPG?set_id=8800005007"], "PostalCode": "10510", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "premiumguitar", "FeedbackRatingStar": "None", "FeedbackScore": 8, "PositiveFeedbackPercent": 100.0}, "BidCount": 15, "ConvertedCurrentPrice": {"Value": 986.66, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 986.66, "CurrencyID": "USD"}, "HighBidder": {"UserID": "e***p", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 865}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson Les Traditional 2016 Heritage Cherry Sunburst $3,500 No Reserve!!!", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Les Paul Traditional"]}, {"Name": "Body Color", "Value": ["Heritage Cherry Sunburst"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["2016"]}]}, "HitCount": 517, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "TH", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalRefund": "MoneyBack", "InternationalReturnsWithin": "30 Days", "InternationalReturnsAccepted": "ReturnsAccepted", "InternationalShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 996.66, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 30, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["TH"], "GlobalShipping": false, "ConditionDescription": "Mint Condition !!!", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}