{"BestOfferEnabled": false, "Description": "DBZ Barchetta Red Electric Guitar with Hard Case Click images to enlarge Description DBZ Barchetta Red Electric Guitar with Hard Case Guitar is in used condition. There are minor scratches on the back side of the body. Electronics have been tested and are in good working condition. The guitar stand is not included in this sale. The action on this guitar is nice for playing quickly and easily. Case shows wear from being used. There are stickers on the outside of the case. Please look at the pictures to see the condition. This is a great chance to get a great deal on a DBZ Barchetta Red Electric Guitar with Hard Case. Please let us know if you have any questions. Payment We accept Paypal and Cash on pick up. If you are going to pick the item up you must contact us to make arrangements. For Buy it Now and Best Offer purchases we ask for immediate payment, otherwise payment is due within 3 business days of listing end date. Our contact information can be found here http://stores.ebay.com/Alldotcomauctions/Welcome-To-Alldotcom-Auctions.html Shipping We will ship your item within 1 business day after your payment is received and cleared. We ship through USPS, UPS, and FEDEX depending on the item. Some items can be shipped Internationally. All international orders must go through the EBAY GLOBAL SHIPPING PROGRAM, no exceptions. International orders are only shipped via USPS International Priority or International Express Mail. We do not ship 1st class as this is not traceable!! To our International Customers: Please remember we are not responsible for any customs or duties charges incurred. Terms of Sale Items marked SOLD AS IS NO REFUNDS NO RETURNS are NOT eligible for our Standard Return Policy. Returns are accepted only in the case the item was not received as described. You must contact us first through eBay before making a return. Returns received without pre-authorization will incur a 15% restocking fee. About Us Welcome to Alldotcomauctions We are a chain of pawn stores in Indiana. Many of the items we purchase are used. We do our best to test each item and give detailed listings of any known defects. We add many closeup pictures in each listing but are always happy to add more if you request it. Give us a call or email us through eBay with any questions. *****We want to be sure you receive 5 star service***** eBay's feedback system allows you to leave not only feedback but also detailed seller ratings (5 stars). If you feel that we deserve anything less than 5 stars please contact us at so we can do our best to make it right. eBay no longer allows us to show our contact information in a listing. Please follow this link to our contact information http://stores.ebay.com/Alldotcomauctions/Welcome-To-Alldotcom-Auctions.html Contact Us Contact us at Alldotcomauctions we are here for you and happy to be available to our customers. Please message us through Ebay for any questions or requests. Ebay no longer allows us to have our contact information on the listing. Please follow this link to our contact information http://stores.ebay.com/Alldotcomauctions/Welcome-To-Alldotcom-Auctions.html Images sell! Get Supersized Images & Free Image HostingCreate your brand with Auctiva's Customizable Templates. Attention Sellers - Get Templates Image Hosting, Scheduling at Auctiva.com. Track Page Views WithAuctiva's FREE Counter", "ItemID": "264043897952", "EndTime": "2018-12-23T00:11:08.000Z", "StartTime": "2018-11-16T15:35:52.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/DBZ-Barchetta-Red-Electric-Guitar-Hard-Case-/264043897952", "ListingType": "FixedPriceItem", "Location": "La Porte, Indiana", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2640438979528080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/ODUzWDEyODA=/z/0PoAAOSwDEtaO-np/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg2ODI=/z/zuYAAOSwiIxaO-np/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg2ODI=/z/JCsAAOSw-jFaO-np/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg2ODI=/z/jzQAAOSwv~1aO-np/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg2ODI=/z/uagAAOSwA~VaO-no/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg2ODI=/z/E60AAOSwVlVaO-no/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg2ODI=/z/bcsAAOSw9KhaO-np/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg2ODI=/z/aI0AAOSwnw9aO-no/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg2ODI=/z/QvsAAOSw9idaO-np/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODUzWDEyODA=/z/eHwAAOSwAC1aO-np/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODUzWDEyODA=/z/dfgAAOSwiYlaO-np/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODUzWDEyODA=/z/VvkAAOSwy~BaO-np/$_1.JPG?set_id=880000500F"], "PostalCode": "46350", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "alldotcomauctions", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 13606, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 199.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 199.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "8***1", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 122}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "DBZ Barchetta Red Electric Guitar with Hard Case", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["DBZ"]}, {"Name": "MPN", "Value": ["Does not apply"]}]}, "HitCount": 173, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=18207105", "StoreName": "Alldotcomauctions"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Middle East", "South America"], "GlobalShipping": false, "ConditionDescription": "Guitar is in used condition. There are minor scratches on the back side of the body. Electronics have been tested and are in good working condition. The guitar stand is not included in this sale. The action on this guitar is nice for playing quickly and easily. Case shows wear from being used. There are stickers on the outside of the case. Please look at the pictures to see the condition.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}