{"BestOfferEnabled": false, "Description": "Even though we've listed this item as \"used,\" it is simply an open-box unit that has been used temporarily for demonstration purposes or returned from another customer.This is an open-box deal. Please read this for product condition notes:There is wood exposed along the bass side edge of the body top on the upper bout near the pickup switch. There are fine scratches on various parts of this guitar that are not shown in pictures. These fine scratches do not show up well in pictures. Sweetwater is an Authorized PRS Dealer Sweetwater's 2-year warranty Fast, Free Shipping! Nearly every order received by 3PM Eastern ships the SAME DAY! FREE shipping to lower 48 states. Our central location reaches most states in 1-4 business days 99.95% warehouse accuracy Expedited shipping available We are proud to provide some of the fastest turnaround times on eBay. We use FedEx or UPS for most items, and USPS for smaller items. Residents of Hawaii, Alaska, and Puerto Rico should contact us for a shipping quote. In order to ensure you receive your valuable shipment, all orders over $500 will require a delivery signature. Buy with confidence! Sweetwater's been selling on eBay since 2001, with 99.9% positive feedback! More than 30 years in business World-class customer service Fast, FREE shipping Free 2-year warranty on nearly every product Free tech support from audio experts Solidbody Electric Guitar with Mahogany Body, Mahogany Neck, Maple Top, Rosewood Fingerboard, 2 Humbucking Pickups, and Vibrato - Charcoal BurstThe PRS Mark Tremonti Signature solidbody electric guitar gives you a gorgeous, vintage-inspired Singlecut with a striking maple top. Typical of Paul Reed Smith, the fit and finish on this axe are impeccable. You get a fast Pattern Thin neck that plays like butter. Two Tremonti humbuckers, which were designed to compliment Mark's agressive playing, deliver a huge arsenal of tone, while a PRS whammy serves up the vibe with incredible smoothness, stability, and sustain. If you're a reformed axe slinger with a taste for the finer things, you'll totally appreciate the splendid PRS Mark Tremonti Signature. PRS Mark Tremonti Signature Solidbody Electric Guitar at a Glance: The signature axe of a rock legend Mouth-watering visuals and outstanding playability Topped off with a stunning PRS V12 finish The signature axe of a rock legend Mark Tremonti is one of those musically diverse guitarists who makes the rounds in and out of the world of hard rock. His repertoire varies from driving guitar work with Creed and Alter Bridge to a highly technical solo career work with everyone from Sevendust to Larry the Cable Guy. Equally well geared for shredding, riffing, and even the occasional clean passage, this highly versatile axe gives you a massive range of playing options. If you want performance, tone, and style fit for a pro, then pick up your Mark Tremonti Signature from Sweetwater today! Mouth-watering visuals and outstanding playability On the PRS Mark Tremonti Signature, thoughtful touches abound, such as the perfectly formed belly cut that lets the '58 fit you like a glove. From tonewoods to electronics, there's artistry and genius in the details of this gorgeously crafted guitar. But you'd expect nothing less from Paul Reed Smith: a master luthier known for guitars you just can't put down. PRS enjoys a well-deserved reputation for marrying sonic mojo with mouth-watering visuals and outstanding playability. As usual, they've done a terrific job with the Mark Tremonti Signature. Go ahead, pick it up and start playing. Just make sure you don't have anything to do for the next day or so. Topped off with a stunning PRS V12 finish The PRS Mark Tremonti Signature is finished in a stunning PRS V12 finish. If you're seeking a vintage vibe with a sophisticated edge, your search ends here. Over a decade in the making, PRS's V12 finish blends the thin, resonance-enhancing characteristics of a nitro finish with the non-cracking reliability you expect from a modern acrylic finish. It has a classic feel all its own, making your guitar feel like an old instrument; one that will stay flawless-looking for years to come. PRS Mark Tremonti Signature Solidbody Electric Guitar Features: Mahogany singlecut body with belly cut and gorgeous figured maple top Fast Pattern Thin neck with rosewood fingerboard 2 Tremonti humbuckers designed to compliment agressive playing PRS vibrato bridge provides exceptional sustain and tuning stability Handcrafted in the USA Hardshell case included Rock seriously, with the PRS Mark Tremonti Signature! RETURN INFORMATION We want you to be completely happy with your purchase from Sweetwater. If you are not satisfied with your product, you may return it for a refund of the purchase price within 30 days. If your purchase was eligible for Free Shipping, the shipping cost will be deducted from your credit or refund. Returns must be in the complete and original packaging with all accessories and complete documentation (Owner's Manual, warranty card, quick start guides, etc.), show no signs of wear or use, and include a Return Authorization number or be subject to a restocking fee. Some products are not returnable, including: Special orders Software Oversized or overweight items Discontinued products, closeouts, and used products Cymbals Tubes Speakers Drumsticks Guitar strings Personal items (earphones, harmonicas, mouthpieces, etc.)", "ItemID": "173759451796", "EndTime": "2019-02-01T18:22:11.000Z", "StartTime": "2019-01-24T21:38:06.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/PRS-Mark-Tremonti-Signature-w-Tremolo-Charcoal-Contour-Burst-Open-Box-/173759451796", "ListingType": "FixedPriceItem", "Location": "Fort Wayne, Indiana", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1737594517968080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NzQ5WDUwMA==/z/lJIAAOSw~HFcSi9A/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/NzUwWDUwMA==/z/tOMAAOSwtvZcSi9B/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/NzUwWDUwMA==/z/nMwAAOSwc6ZcU2FX/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzUwWDUwMA==/z/~U4AAOSwFSNcU2GD/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzUwWDUwMA==/z/lx4AAOSw0i9cU2Go/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzUwWDUwMA==/z/yWAAAOSwHSdcU2Hf/$_1.JPG?set_id=8800005007"], "PostalCode": "46818", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "sweetwatersound", "FeedbackRatingStar": "RedShooting", "FeedbackScore": 275717, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 3240.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 3240.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "c***m", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 9}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "PRS Mark Tremonti Signature w/ Tremolo - Charcoal Contour Burst (Open Box)", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["PRS"]}, {"Name": "MPN", "Value": ["101586:CT:N"]}]}, "HitCount": 62, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=36121123", "StoreName": "Sweetwater Sound"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 0, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["US Protectorates", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "Oceania", "Southeast Asia", "South America", "BM", "GL", "MX", "PM"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "SKU": "TremontiChd1", "NewBestOffer": false}