{"BestOfferEnabled": false, "Description": "Schecter PT FR Sustainiac Sweetwater Exclusive Plek'd with Case Contents: Schecter PT FR Sustainiac Sweetwater Exclusive Plek'd with Case: Schecter PT FR Sustainiac Sweetwater Exclusive Electric Guitar Schecter SGR-Universal Case This unit was used for a few weeks and in great condition - Looks new -- Barely used! The guitar was Plek'd at Sweetwater and set up with Gibson 700ULMC Brite Wires Electric Strings - .009-.046. The Plek and case together are valued at $330 alone. I have not used it much since I purchased it -- It still has the plastic covering over the pickguard. I bought another guitar and I can't keep both of them :(. Includes original box and packaging. Items are used and sold as-is. Shipping: All shipping is FedEx Ground calculated. Continental US Only Payment: Payment is via PAYPAL only within 3 days after auction end. Please contact with any questions. Schecter PT FR Sustainiac Sweetwater Exclusive Electric Guitar OVERVIEW One-of-a-kind Sweetwater-exclusive! Benefit from everything a modern rock guitarist could ever want, thanks to this one-of-a-kind Sweetwater-exclusive Schecter PT FR S. An alder body yields a balanced sound with equal doses of lows, mids, and highs. A Schecter Diamond Super Rock II pickup delivers vintage humbucker tones with a modern bite, while a Sustainiac circuit gives you endless sustain and harmonic feedback. And if you like pitch effects, you can dive-bomb with confidence with the Floyd Rose tremolo system. Complete with an all-maple neck and Satin Black finish for an eye-grabbing contrasted look, this PT FR S Sweetwater Exclusive is the axe you've been waiting for. Hot-rodded construction Inspired by souped-up and highly modified rock guitars, this Schecter PT FR S exudes a no-nonsense, high-performance attitude. Its blacked-out hardware and electronics sit on a comfortable alder T-style body. A bolt-on hard rock maple neck features a fast Thin-C neck contour and a 22-fret, 14\" radius fretboard. And the PT FR S's neck heel is beautifully contoured, allowing unrestricted access to the guitar's highest frets. Killer pickups for blistering modern tones Schecter didn't load this Sweetwater-exclusive PT FR S with any old pickups. Its Diamond Super Rock II Alnico dual-coil neck pickup is teeming with vintage humbucker tones and a modern-sounding bite, by virtue of its unique 3x3 staggered pole piece configuration. Beyond that, its Sustainiac circuit offers you instant access to completely controllable unending notes. Turn the pickup on with the onboard controls, play a note, and enjoy hearing your guitar sing as long as you keep fretting the note. A 3-way toggle lets you choose from hearing your tone unaffected, a harmonic mode that sounds much like the feedback from a cranked amplifier, and a mix of the two. This is especially helpful if you perform through in-ears without the interaction of a loud amplifier onstage. Schecter-exclusive Floyd Rose Trem Schecter and Floyd rose have partnered to bring you the Floyd Rose Hot Rod double-locking tremolo for a new level of control and stability. Floyd Rose has long been one of the best double-locking tremolo sellers at Sweetwater. And the Hot Rod is a specialized take on their iconic design design that you will only find on select Schecter guitars. The addition of this trem is another appointment that prepares this PT FR S for your best playing. Schecter PT FR S Sweetwater Exclusive Features: One-of-a-kind Sweetwater-exclusive model Alder body yields a balanced sound with equal doses of lows, mids, and highs Diamond Super Rock II Alnico dual-coil neck pickup is teeming with vintage humbucker tones and a modern-sounding bite Sustainiac circuit yields endless sustain and harmonic feedback Floyd Rose tremolo lets you dive-bomb with confidence All-maple neck and Satin Black finish for an eye-grabbing contrasted look Please see my other auctions!!", "ItemID": "292927105367", "EndTime": "2019-01-27T17:00:55.000Z", "StartTime": "2019-01-20T17:00:55.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Schecter-PT-FR-Sustainiac-Sweetwater-Exclusive-Plekd-Case-/292927105367", "ListingType": "Chinese", "Location": "Tracy, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2929271053678080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/uIkAAOSwIw1cK9hw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/ZiIAAOSwI9FcK9iR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/PoAAAOSw-QBcK9iZ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/saAAAOSwjfpcK9ig/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/FwYAAOSwHexcK9im/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/6s4AAOSwAThcK9hs/$_57.JPG?set_id=8800005007"], "PostalCode": "95377", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "golyath", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 320, "PositiveFeedbackPercent": 100.0}, "BidCount": 2, "ConvertedCurrentPrice": {"Value": 670.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 670.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***m", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 212}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Schecter PT FR Sustainiac Sweetwater Exclusive Plek'd with Case", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Schecter"]}, {"Name": "Model", "Value": ["PT"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Color", "Value": ["Black"]}]}, "HitCount": 208, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 680.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}