{"BestOfferEnabled": false, "Description": "Just an awesome, awesome guitar! Here's the deal: it looks beautiful; it plays beautiful; it sounds beautiful. The thing even SMELLS beautiful, lol. It's a 2016 \"Late 60s\" ES-335 TD in what I believe is the \"Lightburst\" nitro finish (hence the sweet, sweet smell of a Gibson rock and roll machine!). It comes equipped with MHS humbuckers that growl like an angry dog. Or cat. Whatever, to each his own - but the point is they GROWL! And they sing! Has a trapeze tailpiece which is, I think, part of what sold me on it in the first place - there's a certain 'give' to the feel of the strings, and it's a good thing. Actually, to me, a great thing! I'd always found 335s to be wound just a little too stiffly - never liked the action much, hard as I tried. This one with the trapeze tail though . . . whoa! It's like the strings just want to melt into the motion of your hand, and your playing becomes effortless. Okay - YOUR playing, because MY playing is pretty much like what a gorilla would do trying to fix a Swiss watch, but trust me - it plays great. \"Okay Mr. Prosey Ebay Posting Dude - if it's so great, why are you letting it go??\" \"Let me tell you a story, my son. Once upon a time, there was a man - a man who met perhaps the best playing, most beautiful sounding guitar he'd ever seen or heard. And he fell in love with that guitar. But he had . . . FAT FINGERS!!! (cue the diabolical organ music)\" Alright, it's not quite that bad, but the deal is this: like the name says, it's a \"Late 60s\" 335, which means it has a \"Late 60s\" neck, which is - according to Gibson - a skinnier neck that every other time period Gibson has ever produced 335s and the necks that go with them. I'm not talking skinny from top to bottom - like the difference between a 50s Les Paul and a Slim 60s Les Paul neck; I'm talking skinnier from side to side, from E to shining e. Which, frankly, is just fine. I'm happy to play her and stumble around like I do on every other fretboard, regardless of neck width, but I can see that in the long run, I may never get totally used to it, especially because I find myself gravitating to chunkier necks as I get older. The neck is deep, however - like from top to bottom - which really does make the neck feel like it's NOT a skinny neck. It does have some good real estate to grab on to, you just have to be aware that you're going to have slightly - SLIGHTLY - less room between the strings. Which makes for some really fast runs, but can - like for me - make chording a little more tricky. Anyways, full disclosure. There is one tiny, tiny, tiny little spot on the back of the neck, shown in a photo. It's like a tiny white speck. Not really sure what it is. Might even come off if I give it a try over the weekend, but that is the ONLY flaw I see on this beauty. Ships with original Gibson case. Additional pics will be posted as requested. Happy to answer any questions. Please wait for a final invoice before PayPal payment so that I can include an accurate ship total. Shipping will be via FedEx, so please - no P.O. Boxes, no FPOs, and NO SHIPPING OUTSIDE U.S.A. Thanks for looking!", "ItemID": "223213693768", "EndTime": "2018-11-12T01:00:19.000Z", "StartTime": "2018-11-02T01:00:19.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2016-Gibson-Late-60s-ES-335-TD-MHS-pickups-Original-Case-/223213693768", "ListingType": "Chinese", "Location": "Houston, Texas", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2232136937688080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/038AAOSwEKpb23CI/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/zzAAAOSwenJb23CS/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/YKIAAOSwnfRb23Cb/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/B9cAAOSwP8db23Ck/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/ZB8AAOSwLSZb23Cs/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/lLQAAOSwCtNb23C2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/ID8AAOSwKDpb23C-/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/EwQAAOSwQTRb23DG/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/5acAAOSwujJb23DP/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/PdAAAOSwqS5b23Db/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/szAAAOSwhwlb22xN/$_57.JPG?set_id=8800005007"], "PostalCode": "77008", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "lcastro", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 344, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 7, "ConvertedCurrentPrice": {"Value": 1970.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1970.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "7***n", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 167}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2016 Gibson \"Late 60s ES-335 TD\" - MHS pickups - Original Case", "HitCount": 494, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 1995.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Central America and Caribbean", "Middle East", "Southeast Asia", "South America", "RU", "AF", "AM", "AZ", "BD", "BT", "CN", "GE", "IN", "KZ", "KR", "KG", "MV", "MN", "NP", "PK", "LK", "TJ", "TM", "UZ", "PO Box"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}