{"BestOfferEnabled": true, "Description": "Shop By Department New Arrivals On Sale Pre-Owned Gear & B-Stock Epiphone G310 SG Guitar in Ebony Mint Condition w/ Six Month Alto Music Warranty! Why you need the Epiphone G310 SG Guitar in Ebony Mint condition w/ six month Alto Music warranty! The Epiphone G-310 SG Electric Guitar is an axe that delivers everything from warm distortion to all-out scream. Crafted with alder body, bolt-on mahogany neck, and rosewood fingerboard with dot inlay. Also has chrome LockTone Tune-O-Matic bridge and stopbar tailpiece for more sustain and easier string changing, and LockTone tuners. Limited lifetime warranty. Features: Alder bodyBolt-on mahogany neck22-fret rosewood fingerboard2 open-coil humbuckersLockTone Tune-O-Matic bridge and stop tailpiece (more sustain,easier string change)Chrome hardwareDot inlaysLimited lifetime warranty Shipping Policy BUYER PAYS SHIPPING-WE SHIP VIA FEDEX OR UPS; IF SHIPPED TO NYS WE MUST CHARGE NYS SALES TAX. WE ACCEPT PAYPAL. *For an additional charge, overnight or upgraded shipping may be available to buyers in the USA. Email us for more info. Alto Music will only ship to the address provided by PayPal, and must be a PayPal confirmed address. Any item(s) purchased at a total exceeding $499.99 (prior to shipping charges and or sales tax when applicable) will require a recipient signature upon delivery. Warranty New condition items carry manufacturer warranty. Contact us through eBay for more details. Return Policy Refunds are issued within 30 days of the date the customer's order is received. Merchandise and packaging MUST be in the same condition as when received. Items may be subject to a restocking fee up to 20%. Alto Music reserves the right to refuse any return if it appears the item has been used. The customer is responsible for return shipping costs. If the customer's order included free shipping, the customer will be refunded order amount, less Alto Music's original shipping cost. There are absolutely no refunds for the following items: Software (if unsealed or registered) Sheet Music Books DVDs Videos CDs Harmonicas, Mouthpieces, Earbuds/Earphones/Headphones(if unsealed), or any item that may come in contact with the mouth, ears or nose. Used merchandise carries a 30-day warranty through Alto Music, unless otherwise specified. New merchandise carries the original warranty issued by the manufacturer. There are no warranties for the following items: Strings Drumheads Drum Sticks Best Offer Policy ***BEST OFFERS*** - Please submit offers directly using the \"make an offer\" button. We will consider your offer as soon as it is received. We will then either accept, decline, or counter accordingly. Please do not send a message or call Alto Music in regards to best offers. If a specific listing of ours does not include the \"make an offer\" button, we are then currently not accepting anything less than the BIN price for that particular item. Thank You!!", "ItemID": "173743794111", "EndTime": "2019-01-25T14:55:01.000Z", "StartTime": "2019-01-16T09:58:07.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Epiphone-G310-SG-Guitar-Ebony-/173743794111", "ListingType": "FixedPriceItem", "Location": "Middletown, New York", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1737437941118080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/JkgAAOSwCgtcPwA0/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/ctMAAOSwbKVcPwAz/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/bV8AAOSwzEVcPwA0/$_1.JPG?set_id=880000500F"], "PostalCode": "10940", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 2, "Seller": {"UserID": "altomusicpro", "FeedbackRatingStar": "TurquoiseShooting", "FeedbackScore": 29752, "PositiveFeedbackPercent": 99.8, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 198.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 198.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "g***p", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1466}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Epiphone G310 SG Guitar in Ebony", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "MPN", "Value": ["EGG1EBCH1"]}]}, "HitCount": 325, "Subtitle": "Mint Condition w/ Six Month Alto Music Warranty!", "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=872300470", "StoreName": "altomusicpro"}, "Country": "US", "ReturnPolicy": {"Refund": "Money back or replacement (buyer's choice)", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalRefund": "MoneyBackOrReplacement", "InternationalReturnsWithin": "30 Days", "InternationalReturnsAccepted": "ReturnsAccepted", "InternationalShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "APO/FPO", "US Protectorates", "Middle East"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "SKU": "EGG1EBCH1EBAYPRO", "NewBestOffer": false}