{"BestOfferEnabled": false, "Description": "The ESP LTD GL-256 solidbody electric guitar means business. Lynch Mob axeman George Lynch's signature guitar gives you a comfortable contoured alder body that fits you like a glove, while the speedy maple neck/fingerboard combo paves the way for extremely fast fretting. This guitar's H-S-S pickup arrangement dishes out everything from chimey cleans to searing high gain, while a vintage-style trem delivers the vibe. The entire package is dressed in a way cool distressed finish. Shred with a guitar that oozes quality, tone, and playability: the ESP LTD GL-256.ESP LTD GL-256 Solidbody Electric Guitar at a Glance:ESP Signature series guitars deliver the goodsESP LTD - the perfect guitar for rock or metalESP guitars: built to rock hardESP Signature series guitars deliver the goodsWorking closely with the influential guitar slingers in their roster, ESP has built an impressive collection of artist signature instruments. From James Hetfield to Jeff Hanneman, these are the who's who of rock and metal guitardom - and their signature axes sport the personalized features and specs that make them unique. ESP's Signature series is all about tone and playability - and because they're members of ESP's affordable LTD series, these guitars offer incredible value. Try an ESP Signature series solidbody electric guitar. You'll be amazed.ESP LTD - the perfect guitar for rock or metalESP LTD guitars was created bring a more affordable version of the classic designs and quality of ESP guitars to a new market. The entire ESP LTD line of instruments feature premium tonewoods, quality pickups, and solid hardware for a lifetime of use. An exacting eye to detail and quality means that every instrument is ready to rock when it leaves the factory. An impressive list of signature guitars, by some of today's biggest guitar heroes, shows the popularity and respect held by ESP LTD. If you're looking for the perfect rock or metal guitar, you need to check out ESP LTD Guitars.ESP guitars: built to rock hardESP started as a manufacturer of after-market guitar parts in Japan in the late 1970s. By the mid-80s ESP was making custom guitars for some of the biggest names in rock. An exacting eye toward playability and craftsmanship has made ESP Guitars one of the most visible and prevalent guitar brands in rock and metal. Their commitment to quality is second to none, and their impressive roster of endorsers proves it. From George Lynch to Ron Wood to Gus G., George Lynch, and Alexi Laiho, ESP makes the guitars that today's guitar heroes use.ESP LTD GL-256 Solidbody Electric Guitar Features:Bolt-on construction; 25.5\" scale lengthComfortable contoured alder body with double cutawayMaple neck with Extra Thin U Neck contour; maple fingerboard1.693\" standard nut; 22 XJ fretsNickel hardware; LTD tunersVintage-style vibrato bridgeESP Designed LH-150 humbucker (bridge); two LS-120 single-coils (middle, neck)", "ItemID": "143022719426", "EndTime": "2018-11-28T21:23:27.000Z", "StartTime": "2018-11-21T21:23:27.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/ESP-LTD-George-Lynch-Signature-GL-256-Distressed-2-tone-Burst-/143022719426", "ListingType": "Chinese", "Location": "Loves Park, Illinois", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1430227194268080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/hCUAAOSwG-xb9ch1/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/EhUAAOSwXAxb9ch3/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/1TIAAOSwqkRb9ch5/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/wssAAOSwfhlb9ch6/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/xL4AAOSwihVb9ch8/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/7YsAAOSwxG9b9ch-/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/2cwAAOSwzcNb9ch~/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/gWsAAOSwPrdb9ciA/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/KTAAAOSwCWRb9ciC/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/0IUAAOSws~pb9ciD/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/qkgAAOSwF5hb9ciE/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/lG8AAOSwylBb9ciG/$_12.JPG?set_id=880000500F"], "PostalCode": "61111", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "eklund.chad", "FeedbackRatingStar": "None", "FeedbackScore": 1, "PositiveFeedbackPercent": 100.0}, "BidCount": 11, "ConvertedCurrentPrice": {"Value": 180.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 180.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "n***n", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 530}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "ESP LTD George Lynch Signature GL-256 - Distressed 2-tone Burst", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["ESP"]}, {"Name": "Model", "Value": ["GL-256"]}, {"Name": "Body Type", "Value": ["Solid"]}]}, "HitCount": 294, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 182.5, "CurrencyID": "USD"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}