{"BestOfferEnabled": false, "Description": "Up for auction is my Fender Modern Player Plus Telecaster. My Grandson noted I have three of these in my music room and he asked, \"Why?\" Well, I love the neck which is Quarter Sawn Maple, the body sculpting, the sound and the Pine body. Don't worry, this is not soft pine, it is Southern Yellow Pine which is called hard pine which is much harder than many hardwoods. It is in player condition with pick marks on the pick guard and minor scuffs in the finish. I could not find any dents but I did not look with a magnifier. Frets are like new. Electronics are original and work as they should. The chrome hardware has some cloudy dull areas that do not rub off. I have no idea what happened but it is there. There are no crack, breaks or repairs. It is all original. This guitar offers a unique mix of Tele and Strat sounds with a little bit of Les Paul with the humbucking bridge pick up. It was made in 2017 according to the serial number. The color is transparent black which is darker than the first stock photo appears on my computer screen. The photos after the first one are the actual guitar. Please excuse the flash artifacts. I had to take the pics indoors. The finish is very high gloss. Shipping is $50.00 to CONUS only. Below is info from Fender. I will not accept returns. Guitar is as described. It plays well. USA ONLY PLEASE. The Fender Modern Player Telecaster Plus HSS offers a rare feature set among Telecaster guitars. This triple-pickup model with a mini-toggle coil-split switch for the Modern Player humbucking bridge pickup. That's a lot of electronics and variety of tone packed into one guitar that's already know for being able to cover a lot of musical ground. This unique model is further distinguished by a pine body whose grain offers a warm look and feel. Other features include C-shaped maple neck, maple fretboard with 9.5\" radius and 22 jumbo frets, Modern Player single-coil Telecaster neck pickup and Modern Player Stratocaster middle pickup, five-way pickup switching, three-ply pickguard, knurled \"chrome-dome\" control knobs, vintage-style Stratocaster string-through-body six-saddle hard-tail bridge, vintage-style tuners and nickel/chrome hardware. Case sold separately. FEATURES Body Body shape: Single cutaway Body type: Solid body Body material: Solid wood Top wood: Not applicable Body wood: Pine Body finish: Gloss Orientation: Right handedNeck Neck shape: C standard Neck wood: Maple Joint: Bolt-on Scale length: 25.5\" Truss rod: Standard Neck finish: GlossFretboard Material: Maple Radius: 9.5\" Fret size: Jumbo Number of frets: 22 Inlays: Dot Nut width: 1.65\" (42mm)Pickups Configuration: HSS Neck: Modern Player Tele Middle: Modern Player Strat Bridge: Modern Player Humbucker Brand: Fender Active or passive: Passive Series or parallel: Series Piezo: No Active EQ: No Special electronics: NoneControls Control layout: Master volume, tone Pickup switch: 3-way and mini coil selector switch Coil tap or split: Coil split Kill switch: NoHardware Bridge type: Fixed Bridge design: 6-saddle vintage-style Tailpiece: String thru body Tuning machines: Vintage-style Color: Nickel/chromeOther Number of strings: 6-string Special features: Pickups Accessories: None Country of origin: China SPECIFICATIONS Series: Modern PlayerBody Shape: TelecasterBody Material: PineBody Finish: Gloss PolyesterNeck: Maple, \"C\" ShapeNeck Finish: Gloss Polyester Fretboard: Maple Fretboard Radius: 9.5\" (24.1 cm)Frets: 22, JumboScale Length: 25.5\" (64.8 cm)Nut Width: 1.650\" (42 mm)String Nut: Synthetic BonePickups: Modern Player Humbucking Pickup (Bridge) Modern Player Strat Pickup (Middle) Modern Player Tele Pickup (Neck)Pickup Switching: 5-Position Blade: Position 1. Bridge Pickup, Position 2. Bridge and Middle Pickup, Position 3. Middle Pickup, Position 4. Middle and Neck Pickup, Position 5. Neck PickupAux Switching: Mini-Toggle Rear Coil Selector SwitchControls: Master Volume, Master ToneHardware: Nickel/ChromeTuning Keys: Vintage Style Tuning MachinesBridge: Vintage Style 6-Saddle Strings-Thru-Body Hardtail BridgeControl Knobs: Knurled Chrome DomePickguard: 3-Ply Black/White/BlackStrings: Fender USA, NPS, (.009-.042 Gauges)", "ItemID": "192754078476", "EndTime": "2018-12-18T02:30:05.000Z", "StartTime": "2018-12-11T02:30:05.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fender-Modern-Player-Telecaster-Plus-Electric-Guitar-Excellent-condition-No-Resv-/192754078476", "ListingType": "Chinese", "Location": "Gardner, Massachusetts", "PaymentMethods": ["PayPal", "CashOnPickup"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1927540784768080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA2NFgxNjAw/z/ErEAAOSwOchcDosw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NFgxNjAw/z/b6UAAOSw~5dcDotB/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NFgxNjAw/z/NhAAAOSwohVcDovN/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NFgxNjAw/z/goQAAOSwWrxcDovf/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NFgxNjAw/z/Q9sAAOSw~HFcDov2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NFgxNjAw/z/9nwAAOSwzZNcDowZ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NFgxNjAw/z/6cgAAOSwgotcDow7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NFgxNjAw/z/0uUAAOSwa1hcDoxL/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NFgxNjAw/z/oowAAOSwF5hcDoxf/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NFgxNjAw/z/9HoAAOSwmvpcDoxy/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NFgxNjAw/z/BegAAOSwZbVcDoyN/$_57.JPG?set_id=8800005007"], "PostalCode": "01440", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "match_shot", "FeedbackRatingStar": "Purple", "FeedbackScore": 774, "PositiveFeedbackPercent": 100.0}, "BidCount": 2, "ConvertedCurrentPrice": {"Value": 255.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 255.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "w***h", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1085}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Fender Modern Player Telecaster Plus Electric Guitar Excellent condition No Resv", "ItemSpecifics": {"NameValueList": [{"Name": "Size", "Value": ["Full Size"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Non-Domestic Product", "Value": ["Yes"]}, {"Name": "Soundboard Style", "Value": ["Flat Top"]}, {"Name": "Model Year", "Value": ["2017"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Body Material", "Value": ["Pine"]}, {"Name": "Country/Region of Manufacture", "Value": ["China"]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Brand", "Value": ["Fender"]}, {"Name": "Model", "Value": ["Modern Player Telecaster Plus"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "MPN", "Value": ["241102542"]}]}, "HitCount": 598, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 260.0, "CurrencyID": "USD"}, "ProductID": {"Value": "131648696", "Type": "Reference"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Very minor scuffs on the body.  Very minor play wear with pick marks on the pick guard.  Frets are like new.  Chrome has some hazing i.e. some not so shiny areas.   I could not find any dents or dings.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}