{"BestOfferEnabled": true, "Description": "This auction is for a full scale Custom Built SG Cherry Red Guitar. I bought the Chinese body from a factory in China back in June with the headstock modification already looking exactly the way you see - Note: I masked the brand name for the photos and this guitar IS NOT that brand. This is a dense and very solid guitar body with a lot of clean resonance and sustain. It sounds and plays great, butter than the Epiphone SG-Pro which has the same electronics. The body and neck are in excellent, as new, shape. I am relisting this from last month but, I will not be lowering my price. The spreadsheet below details my exact costs in this and I am willing to lose some money with the best offer feature but, will not be giving this away.There is no fret wear and the action is set at 2mm on the low E string at the 12th fret and 1.5mm on the high E string with no fret buzz. The neck tension has been adjusted so that it is flat with the strings as installed and the intonation has been set by meter. The tuners are new Kluson Deluxe (The same as Gibson). I installed the new Epiphone ProBucker Alnico 2 chrome pickups and push pull split pickup control harness, new chrome Nashville style bridge and tailpiece, new mushroom head strap buttons, a new 2 ply truss rod cover, new pickup rings and a used Gibson USA Triangle Gig Bag. I modified the control harness and replaced the standard 0.022uF Tantalum capacitors with a 0.022uF Russian Paper-In-Oil (PIO) 400V capacitor for the bridge treble bleed and a 0.015uF 400V Russian PIO capacitor for the neck using original Gibson style wiring placing the capacitor in series BEFORE the tone pot instead of after. I am putting it up for sale because I am building a new project. I am also including a new black nylon strap, a 10' guitar cord, a couple of picks and the truss rod wrench. The last picture shows the guitar shows a brand new pickguard and tenon cover in place on the guitar (not attached) that I can include as an option for an additional $25.00. That is what I paid for it from WD Products a few years ago. If you are interested, add this guitar your cart and request a total (which will commit you to buy) or if making an offer, add a note letting me know.I was trained as a Luthier while I was going to school for Engineering back in the early 70's and worked as a private guitar tech and played in a band part time for most of my engineering career until I had a career change in 2006 that meant I would be traveling a lot (went to work for G.E.). I rebuilt guitars and resold them on Ebay for years under the Seller ID Music_Is_Fun and would sometimes have 50 guitars in my work shop to be customized or repaired and rebuilt. Since I have retired from engineering, I have started up again (I needed something to do to keep from going crazy) but will never get to the volume that I had before (I hope!!!!). My feedback still includes a few of those sales from years ago but the rest have expired out of the list and I had a 100% selling rating for that whole time. I will ship this guitar in a standard guitar box with plenty of packing so that it not damaged in shipment. Shipping will be the cheapest for your area based on package weight (you chose from 2) plus insurance and $5.00 for materials.Following is an accounting of the actual costs of the parts so that you can better understand my asking price and that I did this for the fun of it and not to make money: PartConditionQtyCostExtended1Chinese All Mahogany SG Body and Neck (exactly as received from factory) - CherryNew1$198.00$198.002Kluson Deluxe Tuners (new guitar take-off)New - NGTO1$42.00$42.003Epiphone USA ProBucker 4 Wire Quick Connect Pickups (pair)New1$58.00$58.004Epiphone USA Quick Connect Control Harness with Push/Pull Pots (includes switch and jack) (Replaced Capacitors see below)New1$21.00$21.0050.022 uF 400V Paper in Oil (PIO) Capacitor for Bridge Treble BleedNew1$4.00$4.0060.015 uF 400V Paper in Oil (PIO) Capacitor for Neck Treble BleedNew1$3.00$3.007Chrome Tailpiece and Tune-O-Matic BridgeNew1$12.00$12.008Black Flat Pickup Rings (pair)New3$5.00$15.009Chrome Pickup Ring ScrewsNew8$0.10$0.8010Black Reflector Control Knobs (set of 4)New1$6.00$6.0011Chrome Knob Position Indicators (set of 4)New1$4.50$4.5012Standard Nut - CrèmeNew1$1.50$1.5013Black 2 Ply Truss Rod Cover with ScrewsNew1$5.00$5.0014Chrome Mushroom Head Strap Buttons with Screws and Insulating WashersNew2$1.50$3.0015Gibson Switch RingNew1$4.50$4.5016Light Gauge Steel Round Wound StringsNew1$5.00$5.0017Gibson USA Padded Triangle GigBagUsed1$25.00$25.00 Grand Total: $408.30 Optional ItemConditionQtyCostExtended1Tortoise 4 Ply Pickguard with Tenon CoverNew1$24.50$24.502Chrome Gibson Pickguard ScrewsNew11$0.10$1.10 Total Option: $25.60I priced the used parts as best as I could based on average completed Ebay sales of equivalent items.", "ItemID": "143051766260", "EndTime": "2018-12-16T02:00:31.000Z", "StartTime": "2018-12-14T16:29:03.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Custom-Built-SG-Cherry-Guitar-Epiphone-ProBucker-Pickups-w-Gibson-USA-Gig-Bag-/143051766260", "ListingType": "FixedPriceItem", "Location": "Butler, Pennsylvania", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1430517662608080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg1ODY=/z/h5AAAOSwQg9bw5Cr/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg1NjA=/z/1AMAAOSwlINbw5Ct/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/HQMAAOSwH~Rbw5Dr/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/5n0AAOSwHgRbw5Cx/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/jp8AAOSwAWtbw5C3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/IRgAAOSwnz9bw5C0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/UsgAAOSwahlbw5C9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/BoQAAOSwCtNbw5C~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/bgUAAOSw-pNbw5DC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/36UAAOSwnqpbw5DG/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/roAAAOSwb8Vbw5DJ/$_57.JPG?set_id=8800005007"], "PostalCode": "16001", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "music-is-fun", "FeedbackRatingStar": "Red", "FeedbackScore": 3978, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 400.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 400.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "s***s", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1148}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Custom Built SG Cherry Guitar, Epiphone ProBucker Pickups w Gibson USA Gig Bag", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Unbranded"]}, {"Name": "Body Type", "Value": ["Semi-Hollow Arch Top"]}, {"Name": "Model", "Value": ["SG"]}, {"Name": "Body Color", "Value": ["Cherry Red"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Body Material", "Value": ["Mahogany"]}, {"Name": "Soundboard Style", "Value": ["Flat Top"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Modified Item", "Value": ["Yes"]}, {"Name": "Modification Description", "Value": ["See description"]}, {"Name": "Size", "Value": ["Full Size"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}]}, "HitCount": 41, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "New cherry red Chinese mahogany body, New Epiphone ProBucker Alnico 2 pickups and split pickup control harness, New Kluson Deluxe tuners, New Nashville style chrome tailpiece and bridge, New Allparts Tortoise 4 ply pickguard and premium pickguard bracket, New mushroom head strap buttons, New 2 ply  truss rod cover. Includes used Gibson USA Triangle Gig Bag", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}