{"BestOfferEnabled": false, "Description": "Up for sale, a 1989 Rickenbacker John Kay signature model 381JK in excellent condition and in perfect working order. Introduced in October of '88, this model was limited to just 250 guitars and has been discontinued for decades. Easily one of the rarest and coolest Rickenbacker artist models ever put into production, the 381JK offers a host of features unique to this model, with a pair of HB-1 humbuckers, active electronics (passive mode also available), a phase mini toggle, and a four position rotary switch which offers various single coil and humbucking pickup configurations. Designed to match the feel of John Kay's 1968 Rickenbacker 381 which he used extensively with Steppenwolf, the 381JK signature model has a wider tonal palette than its vintage brethren, and is a powerful, substantial feeling Rickenbacker that can deliver both top end sparkle and more full, rich textures. The guitar weighs in at 9lbs 1oz and has been professionally setup here at Mike & Mike's Guitar Bar with 10-46 strings and low, comfortable action. The neck has a medium C shaped profile with modest shoulders. It's a quintessential C shape that's not too chunky and not too thin, filling the palm comfortably and fretting easily. The bound rosewood fretboard features triangular fretboard inlays that go all the way to the edges of the board as per vintage spec, and the original fretwire is intact and virtually unplayed. There's just a touch of wear beneath the G and B strings on frets 1-2, and the frets have well rounded crowns. The nut measures 1 5/8\" in width and the headstock is fitted with the original chrome Schaller tuning machines, as well as the stock black Rickenbacker truss rod cover/logo. On the body, the electronics are untouched, and the layout with the rotary coil tap switch and phase mini toggle make for a very versatile and intuitive setup. The guitar also has a notably shorter pickup selector switch as per spec for this model, keeping the switch out of the pick path. The dual silver pickguards have John Kay's signature as well as the Steppenwolf wolf logo. The guitar features Rick-o-Sound stereo or mono functionality, and both the top and back of the guitar have checkerboard binding, framing the deep German Carve on both sides of the body. The chrome hardware and plastic parts are extremely clean and cosmetic wear is limited to some vertical lacquer checking on the body. This is a 100% original and well-kept example of a rare, discontinued Rickenbacker model, limited to just 250 guitars worldwide. The original hardshell case is included, along with a warranty/COA of sorts furnished by \"Pick of the Ricks.\" Check out our shop \"Mike & Mike's Guitar Bar,\" and please let us know if we can answer any questions!Shipping in the continental USA will be $80, fully insured and shipped via FedEx Ground. Expedited shipping available for an additional fee at buyer's request. We will happily ship WORLDWIDE, but please contact us for an accurate international shipping quote before bidding or buying, as cost varies by buyer location. International orders will be declared as “merchandise,” and the value of merchandise will be declared as the amount paid. We cannot declare anything as a gift or for a lesser value. No exceptions! The customer is responsible for all taxes and duty, which may be collected upon delivery, as well as any additional charges involved with import. We have all necessary CITES paperwork in-hand to ship rosewood worldwide.We do our best to describe all items with honesty and accuracy, but to be sure, please contact us with any questions or concerns prior to bidding or buying. We require payment within 48 hours of auction end. In the unlikely event of a return, buyer pays all shipping costs. Your positive feedback and five star ratings are very important to us, and we appreciate your communication in resolving any issues!", "ItemID": "163124974252", "EndTime": "2019-01-30T07:44:11.000Z", "StartTime": "2018-06-29T23:06:39.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1989-Rickenbacker-381JK-John-Kay-Limited-Edition-Steppenwolf-Jetglo-w-ohc-381-/163124974252", "ListingType": "FixedPriceItem", "Location": "Seattle, Washington", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1631249742528080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Xg4AAOSwgvFbNraY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/s1cAAOSwc~NbNrao/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/vokAAOSwxipbNrar/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/7lwAAOSwDzFbNrat/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/r38AAOSwUqBbNraw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/HyUAAOSwuVZbNrab/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/APcAAOSwsh5bNrai/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/O1oAAOSwLmlbNral/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/ER4AAOSwIrVbNrad/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/yP0AAOSwT01bNrag/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/UOoAAOSwqWNbNra0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/kXcAAOSwDw9bNray/$_57.JPG?set_id=8800005007"], "PostalCode": "98117", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mmguitarbar", "FeedbackRatingStar": "Red", "FeedbackScore": 2592, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 3499.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 3499.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "c***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 58}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "1989 Rickenbacker 381JK John Kay Limited Edition Steppenwolf Jetglo w/ohc, 381", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Jetglo"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["381JK"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Model Year", "Value": ["1989"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Material", "Value": ["Maple"]}, {"Name": "Brand", "Value": ["Rickenbacker"]}, {"Name": "Body Type", "Value": ["Semi-Hollow"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}]}, "HitCount": 2226, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=269063702", "StoreName": "Mike and Mikes Guitar Bar"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}