{"BestOfferEnabled": false, "Description": "At top 40 guitarsour customers satisfaction is our first concern.All of out items have a 14 day return policy.If after 14 days you are not completely satisfiedwith your purchase, please return it for a full refund....Peace be with you... *all returned items must be in the same condition theywere at the time of sale. All original packing must be included. # Up for Sale is a2018 EVH Wolfgang Special ! Matte Army Drab Finish! This is really cool. You are looking at a 2018 EVH Wolfgang Special. Matte Army Drab Green Finish. This is the Wolfgang Special model which is the top imported model before you get into the USA EVH's. This Wolfgang Special is made in Mexico at the Fender plant in Ensenada. Just like Eddie's! From The Web:Tone and Playability Worthy of Its Name Eddie Van Halen's 35 years of experience and knowledge are brilliantly reflected in the EVH Wolfgang Special solidbody electric guitar. Direct-mounted EVH Wolfgang humbuckers yield tremendous girth and bite, in addition to incredible resonance and sustain. This guitar's graphite-reinforced quartersawn maple neck was carved and rolled to Eddie's exacting standards, creating insane levels of playability. You'll be amazed at how quickly this guitar's D-Tuna shifts it to Drop D tuning and back. The EVH Wolfgang Special solidbody electric guitar reflects a commitment to quality worthy of the extraordinary guitarist it's named after. A rock machine that's built for serious fretwork From its basswood body to its maple neck and fingerboard, this guitar just screams quality - and that's just the tonewoods! This gorgeous guitar is made for serious playing, with a compound-radius fingerboard, an EVH Floyd Rose bridge and locking nut, and direct-mounted EVH humbuckers. The controls are top-notch, too: you get a handy 3-way pickup selector switch and low-friction volume and tone pots for total control over your tone and volume. All the components come together to make a guitar that looks absolutely stunning and plays even better. Quartersawn neck for stability and playability The neck is one of the most important aspects of any instrument, which is why this EVH Wolfgang Special features a quartersawn maple neck. Besides looking good, the straight grain of quartersawn necks is significantly more stable than plain-sawn necks and less likely to warp, twist, or shrink. You'll also love the playability and feel of the compound-radius fretboard on this Wolfgang Special. The fretboard radius goes from 12\" at the nut to a comfortable and flat 16\" radius on the upper frets. Floyd Rose tremolo allows for twisting, bending, and huge dive-bombs First gaining popularity in the 1980s, the Floyd Rose tremolo's locking design keeps your guitar in tune, even if you like to perform extreme pitch pyrotechnics. You can force the whammy bar all the way down to the guitar's body for psychotic dive-bombing. No matter how hard you're shredding, you'll maintain your tuning stability, thanks to the Floyd Rose tremolo's locking design. On top of that, you can easily switch to Drop D tuning, courtesy of the Wolfgang Special's D-Tuna tremolo device! EVH Wolfgang Special Solidbody Electric Guitar Features:Solidbody electric guitar designed by rock legend Eddie Van Halen Basswood body and dual EVH pickups deliver resonant tone, sustain, and crunch Compound-radius allows for exceptional speed and comfort EVH-branded Floyd Rose tremolo allows for twisting, bending, and dive-bombing D-Tuna tremolo device gives you instant Drop D tuning Belly cut allows the guitar to fit comfortably against your torsoTech Specs Body Type: Solidbody Body Shape: Wolfgang Left-/Right-handed: Right-handed Number of Strings: 6 Body Material: Basswood Body Finish: Satin Urethane Color: Matte Army Drab Neck Material: Maple, Bolt-on Neck Shape: Wolfgang Backshape Radius: 12\"-16\" Fingerboard Material: Maple Fingerboard Inlay: Black Dot Number of Frets: 22 Jumbo Scale Length: 25.5\" Nut Width: 1.625\" Nut Material: Floyd Rose locking Bridge/Tailpiece: EVH-branded Floyd Rose locking tremolo w/ D-Tuna Tuners: EVH-branded Neck Pickup: Wolfgang Zebra humbucker Bridge Pickup: Wolfgang Zebra humbucker Controls: 1 x volume, 1 x tone, 3-way pickup selector Our luthier did a complete setup. Frets are in great shape. Neck is Straight. Brand new strings were installed. Gig ready on Arrival! Serial Number: #WG188209M Nut Width: 1.62\" Weight: 8.35 lbs. Case is NOT Included Cosmetics: Excellent Condition. Both Top and Back are very clean. Neck, Fretboard and Headstock are in fine condition. Pristine. Dripping with \"Mojo\" It is used. Not perfect. Look at the pictures closely. They will tell the story. We are here to help! Top 40 guitars is a Veteran owned business.", "ItemID": "132886135940", "EndTime": "2018-12-24T02:05:56.000Z", "StartTime": "2018-12-14T02:05:56.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2018-EVH-Wolfgang-Special-Matte-Army-Drab-Finish-MINT-CONDITION-NO-RESERVE-/132886135940", "ListingType": "Chinese", "Location": "Santee, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1328861359408080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/kCoAAOSwzhZb31mb/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ0MVgxMTEy/z/QrcAAOSweZpb31lu/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU4NlgxMDAy/z/AuAAAOSwd7Fb31vF/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/QacAAOSwVYhb31tX/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzQ3WDU0MA==/z/Y2AAAOSwGmZb31sL/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU4Nlg5MTg=/z/XW0AAOSwdr1b31xq/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/nxUAAOSw-GNb31wt/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/PBkAAOSwwXRb31wB/$_57.JPG?set_id=8800005007"], "PostalCode": "92071", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "top40powertrio", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 13195, "PositiveFeedbackPercent": 99.7}, "BidCount": 25, "ConvertedCurrentPrice": {"Value": 710.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 710.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "w***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 26}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2018 EVH Wolfgang Special - Matte Army Drab Finish! MINT CONDITION! NO RESERVE!!", "ItemSpecifics": {"NameValueList": [{"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Country/Region of Manufacture", "Value": ["Mexico"]}, {"Name": "Model Year", "Value": ["2018"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Brand", "Value": ["EVH"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Army Drab Green"]}, {"Name": "Model", "Value": ["Wolfgang Special"]}]}, "HitCount": 421, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=47416021", "StoreName": "Top 40 Guitars"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 720.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "2018 EVH Wolfgang Special Electric Guitar, Excellent Condition, See ad below for Full Description", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}