{"BestOfferEnabled": false, "Description": "DescriptionHello, I have been selling with eBay from Japan so I can provide you the best service. This item is sold out everywhere in Japan and very hard to get it!!First come, first served.◆ Cosmetic condition Please check the photos for detailed condition of the product. Excellent FERNANDES The Function FST Floyd Rose Electric GuitarManufacturer: FernandesModel: the Function, FST series (with Floyd Rose)Serial No.: L 109298Made in 1980sNeck: Straight Fret : 70%, 22FTruss Rod: No problemWeight: 3650gThere are scratches, paint peeling, sunburns, dents, dirt, rust, and feeling of usageThere's paint peeling on bottom part of body Specification: On the directly attached Floyd Rose which the dropping process (recess) is not done, the jack position is at bottom of body (Mostly, it's guitars with dropping jack that not jamming jack plate and boat-shaped jack's rock strato specification are being sold) With jumbo frets String height is considerably lowered Former owner tried to make this guitar to look more like Gary Moore's Charvel Strat so he added some processes After acquiring 1 Ham's Floyd Rose compatible pick guard, former owner processed it so that the volume set in just beside the rear pickup Pickup: EMG85 Body material might be Alder Counterbore: box shapeGeneral purpose soft case included◆ Operational statusNormal◆IncludingsAll you can see on this photo will be included in a set of a package. You can enjoy playing music.★ This product is also available at other EC sites.We will update as soon as possible, but if this product is sold on another EC site before this is sold on eBay, we are very sorry, but we will cancel the transaction on this site.★ I have examined the item(s) and included my observations as accurate as I could in the description above. Please note that some descriptions may be based on my own opinion. Please read it carefully and understand the condition of the item(s) before bidding. PaymentPlease pay within 3 days after the auction closed.ShippingWorldwide shipping from Tokyo. For goods with hard cases we usually pack hard case and contents by cushioning material (usually bubble wrap). There has never been a problem with that shipping method so far. However, if you want a hard case to be included in cardboard, I can ship by that method if you pay additional $10. This applies only to products that originally have hard case.this item is shipped within 1 business days after payment is confirmed.(Sunday and public holidays is not business day)It takes 4-7 days to be delivered with insurance and trucking number.*We can not use EMS(Japan Post) service for some countries in Central Asia (Kazakhstan, Kyrgystan, Tajikistan etc.) If your shipping address is in these areas, please contact us before bidding. ReturnsReturns are accepted ONLY if the item was not the item described.International Buyers - Please Note: * Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer's responsibility. * Please check with your country's customs office to determine what these additional costs will be prior to bidding/buying. * These charges are normally collected by the delivering freight (shipping) company or when you pick the item up - do not confuse them for additional shipping charges. * We do not mark merchandise values below value or mark items as \"gifts\" - US and International government regulations prohibit such behavior. Feedback: Feedback is very important for everyone participating in community. Please kindly leave feedback once you get the package, we will leave same for you. Thanks! If things happened please contact us before you leave feedback, we will offer you a satisfactory result. We are serious seller and will respond asap.", "ItemID": "192718015881", "EndTime": "2019-01-31T07:54:15.000Z", "StartTime": "2018-11-09T11:46:19.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Excellent-FERNANDES-Function-FST-Floyd-Rose-Electric-Guitar-Ref-No-1704-/192718015881", "ListingType": "FixedPriceItem", "Location": "Gifu", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1927180158818080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/lskAAOSwHp5bbOTv/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/YdsAAOSwIUZbbOT7/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/VWwAAOSwcjdbbOUY/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/c0MAAOSwkeBbbOUV/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/WK4AAOSwEMpbbOT~/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/6nUAAOSwwAVbbOT4/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/FAgAAOSwAllbbOUC/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/wUoAAOSwj3BbbOUG/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/tiQAAOSwMapbbOUI/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/W8IAAOSwoHVbbOUM/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/S9gAAOSw~K5bbOUQ/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDI0WDY0MA==/z/RSgAAOSwOHpbbOUS/$_1.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "product-value", "FeedbackRatingStar": "Red", "FeedbackScore": 2439, "PositiveFeedbackPercent": 99.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 332.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 332.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "v***i", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 350}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "Excellent FERNANDES The Function FST Floyd Rose Electric Guitar Ref No 1704", "ItemSpecifics": {"NameValueList": [{"Name": "Modified Item", "Value": ["No"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}]}, "HitCount": 1805, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1097028905", "StoreName": "product-value"}, "Country": "JP", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller", "InternationalRefund": "MoneyBack", "InternationalReturnsWithin": "30 Days", "InternationalReturnsAccepted": "ReturnsAccepted", "InternationalShippingCostPaidBy": "Seller"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}