{"BestOfferEnabled": true, "Description": "Offered by Dean Johnson's Music, Inc. NOTE: Photos of actual instrument. This is the specific instrument that will be shipped to the buyer. Used Ovation Celebrity CC 057 acoustic electric guitar with Hard Shell Case. The case has some blemishes (see pic). The case handle is missing and is replaced with a cord (see pic). There is a long finish crack on the front of the instrument (see pic). The instrument has other minor blemishes such as scratches and scuffs. This instrument was checked and set-up by our professional guitar technician and is ready to play! RESTOCKING FEE percentages on returns for reason other than a defective or damaged item are as follows: 20% for items $49.99 or less 15% for items $50.00 - $249.99 10% for items $250 or more International buyers please inquire and provide an address, including postal code, for a shipping quote before initiating a purchase with the Buy It Now. Note that US shipping charges do not apply to international shipments. Note that items showing 5 business day handling time, usually ship sooner. For those items, 5 days is typically the longest scenario. Please bear in mind that instruments go through final quality control inspection, set-up, and sometimes transfer from secondary warehouses before shipping. There are rare occasions when a problem is discovered with an item or we experience a crisis (we all do) and a little extra time is needed before shipping. We appreciate your patience in all cases. As can be seen from our rating and feedback, we strive for excellence in all aspects of what we do and typically ship items in a timely manner. NOTE: Whenever FREE “Standard Shipping” (we currently use FedEx) is offered on our items, it only applies to the specified locations noted in the ad description. International and other US customers may inquire for quotes and shipping options. We sometimes offer discounted rates to other locations, in consideration of the continental shipping US rates. NOTE 2: FedEx and UPS do not deliver to PO Boxes (only USPS does). For items that we advertise with standard shipping via FedEx, or UPS, the item must ship to a physical street address. Buyers using Paypal MUST have a physical street address as the ship-to address and it MUST appear in the shipping details of the Paypal receipt that we receive. No exceptions. IMPORTANT NOTICE: If you choose payment via credit card during the payment “checkout” process, the payment is not automatically sent to us (the seller) when you choose that option and complete checkout. In that case, the buyer must contact us directly with the card information for it to be processed through our terminal. Note that, if the buyer’s credit card is a associated with the buyer’s Paypal account, the Paypal option may be selected and then credit card option selected within the Paypal system. In that case, there is no need to contact us, the seller. Also, we ONLY ship to the billing address for the card being used. Note that items of $450 or more will require a signature to be delivered. This is for the seller’s protection, as well as the protection of the buyer’s merchandise. Most of our items ship via FedEx now and they make 3 delivery attempts, including typical Saturday “home delivery”. They do not make Monday “home deliveries”. It is the buyer’s responsibility to be available to sign for and receive the package for delivery or to contact the shipper to arrange a pickup at a local center or to make other arrangement with the shipper, if possible. Also based on Paypal policy, we must ship to the address in the shipping details of the Paypal invoice we receive for the item purchase. We cannot ship to a secondary or gift address, unless it has been added to the Paypal account and selected before payment is made for an item. Shipping to Hawaii, Puerto Rico and other US territories are not eligible for “Standard Shipping” rates. Customers from those locations and Alaska may inquire for shipping quotes and permission to buy. Also, buyers with certain government and/or military (APO/FPO, etc.) addresses are NOT eligible for lower 48 US shipping rates and need to inquire for a shipping quote and permission to purchase. If Paypal is used for payment, in accordance with Paypal’s recommendation and for our protection, we will only ship to the address shown under “Shipping Information” on the Paypal site and payment confirmation email that we receive. For domestic shipping we use FedEx, so buyers must have a physical address associated with their account before Paypal payment is made. Please note that gift addresses and secondary addresses like a work address CAN be added to an account now for domestic shipping purposes. This MUST be done in advance of payment being made. International buyers note 1: FedEx or UPS shipping to many locations. At seller’s discretion and where eligible, USPS Priority or Priority Express may be offered as an option to confirmed PayPal addresses when eligible online payment sources are used. Buyers may inquire for options. We do NOT accept credit cards by phone for international shipments. INTERNATIONAL BUYERS NOTE 2: Be aware that there will likely be import taxes charged on your item upon arrival in the destination country. Any questions you have related to this should be directed to your country’s Customs Office, as we are in no way connected with that aspect of the sale. (It is our understanding and has been confirmed a number of times that items under $1000 AUD going to Australia enter there without import tax) INTERNATIONAL BUYERS NOTE 3: We only declare factual information, including full price, of items sold. We do not falsify customs documents for international sales. Note that we often modify the original instrument boxing by cutting the empty bottom corner point area out and re-taping for convenience and shipping purposes or removing excess depth of the packaging. We do this in a way that does NOT compromise the safety of the contents. Please buy with that understanding. In the unlikely event of shipping damage, buyers, by purchasing, agree to provide any requested photos of damage and of the inner and outer boxing. All boxing and packing materials must be retained for potential inspection by the shipping company and for possible return to the sender after a claim has been finalized. Please buy with that understanding. Though we post that we allow 7 days to make payment after the initiation of purchase, buyers should inform us if there will be a delay in payment being made. Feedback is currently typically left upon request and after we are sure that the buyer has received and is satisfied with the item and purchase. Seller reserves the right to use alternate mode of shipping (USPS, UPS, etc.) at seller's discretion. Our official hours of operation vary from day to day and seasonally (shorter spring and summer hours). We are closed Sundays. Our regular shipping days are Monday through Friday. In addition to PayPal, we accept Visa, MC and Discover as direct (by phone, fax or email) credit card payment options. We cannot accept American Express. E-mail any questions or for additional photos. Florida residents to include 7% sales tax. See my other auctions for great musical deals! Thanks for looking! Check my feedback rating and bid with confidence.", "ItemID": "401444041272", "EndTime": "2019-01-30T19:41:53.000Z", "StartTime": "2017-11-18T01:15:26.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/OVATION-Celebrity-CC-057-acoustic-electric-GUITAR-used-w-HARD-CASE-/401444041272", "ListingType": "FixedPriceItem", "Location": "Zephyrhills, Florida", "PaymentMethods": [], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/4014440412728080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/nwcAAOSwv~1aD4i0/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/JWQAAOSwRbtaD4i3/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/vkoAAOSwbtNaD4i8/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/JzUAAOSwIFtaD4i-/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/cbQAAOSwVA5aD4jB/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/c3AAAOSwnTdaD4jE/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/JW4AAOSwNwlaD4jG/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/088AAOSwTO9aD4jJ/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/3HQAAOSwySlaD4jM/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/wR4AAOSwJtdaD4jP/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/vhYAAOSwbw1aD4kc/$_1.JPG?set_id=8800005007"], "PostalCode": "33542", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "guitarology", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 11207, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 500.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 500.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "c***d", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1663}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "Europe", "Asia", "MX"], "Site": "US", "TimeLeft": "PT0S", "Title": "OVATION Celebrity CC 057 acoustic electric GUITAR used - w/ HARD CASE", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Ovation"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}]}, "HitCount": 1119, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=24697724", "StoreName": "Dean Johnson&#39;s Music"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "TR", "AM", "CN", "KZ", "MV", "RU", "TJ", "UZ", "BY", "EE", "HU", "LV", "MD", "RO", "SI", "UA"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}