{"BestOfferEnabled": false, "Description": "Didn’t get it for Christmas? Here’s your chance! Fender Squire Stratocaster Electric Guitar is in very nice condition with only minor scuffs around the edges(worst seen in pic pointed out). Tested working electronics ,, shipping Fedex ground insured,,,Selling no reserve Please Read below if bidding or making offer: I aim to make your transaction as pleasant as possible and always work with you to resolve any issues that may arise. Your satisfaction is very important . Please contact me first before you decide to open a case with Ebay/Paypal or leave a neutral/negative feedback. I have a 100% customer satisfaction rate with handling any issues and will work to assure your satisfaction in a beneficial way to both parties,,, shipping rates are calculated by ebay by weight to your zipcode from where i ship from,.... NOTE the calculated shipping is not always exact and there have been issues with different amounts showing on auction, and then more or less on a final Invoice.let me know if you see a difference or if you think your paying too much,, i will send you a screen shot of the postage paid page and refund any difference,,,if its more i will not ask for the difference..you will only pay exact or lower....i use recycled packing material when i can, styrofoam , bubble wrap ect, as well as boxes and my hope this will get used again and again...... I mostly use fedex ground or fedex smart post depending on size of package and weight you may pay for fedex smart but receive ground , ground is usually faster , depending where you are,... smart post is slower but less cost, if your package will ship priority mail for close to the same cost, i usually choose so,if you overpaid shipping, i will refund the difference, if you need it faster ask me about priority shipping rates,.....you will receive track#s and shipping info when i print labels, i ship within 24 hr. i do not charge extra for packing or handling fees, calulated by weight to your zipcode from 21520 or 70584 (im usually in one of these two places) if you care to compare...see my feedback and good luck bidding!! Paypal prefered ,Postal m.o. ok (will get same day ship on receipt) other m.o. or checks 7-10 day wait after receipt to ship,...please let me know If you want signiture delivery , payment not made within 2 days automaticly goes to non-pay status, after 6 days auto cancel,as per ebay, unless we hear form you ...... Return Policy: Contact for returns within a reasonable time for most any reason,, change your mind? buyer pays return ( unless item is not as Described.. my fault or honest mistake) Note; most items i sell are preowned ,not new unless discribed so, all used items must be assumed to have minor cosmedic flaws and may need cleaning and or maintence ect...some items selling \"AS-IS\" for obvious reason are no return...these will be listed for parts or repair only,,,.i try to describe in detail and answer all questions,..please ask to avoid misunderstandings...all shipping is insured, ...i do not charge extra for packing or handling fees, calulated by weight to your zipcode from 70584 or 21520 ( I usually at one of there 2 places) if you care to compare...see my feedback and good luck bidding!!", "ItemID": "264097910700", "EndTime": "2019-01-07T02:00:37.000Z", "StartTime": "2018-12-28T02:00:37.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fender-Squire-Stratocaster-Electric-Guitar-/264097910700", "ListingType": "Chinese", "Location": "Sunset, Louisiana", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2640979107008080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/IekAAOSwYTtcHR5Q/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/5kIAAOSwckVcHR5Z/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/2HAAAOSwgVJcHR5p/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/E38AAOSwBkBcHR51/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/YawAAOSw-sVcHR5~/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/Q5cAAOSwkQhcHR6I/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/acUAAOSwUWtcHR6U/$_12.JPG?set_id=880000500F"], "PostalCode": "70584", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "longstrangetrip", "FeedbackRatingStar": "Red", "FeedbackScore": 3860, "PositiveFeedbackPercent": 100.0}, "BidCount": 34, "ConvertedCurrentPrice": {"Value": 152.5, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 152.5, "CurrencyID": "USD"}, "HighBidder": {"UserID": "7***q", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 1}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Fender Squire Stratocaster Electric Guitar", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Color", "Value": ["Green"]}]}, "HitCount": 1276, "PrimaryCategoryIDPath": "619:3858:33034", "Charity": {"CharityID": "104362", "CharityName": "Pancreatic Cancer Action Network", "CharityNumber": 198962, "DonationPercent": 10.0, "Mission": "The Pancreatic Cancer Action Network is the global leader accelerating the pace of research progress for one of the world's deadliest cancers. With an urgent mission to improve outcomes for pancreatic cancer patients and double survival by 2020, the organization, founded in 1999, executes a bold and comprehensive strategy to Wage Hope through research, patient services, advocacy and community engagement.", "LogoURL": "https://i.ebayimg.com/00/s/MjIwWDIzNA==/z/s1cAAOSwHMJYLsNX/$_1.JPG?set_id=8800004005", "Status": "Valid"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 155.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}