{"BestOfferEnabled": false, "Description": "MIJ, made in japan, Gibson, Lespaul, White, SG, Höfner, Duesenberg, Ibanez, ATELIER Z, ARIA, ESP, Caparison, Killer, COMBAT GUITARS, GUYATONE, Greco, Sugi Guitars, TEISCO, DEVISERA, Nil, Bacchus, VANZANDT, Fernandes, Fender Japan, Fujigen, MOON GUITARS, momose, Yairi Guitar, YAMAHA, TOKAI, Zemaitis, VOX, B, C, Rich, Epiphone, Gibson, Gretsch, Suhr, Schecter, Charvel, Jackson, Dean, Tom Anderson, Fender, Paul Reed Smith, Melancon, Mosrite, Rickenbacker, Robert Benedetto, Washburn, Ibanez, kramer, EDWARDS, Burny, Grassroots, 1987 YAMAHA RGX-620J Very Good condition.Made in Japan Down from here, Photo is dent and scratches etc.. About scratches that are hard to see. To make it easy to understand the condition of the scratches, I lighted the light strongly. 1987 YAMAHA RGX-620J Very Good condition.Made in Japan Body Bass wood. Neck Maple. Frets 24F. Scale 24.75inch ( 628mm ) Gibson Medium Scale. Nut Width About 1.69 inch (43mm). Pickup YAMAHA YGH-F1BO. Control 2 Volume. 1 Tone. 3-Way PU Selector. Bridge Rockin' Magic Pro. Machine heads YAMAHA Japan. Color Black. Weight About 7.5 Pound ( 3.4 Kg ). This is Used Guitar. Whammy bar is not original. __However you can Hard arming action. When I got it, The electric circuit was in a no good condition due to deterioration. Therefore,I changed all electric circuits to New ones. It is 3 Pots and 3way toggle switch and Output jack and Capacitor and Wiring. Lost parts are the 3 lock nuts and the back spring cavity plate. There are scratches and dents. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. 1987, Heavy Metal Music was epidemic in japan and RGX has been release. Its looks is suitable for heavy metal music. I love guitar design of RGX series. And, in a conversation with buyers of eBay, I heard many opinions that Rockin' Magic Pro likes. I also like the unique feeling of this Rockin 'Magic Pro. But what I especially like is this looks. The neck is gibson medium scale and, narrow neck. I recommend to short fingers guitar players. RGX will be compared with Ibanez RG. But I think that I resemble an ESP guitars. When I grasp the neck of RGX, I remember the ESP guitar. About guitar play, Current state, the space between the strings and the frets is very narrow. And, remaining amount of the Frets are many. Thanks to that, I feels very easy to play the guitar. About the pickups, It is YAMAHA Original. However the sound of the bridge pickup, I feels like a Stratocaster. I felt like it was a single coil. If you dislike this bridge's output sound, I recommend you change the bridge's pickup. It is cleanliness. I polished with guitar exclusive polish, so it is in a very clean state. I after the finger board cleaning, painted beeswax. The aim is moisturizing and and protection. Current neck condition, very good ! roughly straight ! There is no problem with the Truss rod and it can be adjusted. Remaining the frets are 95% on average. You can play immediately after it is delivered to you. I was set new strings. Regular tuning. ( Inch : 009, 011, 016, 024, 032, 042 ) Guitar playing, is comfortable. All is working well. It is in a very good condition. The Truss rod Wrench is not included. All Original.Note : I changed all electric circuits to New ones. Note : The whammy bar is not original. Look at the photos, please verify by yourself! It will be professionally pack. Double air packing. And ships inside a sturdy cardboard box. This electric guitar is USED. Please consider it when bidding. Thank you. Payment I accept PayPal only. Please pay within 3 days after the auction closed. Shipping Worldwide shipping from Japan! EMS / Shipping includes a tracking number. / / / Destination cost Delivery time / / / Asia : $1004 ~ 7daysUS Canada : $1205 ~ 8 daysEurope : $1406 ~ 10 daysOceania : $1205 ~ 8 daysSouth America : $2408 ~ 12 days This item is shipped within 3 business days after payment is confirmed. Terms of Sale International buyers - Please Note: Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer's responsibility. Please check with your country's customs office to determine what these additional costs will be prior to bidding/buying. These charges are normally collected by the delivering freight (shipping) company or when you pick the item up -do not confuse them for additional shipping charges. Please contact us first with 30 working days for any returns, Buyer pays shipping cost from buyer's country to Japan when being returned. In case of return, the shipping cost won't be refunded. We sell various kinds of Electric guitars to international customers. Our goal is to provide the best quality products and service and your satisfaction is the most important to us. Happy bidding!! Thank you !!", "ItemID": "254072644607", "EndTime": "2019-01-22T05:05:29.000Z", "StartTime": "2019-01-15T05:05:29.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1987-YAMAHA-RGX-620J-Made-Japan-/254072644607", "ListingType": "Chinese", "Location": "Nagoya-shi,Kita-ku, Aichi", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2540726446078080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/UycAAOSw5r1cPE00/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQyNFgxNjAw/z/yc8AAOSwUu5cPE1v/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/G8EAAOSw0LhcPE04/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/D60AAOSwTxhcPE07/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/7V0AAOSwgbdcPE1A/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI0N1gxNjAw/z/ppsAAOSw9z9cPE1F/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/YR8AAOSwk4RcPE1K/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg2MDI=/z/3vAAAOSwlx9cPE1N/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/OlcAAOSw0YlcPE1p/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/VNAAAOSwqLlcPE1d/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/o-sAAOSwoylcPE1j/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU5OVgxNjAw/z/49IAAOSwFZZcPE1s/$_57.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jguitar-shop", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 369, "PositiveFeedbackPercent": 100.0}, "BidCount": 41, "ConvertedCurrentPrice": {"Value": 145.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 145.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "n***n", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 6}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Americas", "Europe", "Asia", "AU"], "Site": "US", "TimeLeft": "PT0S", "Title": "1987 YAMAHA RGX-620J. Made in Japan.", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Yamaha"]}, {"Name": "Model Year", "Value": ["1987"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["RGX-620J"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "MPN", "Value": ["NP26188"]}]}, "HitCount": 699, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "JP", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 147.5, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["APO/FPO", "Africa"], "GlobalShipping": false, "ConditionDescription": "Very Good Condition. This is Used Electric Guitar. The electric guitar when connect to the amplifier, sound output is normal. There are scratches and Dents. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. Please Read the descriptions for details.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}