{"BestOfferEnabled": true, "Description": "Powered by Frooition Pro Shop Search MusicMan John Petrucci JP6 w/Piezo Electric Guitar - Mystic Dream w/ Case Click here to view full size. Full Size ImageClick to close full size. Item Description 2002 MusicMan John Petrucci JP6 w/ Piezo Pickups Electric Guitar in very good condition with only light playwear and a small chip and a couple small dings on edge underneath the knobs (PLEASE SEE PICTURES). Beautiful Mystic Dream finish on the basswood body with black and chrome hardware and pickups. The guitar has a nice low action and the slim profile birds-eye maple neck feels great. The frets are smooth and in very good condition. This is an early model with the original compliment of DiMarzio pickups. The neck pickup is an Air Norton and the bridge pickup is a Steve's Special. These pickups have a great tone and sound powerful. Looking through forums, some Petrucci fans prefer the earlier pickups over the newer incarnations. The piezo has a nice acoustic tone and the center position of the magnetic pickups is voiced for single coil tones. With separate outputs for the magnetic and piezo this is a versatile instrument. Made in the USA. Includes hard shell case and the tremolo arm. Serial Number: G18805 Weight: 8 lbs. 1 oz. A unique instrument with advanced features and great style.The Music Man John Petrucci 6-String Electric Guitar has a maple neck featuring an adjustable truss rod and 5-bolt mounting to the basswood body for perfect alignment and no slipping. A sculpted neck joint allows free access to upper frets. The Petrucci 6 guitar's fretboard has 24 wide, high-profile frets. Schaller locking tuners and custom John Petrucci tremolo complete the hardware. 2 DiMarzio humbucking pickups were specially designated for the Petrucci model. Piezo bridge adds bright, natural string vibration tones to the mix. 3-way selector has a custom center-position configuration. Key Features Model: John Petrucci 6 Body Wood: Basswood Body Finish: High gloss polyester Bridge: Custom John Petrucci Music Man floating tremolo of chrome plated, hardened steel with solid steel saddles Scale length: 25-1/2\" (64.8 cm) Neck radius: 15\" (38.1 cm) Headstock size: Only 5-7/8\" (14.9 cm) long Frets: 24 - High profile, wide Neck Width: 1-11/16\" (43.0 mm) at nut, 2-1/4\" (57.2 mm) at last fret Neck Wood: Select maple Fret markers: Dots Neck finish: Gunstock oil and hand-rubbed special wax blend Tuning Machines: Schaller M6-IND locking with pearl buttons Truss rod: Adjustable - no component or string removal Neck attachment: 5 bolts for perfect alignment with no shifting; Sculpted neck joint allows smooth access to higher frets Electronic Shielding: Graphite acrylic resin coated body cavity and aluminum lined pickguard Controls: 500kohm volume and tone - .022µF tone capacitor Switching: 3-way toggle pickup selector, with custom center position configuration Pickups: HH - DiMarzio Air Norton humbucker - neck; DiMarzio Steve's Special humbucker - bridge About Us Payment Shipping Terms Returns About UsWe offer a large selection of quality pre-owned musical instruments and equipment from the industries finest manufactures including Akai, Ampeg, Boss, Denon, Digidesign, DigiTech, Epiphone, Fender, Gibson, Gretsch, Guild, Ibanez, Korg, Lexicon, Line 6, Mackie, Mesa Boogie, Marshall, Martin, MusicMan, MXR, Neumann, Peavey, Pioneer, PRS, Roland, Shure, Tascam, Taylor, TC Electronic and Yamaha. New gear arrives daily so check our store often. Lighthouse Sound, Inc. is proud to be an authorized dealer of the following brands of guitar effects pedals, pedal boards, amplifiers and accessories: Bearfoot FX, Bigsby, Cooper Stands, Dunlop, Earthquaker Devices, Ernie Ball, EVH, Fender Accessories, Keeley Electronics, Gretsch Accessories, Ken Smith Strings, Lava Cable, Martin Accessories, Mojo Hand FX, RotoSound, SnaKe Oil Strings, Snark Tuners, Suhr Guitars, Amps, Pedals and Pickups, Voodoo Lab and Wampler Pedals About Us Payment Shipping Terms Returns PaymentWe accept PayPal payments. All major Credit Cards are accepted through PayPal including Master Card, Visa, American Express and Discover. About Us Payment Shipping Terms Returns ShippingLighthouse Sound specializes in prompt, safe shipping. We take great care packaging every item to ensure safe shipment to you. We get your gear to you fast, most orders ship within 1 business day of payment clearance. Tracking information is uploaded to eBay and can be viewed from your eBay account. International customers are responsible for any duties, taxes, brokerage or other fees. Please check with your country's customs office to determine what these additional costs will be. These fees vary from country to country and we have no way to calculate them. About Us Payment Shipping Terms Returns TermsSales Tax - 7 % Ohio Sales Tax will be added to the total amount for all purchases delivered to Ohio. We take pride in our customer service and your satisfaction is very important to us. In the rare event that you have a problem with your item please contact us and we'll be happy to help. While all care is taken, any errors, omissions or variations in the item details are unintentional. About Us Payment Shipping Terms Returns ReturnsWe offer a 14 day return policy. Items must be returned to us within 14 days of the original delivery date. We ask that you please return the product in the original product packaging along with all included materials (manual, warranty card, all accessories) and in the original condition that it was received. Buyer is responsible for return shipping and insurance cost. Refunds will be issued upon return of the item less the original shipping charge and a 15% restocking fee will apply. Helpful Links More Items! This listing is currently undergoing maintenance, we apologize for any inconvenience caused. Powered by SixBit's eCommerce Solution", "ItemID": "362511167931", "EndTime": "2019-01-11T13:41:28.000Z", "StartTime": "2018-12-17T05:09:26.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/MusicMan-John-Petrucci-JP6-w-Piezo-Electric-Guitar-Mystic-Dream-w-Case-/362511167931", "ListingType": "FixedPriceItem", "Location": "Salem, Ohio", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/3625111679318080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/Q4EAAOSw29Jb7d6x/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/ElIAAOSwRrlb7d60/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/G9YAAOSwihVb7d63/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/AEcAAOSw6CRb7d67/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/d-wAAOSwqnlb7d6-/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/9qUAAOSwFx5b7d7A/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/odEAAOSwqnVb7d7D/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/zfkAAOSwpTBb7d7G/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/554AAOSwKtlb7d7L/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/4xcAAOSwolpb7d7J/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/hXsAAOSw21Rb7d7O/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/~dAAAOSw22lb7d7R/$_57.JPG?set_id=880000500F"], "PostalCode": "44460", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "lighthouse_sound", "FeedbackRatingStar": "TurquoiseShooting", "FeedbackScore": 33092, "PositiveFeedbackPercent": 99.6, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1659.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1659.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "u***j", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 156}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "CA", "GB", "DK", "RO", "SK", "BG", "CZ", "FI", "HU", "LV", "LT", "MT", "EE", "AU", "GR", "PT", "CY", "SI", "JP", "CN", "SE", "KR", "ID", "TH", "BE", "FR", "HK", "IE", "NL", "PL", "ES", "IT", "DE", "AT", "BS", "IL", "MX", "NZ", "SG", "CH", "NO", "SA", "UA", "AE", "QA", "KW", "BH", "HR", "MY", "CO", "PA", "JM", "BB", "BD", "BM", "BN", "BO", "EG", "GF", "GG", "GI", "GP", "IS", "JE", "JO", "KH", "KY", "LI", "LK", "LU", "MC", "MO", "MQ", "MV", "NI", "OM", "PK", "PY", "RE"], "Site": "US", "TimeLeft": "PT0S", "Title": "MusicMan John Petrucci JP6 w/Piezo Electric Guitar - Mystic Dream w/ Case", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Music Man"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Model", "Value": ["JP-6"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Color", "Value": ["Mystic Dream"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Model Year", "Value": ["2002"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Color", "Value": ["Mystic Dream"]}, {"Name": "Style", "Value": ["John Petrucci"]}]}, "HitCount": 349, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=22579709", "StoreName": "LHSound"}, "Country": "US", "ReturnPolicy": {"Refund": "Money back or replacement (buyer's choice)", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": true, "ConditionDescription": "2002 MusicMan John Petrucci JP6 w/ Piezo Pickups Electric Guitar in very good condition with only light playwear and a small chip and a couple small dings on edge underneath the knobs (PLEASE SEE PICTURES). Beautiful Mystic Dream finish on the basswood body with black and chrome hardware and pickups. The guitar has a nice low action and the slim profile birds-eye maple neck feels great. The frets are smooth and in very good condition. \n\nThis is an early model with the original compliment of DiMarzio pickups. The neck pickup is an Air Norton and the bridge pickup is a Steve's Special. These pickups have a great tone and sound powerful. Looking through forums, some Petrucci fans prefer the earlier pickups over the newer incarnations. The piezo has a nice acoustic tone and the center position of the magnetic pickups is voiced for single coil tones. With separate outputs for the magnetic and piezo this is a versatile instrument.  \n\nMade in the USA. \n\nIncludes hard shell case and the", "QuantitySoldByPickupInStore": 0, "SKU": "43789", "NewBestOffer": false}