{"BestOfferEnabled": false, "Description": "DescriptionHello, I have been selling with eBay from Japan so I can provide you the best service. This item is sold out everywhere in Japan and very hard to get it!!First come, first served.◆ Cosmetic condition:Please check the photos for detailed condition of the product.Greco EG-600 Custom 3PU Diamond Inlay Black Beauty Electric GuitarModel: EG-600 CustomAlthough there's no description of part number etc, it seems that it's EG-600 by references etcSerial No.: G786558Gibson head, with 3PU, head diamond inlay, a 1978s model Made in JapanNeck : StraightTruss rod: UnknownFret : 60%Weight: 4072 gThere are scratches, paint peeling, dents, rust, dirt, and feeling of usage Scratches, bruises, and body damage etc are seen Body, fret, and fingerboard (oil) polishing, also string exchange were done by former owner Dullness on metal parts and deterioration due to age are also seen PU: 3 PU (H - H - H) Fret number: 22 F (scale about 630 mm) Control: 2 Volume, 2 Tone, 3 Way - SW 12F string height: 6 strings about 2 mm / 1 string about 2 mm Peg has been exchanged from the original to GOTOH-made one (there're a former peg hole) Brass nut, brass bridge There are several painting cracks on TOP's painted surface Crack found on Binding PU eschutcheon cracked Vo pod core is missing (half missing but possible to use) There's pick guard hole Hard case from the guitar's era is included There are scratches and dirt on case)◆ Operational status:Sound: NormalBut there's buzzing noisePlease think it needs maintenance◆IncludingsAll you can see on this photo will be included in a set of a package. You can enjoy playing music.★ This product is also available at other EC sites.We will update as soon as possible, but if this product is sold on another EC site before this is sold on eBay, we are very sorry, but we will cancel the transaction on this site.★ I have examined the item(s) and included my observations as accurate as I could in the description above. Please note that some descriptions may be based on my own opinion. Please read it carefully and understand the condition of the item(s) before bidding. PaymentPlease pay within 3 days after the auction closed.ShippingWorldwide shipping from Tokyo. For goods with hard cases we usually pack hard case and contents by cushioning material (usually bubble wrap). There has never been a problem with that shipping method so far. However, if you want a hard case to be included in cardboard, I can ship by that method if you pay additional $10. This applies only to products that originally have hard case.this item is shipped within 1 business days after payment is confirmed.(Sunday and public holidays is not business day)It takes 4-7 days to be delivered with insurance and trucking number.*We can not use EMS(Japan Post) service for some countries in Central Asia (Kazakhstan, Kyrgystan, Tajikistan etc.) If your shipping address is in these areas, please contact us before bidding. ReturnsReturns are accepted ONLY if the item was not the item described.International Buyers - Please Note: * Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer's responsibility. * Please check with your country's customs office to determine what these additional costs will be prior to bidding/buying. * These charges are normally collected by the delivering freight (shipping) company or when you pick the item up - do not confuse them for additional shipping charges. * We do not mark merchandise values below value or mark items as \"gifts\" - US and International government regulations prohibit such behavior. Feedback: Feedback is very important for everyone participating in community. Please kindly leave feedback once you get the package, we will leave same for you. Thanks! If things happened please contact us before you leave feedback, we will offer you a satisfactory result. We are serious seller and will respond asap.", "ItemID": "183575033851", "EndTime": "2019-01-18T01:33:25.000Z", "StartTime": "2018-12-08T18:07:48.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Greco-EG-600-Custom-3PU-Diamond-Inlay-Black-Beauty-Electric-Guitar-Ref-No-1918-/183575033851", "ListingType": "FixedPriceItem", "Location": "Gifu", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1835750338518080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/xVcAAOSwo-Vb~l8l/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/JhUAAOSw8iZb~l8s/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/dSUAAOSwn7Rb~l88/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/bvoAAOSwAVlb~l81/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/zSoAAOSwz05b~l8w/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/hUEAAOSwuQhb~l8~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/qVwAAOSwkB5b~l84/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/qXIAAOSwkB5b~l9E/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/~bUAAOSw27lb~l9I/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/FMwAAOSwdrdb~l9L/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/ZJwAAOSwqiJb~l9O/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/-iEAAOSwBMpb~l9S/$_57.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "product-value", "FeedbackRatingStar": "Red", "FeedbackScore": 2438, "PositiveFeedbackPercent": 99.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 477.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 477.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "k***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 666}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "Greco EG-600 Custom 3PU Diamond Inlay Black Beauty Electric Guitar Ref.No 1918", "HitCount": 995, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1097028905", "StoreName": "product-value"}, "Country": "JP", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller", "InternationalRefund": "MoneyBack", "InternationalReturnsWithin": "30 Days", "InternationalReturnsAccepted": "ReturnsAccepted", "InternationalShippingCostPaidBy": "Seller"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}