{"BestOfferEnabled": false, "Description": "Ibanez model RG870RWZ electric guitar. Lightly used and in near new condition with the exception of one nick in the finish near the back of the guitar (see last 2 photos) Comes with gator case and tools. New strings. One Owner. Ships to the lower 48 states only. Thanks for looking. Full Description: The Sweetwater-exclusive Ibanez RG870RW solidbody electric guitar is purpose-built for high-octane rock! It all starts with the classic RG body style, which is primed for players with attitude. The RG870RW also gives you a fast-playing 5-piece maple/walnut Wizard Premium neck and a resonant, well-balanced basswood body - and it's topped by a drop-dead-gorgeous rosewood cap. You'll love how this guitar feels as soon as you pick it up. When you need some serious firepower, you'll appreciate this guitar's outstanding trio of hot DiMarzio IBZ pickups. Get your hands on an RG870RW Premium Series guitar and prepare to shred!Ibanez RG870RW Solidbody Electric Guitar at a Glance:Plays fast, with a wide tonal rangeFast and smooth Edge Zero II tremoloStable, precise performance from the Zero Point SystemPlays fast, with a wide tonal rangeThe Ibanez RG870RW is built for maximum speed and tonal range, and you'll love how it performs. The basswood body with rosewood top and five-piece maple/walnut Wizard Premium neck give you sustain that won't quit, and a lively response for excellent note-to-note definition. And the Wizard Premium neck plays incredibly fast, perfect for frantic fretwork.Fast and smooth Edge Zero II tremoloThe RG870RW's Edge Zero II bridge with Zero Point System was designed by Ibanez to give you the fast tremolo response and snap you need to pull off sharp bends and flutters. The extreme stability of this knife-edge-style trem's stud lock function is also one of the many reasons it's a favorite among many of today's top shredders. If you're looking for a guitar that can stand up to long playing sessions without losing its tuning, you'll appreciate the RG870RW.Stable, precise performance from the Zero Point SystemYou'll be amazed at the tuning stability of the Ibanez RG870RW, even when you're doing heavy tremolo work. That's because the Edge Zero II tremolo sports the Zero Point System, which consistently returns the bridge to the exact center point. That means you'll always be in-tune after huge dive bombs. You can adjust the Zero Point System by hand without a tool, making the perfect setup easy to attain.Ibanez RG870RW Solidbody Electric Guitar Features:Fast-playing, tonally versatile electric guitarToneful basswood body is topped with a stunning rosewood capSports the 5-pc maple/walnut Wizard Premium neck, one of the fastest-playing necks you can buyEdge Zero II tremolo has a fast response and exceptional stabilityZero Point System ensures the tremolo will return to the exact center position for incredible tuning stability2 DiMarzio humbucking pickups and 1 single-coil give you rich harmonic content with medium-high outputThe Ibanez RG870RW is a wonderfully extreme guitar!", "ItemID": "283339336747", "EndTime": "2019-01-25T14:23:04.000Z", "StartTime": "2019-01-14T22:09:21.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Ibanez-RG870RWZ-Electric-Guitar-Premium-Limited-Edition-Rare-/283339336747", "ListingType": "FixedPriceItem", "Location": "Carbondale, Colorado", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2833393367478080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/TUkAAOSwIsdcFXVA/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/OrkAAOSwO-pcFXVr/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/iTQAAOSwFs1cFXWI/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/PbkAAOSwJ7RcFXWX/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/iRsAAOSwiwZcFXWr/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/msAAAOSwF8FcFXXY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/~8QAAOSwpwBcFXX3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/ngIAAOSwMKxcFXYo/$_57.JPG?set_id=8800005007"], "PostalCode": "81623", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "57vetteb", "FeedbackRatingStar": "Red", "FeedbackScore": 1528, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 539.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 539.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***d", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 270}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Ibanez RG870RWZ Electric Guitar Premium Limited Edition Rare", "ItemSpecifics": {"NameValueList": [{"Name": "MPN", "Value": ["RG870RWG"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["2015/2016"]}, {"Name": "Brand", "Value": ["Ibanez"]}]}, "HitCount": 229, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "14 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "Premium Limited Edition, Rare", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}