{"BestOfferEnabled": true, "Description": "BIG DEAL PAWN & SHOP 1981 George Benson Model Ibanez GB10NT Crafted In Japan W/ Case Description: This is a vintage Ibanez, GB10NT George Benson model with an original Ibanez case. It has finish cracks on the top and the deteriorating binding that has caused staining on the edges of the guitar. The finish is chipped around the binding in some areas. Take a close look at the photos for the condition and, if you want to see specific things or more photos, please contact me and I'll do my best to accommodate your request. There is fret wear. This guitar isn't close to mint, but it is a great player with a great neck, original parts, and a solid pair of original pickups. The Japanese build quality, tone and play-ability is all there and you won't feel guilty about playing it. Please ask any questions that you may have. We have excellent customer service and will answer you promptly. Details Notes: This is a vintage Ibanez, GB10NT George Benson model with an original Ibanez case. It has finish cracks on the top and the deteriorating binding that has caused staining on the edges of the guitar. The finish is chipped around the binding in some areas. Take a close look at the photos for the condition and, if you want to see specific things or more photos, please contact me and I'll do my best to accommodate your request. There is fret wear. This guitar isn't close to mint, but it is a great player with a great neck, original parts, and a solid pair of original pickups. The Japanese build quality, tone and play-ability is all there and you won't feel guilty about playing it. Please ask any questions that you may have. We have excellent customer service and will answer you promptly. Payment PayPal is the ONLY online payment method we accept at this time. Your PayPal account must be a Verified U.S. PayPal Account. We also recommend that you use a Confirmed Ship To Address. Shipping Your item will be shipped within 1 business day(s). After shipping your items will be delivered within 1-10 business days. Terms of Sale Tax applies in: GA About Us Big Deal Pawn & Shop always offers \"Bigger Loans, Bigger Stuff and Bigger Deals.\" Serving Woodstock, Acworth, Kennesaw, Marietta, and Canton Georgia, Big Deal Pawn and Shop makes big deals on everything from electronics and jewelry to tools. We offer sales and loans on many items. Our store makes browsing our high-quality inventory easy to get to. Drop by and visit us today for great deals! Things I Buy: Jewelry, Gold, Silver, Coins, Diamonds, TV's, Laptops, Guns Bravo Store Systems Point-of-Sale Operating System Bravo Omni-Commerce solutions offers Brick & Mortar stores the only fully integrated eBay API that seamlessly & effortlessly combines the in-store Point-of-Sale to all eBay commerce selling activities. Click here & find out why eBay stated \"Bravo has best solved Brick & Mortars can sell on eBay\"", "ItemID": "202542724886", "EndTime": "2018-12-22T12:47:55.000Z", "StartTime": "2018-12-19T20:10:57.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1981-George-Benson-Model-Ibanez-GB10NT-Crafted-Japan-W-Case-BD1064763-/202542724886", "ListingType": "FixedPriceItem", "Location": "Acworth, Georgia", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2025427248868080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/PCoAAOSwLNxcGqXL/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/Ky8AAOSwMpFcGqXL/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/1dQAAOSwPVFcGqXM/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/VUgAAOSworNcGqXM/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/HR8AAOSwYUZcGqXM/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/NqYAAOSwC9hcGqXN/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/NjAwWDgwMA==/z/hX0AAOSw8a9cGqXN/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/M9oAAOSwl1FcGqXN/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/yEkAAOSwXWhcGqXP/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/NjAwWDgwMA==/z/~20AAOSwa3FcGqXP/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/CBcAAOSwjBhcGqXP/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/NjAwWDgwMA==/z/MKgAAOSwQ9lcGqXQ/$_1.JPG?set_id=2"], "PostalCode": "30102", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "bigdealpawn", "FeedbackRatingStar": "Green", "FeedbackScore": 8208, "PositiveFeedbackPercent": 99.7, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1299.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1299.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "n***h", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 174}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "1981 George Benson Model Ibanez GB10NT Crafted In Japan W/ Case (BD1064763)", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Ibanez"]}, {"Name": "Model", "Value": ["GB10NT"]}, {"Name": "Body Type", "Value": ["Jazz"]}, {"Name": "Body Color", "Value": ["Natural"]}, {"Name": "MPN", "Value": ["GB10NT"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["1981"]}]}, "HitCount": 39, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=987312942", "StoreName": "BIG DEAL PAWN AND SHOP"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "Oceania", "Southeast Asia", "South America", "BM", "GL", "MX", "PM"], "TopRatedListing": true, "GlobalShipping": false, "ConditionDescription": "This is a vintage Ibanez, GB10NT George Benson model with an original Ibanez case. It has finish cracks on the top and the deteriorating binding that has caused staining on the edges of the guitar. The finish is chipped around the binding in some areas. Take a close look at the photos for the condition and, if you want to see specific things or more photos, please contact me and I'll do my best to accommodate your request. There is fret wear. This guitar isn't close to mint, but it is a great player with a great neck, original parts, and a solid pair of original pickups. The Japanese build quality, tone and play-ability is all there and you won't feel guilty about playing it. Please ask any questions that you may have. We have excellent customer service and will answer you promptly.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}