{"BestOfferEnabled": true, "Description": "Serial Number is 18258546. Manufacture date was AUGUST 30, 2018. it is literally three months old and played very briefly. It has NO marks on it whatsoever. It is packed back in the box it came in with all documentation and every thing as new. It is a beautiful dream guitar in pristine condition but I really couldn't afford it when I bought it and I can't afford to keep it. I must sell. I included the description and specs below but you can find tons of info on the Paul Reed Smith website and everywhere else. Free Priority Shipping to make it in in time for Christmas. Enjoy. OVERVIEW Extraordinary attention to detail makes for a stellar signature guitar.More than two and half years in the making, the Silver Sky, a vintage-inspired instrument that is at once familiar but also totally PRS through and through, is the end result of a close collaboration between Grammy Award-winning musician John Mayer and Paul Reed Smith, This model was based off of Mayer and Smith’s favorite elements from 1963 and 1964 vintage instruments, resulting in an idealized version of an iconic vintage single-coil guitar. The attention that was paid to every detail sets this guitar apart Some of the more distinctive specifications include, the headstock shape, tuners, neck and fretboard, bridge, and pickups and electronics. The headstock shape is based on PRS’s trademark design, but inverted to both accommodate Mayer’s playing style and also to keep a consistent length of string behind the nut, which makes staying in tune easier. The tuners are a traditional vintage-style, closed-back tuner, but with PRS’s locking design. The neck shape was modeled after 1963/1964 vintage instruments, and the fretboard has a 7.25” radius. The moment your hand grabs this neck, it just feels right. Like the tuners, the steel tremolo takes a classic design and incorporates PRS’s trem arm and Gen III knife-edge screws. The bridge on the Silver Sky is setup flush to the body in the neutral position so that the tremolo bridge only goes down in pitch. By keeping the bridge in contact with the body, the guitar itself is acoustically louder, which improves the signal to noise ratio of the single-coil pickups. The 635JM single-coil pickups are very round and full, with a musical high end that is never “ice-picky” or brash. Other high-quality specifications include a bone nut, a molded metal jack plate that is curved and makes plugging and unplugging a guitar cable hassle-free, retooled knobs, fretwire that is slightly smaller than what you’d find on most PRS electric guitars, and PRS’s double action truss rod (accessible from the front of the headstock for ease of use). Includes gig bag.FEATURESGloss-finished, solid alder body25.5\" scale maple neck with 22-fret, 7.25\" radius rosewood fretboardCustom John Mayer signature PRS single coils with 5-way blade switchPRS-designed vintage-style steel-plate tremolo, PRS locking tuners SPECIFICATIONS BodyBody shape: Double cutawayBody type: Solid bodyBody material: Solid woodBody wood: AlderBody finish: GlossOrientation: Right handedNeckNeck shape: Custom signatureNeck wood: MapleJoint: Bolt-onScale length: 25.5 in.Truss rod: Dual-actionNeck finish: GlossFretboardMaterial: RosewoodRadius: 7.25 in.Fret size: MediumNumber of frets: 22Inlays: BirdsNut width: 1.65 in. (42 mm) BonePickupsConfiguration: SSSNeck: Custom single-coil Artist SignatureMiddle: Custom single-coil Artist SignatureBridge: Custom single-coil Artist SignatureBrand: PRSActive or passive pickups: PassiveSeries or parallel: ParallelControlsControl layout: Master volume, tone 1, tone 2Pickup switch: 5-wayHardwareBridge type: Tremolo/VibratoBridge design: PRS plate-styleTuning machines: PRS lockingColor: NickelOtherNumber of strings: 6-stringSpecial features: Signature modelCase: Gig bag Country of origin: United States", "ItemID": "192756080888", "EndTime": "2018-12-19T04:13:51.000Z", "StartTime": "2018-12-13T02:00:33.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2018-PRS-John-Mayer-Signature-Silver-Sky-Electric-Guitar-/192756080888", "ListingType": "FixedPriceItem", "Location": "Deltona, Florida", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1927560808888080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/ieYAAOSwtaBcERmx/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/1cAAAOSwhfRcERrt/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/TWcAAOSwzd9cERs3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/oDoAAOSwP8dcERn1/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/UAAAAOSwvqVcERtS/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/hVoAAOSwrAFcERqh/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/oiwAAOSwGmZcERqu/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/pSMAAOSwxO9cERq5/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/4EIAAOSw-GNcERti/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/j-YAAOSwuNNcERp4/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/Bq0AAOSwUWtcERoT/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/Xd8AAOSwvytcERpo/$_57.JPG?set_id=8800005007"], "PostalCode": "32725", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "gijoe119", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 270, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1995.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1995.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "n***n", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 59}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2018 PRS John Mayer Signature Silver Sky Electric Guitar", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Frost White"]}, {"Name": "Brand", "Value": ["PRS"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Model", "Value": ["John Mayer Signature Silver Sky"]}, {"Name": "Model Year", "Value": ["2018"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Size", "Value": ["Full Size"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Product Line", "Value": ["John Mayer Signature Silver Sky"]}, {"Name": "Soundboard Style", "Value": ["Solid Electric Guitar"]}, {"Name": "MPN", "Value": ["2018"]}]}, "HitCount": 160, "Subtitle": "Manufacture Date AUGUST 30, 2018.", "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Absolute mint condition. There are no blemishes, scratches, pick marks.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}