{"BestOfferEnabled": false, "Description": "MIJ, made in japan, Gibson, Lespaul, White, SG, Höfner, Duesenberg, Ibanez, ATELIER Z, ARIA, ESP, Caparison, Killer, COMBAT GUITARS, GUYATONE, Greco, Sugi Guitars, TEISCO, DEVISERA, Nil, Bacchus, VANZANDT, Fernandes, Fender Japan, Fujigen, MOON GUITARS, momose, Yairi Guitar, YAMAHA, TOKAI, Zemaitis, VOX, B, C, Rich, Epiphone, Gibson, Gretsch, Suhr, Schecter, Charvel, Jackson, Dean, Tom Anderson, Fender, Paul Reed Smith, Melancon, Mosrite, Rickenbacker, Robert Benedetto, Washburn, Ibanez, kramer, EDWARDS, Burny, Grassroots, 1989 Burny FERNANDES RLG-50 '59 MODEL Plain Top All Original Excellent condition.Made in Japan Down from here, Photo is dent and scratches etc.. About scratches that are hard to see. To make it easy to understand the condition of the scratches, I lighted the light strongly. 1989 Burny FERNANDES RLG-50 '59 MODEL Plain Top All Original Excellent condition.Made in Japan Body Maple Top, Mahogany Back. Neck Mahogany. Frets 22F. Scale 24.75inch (628mm) Gibson Medium Scale. Nut Width About 1.69 inch (43mm). Pickup VH-1. Control 2 Volume, 2 Tone, 3-Way PU Toggle switch. Bridge Tune O Machic. Stop Tailpiece. Color Cherry Sunburst. Weight About 8.27 Pound ( 3.75 Kg ). This is Used Guitar. The Strap pin has been changed to lock type. The clear coating of the head has deteriorated. The hard case has aged deterioration. There are scratches and dents. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. It was manufactured in 1989. It was manufactured 29 years ago. It keep excellent condition. The protective sheet has not peeled off the electric cavity plate. Fret edge binding etc... It is very polite making. Accuracy of the product is high. High quality wood is used for this RLG. I think that you can understand immediately. Thanks to that, Un pluged sound is be powerful. From the body, the vibration of the sound is transmitted well. Please look at the Maple top. This Plane Top is very beautiful. You can see the birds eye maple top by view angle. All parts, all made in japan. This RLG has dignity of vintage guitar. Burny is Great ! About guitar play, Current state, the space between the strings and the frets is standard. Mounted VH-1 Pickups in Neck and Bridge. This VH-1 Pickup is excellence. And worldwide assessment is high. Official name is \"Vintage Humbucker HISTORY\". I feel the good distortion sound. It is a very comfortable pickup !! It is cleanliness. I polished with guitar exclusive polish, so it is in a very clean state. I after the finger board cleaning, painted beeswax. The aim is moisturizing and and protection. Current neck condition, very good ! roughly straight ! There is no problem with the Truss rod and it can be adjusted. Remaining the frets are 93% on average. You can play immediately after it is delivered to you. I was set new strings. Regular tuning. ( Inch : 009, 011, 016, 024, 032, 042 ) Guitar playing, is comfortable. All is working well. It is in a very good condition. The Truss rod Wrench is not included. All Original.Note : The hard case key has been lost. Note : The Strap pin has been changed to lock type. The Hard Case Included. Look at the photos, please verify by yourself! It will be professionally pack. Double air packing. And ships inside a sturdy cardboard box. This electric guitar is USED. Please consider it when bidding. Thank you. Payment I accept PayPal only. Please pay within 3 days after the auction closed. Shipping Worldwide shipping from Japan! EMS / Shipping includes a tracking number. / / / Destination cost Delivery time / / / Asia : $1204 ~ 7daysUS Canada : $1405 ~ 8 daysEurope : $1606 ~ 10 daysOceania : $1405 ~ 8 daysSouth America : $2608 ~ 12 days This item is shipped within 3 business days after payment is confirmed. Terms of Sale International buyers - Please Note: Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer's responsibility. Please check with your country's customs office to determine what these additional costs will be prior to bidding/buying. These charges are normally collected by the delivering freight (shipping) company or when you pick the item up -do not confuse them for additional shipping charges. Please contact us first with 30 working days for any returns, Buyer pays shipping cost from buyer's country to Japan when being returned. In case of return, the shipping cost won't be refunded. We sell various kinds of Electric guitars to international customers. Our goal is to provide the best quality products and service and your satisfaction is the most important to us. Happy bidding!! Thank you !!", "ItemID": "253970580531", "EndTime": "2018-11-15T04:00:13.000Z", "StartTime": "2018-11-08T04:00:13.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1989-Burny-RLG-50-59-MODEL-Plain-Top-All-Original-Excellent-Made-Japan-/253970580531", "ListingType": "Chinese", "Location": "Nagoya-shi,Kita-ku, Aichi", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2539705805318080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/qhIAAOSwA29b46RS/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY3/z/W2AAAOSwqnVb46Re/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/n2QAAOSwRYNb46Tr/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/24AAAOSwCK1b46SA/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/NNcAAOSwOrpb46SO/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNTk5/z/ZcYAAOSwX6Rb46SA/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg2NTQ=/z/7v8AAOSwlINb46SY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg3MzA=/z/nLAAAOSw9h9b46Sf/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU5OVgxNjAw/z/0JsAAOSwoxpb46TA/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/8JsAAOSw5oxb46TJ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/JeoAAOSwa29b46TO/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTM5OVgxNjAw/z/WMAAAOSwF-9b46TT/$_57.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jguitar-shop", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 369, "PositiveFeedbackPercent": 100.0}, "BidCount": 11, "ConvertedCurrentPrice": {"Value": 413.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 413.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "u***u", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 41}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Americas", "Europe", "Asia", "AU"], "Site": "US", "TimeLeft": "PT0S", "Title": "1989 Burny RLG-50 '59 MODEL. Plain Top. All Original. Excellent. Made in Japan.", "ItemSpecifics": {"NameValueList": [{"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Brand", "Value": ["Burny"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Series", "Value": ["Original"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Cherry Sunburst"]}, {"Name": "Model", "Value": ["RLG-50 '59 MODEL"]}, {"Name": "Model Year", "Value": ["1989"]}, {"Name": "Modified Item", "Value": ["Yes"]}, {"Name": "Modification Description", "Value": ["The Strap pin has been changed to lock type."]}]}, "HitCount": 576, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "JP", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 418.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["APO/FPO", "Africa"], "GlobalShipping": false, "ConditionDescription": "Excellent Condition. This is Used Electric Guitar. The electric guitar when connect to the amplifier, sound output is normal. There are scratches and Dent. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. Please Read the descriptions for details.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}