{"BestOfferEnabled": false, "Description": "Authentic semi-hollow Telecaster tone at its most affordable. Light in weight, but not sound, the Deluxe Telecaster Thinline is crafted with timelessly elegant style and authentic Fender tone. Crisp and articulate, with a versatile voice that cuts through a busy mix, this stage-tested design is the ideal combination of modern features and traditional aesthetics. With a little bit of extra ‘magic’ up its sleeve, this instrument is as flexible as it is distinctly stylish. Two noise-free, highly articulate Vintage Noiseless Tele pickups produce rich, detailed tone, with the balanced string response, definition and twang you’ve come to expect from a Tele. The semi-hollow construction imparts seductively warm overtones to the traditional Tele sound, creating a slightly throatier voice. Four-way switching adds an exciting dimension to the traditional Tele pickup combinations—position four combines the bridge and neck pickups in series for hotter output and punchier midrange. Enjoy increased sustain and slightly thicker tone that complements the famous Tele twang, thanks to the modern six-saddle sting-through-body bridge with block saddles. A contoured neck heel and 4-bolt asymmetrical neck plate make it easy to comfortably reach the upper registers of the neck. The flatter 12”-radius fingerboard makes it easy to play fast leads and perform deep bends without fretting out. Locking short-post tuning machines with vintage-style buttons provide increased break angle at the nut for buzz-free playing and enhanced tuning stability, along with quicker string changes. Classic aesthetic touches include nickel/chrome hardware and a four-ply aged white pearloid pickguard, along with knurled flat-top control knobs and a black switch tip. For players who want classic Fender semi-hollowbody tone with a bit of edge, the Deluxe Telecaster Thinline is ready to step up with its modern features and authentic style. Includes gig bag. FEATURES Body Body shape: Single cutaway Body type: Semi-hollow or chambered body Body material: Solid wood Top wood: Not applicable Body wood: Alder Body finish: Gloss Orientation: Right handed Neck Neck shape: C Neck wood: Maple Joint: Bolt-on Scale length: 25.5 in. Truss rod: Standard Neck finish: Satin Fretboard Material: Maple Radius: 12 in. Fret size: Tall narrow Number of frets: 22 Inlays: Dot Nut width: 1.65 in. (42 mm) Pickups Configuration: SSS Neck: Vintage Noiseless Middle: Not applicable Bridge: Vintage Noiseless Brand: Fender Active or passive pickups: Passive Series or parallel: Series Piezo: No Active EQ: No Special electronics: None Controls Control layout: Master volume, tone Pickup switch: 4-way Coil tap or split: No Kill switch: No Hardware Bridge type: Fixed Bridge design: 6-saddle string through body hardtail with block saddles Tailpiece: Not applicable Tuning machines: Deluxe sealed/locking Color: Nickel Other Number of strings: 6-string Special features: Electronics Case: Gig bag Accessories: None Country of origin: Mexico", "ItemID": "183636583839", "EndTime": "2019-01-20T18:27:15.000Z", "StartTime": "2019-01-14T19:06:15.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fender-Deluxe-Thinline-Telecaster-Maple-Fingerboard-Candy-Apple-Red-/183636583839", "ListingType": "Chinese", "Location": "Uniontown, Pennsylvania", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1836365838398080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Om8AAOSwnKFcM6LE/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/C2IAAOSwYV5cM6L8/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/7tgAAOSwrAFcM6LQ/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/X0gAAOSwgnJcM6Lf/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/zOkAAOSw1jpcM6Kt/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/77oAAOSwHF1cM6MJ/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/gdUAAOSwmaJcM6Kz/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/7BcAAOSwSONcM6MO/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/bB4AAOSwEVlcM6Kk/$_12.JPG?set_id=880000500F"], "PostalCode": "15401", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "theletterblack", "FeedbackRatingStar": "Yellow", "FeedbackScore": 21, "PositiveFeedbackPercent": 100.0}, "BidCount": 13, "ConvertedCurrentPrice": {"Value": 700.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 700.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "m***y", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 194}, "ListingStatus": "Completed", "QuantitySold": 1, "ReserveMet": true, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Fender Deluxe Thinline Telecaster Maple Fingerboard Candy Apple Red", "ItemSpecifics": {"NameValueList": [{"Name": "Body Material", "Value": ["Maple"]}, {"Name": "Brand", "Value": ["Fender"]}, {"Name": "Model", "Value": ["Telecaster Thinline"]}, {"Name": "Body Color", "Value": ["Red"]}]}, "HitCount": 306, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 710.0, "CurrencyID": "USD"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}