{"BestOfferEnabled": false, "Description": "Squier Esprit Masters Series chambered 2004 Korean I am selling all of my Masters Series & Series 24 guitars because I have moved on to Steinberger and PRS. These are exceptional mid-level guitars, but I don't need them anymore, so it is time for this amazing Esprit to go. It is ready for the stage as is. It is a revival of the great Masters Series Fender Esprit from the early 1980's that was adopted by Robben Ford as his signature model. This is one of the great Masters Series guitars that Fender allowed to grace the Squier line. Many of us know modern Squiers as bargain-basement instruments, however Fender allowed their Squier brand to have a renaissance in the early 2000’s with the Masters Series and Series 24 guitars. Squier produced excellent-quality mid-level instruments that were Squier-branded DeArmond guitars (which Fender had recently acquired) like the M-77, classic Fender, and one new design (the M-80). These guitars were made in the excellent Cort plant in Korea, instead of China like most of the cheaper Squier line. These guitars were a combination of Fender and Gibson: twin humbuckers each with their own volume and tone, a three way toggle switch, set necks, big block pearloid fret markers with a dark abalone slash, 24 3/4 Gibson scale, satin-silver finished hardware (on the Masters), Tuneomatic-type bridges with stop bars, and most models had a 3x3 tuner arrangement and carved tops. While some were based on classic Fender designs like the Telecaster and Esprit, others included the DeArmond version of the Gibson Les Paul (the M-77) and the SG (M-73). It is kinda freaky to see a Squier \"Les Paul\" or “SG”. This Squier Esprit guitar is a chambered guitar with a carved top, elegant satin silver hardware, with binding on the body and neck. The set mahogany neck has a rosewood fingerboard with jumbo nickel silver frets and block inlays, and a 24 3/4\" scale length. This guitar features two Seymour-Duncan designed humbucking pickups. It has a Duncan-Designed HB102 set that the Seymour Duncan website describes thusly “The HB-102 was modeled after Seymour’s favorite humbucker combination, the USA-made SH-4 JB bridge and SH-2n Jazz Model neck set. Like the HB-101s, these pickups also use Alnico 5 magnets, but have a hotter winding spec, based on the world’s most popular “hot-rodded” humbucker. The bridge pickup is Trembucker-spaced.” These are great-sounding pickups that go from jazz and blues to rock and metal. The 24 3/4 inch scale allows you to more easily play some of the “stretchier” chords. This chambered Esprit is in nice shape, both playing and cosmetically, except for a little bit of scraping on the tip of the headstock and a short section of binding damage where your arm would rest while you play, both courtesy of a clumsy prior owner. It comes with an ok TKL gigbag. I am working hard to skinny down my instrument collection to only the pieces I need for playing/recording, so check back because you never know what guitar, pedal, pickup, or amplifier I have decided to part with in any week. If you are only purchasing one item, please pay within three days of the auction ending. I would like to keep things pleasant and avoid reporting anyone as a non-payer. *** If you plan on bidding on or win more than one auction, consider waiting to pay and sending me a message detailing your bidding plans. Once all of the auctions you are interested in are over, I can combine everything on one invoice for you so you will have a lower shipping cost if I can ship all of the items together. Large items like guitars will each be shipped in separate boxes.*** Bidders with less than 10 transactions will have their bids cancelled. I have repeatedly seen people open an account, bid and win an item, and then disappear and never pay for what they have won, which is not fair to the honest bidders. Normal 0 false false false EN-US X-NONE X-NONE", "ItemID": "142982425675", "EndTime": "2018-10-30T15:21:36.000Z", "StartTime": "2018-10-21T00:05:40.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Squier-Esprit-Masters-Series-set-neck-chambered-2004-Korean-/142982425675", "ListingType": "Chinese", "Location": "Brunswick, Ohio", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1429824256758080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/46kAAOSwItJaejRd/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/47UAAOSwItJaejRk/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/7mkAAOSwzRFaejRo/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/7ncAAOSwzRFaejRu/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/Os0AAOSw-uhaejR1/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/mJsAAOSwNt1aejR7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/0vQAAOSwndZaejSB/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/ZM8AAOSwjSJaejQg/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/rzwAAOSwIspaejQz/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/ZTAAAOSwjSJaejRD/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/yXAAAOSwBp9aejSP/$_57.JPG?set_id=8800005007"], "PostalCode": "44212", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "capitolistking", "FeedbackRatingStar": "Purple", "FeedbackScore": 824, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 389.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 389.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "0***c", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 0}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Squier Esprit Masters Series set neck chambered 2004 Korean", "ItemSpecifics": {"NameValueList": [{"Name": "Size", "Value": ["Full Size"]}, {"Name": "Body Color", "Value": ["Wine"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Esprit"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Country/Region of Manufacture", "Value": ["Korea, Republic of"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Model Year", "Value": ["2004"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Soundboard Style", "Value": ["Archtop"]}, {"Name": "Brand", "Value": ["Squier"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}, {"Name": "Body Type", "Value": ["Semi-Hollow"]}]}, "HitCount": 158, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 394.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "Used guitar in good shape.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}