{"BestOfferEnabled": false, "Description": "All photos are of the actual item for sale. Sold As-Is This guitar's neck pickup is not working properly. There are scratches all over body of the guitar. Please see the photos above; they are of the actual item for sale. We receive used gear on a daily basis. Some with slight cosmetic flaws, functionality issues, and sometimes it is completely broken. Our goal is to move it out of our warehouse ASAP! After the product is tested and photos are taken, it is boxed, sealed, and stored in our warehouse. We are unable to provide additional pictures. Everything we know about the condition, functionality, and included accessories is stated here. We do our best to describe everything as accurately as we can. Please know that if there is a deeper problem not found from our initial testing, repair is up to the buyer. Bid accordingly. Maybe conservatively. Thank you for understanding that we're selling this as-is, and pass the as-is savings onto you. Gibson Les Paul Standard HP 2018 Left-handed - Hot Pink Fade You waited, you saved, and now it's time. Time to get your hands on one of the most iconic electric guitars the world of music has ever seen — the Les Paul Standard. It features that unmistakable body design and classic asymmetrical SlimTaper neck profile that lets you riff, bend, and tap through any style you desire. The AAA+ figured maple top conjures the classic era of rock and the many players who have brought the Les Paul Standard to the stage decade after decade. Vintage humbucking pickups let you move through a veritable world of tones. Tech Specs Body Type: Solidbody, Ultra Modern relief Body Shape: Les Paul Left-/Right-handed: Left-handed Number of Strings: 6 Body Material: Mahogany Top Material: AAA+ Figured Maple Body Finish: Gloss Nitrocellulose Lacquer Color: Hot Pink Fade Neck Material: Mahogany Neck Shape: Asymmetrical Slim Taper Radius: Compound Fingerboard Material: Rosewood, white binding Fingerboard Inlay: Pearl Trapezoid Number of Frets: 22, Low profile, Plek'd Scale Length: 24.75\" Nut Width: 1.745\" Nut Material: Titanium Bridge/Tailpiece: Aluminum tune-o-matic bridge with titanium saddles and aluminum tailpiece Tuners: G Force Neck Pickup: Rhythm Pro Humbucker Bridge Pickup: Lead Pro+ Humbucker Controls: 2 x volume (push/pull coil-tap, split), 2 x tone (push/pull phase, coil select), 5-way DIP (treble bleed, transient suppression) Strings: .009-.046 Case Included: Aluminum Hardshell case Manufacturer Part Number: HLPS18LP8CH1 INCLUDES Case Candy and Hard Case NOT INCLUDED *There could be important accessories not included. We do our best to call out the accessories that should be included that are missing, however, we don't research every item to know with certainty what should be included. Please do this research before bidding and know what you are purchasing. Everything included in the auction will be pictured in the photos above. If something is not pictured or mentioned, it is not included with the purchase. Check out my other auction listings! and be sure to add me to your favorites list. CONTACT INFORMATION You can e-mail us with any questions you may have about an item. We are very easy to reach, and we are glad to help. Just click \"Ask a question\" in the questions and answers area below. Please note that we are not in the office after 5:00PM EST on weekdays, or all day Saturdays and Sundays. Questions asked over the weekend will be answered on the following business day. SHIPPING INFORMATION Items are shipped within one business day of payment. To avoid a lost or stolen item, your package may ship \"Signature Required.\" If you have special shipping instructions or would like your item shipped UPS instead of USPS or FedEx, please contact us before you make a purchase. We collect local sales tax here in Indiana. This applies to Indiana residents who we ship to, as well as non-Indiana residents who drive here for local pickups. We also collect sales tax in other states around the country. Please check eBay's tax information on the \"Shipping and payments\" tab above to see if we are collecting tax in your area. PLEASE NOTE Shipping quotes are estimates only. We use eBay’s shipping calculator, which provides estimated shipping charges on listings where “Free Shipping” is not offered. Ebay's FedEx calculator on the item page quotes eBay's discounted FedEx shipping rates, which we honor. At checkout, however, buyers in certain areas will see the calculator attempt to charge the full retail price. FedEx's full retail price is the price you pay if you were to walk into a FedEx retail location. The difference between eBay's discounted rate and this retail price can be as much as 40%. If you estimate shipping with a zip code that is different from the zip code registered to your User ID, eBay’s shipping calculator will make the adjustment at checkout. Additionally, FedEx charges a surcharge for delivery in certain rural areas of the country that does not, for some reason, show up in eBay’s estimate calculator; but it does at checkout (we wish we could control this, but we can’t — we have contacted eBay many times about this issue). FedEx does this based on the +4 extension of your primary 5-digit zip code. For example, eBay’s shipping calculator may quote you one price based on your primary 5-digit zip, and then figure out that your requested street address at checkout places you within the rural surcharge area, changing the shipping price to an alternate amount that was originally quoted. If there is a discrepancy in your shipping cost, please send us a screen shot of the quoted price to you on our item page and we can override the eBay checkout calculation to get you the cheapest rate. RETURN INFORMATION We want you to be completely happy with your purchase. If the item you receive is not as described or has been damaged in shipping, please contact us immediately. We will make every effort to promptly resolve any problem. Your satisfaction is our top priority. We are happy to offer free shipping on some of the items we offer. Please note that if you decide to return something where free shipping was offered, our shipping costs are non-refundable.", "ItemID": "401655955202", "EndTime": "2018-12-20T23:01:20.000Z", "StartTime": "2018-12-13T23:01:20.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-Les-Paul-Standard-HP-2018-Left-handed-Hot-Pink-Fade-/401655955202", "ListingType": "Chinese", "Location": "Fort Wayne, Indiana", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/4016559552028080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTE0NVgxNjAw/z/maMAAOSwkHFcEUJv/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/Njk3WDE2MDA=/z/mRAAAOSw8MxcEUJr/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU5OVg2MTI=/z/MLwAAOSw~BRcEUJw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMTQ0/z/gwQAAOSw5cZcEUJz/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg1OTY=/z/qvQAAOSwezRcEUJ0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/uqYAAOSw3-9cEUJ3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTEzWDE2MDA=/z/RwQAAOSwoVZcEUJ5/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTEzMFgxNjAw/z/M5UAAOSwOsFcEUJ7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/A9MAAOSwS4VcEUJ9/$_57.JPG?set_id=8800005007"], "PostalCode": "46818", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jeffsmusicgear", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 14339, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 4, "ConvertedCurrentPrice": {"Value": 1111.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1111.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "o***f", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 812}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson Les Paul Standard HP 2018 Left-handed - Hot Pink Fade", "ItemSpecifics": {"NameValueList": [{"Name": "Right-/ Left-Handed", "Value": ["Left-Handed"]}, {"Name": "Dexterity", "Value": ["Left-Handed"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Features", "Value": ["HSS configuration"]}, {"Name": "MPN", "Value": ["HLPS18LP8CH1"]}, {"Name": "Body Color", "Value": ["Pink"]}, {"Name": "Product Line", "Value": ["Gibson Les Paul"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model", "Value": ["Les Paul Standard"]}, {"Name": "Model Year", "Value": ["2018"]}]}, "HitCount": 784, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=36123540", "StoreName": "jeffsmusicgear"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 1136.99, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "TopRatedListing": true, "GlobalShipping": false, "ConditionDescription": "Sold As-Is. This guitar's neck pickup is not working properly. There are scratches all over body of the guitar. Please see the photos above; they are of the actual item for sale.", "QuantitySoldByPickupInStore": 0, "SKU": "HLPS18LP8CHU1", "NewBestOffer": false}