{"BestOfferEnabled": false, "Description": "At top 40 guitarsour customers satisfaction is our first concern.All of out items have a 14 day return policy.If after 14 days you are not completely satisfiedwith your purchase, please return it for a full refund....Peace be with you... *all returned items must be in the same condition theywere at the time of sale. All original packing must be included. # Up for Sale is a 2017 Charvel Pro-Mod San Dimas Style 2 HH! Quilt Maple Top! Transparent Black Burst! This is really cool. You are looking at a 2017 Charvel Pro-Mod San Dimas Style 2 HH. Charvel's have long been known as the pinnacle in Shred Guitars. This Pro Mod Style 2(PM SD2) is a AWESOME playing and sounding guitar. If you like playing fast with an aggressive tone, this is the right guitar for you. PERFORMANCE The Pro-Mod San Dimas Style 2 HH HT M Ash feels like a wild bucking horse because once you strap yourself in, you can’t help but hang on as your playing heads toward break neck speed. It’s mind blowing and addictive how the guitar changes the character of my playing to accommodate fast runs and wicked riffs. Its speed neck profile with a hand-rubbed urethane gel back finish is so smooth it allows your fingers to effortlessly skate across the whole neck. Charvel was wise to use the darker-voiced Seymour Duncan humbuckers to balance the ash body’s brighter tone characteristics. Here, the pickups have a strong mid-range that makes chords sound chunky when using high-gain amplifiers, while leads have the perfect bite and roundness that slice through the mix. Engaging the volume’s push/pull coil split brightens up the tone for single coil spank. It’s a totally versatile hard rock masterpiece stripped down for dexterous guitar acrobatics. From The Web: Pedigreed shredders from the ‘80s, Pro-Mod San Dimas® guitars are packed with high-speed playability and innovative design elements that epitomize Charvel’s definitive combination of time-honored style and modern features, power and performance. The Pro-Mod San Dimas Style 2 HH FR QM offers an alder body with quilt maple top and a two-piece bolt-on maple neck with graphite reinforcement rods for rock-solid stability, despite the ravages of the road and climate. Engineered for effortlessly nimble and highly-expressive playing, this guitar has a speed neck profile, a 12”-16” compound radius dark rosewood fingerboard with hand-rubbed urethane gel back finish, 22 jumbo frets, white dot inlays and a convenient thumbwheel truss rod butt-adjust for easy access. Hot-rodded for unparalleled performance and versatile sound, this instrument is equipped with a high-output Seymour Duncan® JB TB-4 humbucking bridge pickup and a warm, fat Seymour Duncan® ’59 SH-1N humbucking neck pickup for killer tone, controlled with a three-way blade switch. The volume control hides a push/pull coil split for even more highly useful tonal variations—ideal for everything from a biting lead sound to thick, chunky rhythm work, while the No-Load tone control operates like a standard tone control from positions one through nine, removing itself from the circuit at position ten for transparent sound, letting the full natural voice of the guitar shine through. Scream or rumble with a Floyd Rose® double-locking recessed tremolo and locking nut without sacrificing tuning stability or the pinpoint intonation. Our luthier did a complete setup. Frets are in great shape. Neck is Straight. Brand new strings were installed. Gig ready on Arrival! Serial Number: #MC176420 Nut Width: 1.68\" Weight: 8.05 lbs. Case is NOT Included Cosmetics: Excellent Condition. Both Top and Back are very clean. Neck, Fretboard and Headstock are in fine condition. Pristine. Dripping with \"Mojo\" It is used. Not perfect. Look at the pictures closely. They will tell the story. We are here to help! Top 40 guitars is a Veteran owned business.", "ItemID": "132844697834", "EndTime": "2018-11-12T02:05:06.000Z", "StartTime": "2018-11-05T02:05:06.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2017-Charvel-Pro-Mod-San-Dimas-Style-2-HH-Transparent-Black-Burst-NO-RESERVE-/132844697834", "ListingType": "Chinese", "Location": "Santee, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1328446978348080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTI4N1g4OTY=/z/xMYAAOSwihVb34V3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjQ2WDQ4Mw==/z/DH4AAOSwp7Rb34Sc/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ5MFg4NzQ=/z/FrYAAOSwKQFb34UD/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTk3WDQ4Mw==/z/0wcAAOSwA65b34YK/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ2OFg5MTQ=/z/t7EAAOSwDrpb34aZ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQxOVg5Mjc=/z/1DYAAOSwUS1b34ZX/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTMwMVg4NDM=/z/eLkAAOSwFAtb34b-/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTMwOVg5MDU=/z/lsYAAOSw~atb34bT/$_57.JPG?set_id=8800005007"], "PostalCode": "92071", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "top40powertrio", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 13196, "PositiveFeedbackPercent": 99.7}, "BidCount": 18, "ConvertedCurrentPrice": {"Value": 740.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 740.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "u***u", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 33}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2017 Charvel Pro-Mod San Dimas Style 2 HH! Transparent Black Burst! NO RESERVE!!", "ItemSpecifics": {"NameValueList": [{"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Country/Region of Manufacture", "Value": ["Mexico"]}, {"Name": "Model Year", "Value": ["2017"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Brand", "Value": ["Charvel"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Transparent Black Burst"]}, {"Name": "Model", "Value": ["Pro Mod San Dimas Style 2 HH"]}]}, "HitCount": 254, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=47416021", "StoreName": "Top 40 Guitars"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 750.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "2017 Charvel Pro-Mod San Dimas Style 2 HH Electric Guitar, Excellent Condition, See ad below for Full Description", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}