{"BestOfferEnabled": false, "Description": "AWESOME CUSTOM MADE GUITAR. THE ROBERT CRAY MODEL THAT NEVER WAS!! This is a Fender Stratocaster Electric Guitar. This strat was made in Mexico, MIM. Serial Number MSN6102xx, makes it a 1996 model, but I am almost certain the body is newer than that. From what I can tell this is a Genuine Robert Cray neck and pickguard assembly, with a Standard strat body and tremolo. If you are familiar with the Robert Cray model, you know this guitar should have a hard tail bridge and not a tremolo. The guitar is in exceptional condition and professionally assembled. There are marks on the pickguard and a few light scuffs and scratches on the body. The back of the neck is like new and perfectly smooth. It has been professionally re-fretted with larger, jumbo or medium jumbo frets. It is in perfect structural condition. An exceptionally clean guitar and a GREAT PLAYER!!! One additional oddity to the tremolo body are two abalone dot makers at the 12th fret. All the rest of the dots are the normal 60's reissue clay look. It comes with the quality molded hard case you see in the pictures. I will let you decide which decals to leave on. Features include: Chrome hardware, vintage Kluson style tuners, 1960's reissue style neck, 21 fret maple neck, rosewood finger board w/ dot markers, three specially designed Robert Cray single coil AlNiCo magnet pickups, flat pole bridge pickup, staggered pole neck/mid pickups, 5 way pickup switch, master volume control, neck tone control, middle/bridge tone control, vintage style tremolo bridge with stamped steel saddles, full size tremolo block, three ply cream pick guard, three ply cream back plate. The set up on this guitar is awesome, nice and low. The truss rod works as it should, neck is straight. All the electronics work as they should (no scratchy pots). Chrome parts, frets and finger board look new. I have completely serviced the guitar... cleaned and polished the neck and body, cleaned and conditioned the fingerboard, cleaned and polished frets, installed new strings (Ernie Ball regular Slinky 10-46's), tweaked the neck truss rod, adjusted the bridge and intonation, etc. THIS BABY IS READY TO PLAY. DON'T MISS IT!! If you are looking for a true to spec, all original Robert Cray Strat for collectable reasons, move on. This guitar is not for you. If you are a player who is looking for a great Strat with professional upgrades at a GREAT PRICE, you will not be disappointed. This guitar is for you. Buyer pays $39.95 shipping, insurance, PACKAGING and HANDLING to the contiguous 48 states. Items over 2 lbs will ship Fed Ex ground, (no PO Boxes). Please take a look at the last picture and my other listings. I have great collection of inexpensive, quality, desirable Fender models for sale now. You will find a COOL custom made Robert Cray signature series stratocaster that has been converted to a tremolo model, a 1990's Made in Mexico MIM Mexican three tone sunburst Standard Telecaster hot-rodded with a Seymour Duncan hot stack bridge pickup/AlNiCo neck pickup, a near mint blonde Squier Vintage Modified '51 telecaster/strat from the first years of production and an exceptionally clean Affinity Squier telecaster with custom tortoise pickguard. The following is common sense stuff, but needs mentioned: -If you have a concern with any item purchased, CONTACT ME IMMEDIATELY by phone or email. I always offer a full refund of the purchase amount. You should not have to live with something you are unhappy with for any reason. If you alter, modify, change or \"repair\" the item in anyway without my consent, you are accepting the item \"as is\", at the price paid. All items are packed for safety. Often requiring reassembly, tuning and/or adjusting. -If you receive an item that has been damaged in shipping, CONTACT ME IMMEDIATELY and save all the packaging. We will work through the claim together until things are right. -I can ship almost anywhere, but free shipping or a fixed shipping price is for the contiguous 48 states ONLY. If you have a foreign address, use an APO, live in Alaska, Puerto Rico, etc., message me for a shipping price BEFORE you buy. Due to the cost and risk of shipping I do not accept returns from outside the US. Once the package is delivered to the carrier, the foreign buyer is responsible for the item, including but not limited to taxes, fees, customs issues, delays, damage, lose, duty, etc.", "ItemID": "202542085449", "EndTime": "2019-01-04T17:50:29.000Z", "StartTime": "2018-12-19T04:02:49.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/CUSTOM-FENDER-ROBERT-CRAY-ARTIST-SERIES-ELECTRIC-GUITAR-TREMOLO-CASE-NO-HARDTAIL-/202542085449", "ListingType": "FixedPriceItem", "Location": "Victoria, Kansas", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/2025420854498080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/DxEAAOSw5cZcGbdp/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/6TkAAOSw1rpcGd01/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/b9AAAOSwFlJcGbdk/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/5vkAAOSwKwhcGbdX/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/MdgAAOSw8iZcGbdf/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/0jwAAOSwmkBcGbds/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/96kAAOSwE~ZcGbdv/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/lmMAAOSwLr1cGbdy/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/6OsAAOSwGBRcGbd3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/DiEAAOSwR0dcGbd6/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/bYoAAOSw8VtcGbeM/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/ozUAAOSwpppcGbdb/$_57.JPG?set_id=8800005007"], "PostalCode": "67671", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "kpfeifer", "FeedbackRatingStar": "Red", "FeedbackScore": 2699, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 469.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 469.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "c***d", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 85}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "CUSTOM FENDER ROBERT CRAY ARTIST SERIES ELECTRIC GUITAR TREMOLO CASE NO HARDTAIL", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Model", "Value": ["Robert Cray Stratocaster/Standard strat"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Country/Region of Manufacture", "Value": ["Mexico"]}, {"Name": "Model Year", "Value": ["1996/OTHER"]}, {"Name": "Type", "Value": ["Electric Guitar"]}, {"Name": "Series", "Value": ["ARTIST SERIES"]}, {"Name": "Custom Bundle", "Value": ["Yes"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Bundle Description", "Value": ["INCLUDES HARDSHELL CASE"]}]}, "HitCount": 520, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=2985304", "StoreName": "TAP MUSIC AND MORE"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "AWESOME, CUSTOM STRATOCASTER.  EXCEPTIONAL NEAR MINT CONDITION!  See detailed description below.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}