{"BestOfferEnabled": true, "Description": "Tested - sounds great! Area on back of neck has a rubber base substance, possible small fill. A few areas of scuffing - nothing significant. Otherwise in excellent cosmetic condition! Includes black gig bag as shown. 6 Strings Right Handed Made in Mexico - 2017 Serial Number: MX17837496 Action is nice and low Body & Bridge: Body Material: Alder Body Finish: Gloss Nitrocellulose Lacquer Body Shape: Jazzmaster Bridge: 6-Saddle Vintage-Style Adjustable with \"Floating\" Tremolo Tailpiece Neck & Fingerboard Neck Material: Maple Neck Finish: Gloss Nitrocellulose Lacquer Neck Shape: \"C\" Shape Scale Length: 25.5\" (648 mm) Fingerboard: Pau Ferro Fingerboard Radius: 7.25\" (184.1 mm) Number of Frets: 21 Fret Size: Vintage-Style String Nut: Synthetic Bone Nut Width: 1.650\" (42 mm) Position Inlays: White Dot Truss Rods: Vintage-Style Heel Adjust Truss Rod Nut: Vintage-Style Slotted Neck Plate: 4-Bolt Vintage-Style Electronics & Hardware: Bridge Pickup: American Vintage '65 Single-Coil Jazzmaster Neck Pickup: American Vintage '65 Single-Coil Jazzmaster Controls: Lead Circuit: Volume, Tone Rhythm Circuit: Volume, Tone Pickup Switching: 3-Position Toggle: Position 1. Bridge Pickup Position 2. Bridge and Neck Pickups Position 3. Neck Pickup; 2-Position Slide: Up: Rhythm Tone Circuit, Down: Lead Tone Circuit Hardware Finish: Nickel/Chrome Tuning Machines: Vintage-Style Pickguard: 3-Ply White Guitar is Surf Green. Any discoloration is from reflections or camera flash unless stated above. I attempt to capture all imperfections in photos. Please see photos for details. Thank You For Viewing Our Item 2017 Fender Jazzmaster Guitar Surf Green Synchronized Floating Tremolo Mexico 2017 Fender Jazzmaster Guitar Surf Green Synchronized Floating Tremolo Mexico Click images to enlarge Description 2017 Fender Jazzmaster Guitar Surf Green Synchronized Floating Tremolo Mexico Tested - sounds great! Area on back of neck has a rubber base substance, possible small fill. A few areas of scuffing - nothing significant. Otherwise in excellent cosmetic condition! Includes black gig bag as shown. 6 Strings Right Handed Made in Mexico - 2017 Serial Number: MX17837496 Action is nice and low Body & Bridge: Body Material: Alder Body Finish: Gloss Nitrocellulose Lacquer Body Shape: Jazzmaster Bridge: 6-Saddle Vintage-Style Adjustable with \"Floating\" Tremolo Tailpiece Neck & Fingerboard Neck Material: Maple Neck Finish: Gloss Nitrocellulose Lacquer Neck Shape: \"C\" Shape Scale Length: 25.5\" (648 mm) Fingerboard: Pau Ferro Fingerboard Radius: 7.25\" (184.1 mm) Number of Frets: 21 Fret Size: Vintage-Style String Nut: Synthetic Bone Nut Width: 1.650\" (42 mm) Position Inlays: White Dot Truss Rods: Vintage-Style Heel Adjust Truss Rod Nut: Vintage-Style Slotted Neck Plate: 4-Bolt Vintage-Style Electronics & Hardware: Bridge Pickup: American Vintage '65 Single-Coil Jazzmaster Neck Pickup: American Vintage '65 Single-Coil Jazzmaster Controls: Lead Circuit: Volume, Tone Rhythm Circuit: Volume, Tone Pickup Switching: 3-Position Toggle: Position 1. Bridge Pickup Position 2. Bridge and Neck Pickups Position 3. Neck Pickup; 2-Position Slide: Up: Rhythm Tone Circuit, Down: Lead Tone Circuit Hardware Finish: Nickel/Chrome Tuning Machines: Vintage-Style Pickguard: 3-Ply White Guitar is Surf Green. Any discoloration is from reflections or camera flash unless stated above. I attempt to capture all imperfections in photos. Please see photos for details. Thank You For Viewing Our Item Payment We accept PAYPAL ONLY for all payments. All sales are expected to be paid within 4 days. Unpaid cases will open after that time. NO EXCEPTIONS TO PAYMENT RULES We reserve the right to cancel purchases if unreasonable requests are made or if there is doubt that buyer is not certain of what they have purchased. This is to avoid possible return situations. Shipping We ship to all 50 United States and their Protectorates only. Any items availble for international shipping are handled through the eBay program. We do no set nor quote prices on such shipments. We will ship all purchases the next business day after payment is made. We will combine shipping on all items you purchase from us whenever possible. Please wait for invoice before paying to receive this discount. Invoices are generally issued the morning after end of auction. Continental US Shipping is quoted in the auction. Shipping to all other locations is 2X the quoted price. Items are shipped via USPS or FedEx Ground Only. All items selling for over $250 will include signature confirmation upon delivery. Handling and packaging fees are included in our shipping prices. We do our very best to keep costs down while still ensuring that items are safely packaged. If you do not agree with our costs, please do not bid. Terms of Sale Bidding on or purchasing Buy It Now items are considered binding contracts by eBay. If you bid, please intend to buy. We accept returns within 30 days after end of auction. If you open a new item, a 30% restocking fee may be deducted from your purchase price. We reserve the right to deny cancellation requests or requests to retract bids. Please read the description carefully before placing any bid. We do not accept ‘buy it now’ offers on items up for auction. We reserve the right to cancel bids from suspicious or bad history buyers. We reserve the right to end auctions early due to errors in listings. We do not ever end an auction due to the price being offered. Payment is required within 4 days after end of auction, no exceptions. Unpaid cases will open at that time. Paypal is our only accepted method of payment. About Us We are honestproductdeals. We strive to make all transactions smooth. Customer satisfaction is our main goal. Please read all information carefully. We do sell used items, in addition to our new items, and will do our best to describe its functionality and condition. All used items are tested to the best of our ability. This is our business. We stand behind the items we sell. Please address all questions before bidding or before opening return cases. We appreciate the opportunity to make things right rather than having unhappy customers. Please contact us through eBay messages only. They are the quickest way to reach us. Thank you for shopping with us! Contact Us Please contact us through eBay messages only. They are the quickest way to reach us. We are a store with set hours: Monday thru Friday 10 AM to 6 PM EST. We generally respond to messages during that time. We attempt to answer questions during other hours. Please be patient. All messages are handled ASAP. Images sell! Get Supersized Images & Free Image HostingCreate your brand with Auctiva's Customizable Templates. Attention Sellers - Get Templates Image Hosting, Scheduling at Auctiva.com.", "ItemID": "223315646488", "EndTime": "2019-01-08T00:07:37.000Z", "StartTime": "2019-01-07T17:57:00.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2017-Fender-Jazzmaster-Guitar-Surf-Green-Synchronized-Floating-Tremolo-Mexico-/223315646488", "ListingType": "FixedPriceItem", "Location": "Oley, Pennsylvania", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2233156464888080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTAyNFg2ODI=/z/ir4AAOSw-yJcM5Lv/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg2ODI=/z/zVEAAOSwoDFcM5Lv/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzIwWDEwODA=/z/iBUAAOSwxJ9cM5Lv/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzIwWDEwODA=/z/YuEAAOSw6hNcM5Lv/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzIwWDEwODA=/z/bc0AAOSwU65cM5Lv/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzIwWDEwODA=/z/hA8AAOSweX5cM5Lv/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzIwWDEwODA=/z/cM8AAOSwjMtcM5Lx/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzIwWDEwODA=/z/VAcAAOSw~wVcM5Lv/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzIwWDEwODA=/z/vNEAAOSwn01cM5Lv/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzIwWDEwODA=/z/GmYAAOSw5wFcM5Lv/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzIwWDEwODA=/z/a5oAAOSw0YlcM5Lv/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzIwWDEwODA=/z/H9YAAOSwa3lcM5Lv/$_1.JPG?set_id=880000500F"], "PostalCode": "19547", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "honestproductdeals", "FeedbackRatingStar": "Red", "FeedbackScore": 3657, "PositiveFeedbackPercent": 99.9, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 674.95, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 674.95, "CurrencyID": "USD"}, "HighBidder": {"UserID": "s***s", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 885}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2017 Fender Jazzmaster Guitar Surf Green Synchronized Floating Tremolo Mexico", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "MPN", "Value": ["Jazzmaster"]}]}, "HitCount": 16, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1404335959", "StoreName": "Buy Inn Depot"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "Tested - sounds great! Area on back of neck has a rubber base substance, possible small fill. A few areas of scuffing - nothing significant. Otherwise in excellent cosmetic condition! Includes black gig bag as shown.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}