{"BestOfferEnabled": false, "Description": "The Pro-Mod series continues upon Charvel’s storied legacy of innovative excellence in high-performance guitar design, offering the latest technology and top-notch features that modern players need. An ideal instrument for dazzling high-speed playing, the San Dimas® Style 1 HH FR M boasts scorching sound, stunning style and grin-inducing playing feel and performance. Its body is crafted from ash and is coupled with a bolt-on two-piece maple neck with a pair of graphite reinforcement rods to resist bending and warping under environmental stresses. The speed neck profile is designed for lightning fast playing and completely unhindered position shifts while the comfortably rolled fingerboard edges provide the broken-in feel of an instrument with plenty of playing miles on it, and plenty more to go. This axe also features a maple fingerboard with 22 jumbo frets and black dot inlays, as well as a heel-mounted spoke wheel for quick and convenient truss rod adjustments. High-output Seymour Duncan® JB and Seymour Duncan '59 humbucking pickups are directly mounted to the body, cranking out high octane rock ‘n’ roll tone with plenty of sweet overtones. The volume control conceals a push/pull coil split to have even more tonal variations on tap while the No-Load tone control operates like a standard tone control from positions one through nine, removing itself from the circuit at position ten for transparent sound, letting the full natural voice of the guitar shine through. Dive to rumbling depths or add a well-placed rising harmonic without sacrificing your tuning with the Floyd Rose® 1000 series double-locking recessed tremolo bridge system. Designed with style in mind, the San Dimas Style 1 HH FR M is available in a diverse mix of finishes. A Charvel neck plate, sealed die-cast tuners and standard strap buttons complete the package. Bizarre Guitar is one of the largest family owned and operated guitar stores in the entire world. We have been in business for over 37 years (under the same ownership). We are an authorized dealer of many of the finest Guitar makers including ESP, Fender, Paul Reed Smith, Gretsch, Jackson, Charvel, Ibanez, Martin, Dean, Rickenbacker, Guild, BC Rich, Musicman, Larrivee and Many More. We have over 10,000 guitars and basses in stock at any given time, so if you are after something, please let us know, we probably have it in stock, or can get it for you asap. Please ask any and all questions, we want you to be 100% satisfied with your purchase, and will do our best to earn your business for life. Please check our other auctions for more amazing deals on the best guitars on the planet. Return Policy: Due to the overwhelming amount of returns just because buyers have changed their minds or decided they needed the money more than the item (buyers remorse), we will be charging a restocking fee for returns. Please ask any and all questions you may have about the item you are purchasing before you purchase it. Please make sure you do have the money to buy said item.We will answer them to the best of our knowledge. We want you to be happy with your purchase, and we will describe the items as best we can. Most of our items are brand new in the box. So there shouldn't be any issues with them. We will check them for quality and playability before they are shipped to you. If you decide to return your item, there will be a 10% restocking fee, and you, the buyer will have to pay the shipping costs both ways. If there is a mistake on our part, something is not as described, etc. we will wave the restocking fee. Thank you for your understanding", "ItemID": "332846508664", "EndTime": "2019-01-25T01:32:50.000Z", "StartTime": "2018-10-19T22:07:42.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/MINT-Charvel-Pro-Mod-San-Dimas-Style-1-HH-FR-Neon-Pink-Authorized-Dealer-/332846508664", "ListingType": "FixedPriceItem", "Location": "Reno, Nevada", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/3328465086648080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/OTM4WDE2MDA=/z/xvsAAOSwi5hbylMk/$_57.PNG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODUzWDE2MDA=/z/fjIAAOSwLKNbylMn/$_57.PNG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTM1WDE2MDA=/z/Oh8AAOSwCnVbylMp/$_57.PNG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTE1WDE2MDA=/z/sdwAAOSw-nRbylMq/$_57.PNG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2OFgxNjAw/z/d~EAAOSwvl9bylMu/$_57.PNG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA1M1gxNjAw/z/PX4AAOSwwSJbylMx/$_57.PNG?set_id=8800005007"], "PostalCode": "89512", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "bizarreguitarreno", "FeedbackRatingStar": "Red", "FeedbackScore": 2414, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 764.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 764.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "e***d", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 67}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "MINT Charvel Pro-Mod San Dimas® Style 1 HH FR Neon Pink Authorized Dealer ", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Neon Pink"]}, {"Name": "Brand", "Value": ["Charvel"]}, {"Name": "Type", "Value": ["Electric Guitar"]}, {"Name": "Model", "Value": ["Pro Mod Style 1 HH"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Country/Region of Manufacture", "Value": ["Mexico"]}]}, "HitCount": 721, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=53866535", "StoreName": "bizarreguitar_reno"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}