{"BestOfferEnabled": true, "Description": "this is an older RG model. I only bought this thing for 300 bucks about 5 years ago because I broke the headstock off of my other guitar during a USA tour. I recorded a freedumb album with it and a solo record. I used it live for a while with skull fist as well until I bought a V. Theres a bunch of pictures online, i think i had it painted black and white for a while. I don't want to lead anyone on or something. the action is pretty high, one of the tuning pegs is a little bit sloppy but works ok. on the 3rd fret the steel divider thing sticks out a tiny tiny bit down at the high E string. depending on how you bend it gets hung up for me but its so rare that I've never bothered to fix it. Its an easy fix, just needs like 1 minute of filing it down so the edge dont stick out. As I said, I never bothered to fix it since it was such a rare thing but Ive always noticed it. The bridge pickup works fine but the screw is out of place, it just needs one of those little springs but I also never bothered to fix it because its stock pickups. IF you plan on actually playing this guitar Id suggest just putting in a new bridge pickup but the neck one is actually not to bad of a sound. The paint job was me with spray paint. Its a really beat up guitar but if it gets set up properly will play fine. I was still using it and practicing and recording with it up until a week ago but was just given a sweet sheckter or however you spell it. I don't really like holding on to things if i don't need to so i figure if someone wants it, why not. Just remember, I only paid 300 bucks for this. It definitely has a lot of history with skull fist and my own music but I really don't think its worth over 300 bucks unless you want it for sentimental reasons or whatever but even then. Don't get silly because if this amount goes to high I will just refund a portion or something like that. I can ship it with the chain strap if you like, or not. up to you. lets just figure out the shipping cost afterwards. I'll have to send it in a box and I'll take the neck off for shipping. I'll pack it up nice and comfortable though.", "ItemID": "233044502568", "EndTime": "2018-12-20T02:26:25.000Z", "StartTime": "2018-12-13T02:26:25.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Ibanez-RG-crappy-paint-job-LEFT-/233044502568", "ListingType": "Chinese", "Location": "North York, Ontario", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2330445025688080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/8MoAAOSwjlVcEbzp/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDk2MA==/z/54MAAOSw~bhcEZim/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/UKcAAOSwqxdcEZim/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/PEEAAOSwrblcEZio/$_32.JPG?set_id=880000500F"], "PostalCode": "m2n4a2", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "zacscho", "FeedbackRatingStar": "Blue", "FeedbackScore": 58, "PositiveFeedbackPercent": 100.0}, "BidCount": 56, "ConvertedCurrentPrice": {"Value": 1862.13, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2469.0, "CurrencyID": "CAD"}, "HighBidder": {"UserID": "a***l", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 32}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "Canada", "TimeLeft": "PT0S", "Title": "Ibanez RG crappy paint job (LEFT)", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Ibanez"]}, {"Name": "Product Line", "Value": ["Ibanez RG"]}]}, "HitCount": 3389, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "CA", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 2494.0, "CurrencyID": "CAD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}