{"BestOfferEnabled": false, "Description": "Fender Japan MG66-66 Mustang Electric Guitar, Made in Japan, j8346 Condition Rating : B N: New. A: Used. Nice condition cosmetically, minimal to light cosmetic blemishes only. B: Used. Good condition cosmetically, light to medium cosmetic blemishes and some light aging. C: Used. Fair condition cosmetically, medium to some heavier cosmetic blemishes and aging. D: Used. Quite poor condition cosmetically, has some heavy cosmetic blemishes and aging. J: Junk, heavy with some gnarly cosmetic blemishes and aging, needs love! First come, first served.!! For sale is Used Fender Japan MG66-66 Mustang Electric Guitar, Made in Japan, j8346 . I would rate it's overall condition at 8.6 on a scale from 1 to 10. No other accessories will be included in this sale, please look at the pictures above and the item description below. The item in pictures is the actual item you will receive. Please look at the photos carefully. Item Description Excellent condition! There is a peeling paint around the neck joint, and some parts have signs of wear, dullness, etc, There is no buzzing noise!! There is no problem in performance!! Neck Condition: Flat! Number of Frets: 22 String Configuration: 6 Fret Remaining: About 70% Body Color: Vintage White Dexterity: Right-Handed Country of Manufacture: Japan Accessories: Original Soft Case Serial Number: O096125 Condition: Used (Please see the pictures.) Notice : Items on the list are used or vintage. There is a possibility they may be rusty, faded, scratched, cracked, dented, etc. Please view the picture carefully. Items on the list are sold in actual stores in Japan as sale items. There is a possibility of them selling out. Please don't hesitate to contact me if you have any questions. Thank you for visiting my shop. Hope you find your favorite one!! Payment We accept PayPal only. Payment is due within 5 days of the auction end. Please do not make offer or bid, if you are not ready for payment within 5 days. We will ship the item 5-10 business days after your payment clears. Shipping We ship items via EMS. We will ship your item within 5-10 business days, after your payment. We can ship ONLY to your Paypal address. It usually takes about 7-12 days to arrive.(It depends on your customs procedure.) We will provide the EMS tracking number. You can check delivery status on the site \"Post /EMS Tracking\" Shipping is only available to the address registered in Paypal. Otherwise Paypal protection is not covered. Returns Returns are accepted 14 days after you receive the item. As long as the item is under same condition as when you receive it. Please Note * Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer's responsibility. * Please check with your country's customs office to determine what these additional costs will be prior to bidding/buying. * These charges are normally collected by the delivering freight (shipping) company or when you pick the item up - do not confuse them for additional shipping charges. * We do not mark merchandise values below value or mark items as \"gifts\" Because declared value is insured value.lower value.- Besides US and International government regulations prohibit such behavior. About us Hello, thank you for visiting. Here in Japan, used guitar and bass market is big, and there are a lot of guitars in good condition. So, if you are looking for a particular item that is not in our listing, please do not hesitate to contact us. Maybe we can find it for you. Thank you. tsukasa-japan", "ItemID": "192791794075", "EndTime": "2019-01-17T14:15:30.000Z", "StartTime": "2019-01-15T15:36:57.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fender-Japan-MG66-66-Mustang-Electric-Guitar-Made-Japan-j8346-/192791794075", "ListingType": "FixedPriceItem", "Location": "-", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1927917940758080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTI4MFg5NjA=/z/Q3sAAOSw86Jab5AA/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI4MFg5NjA=/z/5bkAAOSwXzNab4~6/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI4MFg5NjA=/z/N2EAAOSwCMtab4~-/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI4MFg5NjA=/z/mOQAAOSwNDJab4~2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI4MFg5NjA=/z/omUAAOSwGBhab4~0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI4MFg5NjA=/z/-DEAAOSwSVJab4~8/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI4MFg5NjA=/z/LKIAAOSw-Rhab4~y/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI4MFg5NjA=/z/5a4AAOSwXzNab4~4/$_57.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "fun-japanproduct", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 477, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 616.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 616.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "_***c", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 114}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "Fender Japan MG66-66 Mustang Electric Guitar, Made in Japan, j8346", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Vintage White"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Mustang"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Brand", "Value": ["Fender Japan"]}]}, "HitCount": 38, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1366061937", "StoreName": "tsukasa-japan"}, "Country": "JP", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller", "InternationalRefund": "MoneyBack", "InternationalReturnsWithin": "30 Days", "InternationalReturnsAccepted": "ReturnsAccepted", "InternationalShippingCostPaidBy": "Seller"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 5, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["JP", "DE"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "SKU": "j8346", "NewBestOffer": false}