{"BestOfferEnabled": false, "Description": "I've had this guitar for years but never really play anymore. Just don't have time nor the passion to play anymore. This guitar has not been played that much. Haven't really worked with the transposing Tremolo systems so I can't provide much detail on that other than I had it completed locked down and preferred to not use the Tremolo system. The tremolo bar is included with the sale and will be in the gig bag. Great Sounding guitar with very little wear. Couple scuffs here and there but in excellent shape overall. Comes with a free soft shell gig bag. Only authorized payment is through paypal, NO EXCEPTIONS. Additional photos available upon request. Buyer pays for shipping and handling. Shipping to the United States only with pickup in the local area available as well. Please do not ask if I will be willing to ship overseas. Good Luck and Enjoy!! Change Keys Instantly with a Transposing Tremolo!The Steinberger ZT-3 Custom rules Steinberger's arsenal of state-of-the-art guitars. Boasting a unique headless appearance with a CybroSonic Neck, the ZT-3 Custom features a series of design elements that contribute to its extreme stability. Supreme intonation, a TransTrem transposing tremolo system, and USA humbucking pickups with eight different combinations comprise just three of the ZT-3 Custom's many impressive playable attributes, while a finished flame maple top just begs to turn heads. A true player's guitar, learn why the pros are choosing the Steinberger ZT-3 Custom.Steinberger ZT-3 Custom at a Glance:The Latest Steinberger MasterpieceTransTrem Transposing Tremolo SystemDoubleBall/SingleBall Tuning System with Headless Design\"Zero-fret\" Rather Than Traditional NutUSA Humbuckers with Eight Pickup CombinationsCybroSonic Neck and Phenolic FingerboardThe Latest Steinberger MasterpieceNed Steinberger breathed new vision and life into stringed instruments when he introduced the L2 bass at Summer NAMM in 1979. Innovatively designed without headstocks, the L2s astonished the music world and prototypes were quickly sold to such esteemed players as John Entwistle of The Who, Tony Levin of King Crimson, and Andy West of The Dregs. Since then, Steinberger basses and guitars have continued to impress musicians - and engineers! - the world over. Their cutting-edge Headless Tuning systems make way for stability never thought possible, while their CybroSonic necks and versatile pickup systems allow for an extensive range of tonal possibilities.TransTrem Transposing Tremolo SystemEquipped with Steinberger's groundbreaking TransTrem system, the ZT-3 Custom is actually capable of transposing keys and bending chords in pitch, opening up tremendous sonic terrains for all guitarists. Simply move the tremolo arm to the unlocked playing position and dial in your key. The TransTrem can take you from standard \"E\" tuning up to \"F\" and then to \"F#\" or down to \"Eb\" or way down to \"D.\" Lock in the key by moving the arm back and you're ready for anything. When locked, the tremolo acts much like a fixed bridge in that not only is sustain improved, but if you should happen to break a string, all the other strings will still stay in tune. In the un-locking position, the TransTrem acts like a regular tremolo capable of extreme pitch bending with smooth and renowned Steinberger accuracy.DoubleBall/SingleBall Tuning System with Headless DesignOriginally, Steinberger guitars featured an exclusively DoubleBall Tuning System that eliminated the need for a headstock. The strings came through and locked down on the bridge for incredible stability. Plus, with virtually no manual feeding and cutting required, you could change strings in under a minute. Today, the ZT-3 Custom has a redesigned headpiece so you can enjoy using these special double ball-end strings as well as your favorite traditionals. This premier system allows you to dial into tune using precise micrometers rather than standard tuners - and when you get in tune, you stay in tune. Also, because Steinberger guitars need no headstock, they're extremely ergonomically balanced and comfortable to hold during longer jam sessions and performances.\"Zero-fret\" Rather Than Traditional NutBy employing a \"zero-fret\" design instead of a traditional nut, intonation and action is greatly improved. This feature also lets you use a variety of different string gauges because there's no nut to widen.USA Humbuckers with Eight Pickup CombinationsTwo custom-made USA humbuckers combined with an innovative switching system lets you tap into eight different combinations for incredible tonal diversity. By using a push/pull switch on both the volume and the tone controls, you can use the ZT-3 Custom's pickups \"in series\" as you would other two humbucker-equipped instruments but also \"in parallel\" to create single-coil tones but without the noise typically associated with stand-alone single coil pickups. The result is a guitar that works for a variety of styles - from rock to blues, jazz to country.CybroSonic Neck and Phenolic FingerboardAll aspects of Steinberger guitars are on the edge of design, and that's exactly the case with the ZT-3 Custom's CybroSonic neck. Inside the wood is a U-shaped composite graphite structure with an integrated truss rod: You get full-on control of your instrument while enjoying the added stability the composite material provides. A durable phenolic fingerboard complements the neck, and, due to its material, it's dead-zone free for the ultimate in performance. Plus, the ZT-3 Custom's neck-thru-body design ensures distinctive tonal clarity, sustain, \"pop,\" and response with that signature Steinberger stability.Steinberger ZT-3 Custom Features:Finish: Trans GrayNeck Material: CybroSonic patented Graphite U-channel with adjustable trussrod integrated with 3-piece Hard MapleNeck Joint: Bolt-onFingerboard: PhenolicFingerboard Radius: 14\"Frets: 24, Medium jumboScale Length: 25.5\"Body Wings: Hard MapleBody Top: Flame MaplePickups: USA 90R neck and USA 91T bridge humbuckersExternal Controls: Master Volume (push/pull series/parallel neck PU), Master Tone (push/pull series/parallel bridge PU), 3 way selectorBridge: PAF TrensTrem-e Transposing Tremolo SystemSaddle Material: SteelWeight: 6.5 lbLength: 33.5\"Zero Nut Width: 1.62\"12-Fret Width: 2.05\"Bridge Spacing: 0.42\"Case: Heavy-duty Gigbag Included", "ItemID": "292833689244", "EndTime": "2018-12-01T02:04:12.000Z", "StartTime": "2018-11-26T02:04:12.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Steinberger-Guitar-ZT-3-Custom-/292833689244", "ListingType": "Chinese", "Location": "Fort Huachuca, Arizona", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2928336892448080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/50IAAOSwOnJb-1Fl/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/s1wAAOSwJ~5b-1Fv/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/tGsAAOSwhzhb-1Fd/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/bDAAAOSwEphb-1GE/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/1wUAAOSw9z1b-1Hi/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/-tAAAOSwaalb-1H1/$_57.JPG?set_id=8800005007"], "PostalCode": "85613", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "saint_arc", "FeedbackRatingStar": "Blue", "FeedbackScore": 84, "PositiveFeedbackPercent": 100.0}, "BidCount": 55, "ConvertedCurrentPrice": {"Value": 847.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 847.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "r***j", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 126}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Americas"], "Site": "US", "TimeLeft": "PT0S", "Title": "Steinberger Guitar ZT-3 Custom", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Steinberger"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Model", "Value": ["ZT3 Custom"]}, {"Name": "Body Color", "Value": ["Gray"]}, {"Name": "Body Material", "Value": ["Maple"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Features", "Value": ["Volume Knob", "With Pickup"]}, {"Name": "Model Year", "Value": ["2009"]}]}, "HitCount": 470, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 857.0, "CurrencyID": "USD"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Great Condition.  Played on very little.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}