{"BestOfferEnabled": false, "Description": "Black Stone Cherry Burst. Perfect condition! Solidbody Electric Guitar with Mahogany Body, Maple Top, Mahogany Neck, Rosewood Fingerboard, 1 P-90 Pickup, and 1 Humbucking Pickup (with coil-split)Roots Rocker with a Unique CharacterAs a huge fan of the Paul Reed Smith SC245, Black Stone Cherry's Chris Robertson used it as the jumping-off point when crafting his signature PRS SE Chris Robertson solidbody electric guitar. This single-cutaway design boasts the model's comfortable and vintage-sounding 24.5\" scale length as well as its two volume/two tone control layout. But the SE Chris Robertson sings with a unique voice, thanks to a combination of a PRS 57/08 S humbucking pickup in the bridge and an SE Soapbar, P-90 single-coil in the neck. The SE Chris Robertson is a hard-tailed rocker that is perfect for the rootsy grind of Black Stone Cherry.Pickup pairing for the roots rockerWhere the PRS SE Chris Robertson solidbody electric guitar really separates itself from other single-cutaway electrics is in its electronics package. In the bridge position, you'll find one of PRS's vintage-voiced 57/08 S humbucking pickups offering the clarity and punch that make them favorites. In the neck position is an SE Soapbar P-90 single-coil pickup. This gives you plenty of bell-like clarity while still punching your amp with the midrange grunt that great P-90s offer.Vintage-style feelThe PRS SC245 -- which the SE Chris Robertson is based on -- boasts a design that harkens back to the thick tone and comfort of some of the most legendary single-cutaway electric guitars in history. One of the places this is most apparent is in the guitar's shorter 24.5\" scale length. By utilizing this design, the SE Chris Robertson is able to offer a string feel that is always slinky and easy on the fingers. And tonally, this scale length warms up the guitar's sound with plenty of punchy low end.Classic tonewood combinationPerhaps not surprisingly, the PRS SE Chris Robertson is crafted from the time-honored tonewood combination of mahogany, maple, and rosewood. It's a combination that has been pushing warm, articulate, and full-throated tones since the 1950s. The guitar's mahogany back and neck are lightweight with great strength, yielding plenty of sustain. The rosewood fingerboard is fast feeling while warming your tone even further. And thanks to a beautifully figured maple top, the Chris Robertson still kicks with plenty of top-end articulation.PRS SE Chris Robertson Signature Solidbody Electric Guitar Features:Signature model of Black Stone Cherry's Chris RobertsonThick-sounding mahogany, maple, and rosewood tonewood comboSingle-cutaway design offers plenty of vintage appealPAF-sounding PRS 57/08 S humbucking pickup in the bridge position with coil-splitSE Soapbar P-90 single-coil pickup for bell-like chime and midrange punch2 volume and 2 tone controlsHand-filling wide-fat neck profileSpecification DetailBody Type SolidbodyBody Shape SE SinglecutLeft-/Right-handed Right-handedNumber of Strings 6Body Material MahoganyTop Material Flamed Maple VeneerBody Finish V12Color Black Stone Cherry BurstNeck Material MahoganyNeck Shape Wide FatFingerboard Material RosewoodFingerboard Inlay BirdsNumber of Frets 22Scale Length 24.5\"Nut Width 1.6875\"Nut Material SyntheticBridge/Tailpiece PRS Adjustable StoptailTuners PRS TunersNeck Pickup Bass SE Soapbar Single-coilBridge Pickup Treble 57/08 \"S\" HumbuckerControls 2 x volume, 2 x tone (push/pull coil-split bridge control), 3-way toggle pickup switchCase Included Gig Bag", "ItemID": "323545211334", "EndTime": "2018-11-18T22:33:38.000Z", "StartTime": "2018-11-11T22:33:38.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Paul-Reed-Smith-PRS-SE-Chris-Robertson-Signature-electric-guitar-/323545211334", "ListingType": "Chinese", "Location": "Aldie, Virginia", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/3235452113348080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NzY3WDU4Nw==/z/stsAAOSwXHxb33IQ/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/Ed4AAOSwyWxb33Hh/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/1ugAAOSwOkxb33Hd/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/UMIAAOSwPb5b33He/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/0vQAAOSwNexb33Hd/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/olAAAOSw8Ehb33Hh/$_32.JPG?set_id=880000500F"], "PostalCode": "20105", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "pedestrian99", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 244, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 550.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 550.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "4***p", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 1}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Paul Reed Smith PRS SE Chris Robertson Signature electric guitar", "ItemSpecifics": {"NameValueList": [{"Name": "Body Material", "Value": ["Mahogany"]}, {"Name": "Brand", "Value": ["PRS"]}, {"Name": "Model Year", "Value": ["2018"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["PRS"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Case", "Value": ["Gig Bag"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "MPN", "Value": ["CRFR"]}, {"Name": "Body Color", "Value": ["Black Stone Cherry Burst"]}, {"Name": "Size", "Value": ["Full Size"]}]}, "HitCount": 185, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 560.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}