{"BestOfferEnabled": false, "Description": "This is for my Vader 7 Custom. Had this made for me by Kiesel, and it is not only a joy to play, but it is a work of art- as you can see in the pictures and the attached YouTube video. It has been an honor for me to own this, and play it. It is in excellent to Mint condition. I don't say straight Mint because I've played it fairly regularly. The actual condition is flawless. Again; see the pictures or the video.I waited almost four months to have this crafted by the guys at Kiesel, and Jeff did the fretboard himself. No cosmetic issues, dings, dents, scratches; or any other flaws that I could find anywhere, and I am very OCD about my instruments. This has never left the studio, never been gigged with or played outside. Everything functions just as it should. It's been religiously wiped down with a soft microfiber instrument cloth after every use that I will include, and set up by professional Luthiers that I trust and have used for years. I am honest, I ship safe, and I ship fast. I will ship this to you in the Kiesel soft Case that it came in, inside of the Kiesel box it was sent to me in. You can see on the box where Jeff actually signed off on the QC himself. I may end up taking this down, as I really am having a hard time putting this up, so if you like what you see I would keep that in mind. I am 50/50 on whether or not I will keep this up much longer. Not a sales pitch; just being honest. I love this guitar. If you like the guitar, I have it ready to go in the case and original box, and can have it out and on the way to you within one business day via Expedited Shipping. Please feel free to email me with any questions, and I will do my best to respond as soon as I can.*See attached link for my Youtube video of the actual guitar.* https://youtu.be/_5rCPZM71fg -Regards. PLEASE NOTE: MY ONE NEGATIVE FEEDBACK I'VE EVER RECEIVED CAME FROM A CUSTOMER THAT I GAVE A COMPLETE AND FULL REFUND TO ON AN ITEM I HAD AN ISSUE SHIPPING. I ISSUED HIS ENTIRE PAYMENT BACK TO HIM PROMPTLY WITHOUT BEING ASKED. -FOR THIS HE GAVE ME A NEGATIVE. SINCE EBAY WON'T LET SELLERS LEAVE FEEDBACK FOR BUYERS, REFUTE; OR EVEN RESPOND TO NEGATIVE FEEDBACK LEFT BY BUYERS, YOU WOULD NEVER KNOW THIS. I am, and always have been as honest a seller as you will find- Feel free to read through my feedback profile. FEATURES:Vader 7 Headless w Hipshot TremoloAsh TopSwamp Ash BodyJet BlackRaw Tone Ultra Thin Satin Finish (the wood grain looks insane in person)Chambered BodyFive Piece Maple Neck w Walnut StripesTung Oil Back of Neck Finish (plays like butter)Birdseye Maple FretboardRed Treated Fretboard done by JeffBlack Diamond Acrylic Inlays w Custom Abalone Diamonds on the 12th FretStainless Steel Jumbo FretsWhite Kiesel LogoMetal Knobs w Abalone Inlays to match the Abalone Inlays on the 12th FretEbony Rear Cover PlateKiesel Lithium PickupsUltimate Soft Headless Case", "ItemID": "264044473274", "EndTime": "2018-11-21T20:44:59.000Z", "StartTime": "2018-11-16T20:44:59.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Kiesel-Vader-7-Custom-Headless-w-Hipshot-Tremolo-Case-Excellent-MINT-Cond-/264044473274", "ListingType": "Chinese", "Location": "Happy Valley, Oregon", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2640444732748080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NjAwWDgwMA==/z/A~gAAOSwtxlb7ydX/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjAwWDgwMA==/z/xb8AAOSwOsFb7ydk/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjAwWDgwMA==/z/emsAAOSwCPZb7yfi/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjAwWDgwMA==/z/nogAAOSwo2xb7yd0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjAwWDgwMA==/z/O4EAAOSwBMpb7yfC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjAwWDgwMA==/z/N2IAAOSwXbFb7yfP/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjAwWDgwMA==/z/VKwAAOSwyodb7yeE/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjAwWDgwMA==/z/X-4AAOSwfX9b7yeE/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/pS8AAOSwX0db7yem/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjAwWDgwMA==/z/lI4AAOSwI7Fb7yen/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/~~UAAOSwmUBb7yeX/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjAwWDgwMA==/z/U~oAAOSwTxhb7yeY/$_57.JPG?set_id=8800005007"], "PostalCode": "97086", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "sellerofgoreandmore", "FeedbackRatingStar": "Purple", "FeedbackScore": 672, "PositiveFeedbackPercent": 92.9}, "BidCount": 7, "ConvertedCurrentPrice": {"Value": 1500.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1500.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "t***i", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 14}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "Kiesel Vader 7 Custom Headless w Hipshot Tremolo+Case: Excellent/MINT Cond.", "HitCount": 210, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 1525.0, "CurrencyID": "USD"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "It is in excellent to Mint condition. I don't say straight Mint because I've played it fairly regularly. The actual condition is flawless. Again; see the pictures or the video.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}