{"BestOfferEnabled": true, "Description": "LINCOLN PAWN SHOP B.C. Rich Gunslinger Retro 6 String Electric Guitar Description: ELECTRIC GUITAR: BC RICH GUITARS MODEL GUNSLINGER RETRO, 6 STRING, RIGHT HANDED Details Additional Details for eCommerceITEM IS IN VERY GOOD WORKING CONDITION. SEE PHOTOS AND DESCRIPTION. Musical Instrument Condition Rating90% - Very Good - In Great Condition and Primary Features Functional Instrument Appearance95% - Excellent Condition : Very Clean, might have some minor wear, dings, scratches, or finish cracks, but otherwise very close to new condition. Knobs - Tuners - Electronics - Input Jack90% - Guitar shows some wear - All orginal - Input jacks ares shows some scratches- Volume and Tone controls are in good working condition. Musical Instrument CaseOriginal Manufactaure Soft Case Included Number of Strings6 STRING Country of ManufactureMade in China Body StyleNOT SPECIFED DexterityRight Handed Notes: ITEM IS IN VERY GOOD WORKING CONDITION. HEAD AND TUNER KNOBS ARE IN VERY GOOD CONDITION AND WORKING PROPERLY. NUT, FRET BOARD ARE IN VERY GOOD CONDITION. NUT COVER IS MISSING. NECK IS IN VERY GOOD CONDITION. VERY SMALL SCUFF ON BACK OF NECK. BODY IN IN EXCELLENT CONDITION. NO KNICKS OR SCRATCHES. BACK PLATES ARE ALL IN GOOD CONDITION. NO SCREWS MISSING. PICK UPS AND ADJUSTMENT KNOB ARE IN GOOD CONDITION. NO SIGNS OF DAMAGE. COMES WITH ORIGINAL SOFT CASE. PLEASE SEE PHOTOS. Please feel free to email me with any questions you may have before purchasing. And please take a look at my other web items! We ship all items through USPS & FedEx. All of our items will be shipped no later than the next business day after your payment is received. We do not offer international shipping. If you need any special shipping arrangements please feel free to contact us prior to purchasing the item. If you are satisfied with your transaction we would appreciate your positive feedback once you have received your item. In the unlikely event you have a problem please contact us prior to leaving bad feedback so that we can try to resolve the issue with you. We are very good about leaving feedback for our customers in a timely manner. Payment PayPal is the ONLY online payment method we accept at this time. Your PayPal account must be a Verified U.S. PayPal Account. We also recommend that you use a Confirmed Ship To Address. Shipping Your item will be shipped within 1 business day(s). After shipping your items will be delivered within 1-10 business days. Terms of Sale Tax applies in: CA About Us We have been open since July of 2013! We specialize in gold, electronics, musical instruments, tools and much more! We have an amazing knowledgeable staff who can assist you with any of you pawn / buy needs! Come into our clean and safe store! We do loans and buys for all Gold, Platinum, and all other rare merchandise. We have the combined knowledge of over 20 years of pawn experience! Things I Buy: gold, silver, platinum, diamonds, musical instruments, tools, electronics, and more Bravo Store Systems Point-of-Sale Operating System Bravo Omni-Commerce solutions offers Brick & Mortar stores the only fully integrated eBay API that seamlessly & effortlessly combines the in-store Point-of-Sale to all eBay commerce selling activities. Click here & find out why eBay stated \"Bravo has best solved Brick & Mortars can sell on eBay\"", "ItemID": "264123380456", "EndTime": "2019-01-09T01:26:58.000Z", "StartTime": "2019-01-07T21:14:48.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/B-C-Rich-Gunslinger-Retro-6-String-Electric-Guitar-LIN015181-/264123380456", "ListingType": "FixedPriceItem", "Location": "Anaheim, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2641233804568080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/XiIAAOSw8DpcM8FD/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/OLEAAOSwWk5cM8FE/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/jPYAAOSwV0VcM8FE/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/EewAAOSwIkNcM8FF/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/VMAAAOSw9xJcM8FF/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/lqsAAOSwCEhcM8FF/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/NPwAAOSw3GlcM8FG/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/osgAAOSwaPNcM8FG/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/SmYAAOSw-QBcM8FG/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/FwkAAOSwy6NcM8FH/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/mVsAAOSwEVlcM8FH/$_1.JPG?set_id=2"], "PostalCode": "92801", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "lincolnpawn", "FeedbackRatingStar": "Red", "FeedbackScore": 1759, "PositiveFeedbackPercent": 99.1, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 350.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 350.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "v***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 372}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "B.C. Rich Gunslinger Retro 6 String Electric Guitar (LIN015181)", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["BC RICH GUITARS"]}, {"Name": "MPN", "Value": ["GUNSLINGER RETRO"]}, {"Name": "Model", "Value": ["GUNSLINGER RETRO"]}]}, "HitCount": 44, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1166908600", "StoreName": "lincolnpawn"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}