{"BestOfferEnabled": true, "Description": "Up for purchase is a Michael Kelly Patriot VintageFew scratches on backOtherwise good condition ** Feel free to ask questions, but be sure to do so 24 hours before the end of the auction to ensure that we can respond to you. *** Thank you for your interest in our listing, view our eBay store for other great items! KOHNS BEST BUYS INFORMATION: Payment Information: PayPal Payment is required within 4 days of the close of the auction. If you have extenuating circumstances on sending payment, you must email us immediately to notify us of the expected date of receipt of payment. (We are happy to work with you only if there is contact) If our emails are ignored we will assume this to be a fraudulent win, and item will be relisted before the 4 days have elapsed. Sales made in Ohio: Sales made to Ohio customers are subject to a 7% sales tax. Sales picked up at our store are subject to 7% sales tax. International Payment Information: International sales where applicable must be paid using PAYPAL. ** We must receive payment within four (4) days of auction's end, PLEASE DO NOT BID if you are unable to send payment within that period. Please contact us with your intentions if not paying by PayPal. CANCELLATION OF BIDS: We reserve the right to cancel any and all bids from bidders with little or no history of buying activity (feedback), a significant number of negative feedback or numerous bid retractions. Shipping Information: We ship primarily with Fed Ex Ground Service or USPS Priority Mail We will ship by alternate shippers if requested. Any item which is too heavy to box will be crated. Items where specified shipping may be included in the price of the item. Import charges are your responsibility. We do not include these charges within the eBay final sale price. Your countries Customs will collect these from you upon receipt. International Shipping: All international shipments will be shipped using USPS Mail. A tracking # will be included. International Buyers Please Note: Some countries may limit the type, size or quantity of items shipped in. It is the responsibility of the buyer to determine any and all requirements, limitations and/or prohibitions connected with the purchase and/or importation of this item. Additionally, it is a violation of U.S. Postal Service regulations to label any package \"gift\", or declare a lesser value when shipping into your country. NON-USA Sales MAY require a 14 day hold for payment too clear. Returns: We believe that it is important that you get what you feel you paid for. Therefore, we have a 14-day return policy so that you can inspect your purchase and feel satisfied with your buy. If a return is necessary the cost of return is at the buyers’ expense UNLESS the item that you received is not what was advertised in any way (broken, not as described, etc.) Note: Descriptions and pictures are taken immediately before the item is listed and are accurate at that time. If you receive an item and there are any questions on the representation of the item, you must email with problems within 3 days of delivery. (We are not experts on all the items we sell, however we try to give the best description possible, Questions from eBay buyers who are more knowledgeable help us at times better define items we list. Ad Descriptions: We do our best to give honest detailed descriptions on items we sell on eBay. From time to time we make mistakes. Therefore, feel free to question us about product or our descriptions. If you feel we have made an error please let us know, we'll make the necessary correction. This helps us better serve the eBay community. Auction Policies: We do not end auctions early. - Please don't ask. We also do not give out our reserve. - Please don't ask. Warranties and Guarantees: We are a re-seller of used merchandise; therefore, we are unable to offer any warranty on the items we sell. All items sold as is, all sales are final. On occasion, we will offer an item that is pre-owned yet may not have been used. It may include manufacturer’s warranty paperwork. We do not imply that such warranties are transferable to the successful bidder. In the event we have not accurately described the item(s) you have purchased, please contact us as quickly as possible and we will refund you as soon as we receive the item back. Return shipment must be made within the 14 day eBay return policy. Returned items must be securely and adequately packed with all original parts and accessories. You will be responsible for all shipping costs (unless the item you received was not as described). Please contact us for any other conditions for refunds. Non-Paying Bidder Policy If you bid and win an item, we expect payment in full for the item. Note: We receive so many emails in the course of a day that it is possible for us to miss yours. If you receive an item that is incorrect or has a problem with it. If the item does not match what we described it as. Please call us for a return or credit. We want to make sure you are satisfied with our service and products.", "ItemID": "142476312744", "EndTime": "2019-01-15T21:49:47.000Z", "StartTime": "2017-08-14T18:15:09.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Michael-Kelly-Patriot-Vintage-w-case-/142476312744", "ListingType": "FixedPriceItem", "Location": "Cincinnati, Ohio", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1424763127448080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NTUwWDE1MzU=/z/lIkAAOSwkr5Zkegk/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA1M1gxNTM5/z/ELcAAOSwYSRZkegY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/74wAAOSw7bpZkeT6/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/36YAAOSwIIxZkeT-/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/DeMAAOSwC~tZkeUC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/grkAAOSw~fpZkeUG/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/ANQAAOSwH9dZkeUL/$_57.JPG?set_id=8800005007"], "PostalCode": "45239", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "kohnsbestbuys", "FeedbackRatingStar": "Green", "FeedbackScore": 5961, "PositiveFeedbackPercent": 99.8}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 549.95, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 549.95, "CurrencyID": "USD"}, "HighBidder": {"UserID": "n***o", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 207}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Michael Kelly Patriot  Vintage - w/ case", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Michael Kelly"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Features", "Value": ["Evertune"]}, {"Name": "Model", "Value": ["Vintage"]}, {"Name": "Series", "Value": ["Vintage"]}]}, "HitCount": 626, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=102718871", "StoreName": "kohnsbestbuys"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Southeast Asia", "AF", "AM", "AZ", "BD", "BT", "CN", "GE", "IN", "KZ", "KR", "KG", "MV", "MN", "NP", "PK", "RU", "LK", "TJ", "TM", "UZ", "CK", "FJ", "PF", "KI", "MH", "FM", "NR", "NC", "NU", "PW", "SB", "TO", "TV", "VU", "WF", "WS", "AL", "AD", "BY", "BA", "BG", "HR", "CY", "CZ", "EE", "GI", "GG", "HU", "IS", "JE", "LV", "LI", "LT", "LU", "MK", "MT", "MD", "MC", "ME", "PL", "RO", "SM", "RS", "SK", "SI", "SJ", "UA", "AI", "AG", "AW", "BS", "BB", "BZ", "DM", "SV", "GD", "GP", "GT", "HT", "HN", "JM", "MQ", "MS", "AN", "NI", "PA", "KN", "LC", "VC", "TT", "TC", "AR", "BO", "CL", "CO", "EC", "FK", "GF", "GY", "PY", "PE", "SR", "UY", "VE", "BH", "IQ", "JO", "KW", "LB", "OM", "QA", "SA", "TR", "AE", "YE"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}