{"BestOfferEnabled": false, "Description": "U.S. buyers only! Listing may be ended early. If you want it, take action now. Final listing for this year! One used Agile AL-2500 single cutaway solid body silverburst electric guitar from 2004. Solid wood. Weighs just over 10 pounds. Set neck. Two humbuckers, two volume, two tone, one 3-way toggle pickup selector. Rosewood fretboard. Old style open book headstock which is no longer available. Hardly used, spent most of it's life in the case. Very light wear, you probably won't find a cleaner guitar from this era. Ask questions before you bid! Sold AS-IS. All sales final, NO returns! Case included. This will not be shipped until after Thanskgiving unless Buy-It-Now is used. Terms & Conditions Please take the time and read my terms and conditions. By placing a bid, you are indicating that you have read these! All Items: All items are sold \"as-is\", including new factory sealed items. Used items are functioning at the time they were listed and tested before they are shipped out. Any flaws or defects are listed. Factory sealed items are just that, FACTORY SEALED, and were purchased at retail at the time they were available, so there is no way to know if everything is there and/or it is working. In almost all cases, everything is complete and in perfect working order. Sorry, but I have to put this in here due to an unpleasant experience. Any problems with factory sealed items, please contact the manufacturer. Items With Batteries: Items that include batteries will probably need their batteries replaced when you receive it even if they are currently working, as many items I list are several years old. I put this in here due to an unpleasant experience. Shipping: I only ship items to U.S. addresses. Items with free shipping are sent the cheapest way possible since I am paying for shipping, and may take between 7 to 14 days to arrive. Items with calculated shipping are paid by the buyer. An item's shipping box size and weight is entered into the shipping calculator and the calculator does the rest. I don't set the shipping rates, the calculator does, so please don't ask \"why is shipping so high\" or \"can you ship this any cheaper\", blame the calculator. Combined Shipping: Yes, I can combine shipping on most items. Please ask ahead of time before you bid and be specific on which items you want combined. Payment: Payment is made by PayPal only, no other forms of payment are accepted. I will only ship items to confirmed PayPal addresses. If you want your item to ship to a different address, you will have to change your address in PayPal before you send payment. I will not change the shipping address once payment is received. Prompt payment is appreciated, within 24 hours of the auction end would be great. If payment is not received within 48 hours of the auction end, an Unpaid Item Case will be opened via my settings. This applies to all auctions, so check your email often to see if you've won. Buy-It-Now or Best Offer: Buy-It-Now listings require immediate payment. Sometimes there will be a Best Offer option. If you use Best Offer, please make a reasonable offer close to the asking price. If submitting an offer, please submit at least 24 hours before a listing ends. Returns: No returns or refunds of any kind. All sales are final! Feedback: I will gladly leave feedback after I have received it from the buyer. I used to leave it for all buyers, but because many people won't leave feedback, I now only leave it for people who leave it for me. Sellers need feedback as well as buyers, so please be considerate and leave positive feedback once you receive your item. When leaving feedback for Shipping Time, please do not confuse \"shipping time\" with \"delivery time\". Shipping time is how fast I gave the item to the Post Office to mail out. Delivery time is how fast the Post Office delivered the item to you. I have no control over delivery time, but generally ship my items within a day or two. Ending Auctions Early: Most of the time, I will not end auctions early, but I may end a listing if there are no bids on it, regardless of how many watchers there are since many of my items are listed elsewhere. Also, I may end a listing after the first bid is placed and sell it to the current bidder. With that being said, I highly recommend that if you see an item that interests you, bid early! Bid Retractions: Once you place a bid, it is valid until you either win the auction or are outbid. I will not cancel bids, so don't ask. International Bidders: If you live in a country other than the U.S. you will need to sign up for eBay's Global Shipping Program to obtain a U.S. shipping address, as I will only ship to U.S. addresses. Questions: If you have any questions, please ask with a minimum of 24 hours before auction end. I will be unable to answer last minute questions. Be sure to check out my other auctions! Remember, watchers don't win auctions, bidders do, so bid now! The longer you wait, the better chance that someone else comes along and wins it. Froo www.froo.com | Froo Cross Sell, Free Cross Sell, Cross promote, eBay Marketing, eBay listing Apps, eBay Apps, eBay Application", "ItemID": "323543640421", "EndTime": "2018-11-20T22:42:43.000Z", "StartTime": "2018-11-10T22:42:43.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Agile-2004-Set-Neck-AL-2500-Silverburst-LP-Style-Electric-Guitar-Case-/323543640421", "ListingType": "Chinese", "Location": "Hinsdale, New Hampshire", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/3235436404218080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg4NDA=/z/8zUAAOSwkXRbYfoi/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDky/z/YSYAAOSwYLZbYfom/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDk0/z/dh4AAOSwAV5bYfop/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg3NzY=/z/qGcAAOSwdT9bYfos/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/St8AAOSwbrRbYfov/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/P7sAAOSwrg1bYfoy/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMTAw/z/WZ0AAOSwyCNbYfo2/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMTI0/z/M28AAOSw9W5bYfo5/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMTU4/z/7XwAAOSwfjdbYfo9/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/ulYAAOSwnM1bYfpC/$_1.JPG?set_id=8800005007"], "PostalCode": "03451", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "71-too-much-stuff", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 293, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 400.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 400.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "r***d", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 107}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Agile 2004 Set Neck AL-2500 Silverburst LP Style Electric Guitar With Case", "ItemSpecifics": {"NameValueList": [{"Name": "Size", "Value": ["Full Size"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Brand", "Value": ["Agile"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}, {"Name": "Body Type", "Value": ["Solid"]}]}, "HitCount": 110, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 405.0, "CurrencyID": "USD"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 5, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}