{"BestOfferEnabled": false, "Description": "This is a rare, like new 2018 Fender Custom Shop GT11 Heavy Relic Stratocaster, a Sweetwater Exclusive model with some really unique specs. I am the sole and original owner, having purchased this guitar brand new directly from Sweetwater, which is an authorized Fender Custom Shop dealer. Original purchase price was $3,920, but you can bring her home for much less here. This Fender Custom Shop model stands toe to toe with the best instruments in Fender's long, historic line of iconic guitars. It's just a beautiful, immensely tuneful and playable instrument that sounds terrific for just about any style of music. If you love your Strats as much as I do, I cannot recommend a guitar any more than I do this one - she is an absolute killer! This guitar has been played only by me in my humidity and temperature-controlled basement studio. She is truly pristine, with only the Custom Shop's heavy relic treatment creating the worn look of a well-loved guitar. This was exactly how the guitar was delivered to me when it arrived brand new - she came with a killer, perfect setup, and plays just beautifully up and down the neck. The 11\" radius is really comfy with the oval C neck - which feels pretty slim, more like a medium C - and is great for quick runs and grabbing chords in any style of music. And harmonics just bounce off the frets on this one - really just an excellent example of superior guitar craftsmanship. The pickups are wired like a standard Strat, except that the 2nd tone knob is used to dial in the neck pickup when the middle or middle+bridge pickups are selected. It's an absolutely fantastic mod and was spec'd out this way by the awesome guitar experts at Sweetwater. You'll be surprised how useful it can be to dial in a bit of warmth/bass from the neck pickup - and playing with all 3 pickups selected sounds absolutely amazing. It will make you wonder why this mod isn't the default for ALL Stratocaster models - yes, it's that good! Here's the information from the original listing:An All-new Stratocaster That Goes to 11 Over the long and iconic history of Fender Custom Shop, thousands of Stratocaster variations have been produced. None are like this one. The GT11 starts with a lightweight, roasted alder body and a roasted AAA flame maple neck for a very open and balanced tone. With the all-new and Sweetwater-exclusive 11\"-radius fingerboard, the GT11 provides a playing surface that inspires and delivers more speed and precision. Add in three custom-wound Sweet ’64 pickups with the Half Blender switching system and Fat ’50s wiring, and you’ve got a premium guitar for any style of music. Topping off the feature-laden GT11 is an updated tremolo with improved string spacing and vintage staggered pole tuning machines. The Heavy Relic body and neck combined with Closet Classic hardware give the new GT11 Stratocaster a vintage, worn-in look and feel with precision performance. You’ve never felt a Strat neck like this one Some necks feel good, while others feel great. The GT11 Stratocaster goes way beyond great — you’ll feel an immediate personal connection to this guitar. The 11\"-radius AAA rosewood fingerboard makes everything effortless. Play a chord by the nut or play a few licks at the 14th fret; it all feels the same — smooth and incredible. And the AAA roasted flame maple neck features a ’60s-style Oval “C” shape that fills your hand perfectly, no matter where you’re playing. When we first got our hands on the GT11 here at Sweetwater, we were amazed at what a difference the 11\" radius made — especially for players who were used to a radius wider than the traditional Strat. The Holy Grail of Strat tones is right here Trying to create the ultimate Strat pickup is no easy task, but Fender Custom Shop’s Mike Lewis pulled it off nicely with his Sweet ’64s. Voiced especially for the GT11, these exclusive hand-wound pickups deliver a full-range sound with fat, round lows, sparkling highs, balanced mids, and zero ice-pick frequencies. The pickups are under-wound, giving you unparalleled note separation and clarity. When we ran the GT11 Strat through its paces, we plugged into everything from vintage amps to high-end boutique models to uber-high-gain monsters, and the Sweet ’64s performed admirably through each. The search for the Holy Grail of Strat tones ends here. All the most player-requested features The GT11 Stratocaster gives you all the most player-requested features. You get a modern 5-way position blade switch, along with one volume and two tone controls. The volume boasts Fender’s Fat ’50s hookup wiring with treble bleed to avoid tone loss with volume changes. And you also get a Half Blender tone control that blends the neck pickup into positions 1 and 2, along with a master tone control. And the middle pickup is reverse-wound/reverse-polarity, for humbucking operation in switch positions 2 and 4. Relic’d finish and hardware are packed with vintage appeal The GT11 Stratocaster is a classic Strat all the way through. Its roasted alder body sports a relic’d nitro finish, for the look of a vintage guitar that’s been played lovingly for decades. Many guitar collectors like the Heavy Relic look, but even more players get these guitars because they feel so comfortable and broken-in. While the Heavy Relic look naturally calls for highly distressed hardware, many players prefer the smoother feel of Fender’s Closet Classic hardware for a slightly aged, vintage look. The GT11 Strat looks and feels like a well-worn instrument that will be comfortable and familiar right off the bat. Fender Custom Shop GT11 Stratocaster: Sweetwater-exclusive Custom Shop StratocasterHandpicked roasted alder body produces a balanced tone with equal doses of lows, mids, and highs’60s Oval C-shaped AAA roasted flame maple neck fills your hand perfectly in all positions11\"-radius AAA rosewood fingerboard makes playing effortlessHand-wound Sweet ’64 single-coil pickups exhibit a full-range sound with fat, round lows, sparkling highs, balanced mids, and zero ice-pick frequencies5-way pickup switching with Fat ’50s hookup wiring and treble bleedHalf Blender tone control blends the neck pickup into positions 1 and 2Reverse-wound/reverse-polarity middle pickup supplies humbucking operation in switch positions 2 and 4Combines the well-worn feel of Heavy Relic wood with the newer feel of Closet Classic hardware Tech Specs Body Type: Solidbody Body Shape: Stratocaster Left-/Right-handed: Right-handed Number of Strings: 6 Body Material: Roasted Alder Body Finish: Nitrocellulose Lacquer, Heavy Relic Color: Aged Olympic White over 3-tone Sunburst Neck Material: AAA Flamed Roasted Maple Neck Shape: '60s Oval C Radius: 11\" Fingerboard Material: AAA Rosewood Fingerboard Inlay: Dots Number of Frets: 22, Medium Jumbo, Sanko 6105 Scale Length: 25.5\" Nut Width: 1.65\" Nut Material: Bone Bridge/Tailpiece: RSD Custom Shop Floating Tremolo with Bent Steel Saddles Tuners: Custom Classic Vintage Staggered Neck Pickup: Mike Lewis '64 Hand-wound Single-coil Middle Pickup: Mike Lewis '64 Hand-wound Single-coil Bridge Pickup: Mike Lewis '64 Hand-wound Single-coil Controls: 1 x master volume (Fat '50s wiring), 2 x tone (master, half-blender), 5-way blade pickup switch Strings: Fender NPS, 10-46 Case Included: Brown Tolex G&G Hardshell Case Manufacturer Part Number: 9231010506 Please feel free to ask me any questions - I will do my best to answer ASAP. Buyer to prepay via PayPal, and I will ship via UPS Ground within a couple of days, well packed to ensure safe delivery. If you are interested in expedited UPS shipping and are willing to pay my actual cost, I am more than happy to accommodate you - just let me know and we will work it out. I promise a prompt and courteous transaction - will do my best to ensure that you are happy with your purchase. I promise that this guitar is truly pristine and looks as new and clean as the day I took delivery (less of course the tasty heavy relic work done by the Fender CS!). Thanks for looking, and good luck - this one is hard for me to part with, but I really need the funds!", "ItemID": "183638144897", "EndTime": "2019-01-22T20:24:01.000Z", "StartTime": "2019-01-15T20:24:01.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2018-Fender-Custom-Shop-Heavy-Relic-Stratocaster-Olympic-White-3-Tone-Sunburst-/183638144897", "ListingType": "Chinese", "Location": "Parsippany, New Jersey", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1836381448978080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/UcEAAOSw8VtcIvIt/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/8I8AAOSwAx9cIvIv/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/vuUAAOSwseFcIvIc/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/ckkAAOSw6IdcIvIf/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/G~YAAOSwPGtcIvIi/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/IKQAAOSwEp5cIvIk/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/VygAAOSw~2VcIvIn/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/UYcAAOSw76JcIvIp/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/0-IAAOSwTEZcIvIy/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/l7EAAOSwGBRcIvI1/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Ud0AAOSw8VtcIvJY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/J8UAAOSwws5cIvI6/$_57.JPG?set_id=8800005007"], "PostalCode": "07054", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "asg618", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 323, "PositiveFeedbackPercent": 100.0}, "BidCount": 8, "ConvertedCurrentPrice": {"Value": 2515.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2515.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "_***l", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 96}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2018 Fender Custom Shop Heavy Relic Stratocaster Olympic White/3-Tone Sunburst", "ItemSpecifics": {"NameValueList": [{"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Brand", "Value": ["Fender Custom Shop"]}, {"Name": "Body Color", "Value": ["Olympic White over 3-Tone Sunburst"]}, {"Name": "Model", "Value": ["Stratocaster"]}, {"Name": "Model Year", "Value": ["2018"]}]}, "HitCount": 295, "Subtitle": "Original Hardshell Case + Case Candy + Documentation", "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 2565.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Excellent, like new", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}