{"BestOfferEnabled": true, "Description": "I first saw this guitar in the early '70s (maybe '72 or '73?) It was painted red, white, & blue in kind of a flag motif with most of the paint worn off where your arm would sit. Awesome, funky sound and loads of quirky character in this guitar when I first saw it. My guitar-playing buddy showed it to me and said he was thinking about buying it. Man, this guitar sounded great with that original soapbar pickup! I never thought he'd buy it so I saved up the cash and went to the music store where it had been... IT WAS GONE! I called him - he bought it... I told him I REALLY wanted it and ended up trading him something - my Guild 335 knock off? Something like that - and he brought it over for the trade. He took it out of the case... and it wasn't red/white/blue anymore. He had painted it black (with a brush, no less!). Sheesh! He wanted a 'black beauty' and was trying to create one somehow (with a paintbrush? on a Gibson? I had more appreciation for the red/white/blue...) Then, the soapbar pickup quit working - one of the windings broke or something? - and I had all these great ideas: \"I shall put in a humbucker, yeah, that's the ticket! ...and a brass nut! And I'll have it refretted with jumbo frets, and split the coil on the pickup and put a switching tone pot! And then I SHALL GET RID OF THIS HORRIBLE BLACK BRUSHED ON PAINT JOB! I shall STRIP off the paint and I shall refinish this beautiful wood!\" And so, I did. I did attempt to keep the serial numbers on the back of the headstock, but I used some powerful stripper to get all those layers of paint off (the red/white/blue, the heavy coat of brushed on black paint) and it just did not work to keep them on there. So, this is what you're bot here: A Les Paul Junior from 1957, completely stripped and refinished (I believe that is the correct year, but it can only be one ho of three years if I'm not mistaken - single cutaway, one piece body, pickup close to bridge, etc. I could be wrong, I have no paperwork or serial number proof so caveat emptor - check the pics and identify for yourself if you can. And PLEASE, if I'm wrong, please tell me why I'm wrong, correct me, and I will correct this listing ASAP! I put in a humbucker, Schecter tuning pegs, (it didn't stay in tune too well before with the original tuning pegs), a brass nut, new frets, new pots... my god, isn't that enough??? STOP THE MADNESS!!! I've owned this since 1973 or so, played hundreds of casual gigs over the 55 years since, but it's time to let this baby go to a better place. Great action, nice neck, great feel, I had a lot of fun playing this guitar over the decades. If I were motivated, I would probably try and find an original pickup and put it back in, but if I remember correctly, I had to router out the pickup hole to make the humbucker fit (again, STOP THE MADNESS!!!) Sheesh! Anyway, this is a nice fun guitar, a definite one of a kind from days past, it's NOT ORIGINAL by any stretch of the imagination, other than the original body & neck and awesome Gibson workmanship from the late 1950's Bid away, if this thing doesn't bring at least $500 bucks I think I'll just have it buried with me... what the heck, it's the longest relationship I've ever had, why not? YOU PAY SHIPPING - I will take it to one of those FedEx (formerly Kinko's) shipping places and let them package and ship it. From what I can tell, it will cost somewhere around $70 ot $80 bucks. I'll put a flat fee of $80 for shipping to US only, just pay me anything over that, fair enough. If it's LESS than $80, consider it payment for the supercool rainbow guitar strap - used for decades - that I'll put in the case for you. International? $100 flat rate plus anything over that. If you are anywhere near the Dallas (DFW) area, the guitar and I are in the Plano area, just North of Dallas. Buy it and come pick it up for free. Also includes a hardshell case that I bought somewhere along the line, maybe in the 80's? The 90's? I don't remember. The case is a little banged up - I did take it to hundreds of gigs over the years - but it's it good shape. You can kind of see the case in the pics. I've tried to answer as many questions as I could think of, but if you have any more, let me know and I'll do my best to answer. Thanks for looking and congratulations in advance to whoever buys my little buddy...On Nov-30-18 at 10:48:15 PST, seller added the following information: I took some additional photos showing close up of my 'masterful' router skills when I was in high school (putting the humbucker pickup in). Someone asked for more pics of that area which reminded me that I had to router out the cavity in order to have the humbucker fit. I also took pics of the control cavity, which show my masterful soldering skills when I was in high school (**cough, cough**). In addition, I took additional pics of cosmetic flaws from decades of gigs, travel, and general usage of this instrument. I've reached my picture limit but I can send an additional 5 pics to you if you ask a question. So if you need to see more pics, let me know and I'll get back to you ASAP. Thanks for looking.On Nov-30-18 at 11:25:15 PST, seller added the following information: Could be a '55 or '56?? I didn't do a lot of research before I listed my little buddy here. In following up on a question and looking at pics of confirmed '57 models, the proximity of the bridge to the pickup makes me think this could be a '56 or maybe even a '55. Look at the pics and do your own due diligence. On one hand, it's kind of cool. On the other hand I mutilated the dog doo out of this one so it might end up being irrelevant, unless you just want that nice fat neck, the bridge closer to the pickup, and that big-slab-of-wood body. Enjoy and good luck and whoever wins, please provide a good home. This instrument enjoys being played.", "ItemID": "302971469062", "EndTime": "2018-12-02T02:00:24.000Z", "StartTime": "2018-11-25T02:00:24.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-1957-Les-Paul-Junior-Heavily-Molested-see-sad-story-description-/302971469062", "ListingType": "Chinese", "Location": "Plano, Texas", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/3029714690628080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/O4wAAOSwtmNb-d6F/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Q58AAOSwaalb-d6v/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/IPoAAOSwlThb-d7Z/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/GFMAAOSwctJb-d6V/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/2s4AAOSwosdb-d6j/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/xgoAAOSwpTBb-d7p/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Uz8AAOSwCXFb-d73/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/tqUAAOSwIGxb-d8X/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/QpYAAOSwtaBb-d8n/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/qSQAAOSwYd5b-d9a/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/fJwAAOSwzqtb-d9t/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/u2QAAOSwkXFb-d~R/$_57.JPG?set_id=8800005007"], "PostalCode": "75074", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "resonantessence", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 225, "PositiveFeedbackPercent": 75.0}, "BidCount": 19, "ConvertedCurrentPrice": {"Value": 2125.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2125.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "d***u", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 207}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Americas", "GB", "DK", "RO", "SK", "BG", "CZ", "FI", "HU", "LV", "LT", "MT", "EE", "AU", "GR", "PT", "CY", "SI", "JP", "CN", "SE", "KR", "ID", "TW", "TH", "BE", "FR", "HK", "IE", "NL", "PL", "ES", "IT", "DE", "AT", "IL", "NZ", "SG", "CH", "NO", "SA", "UA", "AE", "QA", "KW", "BH", "HR", "MY", "BD", "BN", "EG", "GG", "GI", "IS", "JE", "JO", "KH", "LI", "LK", "LU", "MC", "MO", "MV", "OM", "PK", "RE"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson 1957 Les Paul Junior  - Heavily Molested (see sad story in description)", "ItemSpecifics": {"NameValueList": [{"Name": "Product Line", "Value": ["Gibson Les Paul"]}, {"Name": "Model", "Value": ["Les Paul Junior"]}, {"Name": "Exact Year", "Value": ["1957"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Body Material", "Value": ["Mahogany"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Type", "Value": ["Solid"]}]}, "HitCount": 1659, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 2150.0, "CurrencyID": "USD"}, "ProductID": {"Value": "78618852", "Type": "Reference"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": true, "ConditionDescription": "Heavily molested. This is what happens when a guy in high school in the early '70s buys one of these and thinks \"Hey, I know what I'll do...\" and then starts messing with perfection. See description for more details...", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}