{"BestOfferEnabled": false, "Description": "1997 1998 Fender Stratocaster American Standard Made in USA RH w/ Case & Extras100% GenuineHigh QualityFast Shipping Pre-owned, in good condition. Fully tested and works perfectly. No cracks anywhere. All original. Fretboard shows wear on the far side, most likely from a glass or metal slide. I&apos;ve included a photo of the wear. There is similar wear on the fretboard, though nowhere near as prevalent. Nut is still well defined and has a lot of life left in it. Frets themselves show light wear but still have a lot of life left in them. Knobs aren&apos;t loose and work perfectly well. Light cosmetic pockmarking in the finish all over the guitar. Tuning pegs and knobs are original and working perfectly. Includes roadrunner case and a ton of extra cables. Serial number of N7321808 places manufacture between 1997 or 1998. *** Will not ship internationally due to CITES restrictions *** *** Signature Confirmation will be required on delivery *** Your order will be sent&#xA0;within 1 business day of receiving payment. Our normal business hours are 9am-5pm PST All of our packages are shipped with insurance included, at our expense.&#xA0;In the very unlikely event that your item is lost or damaged during shipping,&#xA0;just reach out and we&apos;ll make it right.&#xA0; Tracking information will be uploaded to eBay immediately upon shipment.SHIPPINGUnder no circumstances will we ever end an auction early in favor of buy it now offers. It isn&apos;t fair to everyone else. If you send a message offering to buy an item now, it will be ignored. We accept PayPal as payment. California buyers are subject to an 8% sales tax. eBay collects interstate commerce sales tax for some states. Please refer to eBay&apos;s policies to see if you&apos;ll be subject to these taxes prior to placing your bid.&#xA0; Please make payment within 4 business days of auction end. If payment is not received within four days, an unpaid item case will be opened. We will never&#xA0;cancel a sale&#xA0;after an auction has ended.&#xA0; PAYMENTOur feedback score and reputation is important to us. We want you to be happy with your purchase. If you are not 100% satisfied with your purchase,&#xA0;simply reach out to us&#xA0;to return the product and get a full refund. We&#xA0;ask, as a courtesy, that you please reach out to us and give us the chance to make it right prior to opening a case with eBay. We&apos;re on the same team and want you to walk away with a positive experience.&#xA0; You can file a return&#xA0;up to 30&#xA0;days from the date you purchased it.&#xA0;Any product you return must be in the same condition in which you received it. We mark all of our items with invisible ink as a form of fraud detection and anti-tampering mechanism. By placing your bid, you are consenting to receiving your item with an invisible marking placed on it.&#xA0;RETURNS100% GenuineHigh QualityFast ShippingPre-owned, in good condition. Fully tested and works perfectly. No cracks anywhere. All original. Fretboard shows wear on the far side, most likely from a glass or metal slide. I&apos;ve included a photo of the wear. There is similar wear on the fretboard, though nowhere near as prevalent. Nut is still well defined and has a lot of life left in it. Frets themselves show light wear but still have a lot of life left in them. Knobs aren&apos;t loose and work perfectly well. Light cosmetic pockmarking in the finish all over the guitar. Tuning pegs and knobs are original and working perfectly. Includes roadrunner case and a ton of extra cables. Serial number of N7321808 places manufacture between 1997 or 1998. *** Will not ship internationally due to CITES restrictions *** *** Signature Confirmation will be required on delivery *** Fast ShippingHigh Quality100% Genuine1997 1998 Fender Stratocaster American Standard Made in USA RH w/ Case & Extras Pre-owned, in good condition. Fully tested and works perfectly. No cracks anywhere. All original. Fretboard shows wear on the far side, most likely from a glass or metal slide. I&apos;ve included a photo of the wear. There is similar wear on the fretboard, though nowhere near as prevalent. Nut is still well defined and has a lot of life left in it. Frets themselves show light wear but still have a lot of life left in them. Knobs aren&apos;t loose and work perfectly well. Light cosmetic pockmarking in the finish all over the guitar. Tuning pegs and knobs are original and working perfectly. Includes roadrunner case and a ton of extra cables. Serial number of N7321808 places manufacture between 1997 or 1998. *** Will not ship internationally due to CITES restrictions *** *** Signature Confirmation will be required on delivery *** PAYMENTUnder no circumstances will we ever end an auction early in favor of buy it now offers. It isn&apos;t fair to everyone else. If you send a message offering to buy an item now, it will be ignored. We accept PayPal as payment. California buyers are subject to an 8% sales tax. eBay collects interstate commerce sales tax for some states. Please refer to eBay&apos;s policies to see if you&apos;ll be subject to these taxes prior to placing your bid.&#xA0; Please make payment within 4 business days of auction end. If payment is not received within four days, an unpaid item case will be opened. We will never&#xA0;cancel a sale&#xA0;after an auction has ended.&#xA0; SHIPPINGYour order will be sent&#xA0;within 1 business day of receiving payment. Our normal business hours are 9am-5pm PST All of our packages are shipped with insurance included, at our expense.&#xA0;In the very unlikely event that your item is lost or damaged during shipping,&#xA0;just reach out and we&apos;ll make it right.&#xA0; Tracking information will be uploaded to eBay immediately upon shipment.RETURNSOur feedback score and reputation is important to us. We want you to be happy with your purchase. If you are not 100% satisfied with your purchase,&#xA0;simply reach out to us&#xA0;to return the product and get a full refund. We&#xA0;ask, as a courtesy, that you please reach out to us and give us the chance to make it right prior to opening a case with eBay. We&apos;re on the same team and want you to walk away with a positive experience.&#xA0; You can file a return&#xA0;up to 30&#xA0;days from the date you purchased it.&#xA0;Any product you return must be in the same condition in which you received it. We mark all of our items with invisible ink as a form of fraud detection and anti-tampering mechanism. By placing your bid, you are consenting to receiving your item with an invisible marking placed on it.&#xA0;100% GenuineFast ShippingHigh Quality Pre-owned, in good condition. Fully tested and works perfectly. No cracks anywhere. All original. Fretboard shows wear on the far side, most likely from a glass or metal slide. I&apos;ve included a photo of the wear. There is similar wear on the fretboard, though nowhere near as prevalent. Nut is still well defined and has a lot of life left in it. Frets themselves show light wear but still have a lot of life left in them. Knobs aren&apos;t loose and work perfectly well. Light cosmetic pockmarking in the finish all over the guitar. Tuning pegs and knobs are original and working perfectly. Includes roadrunner case and a ton of extra cables. Serial number of N7321808 places manufacture between 1997 or 1998. *** Will not ship internationally due to CITES restrictions *** *** Signature Confirmation will be required on delivery ***", "ItemID": "264141468290", "EndTime": "2019-01-23T03:09:23.000Z", "StartTime": "2019-01-16T03:09:23.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1997-1998-Fender-Stratocaster-American-Standard-Made-USA-RH-w-Case-Extras-/264141468290", "ListingType": "Chinese", "Location": "West Sacramento, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2641414682908080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/a64AAOSwlkpcPoIr/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/1ZUAAOSwWrxcPoIv/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/XnoAAOSwlINcPoI0/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/514AAOSwMlNcPoI5/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/-2UAAOSwjlVcPoI9/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDY3/z/tZIAAOSwoEFcPoJB/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDY3/z/lZUAAOSwRL1cPoJF/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDY3/z/2ZIAAOSwPA1cPoJK/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/4JwAAOSwrm5cPoJO/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/RAwAAOSwFlJcPoJS/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/lvIAAOSwEfVcPoJW/$_57.JPG?set_id=880000500F"], "PostalCode": "95691", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "loyaltypawn", "FeedbackRatingStar": "Purple", "FeedbackScore": 669, "PositiveFeedbackPercent": 99.7, "TopRatedSeller": true}, "BidCount": 76, "ConvertedCurrentPrice": {"Value": 650.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 650.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "3***j", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 193}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "1997 1998 Fender Stratocaster American Standard Made in USA RH w/ Case & Extras", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Model", "Value": ["Stratocaster American Standard"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model Year", "Value": ["1997"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}]}, "HitCount": 1198, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1681271450", "StoreName": "Loyalty Pawn"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller"}, "MinimumToBid": {"Value": 660.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "TopRatedListing": true, "GlobalShipping": false, "ConditionDescription": "Pre-owned, in good condition. Fully tested and works perfectly. No cracks anywhere. All original. Fretboard shows wear on the far side, most likely from a glass or metal slide. I've included a photo of the wear. There is similar wear on the fretboard, though nowhere near as prevalent. Nut is still well defined and has a lot of life left in it. Frets themselves show light wear but still have a lot of life left in them. Knobs aren't loose and work perfectly well. Light cosmetic pockmarking in the finish all over the guitar. Tuning pegs and knobs are original and working perfectly. Includes roadrunner case and a ton of extra cables.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}