{"BestOfferEnabled": true, "Description": "Stunning Fender American Vintage '64 Telecaster in beautiful 3-tone sunburst nitro lacquer and period-correct, aged vintage hardware. I'm also including a custom made 920D wiring harness and control plate with the complete Fender vintage wiring setup, so you can swap between the two control modes and rewire only the pickups. I love this guitar, but it needs to find a new home as I downsize my Telecaster collection. It's by far the nicest guitar I've ever owned, and it needs to go to an owner who is a stronger player who will love it just as much as I do! I'd estimate this guitar has about 6 hours of total play time in my basement studio, and I have never gigged with this guitar. This Telecaster is in near-mint condition, with only minor rubs to the lacquer and small dings in the finish. Please closely examine the auction images. Includes the original G&G brown tolex case with brass hardware and Fender logo. There are some small rub marks on the exterior of the case. I am a hobbyist guitar player, not a store. I cannot accept returns, so please ask any questions prior to committing to purchase. I ship all of my guitars professionally packed and fully insured via FedEx Ground. Reasonable offers are always welcome! 1964 was a monumental year for popular music and a pivotal year for the Telecaster, too, as seen in the Fender American Vintage '64 Telecaster Electric Guitar. The thicker maple necks of the '50s and early '60s now gave way to a more rounded C-shaped profile, this time topped with a round-laminated rosewood fingerboard with larger pearl dot inlays. Other vintage-accurate touches include a lightweight alder body (ash on White Blonde model), staggered bridge pickup pole magnets, threaded steel \"barrel\" bridge saddles, three-ply white pickguard with eight holes, top-hat switch tip, flat-top knurled chrome control knobs and more. The American Vintage Series has long presented some of Fender's best selling guitars (their early-'80s introduction, in fact, was one of the first signs that Fender was \"back\" as the CBS era ended). Today, Fender has boldly cleared the slate to make way for a fresh American Vintage series with new features, new specs and the most meticulous level of vintage accuracy yet. Rather than just replacing the previous models with different ones, they've completely and comprehensively re-imagined the entire vintage-reissue concept-restoring original tooling dies, voicing new pickups, reformulating vintage colors and more-based on actual vintage guitars. Includes case. FeaturesBodyBody shape: Single cutawayBody type: Solid bodyBody material: Solid woodTop wood: Not applicableBody wood: AlderBody finish: GlossOrientation: Right handedNeckNeck shape: C mid '60sNeck wood: MapleJoint: Bolt-onScale length: 25.5\"Truss rod: StandardNeck finish: GlossFretboardMaterial: RosewoodRadius: 7.25\"Fret size: MediumNumber of frets: 21Inlays: DotNut width: 1.65\" (42mm)PickupsConfiguration: SSNeck: American Vintage '64 TeleMiddle: Not applicableBridge: American Vintage '64 TeleBrand: FenderActive or passive: PassiveSeries or parallel: SeriesPiezo: NoActive EQ: NoSpecial electronics: NoneControlsControl layout: Master volume, tonePickup switch: 3-wayCoil tap or split: NoKill switch: NoHardwareBridge type: FixedBridge design: 3-saddle vintage-styleTailpiece: Not applicableTuning machines: Deluxe sealedColor: ChromeOtherNumber of strings: 6-stringSpecial features: Neck profileCase: Hardshell caseAccessories: Strap, cable, cloth and owner's manualCountry of origin: United States", "ItemID": "233060625555", "EndTime": "2018-12-27T14:59:49.000Z", "StartTime": "2018-12-21T17:38:09.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fender-American-Vintage-64-Telecaster-Electric-Guitar-3-Tone-Sunburst-/233060625555", "ListingType": "FixedPriceItem", "Location": "Madison, Wisconsin", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2330606255558080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/MsUAAOSwyUFcHQNl/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTU1MFg2MzE=/z/U2wAAOSwFu1cHQXg/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTU3OFg2OTY=/z/SBUAAOSw76lcHQXs/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/8e0AAOSwvGZcHQNl/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzE1WDE1OTU=/z/BqQAAOSwDX5cHQX8/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/rGkAAOSw5YlcHQNk/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/8qcAAOSwcnZcHQN6/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/~v8AAOSw3-9cHQON/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/HDoAAOSwcs1cHQQL/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/M1EAAOSwolpcHQNl/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/8rkAAOSwqiJcHQNl/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/rvIAAOSwIAJcHQNl/$_32.JPG?set_id=880000500F"], "PostalCode": "53719", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "tgbrass", "FeedbackRatingStar": "Purple", "FeedbackScore": 885, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1100.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1100.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "l***l", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 194}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Fender American Vintage '64 Telecaster Electric Guitar - 3 Tone Sunburst", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Multicolor"]}]}, "HitCount": 98, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}