{"BestOfferEnabled": true, "Description": "This is a beautiful Guitar. Solid Koa. Comes with case, case candy. Mint Condition. Photo of certificate of authenticity in last photo. Original lost by dealer. See description from Parker Below: Normal 0 false false false EN-US JA X-NONE Parker USA Koa Custom DF1024 This is a extremely lightly used Parker USA Koa Electric guitar, This guitar was special ordered this guitar with a Carbon Fiber fingerboard/Flame Maple neck combination rather than the carbon fingerboard/Coccobolo rosewood that this model comes standard with. This particular guitar has a very pronounced flame, probably the most flamed Koa body I’ve ever seem. It is ONE PIECE (NOT a simple thin Koa overlay on top). Guitar comes with factory hard shell case in superior condition as well as the usual stuff including tremolo arm, wrench, , etc. Below are some descriptions from Parker Literature and website: Parker MaxxFly DF1024 Solidbody Electric Guitar Features: · A premium addition to the Maxx Fly Radial Neck Joint guitar line · Beautiful koa body delivers rich sound across the spectrum · Elegant cocobolo neck offers up superior playing stability and sustain · HSS Seymour Duncan pickups and Graph Tech piezo saddles deliver tons of tone · Outfitted with a carbon fingerboard, stainless steel frets, Sperzel Trim-Lok tuners · Hardshell case included The Parker USM DF1024 Koa is a unque, versatile tone machine with amazing tonewood combinations, smooth electronics including an HSS pickup configuration with coil tap and a piezo system, providing super-realisitic acoustic tones at the flick of a switch. This DF1024 has a high end Koa body with a maple neck and the unique, solid carbon fiber fretboard. The woods together make for a very organic tone with a well-balanced response and a blooming low end without sacrificing highs. With the cocobolo neck, highs are clear and singing with an articulate upper-midrange that doesn't get muddy. The carbon fiber fingerboard means playing is smooth and setup is extremely stable as it doesn't bend or give like wood. The tones from the Graph Tech piezo system go into an amp very well and don't feedback from louder volumes like an acoustic would. You get total control over the tones with one 3-way switch that selects between the magnetic pickups, the piezo only, and the combination of both the magnetic and piezo system. Along with this, the Parker has a volume/blend knob for the piezo system, a volume for the magnetic pickups, and a tone knob with a coil tap for the bridge humbucker for full control. The output jack is mono and automatically switches between the piezo and magnetic pickups, eliminating the need for a Y-cable DF1024 The MaxxFly Radial Series is equipped with most of the great features Parker is known for in an elegantly carved new shape, showcasing a new, more traditional and ergonomically shaped upper horn while retaining the look and feel that is unmistakably Parker. The flared headstock provides more strength and allows for a thinner profile and a faster, more comfortable neck. The MaxxFly Radial Series also feature a 22 fret fingerboard enabling precise placement of the neck pickup for that classic neck-position tone. An HSS pickup configuration has been utilized for the wider palette of tones that today's guitarists demand from a high-end instrument. Pickup mounting has also been improved to allow players to swap out the included Duncans with the pickup of their choice. Our new exclusive radial neck joint ensures better transfer of tone from neck to body and a precise fit with no slippage due to lateral sliding. The DF1024 Features a Solid Figured Koa (DF1024KOA) body with a bolt-on cocobolo neck that utilizes our exclusive radial neck joint. The fretboard is our ridiculously fast playing Carbon Glass Epoxy fingerboard with Stainless steel frets and Sperzel® Trim-Lok™ tuners. A Parker custom-cast aluminum vibrato bridge with Graph Tech™ ghost® piezo saddles through the Acousti-phonic Modular Pre-amp add unparalleled versitility. Equipped with Seymour Duncan® SSL6 neck and middle pickups and a TB14 bridge pickup, the center pickup is reverse wound, reverse polarity for hum-free 2nd and 4th switch positions. It's also Midi upgradable.", "ItemID": "223337032414", "EndTime": "2019-01-23T16:37:20.000Z", "StartTime": "2019-01-21T16:04:52.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Parker-Maxx-Fly-KOA-Custom-Beautiful-Solid-One-Piece-Koa-Body-Mint-Condition-/223337032414", "ListingType": "Chinese", "Location": "Long Beach, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2233370324148080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMDcx/z/y3QAAOSwdU9bw6EE/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA4OFgxNjAw/z/zm8AAOSwdrpcGpxS/$_57.PNG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5Mzg=/z/0WMAAOSw6-Nbw6EC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MTQ=/z/1WYAAOSwI4Fbw6EL/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg2ODI=/z/JxAAAOSwCtNbw6EM/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg3NjU=/z/loMAAOSwfPlbw6EO/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjM2/z/Q7UAAOSwAvpbw6ET/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/CtAAAOSw2~Zbw6EQ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjM2/z/45oAAOSwC1Fbw6ES/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg1MzM=/z/eKkAAOSwRNhbw6EV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY4/z/FGwAAOSwi-dbw6EG/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg4MTA=/z/hHAAAOSwDP1bw6EX/$_57.JPG?set_id=8800005007"], "PostalCode": "90803", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "bubbastrat", "FeedbackRatingStar": "Red", "FeedbackScore": 2362, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 3399.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 3399.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "u***u", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 27}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Parker Maxx Fly KOA Custom. Beautiful-Solid-One-Piece Koa Body. Mint Condition", "ItemSpecifics": {"NameValueList": [{"Name": "Modified Item", "Value": ["No"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Product Line", "Value": ["Parker"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Body Material", "Value": ["Koa"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Brand", "Value": ["parker"]}, {"Name": "Body Color", "Value": ["Koa"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Model", "Value": ["Parker Max Fly Supreme Koa"]}]}, "HitCount": 41, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 3449.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Guitar is extremely lightly used. No scratches, dents dings.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}