{"BestOfferEnabled": false, "Description": "At top 40 guitarsour customers satisfaction is our first concern.All of out items have a 14 day return policy.If after 14 days you are not completely satisfiedwith your purchase, please return it for a full refund....Peace be with you... *all returned items must be in the same condition theywere at the time of sale. All original packing must be included. #Up for Sale is a 2018 Supro Westbury Electric Guitar! Turquoise Blue Finish! Gold Foil Pickups!2018 NAMM Show Display Model!Top 40 Guitars a factory authorized Supro dealer, purchased the display models from the 2018 NAMM Music Trade Show held in Anaheim, CA. USA. These were models hanging on the wall of their display for the 4-day show from January 25-28, 2018. Some of these guitars may have been played and handled during the event. Some were never even touched. I am selling these as used guitars. They have never been sold, just been on display at the show. They still have the Factory Warranty from Supro. We were able to make a below market purchase on these guitars and we are passing the savings on to you! Not a Second or Refurbished guitar. A brand New guitar that was just on display for 4-days and than sent to Top 40 Guitars! This is really cool. You are looking at a 2018 Supro Westbury Electric Guitar. All the Vintage Vibe in a Modern Guitar! From The Web:Vintage InspirationThe Westbury is a 21st-century update of the Supro electric solidbody guitar. The elegant comfort of the 1960’s-era beveled-edge Ozark body shape and the mighty sound of the original field-coil pickups have been enhanced with an ultra-fast satin neck, Tune-o-matic bridge and updated wave tailpiece.Gold Foil PickupsThe unique Gold Foil pickups found in the Supro Westbury are faithful reproductions of the original magnetics developed for Valco by Ralph Keller in the early 1950s. These pickups, which gave voice to the vintage Chicago-made Supro guitars, have a massive, broadband sound with remarkably low noise for a single-coil design.The humbucker-sized Gold Foil bridge pickup found in the Westbury is slightly overwound, while the neck pickup is reverse-wound in order to provide fully hum-cancelling sound when the two pickups are combined by selecting the middle position of the 3-way toggle switch.Modern ConstructionThe time-tested tone-wood recipe of an alder body paired with a 25 ½”-scale maple neck and rosewood fretboard combine with the Westbury’s vintage-correct pickups to produce an exceptionally dynamic playing experience.Blending vintage American tone with refined set-neck design, the Supro Westbury is intended for the professional musician who needs an ergonomic and versatile guitar capable of handling most genres of music with authority. The Westbury’s dual-pickup configuration lets the player switch effortlessly between warm, single-coil neck pickup sounds, throaty bridge tones, or a perfectly balanced, parallel combination of both pickups for rhythm work.Vintage Supro body designSet neck with black satin finish2x vintage Gold Foil pickups50’s-wiring volume and tone controlsWave tailpieceAlder bodyDot inlays6100 frets12″ radius fretboard25 ½” scale Our luthier did a complete setup. Brand new strings were installed. Gig ready on Arrival! Stand Out From The Crowd! All The Retro Vibe in a Modern Guitar! Retrolicious! Serial Number: #IW16090748 Weight: 7.90 lbs. Case is NOT Included Due to CITES Treaty for Endangered Wood (Mahogany, Rosewood) We no longer ship out of the USA. Cosmetics: Excellent Condition. Pristine. Dripping with \"Mojo\". It is used. Not perfect. Overall, a really nice guitar. Look at the pictures closely. They will tell the story. Top 40 guitars is a Veteran owned business.", "ItemID": "392212619628", "EndTime": "2019-01-21T02:10:14.000Z", "StartTime": "2019-01-11T02:10:14.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2018-Supro-Westbury-Electric-Guitar-NAMM-Show-Display-Model-MINTY-NO-RESERVE-/392212619628", "ListingType": "Chinese", "Location": "Santee, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/3922126196288080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTUzNFg5NDU=/z/saYAAOSwb2Jbhbft/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzQyWDYyOA==/z/RDcAAOSwsspbhbeU/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTUyMFg2NjM=/z/SKkAAOSw~p1bhbiM/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU2MFg5MTQ=/z/zFkAAOSwxyJbhbly/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzM0WDYxOQ==/z/g0kAAOSwefxbhbmh/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTUyNVg2Njg=/z/m2EAAOSwKF5bhbhe/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/vyUAAOSwiIRbhbjF/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/urAAAOSwaGBbhbii/$_57.JPG?set_id=8800005007"], "PostalCode": "92071", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "top40powertrio", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 13196, "PositiveFeedbackPercent": 99.7}, "BidCount": 28, "ConvertedCurrentPrice": {"Value": 480.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 480.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "w***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 26}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2018 Supro Westbury Electric Guitar! NAMM Show Display Model! MINTY! NO RESERVE!", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Turquoise Metallic"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Westbury Model 2020 TM"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Country/Region of Manufacture", "Value": ["China"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["2018"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Brand", "Value": ["Supro"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}, {"Name": "Body Type", "Value": ["Solid"]}]}, "HitCount": 291, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=47416021", "StoreName": "Top 40 Guitars"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 485.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "2018 Supro Westbury Electric Guitar, Excellent Condition, See ad below for Full Description", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}