{"BestOfferEnabled": true, "Description": "Line 6 Variax 300 Black with accessories Line 6 Gig Bag and Direct Box Product DescriptionThis guitar is in very good condition. (I'd say excellent but this is subjective so I'll just describe as Very Good Condition). Above Excellent is Mint to understand my scale which this Guitar is not. There are typical guitar pick light scratches - very light and no major scratches. I installed new batteries and tested guitar tested just fine. I also tested with the included XPS mini power supply. I purchased separately the Line 6 branded Gig Bag which was never really used outside house (just stored guitar in bag which is Like New/ Excellent Condition which these guitars did not come with). This is priced like getting the GIG Bag Free. User Manual is included and also available on-line. Custom TRS cable (not needed to play in amp), guitar strap or other standard guitar cables are NOT INCLUDED. (see pictures for specifically what is included). Available new from 2005-2009, the Variax 300 was Line 6's lowest cost modelling guitar, and shares electronics and sounds with their other 3 first generation Variax 6-string electric models: 500, 600 and 700. The 300 is most similar to the more highly regarded 600, which was available with or without a whammy bar. Power Your Variax!Keep your Variax running with the Line 6 Variax Cabled Power Box. This robust unit powers your Line 6 Variax, it also functions as a direct box. Use a (not supplied) 1/4\" TRS cable powers your Variax and sends the guitar's signal to the XPS A/B box. The XPS sports a 1/4\" and an XLR output. Send the 1/4\" signal to your amp and the XLR to the main board. By hitting the A/B button you can switch where your signal is sent to. This is perfect for acoustic guitar models that will sound better running straight through the mixer as opposed to your guitar amp. This kit adds flexibility and unlimited power to any Variax. Never worry about battery life again with the Line 6 Variax Cabled Power Kit. Includes what is pictured and this accessory box is like new condition. The Power Cable cable is included per picture but the guitar 1/4\" cables are NOT INCLUDED. This box retails $80 dollar range. The high quality padded Gig Bag is also around $100 so this is $200 range accessories. In addition to the Guitar that typically sells for $300-plus. Overall value is $500.Line 6 Variax Cabled Power Kit Features:Power your Variax at gigs or in the studio without worriesXPS A/B box works as a direct box sending your signal to your amp or mixerIncludes 9V power adapter to power XPS and your Variax Line 6 Variax 300 Modeling Guitar, Black * Agathis body with Maple neck and Indian rosewood fingerboardSix-on-a-side headstock22 medium profile frets, 25 1/2\" scale length, 12\" fingerboard radiusPODxt Live, Vetta II, and Workbench connectivity Variax 300 in black from Line 6 takes the technology and sound from the award-winning Variax family and puts in a guitar any musician can afford. The exclusive Line 6 modeling technology that lives inside this solid-body guitar enables musicians to easily access over 25 historic guitar sounds, including classic single-coil and humbucker guitars, hollow and semi-hollow jazz guitars, acoustic 6- and 12-string, dobro, sitar, banjo, and many others. Instantly familiar controls work just like any traditional guitar. XPS mini power supply box included. From the ManufacturerThe Line 6 Variax 300 is a 22-fret digital modeling guitar with a comfort-contoured agathis body, maple neck with Indian rosewood fingerboard , maple neck with Indian rosewood fingerboard, and a Baggs hardtail bridge. A couple of years before Variax® was born, we decided to turn our attention from all that guitar gear to the guitar itself. We wonderedcould it be possible to capture a complete range of this tone in one single instrument? It was a daunting task, but then so was the idea of squeezing a whole collection of amps and effects into one little kidney bean shaped metal box. So we figured, why not give it a go? We knew our sounds would have to be amazingly accurate to meet the needs of discriminating guitarists, so we began an intensive research project into guitar physics. We assembled test guitars that would make Victor Frankenstein blush. We systematically examined every factor that contributes to a guitar's tone, and developed ways to measure the complex interactions of vibrating strings, resonant bodies, and magnetic pickups. More importantly, we developed ways to capture these interactions mathematically so we could get the same sounds from our guitar. As we refined our measuring and modeling techniques, we began working on a new, powerful hardware platform that could deliver our shockingly accurate sounds. Variax needed to have less noise than a standard humbucker, the ability to switch sounds in the fraction of a second that it takes to slap a pickup selector switch to the next position, and be powered in a variety of ways. And, most importantly, perform so flawlessly that you could forget it's even there. As the body and brain neared completion, it was time for us to create the soul. We auditioned an amazing array of vintage instruments to find the ones with the most distinctive voices and personalities. We applied our painstaking measuring techniques to these specimens, and refined our models while constantly referring back to the originals for accuracy. When the model reached the point not only sounding like the original, but also being as much fun to play, it was done. Features:Comfort-contoured agathis body Maple neck with Indian rosewood fingerboard Six-on-a-side headstock 22 medium profile frets 25 1/2\" scale length 12\" fingerboard radius Standard 1/4\" guitar output jack Digital I/O jack for PODxt Live, Vetta II, and Workbench connectivity Includes XPS Mini power supply with 1/4\" standard guitar output for connection to any guitar amp Powered by XPS Mini, on-board batteries, Vetta II or PODXT Live Opaque gloss Black (this guitar). Variax Workbench:Build your own custom guitar at home on your PC or Mac®! Variax® Workbench gives you your own personal guitar custom shop with all the tools needed to easily create, store, and share the guitar you've been dreaming of. Variax Workbench allows you to completely customize Variax Electric 300, 500, 600, and 700. Now you have the tools to easily create and store the guitars you've always wanted. Select from a complete list of guitar bodies, choose pickups and placement, and tweak other parameters to design guitar models that are truly unique. This combination USB interface and software application allows you to see and hear the physical changes as you apply them to your custom guitar. You can even add alternate tunings. Once you've created your custom guitars, model patches can be stored in the included \"Tone Locker,\" downloaded into any of the 60 available positions on your Variax, and even emailed to your friends that own a Variax. Your dream guitar is just a few clicks away! Variax 300 Frequently Asked QuestionsWhat is Variax? :Variax® is the world's first modeling guitar. It offers the sounds of an entire guitar collection in a single instrument. Is Variax a MIDI guitar? No, Variax is a real guitar. All of the sounds available in Variax start with the actual string vibrations of the Variax itself. Our patented modeling process shapes the raw string signal to replicate the sounds of the modeled instruments. Does Variax work with only Line 6 amps?Variax works with any guitar amp from any manufacturer. (I think an Acoustic Amp Sounds best for a modeling guitar)How does Variax 300 differ from Variax 500 or 700?Variax 300 has a new, slimmer neck with a flatter fingerboard, rolled edges, and a six-on-a-side flat headstock. It features a comfort-contoured Agathis body, maple neck with Indian rosewood fingerboard, and a Baggs hardtail bridge. What colors does it come in? This Variax 300 comes in an opaque Black.Does it have the same models as Variax 500 and 700?Yes. Variax 300 has the identical model compliment as the 500 and 700 guitars. Is it upgradeable? Variax 300 is upgradeable, as is the 500 and 700. Can I use it with Vetta II and PODxt Live?Variax 300 is fully compatible with Vetta II and PODxt Live via the custom RJ-45 digital Variax cable. What does it come with? Variax 300 comes with an XPS mini power supply USA Shipment Only to the Lower 48 StatesPayPal Only", "ItemID": "143031954510", "EndTime": "2018-12-18T14:45:19.000Z", "StartTime": "2018-11-29T02:00:01.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Line-6-Variax-300-Black-accessories-Line-6-Gig-Bag-and-Direct-Box-/143031954510", "ListingType": "FixedPriceItem", "Location": "Columbus, Ohio", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1430319545108080_2.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMDYz/z/4FAAAOSwQH5b~05C/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDYz/z/6-AAAOSw1Ihb~0DD/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2M1gxNjAw/z/YawAAOSw5tNb~05T/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDYz/z/nRAAAOSwlAFb~0C~/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2M1gxNjAw/z/4h8AAOSwaSVb~0C~/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDYz/z/axYAAOSw8R9b~0DA/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDYz/z/UsgAAOSwZtRb~0DA/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2M1gxNjAw/z/nwEAAOSw8Dpb~0DD/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2M1gxNjAw/z/HwoAAOSwpppb~05s/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2M1gxNjAw/z/tjEAAOSwLuBb~06E/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2M1gxNjAw/z/IbsAAOSwt~1b~06o/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2M1gxNjAw/z/KTYAAOSwxPNb~0DA/$_32.JPG?set_id=880000500F"], "PostalCode": "43214", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "8159larry", "FeedbackRatingStar": "Purple", "FeedbackScore": 590, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 340.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 340.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "c***s", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 74}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Line 6 Variax 300 Black with accessories Line 6 Gig Bag and Direct Box", "ItemSpecifics": {"NameValueList": [{"Name": "Body Material", "Value": ["Mahogany", "Spruce"]}, {"Name": "Product Line", "Value": ["Variax"]}, {"Name": "Brand", "Value": ["Line 6"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["LINVA300NNT"]}, {"Name": "Body Color", "Value": ["Black"]}]}, "HitCount": 188, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}