{"BestOfferEnabled": true, "Description": "RARE Sunburst Model Fender Cabronita TELE Thinline Very Good to Excellent Comes w/ PRS gig bag Very cool sounding and playing guitar here. I bought this from the original owner who purchased it new at Highland Music in Birmingham. Shows some signs of use like light finish scratches, pick marks, but the frets show very little visible wear; 1 small nick I have pictured as well. Guitar has been recently set up with 12's, and plays like a dream! Very unique sounding guitar, twangy but at the same time has a booming low end (neck pickup). Mid and High tones are excellent, does not get muddy when you push the amp very hard. I have only played it thru my Mesa RA-100 for about 20 minutes. Good guitar for multiple music styles, Rock, Country, Jazz, hard rock, etc. Please read the specs below, thanks! An Extra-spicy Thinline Tele!Fender's Cabronita Telecaster Thinline electric guitar combines classic Tele style with a slightly rude attitude. It's got all the bark, bite, and howl you'd expect from a Thinline Tele, courtesy of its resonant chambered alder body and spanky maple neck. But, you can easily take the Cabronita Telecaster Thinline over the edge with its duo of Fideli'Tron humbucking pickups. All you need is a little tube-amp mojo and the Cabronita Telecaster Thinline's single master volume control, and you're ready to take your tone from sweet and chimey to over-the-top snarl and bite. If no ordinary Tele will do, check out Sweetwater's selection of Fender Cabronita Telecaster Thinline guitars.Fender Cabronita Telecaster Thinline Solidbody Electric Guitar at a Glance:Fideli'Tron humbuckers for tone with attitudeSimplified control set is all you need to rockChambered alder body delivers extra resonanceFideli'Tron humbuckers for tone with attitudeHuge sound, wide tonal range, and aggressive output - this is what your amplifier can expect from Fender's Fideli'Tron humbucking pickups. From smooth and mellow clean tones at the neck position, to biting lead tones at the bridge, you'll love the sound of the Fideli'Tron humbucking pickups.Simplified control set is all you need to rockWith a 3-way pickup selector and a single master volume control, the Fender Cabronita Telecaster Thinline is a straightforward tone monster. But even with a single-channel tube amplifier, you get a lot of sonic flexibility. You can cover tonal ground from subdued clean tones to overdriven aggression with just a turn of your volume knob.Chambered alder body delivers extra resonanceNot only does the Modern Player Cabronita Telecaster Thinline's chambered aldere body make this an incredibly comfortable guitar to play, but it has depth and resonance to its tone. Fat, warm, and woody, the Modern Player Cabronita Telecaster Thinline goes beyond the classic tone of a Fender Telecaster.Fender Cabronita Telecaster Thinline Solidbody Electric Guitar Features:A unique, stripped down Thinline Telecaster with a special set of humbucking pickupsDual Fideli'Tron humbucking pickups have a hot output and wide tonal responseSingle Master Volume control lets you take your amplifier from clean to meanChambered alder body is light on your shoulders and heavy on toneEffortless playability thanks to modern \"C\"-shape neck", "ItemID": "123478055509", "EndTime": "2018-12-18T21:51:47.000Z", "StartTime": "2018-11-08T17:24:16.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/RARE-Sunburst-Fender-Cabronita-Telecaster-Thinline-w-PRS-gig-bag-Filtertrons-/123478055509", "ListingType": "FixedPriceItem", "Location": "Centre, Alabama", "PaymentMethods": ["PayPal", "VisaMC", "Discover"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1234780555098080_2.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/DHcAAOSwohVcDy4k/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/NBIAAOSwNCtb5Gjk/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/fBsAAOSwVH9b5GjV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/X9QAAOSwRNtb5Gjt/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/kigAAOSwcABb5Gj-/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/0qYAAOSwQuZb5GjM/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/MRoAAOSwL4tb5GkN/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/934AAOSwYj9b5GkW/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/btQAAOSwo3Fb5GkG/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/6MIAAOSwxxVb5Gkg/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/YacAAOSwNpRb5Gkq/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/ET4AAOSwWXFb5Gk2/$_57.JPG?set_id=8800005007"], "PostalCode": "35960", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mmorgan57", "FeedbackRatingStar": "Purple", "FeedbackScore": 626, "PositiveFeedbackPercent": 98.8, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 650.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 650.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "e***t", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 0}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "RARE Sunburst Fender Cabronita Telecaster Thinline w/ PRS gig bag Filtertrons", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "Model", "Value": ["Telecaster Thinline"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Material", "Value": ["Alder"]}, {"Name": "Body Color", "Value": ["Sunburst"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["Mexico"]}]}, "HitCount": 862, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": true, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}