{"BestOfferEnabled": true, "Description": "Up for sale, a 1969 Gibson SG Standard in excellent condition and in perfect working order. One of the last great SGs of the 1960s, this guitar retains all of the features of the SG's heyday, with original Patent # stickered T Top humbuckers, long frame chrome Maestro Vibrola tailpiece, and deep carve on the body contours. We're huge fans of these SGs here at Mike & Mike's Guitar Bar, and no other Gibson can deliver the immediate attack and harmonic rich tone of these \"large 'guard\" T Top equipped Gibsons of the late '60s. The bridge pickups is surprisingly clear and twangy, with tight low end and plenty of aggressive snarl. The middle and neck positions have incredible body, and a meaty fullness that stays focused and powerful, smoothing out nicely as you roll off the tone knob. Weighing in at just 7lbs 13oz, this guitar is very light and very acoustically resonant from years of constant strumming. Setup with a fresh set of 10-46 strings and very slinky low action, few guitars are as effortless to play and tonally exquisite as this vintage SG Standard!The three-piece mahogany neck has a medium C shaped profile down near the nut, gaining incredible heft and depth as you move into the higher registers of the fretboard, achieving full \"baseball bat\" girth by the time you reach the 7th fret and beyond. The 1 9/16\" nut width (standard for Gibson SGs post-1964 through the '70s) makes open chords easy, and the depth of the profile fills the palm comfortably further up the neck in particular for a substantial feel while soloing. The nut has also been upgraded with a hand carved piece of bone for optimal clarity and sustain. The guitar has been cleanly refretted with wire that has the same width as the original frets. These frets show virtually no wear and play cleanly up the neck with no buzzing or dead spots having been recently Plek'd. On the headstock, the guitar retains the original Gibson Deluxe double line double ring tuning machines which have been fitted with new oversized tuner bushings, as the guitar had at one time been fitted with a different set of gears. There is a cigarette burn on the High E tuner button, yet it still works exactly as intended. The headstock is notable for having a serial number more in line with late '68, as well as no \"Made in USA\" stamp and no volute (both pre-1969 features).All of the electronics work as they should, with original CTS pots that date to '69, untouched solder joints, stock Sprague \"Black Beauty\" tone caps, and Switchcraft jack and switch. The body has its original three pickup route (standard for all SG Standard and Custom models at the time), large \"batwing\" pickguard, chrome hardware, and Gibson Tune-o-Matic bridge with nylon saddles and patent # baseplate. The Maestro Vibrola is one of the most effective and often overlooked vibrato designs in guitar history, working extremely well for quick flutters, surfy shimmies and deep dives with ease, jumping back to the original pitch and responding to a light touch. The knobs are an ostensibly original set of Gibson witch hat knobs, and although the caps on the knobs are gold, Gibson was known to be a bit less careful in the Norlin era when matching knobs to hardware.The Walnut nitro lacquer has a very deep and rich appearance and this guitar has zero cracks or repairs. The body has light buckle rash on the back and a few scattered nicks on the body contours and headstock edges, as well as a couple shallow nicks on the neck profile, but nothing distracting to the palm. The original pickguard has a few small screw holes around each pickup from when pickup rings were once added and subsequently removed.The original hardshell case is included. The case retains all of the original latches, with a strip of tolex missing by headstock edge of the case and one missing \"foot.\" The original handle is intact and the case has a clean gold interior. Check out our shop \"Mike & Mike's Guitar Bar,\" and please let us know if we can answer any questions!Shipping in the continental USA will be $50, fully insured and shipped via FedEx Ground. Expedited shipping available for an additional fee at buyer's request. We will happily ship WORLDWIDE, but please contact us for an accurate international shipping quote before bidding or buying, as cost varies by buyer location. International orders will be declared as “merchandise,” and the value of merchandise will be declared as the amount paid. We cannot declare anything as a gift or for a lesser value. No exceptions! The customer is responsible for all taxes and duty, which may be collected upon delivery, as well as any additional charges involved with import. We have all necessary CITES paperwork in-hand to ship rosewood worldwide.We do our best to describe all items with honesty and accuracy, but to be sure, please contact us with any questions or concerns prior to bidding or buying. We require payment within 48 hours of auction end. In the unlikely event of a return, buyer pays all shipping costs. Your positive feedback and five star ratings are very important to us, and we appreciate your communication in resolving any issues!", "ItemID": "173716795805", "EndTime": "2018-12-31T23:02:52.000Z", "StartTime": "2018-12-31T23:01:07.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1969-Gibson-SG-Standard-Vintage-Electric-Guitar-Walnut-w-T-Tops-Vibrola-Case-/173716795805", "ListingType": "FixedPriceItem", "Location": "Seattle, Washington", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1737167958058080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTE3NlgxNjAw/z/8x8AAOSwhZ5btezY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMTU1/z/c38AAOSwPfBbtezf/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMTYz/z/sPoAAOSw5oxbtezt/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/HR4AAOSwz6pbtezi/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/yy8AAOSwcWJbtezo/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/aqEAAOSwoUZbtezb/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE3NVgxNjAw/z/tuEAAOSwt5Fbtezd/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE3NlgxNjAw/z/1NUAAOSwOkxbtezk/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE4NVgxNjAw/z/Hz4AAOSwPR9btezm/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/DE8AAOSwy-5btezr/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/8JcAAOSwMWNbtezV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/6igAAOSwqcJbtezw/$_57.JPG?set_id=8800005007"], "PostalCode": "98117", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mmguitarbar", "FeedbackRatingStar": "Red", "FeedbackScore": 2591, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 4799.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 4799.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "t***t", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 528}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "1969 Gibson SG Standard Vintage Electric Guitar Walnut w/ T Tops, Vibrola, Case", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Walnut"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Material", "Value": ["Mahogany"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model", "Value": ["SG Standard"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["1969"]}, {"Name": "Body Type", "Value": ["Solid"]}]}, "HitCount": 1, "PrimaryCategoryIDPath": "619:3858:33034", "SecondaryCategoryID": "118985", "SecondaryCategoryName": "Musical Instruments & Gear:Vintage Musical Instruments:Vintage Guitars & Basses:Electric Guitars", "SecondaryCategoryIDPath": "619:181162:181163:118985", "Storefront": {"StoreURL": "https://stores.ebay.com/id=269063702", "StoreName": "Mike and Mikes Guitar Bar"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}