{"BestOfferEnabled": false, "Description": "Here’s a gorgeous 2017 Gibson SG Standard in Heritage Cherry Burst. Awesome finish that they only made for one year; 2017. It looks and plays awesome, which is why I bought this one, brand new. It’s never been gigged with. I’ve played it only at home and a few rehearsals. It shows only very regular and minimal play-wear; some pick swirling and a tiny bit of strap rub just around the button on back. There are no scratches, dings, dents or cracks. This guitar is a solid 9.5 out of 10. It’s been professionally set up with 10s and plays perfectly. Straight and true neck, Classic 57 buckers. This guitar does anything and everything you want. Buyer to pay flat $75 shipping/insurance in the 48 CONUS. Thanks! From Gibson: The Gibson SG Standard T solidbody electric guitar is a favorite with rock, blues, and jazz players everywhere. Its double-cutaway mahogany body delivers all of the resonance you'd expect from a classic instrument. A set of '57 Classic humbuckers yields vintage PAF-style tones by the truckload. Wrapping your hand around this guitar's mahogany SlimTaper neck is a joy, and its new thicker rosewood fingerboard exhibits a richer tone and makes bending incredibly smooth. Locking Grover kidney-button tuners are durable and precise. A self-lubricating TekToid nut enhances your sustain and provides an accurate return to pitch. A small teardrop pickguard adds a touch of vintage vibe to the Gibson SG Standard T solidbody electric guitar. Gibson SG Standard T Solidbody Electric Guitar at a Glance: Plek'd for precision playability The Gibson SG - a brief history SlimTaper neck feels great and provides exceptional playability Powerful, punchy pickups plus killer appointments Plek'd for precision playability This SG Standard 2017 T feels fast and precise, thanks in large part to Plek processing. Typically reserved for top-dollar custom guitars, this process levels the frets with pinpoint precision, providing you with the most playable fretboard you're likely to own. Each note rings loud and clear, and the fret edges feel smooth as silk. The Gibson SG - a brief history In the early 1960s, Gibson sought to bolster its reputation as a quality builder of electric solidbody guitars in the midst of slow sales of their now-iconic Les Paul. Originally intended as a new model of the Les Paul, this new design failed to obtain the endorsement of Les Paul himself, and as such was renamed the SG (Solid Guitar). The newly minted Gibson SG was thinner than the Les Paul, with two cutaways, pointed horns, beveled edges, and no body binding. Originally advertised as having the \"fastest neck in the world,\" the Gibson SG is presently one of the most copied solidbody electric guitar models in the world. SlimTaper neck feels great and provides exceptional playability The Gibson SG Standard T sports a comfortable, fast-action neck with a SlimTaper profile. Early Gibson guitars had huge, often ungainly necks. By 1960, Gibson had gradually carved down this profile into what became their SlimTaper neck. As your fingers move down this neck, the precisely controlled width-to-thickness ratio of the SG Standard T's SlimTaper neck provides you with a consistent, fast, and comfortable feel. It's no wonder many lifelong guitar players consider the SlimTaper Gibson's finest neck. Powerful, punchy pickups plus killer appointments Two of Gibson's best-loved humbuckers amongst Sweetwater guitarists - a '57 Classic in the neck position, and a '57 Classic Plus in the bridge - give the Gibson SG Standard T the power, punch, and clarity of Gibson's legendary PAF pickups. Other traditional appointments include a small teardrop pickguard, locking Grover kidney-button tuners, and a chromed aluminum Tune-o-matic bridge and stopbar. Gibson SG Standard T Solidbody Electric Guitar Features: Solid mahogany body delivers copious sustain Fast and comfortable SlimTaper neck profile Thicker rosewood fingerboard for improved sonic depth and playability '57 Classic humbuckers deliver classic PAF-style tones Self-lubricating TekToid nut yields great sustain and accurate return to pitch Small teardrop pickguard is a hallmark of early '60s SG Standards Durable and precise locking Grover kidney-button tuners Plek'd for precision playability The Gibson SG Standard T solidbody electric guitar delivers the goods.", "ItemID": "123544616648", "EndTime": "2018-12-28T21:16:51.000Z", "StartTime": "2018-12-14T19:15:29.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-SG-2017-Standard-T-Heritage-Cherry-Burst-/123544616648", "ListingType": "FixedPriceItem", "Location": "Little Rock, Arkansas", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1235446166488080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTEzOFgxNjAw/z/aKEAAOSwdrpcE~3l/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/awwAAOSwJtJcE~3a/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/mhAAAOSwlfNcE~3s/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMTM0/z/NnkAAOSwxoJcE~3Y/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/megAAOSw3bZcE~3c/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/-yYAAOSwBkNcE~3b/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/yhwAAOSwENVcE~3g/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/TfAAAOSwvqVcE~3v/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/dNQAAOSwFSNcE~3t/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/c5MAAOSwctJcE~3n/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/u4AAAOSw8OFcE~3w/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/U0YAAOSwbKdcHm5K/$_12.JPG?set_id=880000500F"], "PostalCode": "72212", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "cuuhl", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 342, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 999.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 999.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***a", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 478}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson SG 2017 Standard T Heritage Cherry Burst", "ItemSpecifics": {"NameValueList": [{"Name": "Product Line", "Value": ["Gibson SG"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model Year", "Value": ["2017"]}, {"Name": "Model", "Value": ["SG Standard"]}, {"Name": "Size", "Value": ["Standard"]}]}, "HitCount": 201, "Subtitle": "Unique burst finish, with OHSC and the extras", "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}