{"BestOfferEnabled": false, "Description": "At top 40 guitarsour customers satisfaction is our first concern.All of out items have a 14 day return policy.If after 14 days you are not completely satisfiedwith your purchase, please return it for a full refund.... Peace be with you ... *all returned items must be in the same condition theywere at the time of sale. #5872 Up for Sale is a 2013 Fender Telecoustic Plus! Electric-Acoustic Guitar! Sherwood Green Finish! This is really cool. You are looking at a Fender Telecoustic Plus Electric-Acoustic Guitar. Beautiful Sherwood Green Finish. These are kind of rare. They discontinued the Telecoustic a few years ago. From The Web: Electric Feel in an Acoustic! Fender's Telecoustic Plus 6-string acoustic-electric guitar bridges the gap between acoustic tone and electric playability. If you play electric guitar and you're looking for versatility, the Telecoustic Plus is your easy choice. Inspired by the iconic Tele body shape and neck you get the familiar feel of an electric guitar, making for easy change-ups during your gig. With Fishman electronics including tuner, tone shaping, and mini USB output, the Fender Telecoustic Plus 6-string acoustic-electric guitar will give you the versatile sound you have been searching for.Acoustic guitar with electric guitar playabilityFrom the neck up the Fender Telecoustic Plus is pure Tele. At Top 40 Guitars, we want you to have a guitar you can rock from the get-go, and with the maple, C-shaped neck you'll be playing this acoustic guitar like it was your favorite electric guitar instantly. The bolt-on neck joint and rosewood fingerboard combine so you experience substantial sustain and sound. Topping it all off, vintage-style chrome tuners sit atop the traditional Telecaster headstock - there's no mistaking the Plus is a true Fender! Built to last for years of music makingFor tone, beauty, and strength, Fender gives you a laminated spruce top. Spruce is known for it's responsiveness and adds a sweetness to your sound. The one-piece fiberglass back and sides give strength to the traditional acoustic guitar construction and provide warmth and tonal consistency. The Fender Telecoustic Plus also features quartersawn X-bracing supporting the top so your guitar will give you years of great tone. Fishman Isys III electronics get you heardTo ensure everyone hears the love Fender put into building the Telecoustic Plus, they chose the Fishman Isys III preamp. The Isys III has a bright LED readout tuner that auto-mutes output for tuning without having to go through your electric guitar pedalboard. Along with the output volume knob, you also have bass, mid, and treble controls for tone shaping and a battery status light so you'll never be silenced. As if all that wasn't enough, in addition to the endpin audio output Fishman put a mini USB out for easily connecting to your computer or any iOS device for easy recording or using effects apps! Fender's Telecoustic Plus 6-string Acoustic-electric Features:6-String telecaster-shaped acoustic-electric guitar Laminated Spruce top for attack and presence 1-piece fiberglass back and sides give you warmth and projection Maple bolt-on neck with rosewood fingerboard for sustain Fender c-shape maple neck plays like an electric Fishman electronics with tuner and mini USB output FEATURESType: Electracoustic SeriesModel name: TelecousticSeries: Electracoustic SeriesBody style: Acoustic StratocasterFinish: satin, (polyurethane)Top: laminated spruceBracing: X bracingBack and sides: 1-piece fiberglassNeck: mapleFingerboard: rosewoodFrets: 21Bridge: Fender rosewood with compensated saddleMachine heads: chrome, (die-cast)Electronics: Fishman Isys III On-Board Preamp with tuner, volume, bass, mid, and trebleScale length: 25.5\" (648 mm)Body depth: 3\"Width at nut: 1.69\"Width at heel: 2.12\"Unique features: oval sound hole,Dot position inlays,Telecaster headstock,Fender body shape Our Luthier did a complete setup and installed new strings. Gig Ready on Arrival! Nut Width: 1.75\" The former owner was more of a Collector than a Player. Consequently, very little playing time (if any) on this guitar. Still has the original hangtag from Fender! Case is NOT Included Due to CITES Treaty for Endangered Wood (Mahogany, Rosewood) We no longer ship out of the USA. Cosmetics: Excellent Condition. A few light strumming scratches just below the sound hole. A couple of marks on the back from being held next to the players body. Pristine. Dripping with \"Mojo\". It is used. Not perfect. Overall, a really nice guitar. Look at the pictures closely. They will tell the story. Top 40 guitars is a Veteran owned business.", "ItemID": "392202946632", "EndTime": "2019-01-07T02:05:55.000Z", "StartTime": "2018-12-31T02:05:55.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fender-Telecoustic-Plus-Electric-Acoustic-Guitar-Sherwood-Green-NO-RESERVE-/392202946632", "ListingType": "Chinese", "Location": "Santee, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/3922029466328080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTQwNlg5OTc=/z/lGcAAOSwVYhcJsac/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjM3WDQ3OQ==/z/hNYAAOSw-QBcJsZI/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU1Nlg5MDU=/z/ryEAAOSwHDdcJsbj/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU0N1gxMDMy/z/mJ4AAOSwJOJcJsdF/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTExNlg5NzU=/z/7BUAAOSw3bZcJseW/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ3Nlg5NDk=/z/oAgAAOSwM6FcJsfk/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTM3MVg5NDA=/z/mSUAAOSwJOJcJsgZ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTExM1gxMTg5/z/ZkoAAOSwPVFcJshQ/$_57.JPG?set_id=8800005007"], "PostalCode": "92071", "PrimaryCategoryID": "22966", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Acoustic Electric Guitars", "Quantity": 1, "Seller": {"UserID": "top40powertrio", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 13196, "PositiveFeedbackPercent": 99.7}, "BidCount": 57, "ConvertedCurrentPrice": {"Value": 380.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 380.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "u***u", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 33}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Fender Telecoustic Plus Electric-Acoustic Guitar Sherwood Green! NO RESERVE!!!! ", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["China"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Telecoustic"]}, {"Name": "Model Year", "Value": ["2013"]}]}, "HitCount": 492, "PrimaryCategoryIDPath": "619:3858:22966", "SecondaryCategoryID": "33034", "SecondaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "SecondaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=47416021", "StoreName": "Top 40 Guitars"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 385.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "Fender Telecoustic Plus Electric-Acoustic Guitar, Excellent Condition, See ad below for Full Description", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}