{"BestOfferEnabled": false, "Description": "At top 40 guitarsour customers satisfaction is our first concern.All of out items have a 14 day return policy.If after 14 days you are not completely satisfiedwith your purchase, please return it for a full refund....Peace be with you... *all returned items must be in the same condition theywere at the time of sale. All original packing must be included. # Up for Sale is a 1997 Fender Jimmie Vaughn Tex-Mex Signature Stratocaster! Tex-Mex Single Coil Pickups! This is really cool. You are looking at a 1997 Fender Jimmie Vaughn Tex-Mex Signature Stratocaster. What makes the Tex-Mex Strat different from a regular Strat? It’s essentially the set of Tex-Mex single-coil pickups, jumbo fretwire, and overall styling that mimics the Strats from the late 1950s/early 1960s. The bodies and necks were made at Fender’s U.S. factory in Corona, California, but were assembled and sanded in the company’s plant in Ensenada, Mexico. From The Web: While he's not the guitar superstar that his brother the late Stevie Ray Vaughan was, Jimmie has nonetheless carved out a special place in modern music for himself with his blistering hot tone. The Jimmie Vaughan Tex-Mex Strat guitar features an alder body, a specially shaped and tinted maple neck equipped with medium-jumbo frets, vintage hardware, and a single-ply white pickguard. Single-coil Tex-Mex pickups occupy the neck and middle positions and an extra-hot Tex-Mex bridge pickup with special wiring adds just the right amount of extra spice and bite. Just like Jimmie's own guitar When you think of the classic, searing hot roadhouse blues Strat sound, that's exactly the tone Jimmie Vaughan prefers. It's a bit dirty - though not to the point of true distortion - and it's bite is as sharp as razor wire! If that's the sound you're after and you aren't particularly keen on emptying your bank account to get it, then this is unquestionably the guitar for you! The Gloss Black polyurethane finish gives this Strat a classic look, and the custom-contoured body makes it amazingly comfortable to play whether you're sitting or standing. The American Vintage synchronized tremolo tailpiece lets you bend notes or entire chords up or down with remarkable tuning stability. The bottom line is clear: this is a Strat that delivers the superior tone and playability you want at a price that's sure to please! Blistering roadhouse blues sound The original Strat had three single-coil pickups, so it was able to produce sounds that no other guitar could deliver - particularly once players discovered they could lodge the 3-position blade switch in those in between positions to access different combinations. These were often erroneously referred to as the out-of-phase settings. The Jimmie Vaughan Strat comes standard with a modern 5-way blade switch, making it easy to access all the pickup combinations. To deliver on the promise of a blistering hot roadhouse blues sound, there are two Tex-Mex calibrated, overwound single coils in the neck and middle positions, along with a specially wound Tex-Mex Hot Bridge single coil. It's the perfect blend of classic Strat spank and sparkle along with a searing hot lead sound in any of the five pickup positions that will cut through any mix. Fast-playing maple neck with soft V shape Leo Fender wasn't afraid to think outside the box when it came to guitar designs - after all, he was an engineer, not a guitar player. In the 1950s and well into the 1970s, the blonde natural maple neck became almost synonymous with Fender guitars. The Jimmie Vaughan Stratocaster comes with a 1-piece, tinted maple neck and fingerboard so you get the authentic vintage look of a guitar that's played a thousand weekend gigs at hot, smoky clubs and bars. Next, add 21 medium-jumbo frets and Jimmie's personal favorite soft V shape. In keeping with contemporary player preferences, the fast-playing neck is finished in a smooth satin polyurethane.Tech Specs Body Type: Solidbody Body Shape: Stratocaster Left-/Right-handed: Right-handed Number of Strings: 6 Body Material: Alder Body Finish: Polyester Color: Black Neck Material: Maple, bolt-on Neck Shape: Soft V Radius: 9.5\" Fingerboard Material: Maple Fingerboard Inlay: Black dots Number of Frets: 21 Scale Length: 25.5\" Nut Width: 1.650\" Nut Material: Synthetic Bone Bridge/Tailpiece: Synchronized tremolo Tuners: Vintage style tuners Neck Pickup: Tex-Mex single-coil Middle Pickup: Tex-Mex single-coil Bridge Pickup: Tex-Mex Hot Bridge single-coil Controls: Master Volume, 2 x Tone, 5-way blade pickup switch Our luthier did a complete setup. Frets are in great shape. Neck is Straight. Brand new strings were installed. Gig ready on Arrival! Serial Number: #MSN706749 Nut Width: 1.65\" Weight: 7.50 lbs. Case is NOT Included Cosmetics: Excellent Condition. Some light strumming scratches on the pickguard. Both Top and Back are very clean. Neck, Fretboard and Headstock are in fine condition. Pristine. Dripping with \"Mojo\" It is used. Not perfect. Look at the pictures closely. They will tell the story. We are here to help! Top 40 guitars is a Veteran owned business.", "ItemID": "132880195428", "EndTime": "2018-12-17T02:05:41.000Z", "StartTime": "2018-12-07T02:05:41.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1997-Fender-Jimmie-Vaughn-Tex-Mex-Signature-Stratocaster-Gloss-Black-NO-RESERVE-/132880195428", "ListingType": "Chinese", "Location": "Santee, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1328801954288080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTMwNVg4NzQ=/z/KkMAAOSw7HhcCcK8/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE2OVg4ODM=/z/8foAAOSw~flcCcFy/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQzMlg4MzA=/z/XsQAAOSwgotcCcL7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTUwN1g5MTg=/z/76UAAOSw9g1cCcPP/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzI1WDU0MA==/z/arcAAOSwl29cCcNb/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ5OFg5NzE=/z/6egAAOSwrpJcCcRw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTUxNlg5NzE=/z/HeMAAOSwUqVcCcRJ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI3NFg3NzM=/z/kxoAAOSwEOJcCcQU/$_57.JPG?set_id=8800005007"], "PostalCode": "92071", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "top40powertrio", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 13195, "PositiveFeedbackPercent": 99.7}, "BidCount": 23, "ConvertedCurrentPrice": {"Value": 454.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 454.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***l", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 235}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "1997 Fender Jimmie Vaughn Tex-Mex Signature Stratocaster! Gloss Black NO RESERVE", "ItemSpecifics": {"NameValueList": [{"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Country/Region of Manufacture", "Value": ["Mexico"]}, {"Name": "Model Year", "Value": ["1997"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Brand", "Value": ["Fender"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model", "Value": ["Jimmie Vaughan Tex-Mex Strat"]}, {"Name": "Body Color", "Value": ["Gloss Black Finish"]}]}, "HitCount": 360, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=47416021", "StoreName": "Top 40 Guitars"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 459.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "1997 Fender Jimmie Vaughn Tex-Mex Signature Stratocaster Electric Guitar, Excellent Condition, See ad below for Full Description", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}