{"BestOfferEnabled": false, "Description": "CASIO PG-380 in Black, manufactured by Ibanez in Japan... as used by jazz guitarist, Stanley Jordon and by Bob Wier of Greatful Dead. Uses any 9v power supply, or 9v battery. Untested synthesizer sounds. Comes with a nice hard shell case.I am selling various musical equipment including guitars, acoustic guitars, basses, bass amps and pre-amps, effects pedals, speaker cabinets, raw vintage speakers, SKB racks, rack equipment, mixing boards, recording equipment, snakes, power amps, compressors, etc. All were purchased for personal use or collection. It all must go because I am retired, downsizing, and moving. They are all in good working condition unless stated otherwise. Some are new in original packaging or in nearly mint condition. Please check the individual item descriptions and pictures for details. I brought this particular PG-380 from a local music store. It is cosmetically in super fine shape for a guitar this old, with the usual fine polishing swirls. No major dings. The neck finish is mint and the neck adjustment works without issue. Locking mechanism at the nut and tremolo bridge keeps it right in tune. Does not include the whammy bar which has so often been lost along the way by owners of these instruments. Replacement wb's are available at Allparts. Owners Manuals are available on eBay. It has been stored for 5 years. Presently un tested. Untested onboard synthesizer sounds The guitar portion performed exactly as it should and sounds better than a Strat, in my opinion. This guitar is so cosmetically nice that I would spend the money in a heart beat to have the caps replaced and serviced if I were going to keep it. There are more than a few articles on the web on how to cure the triggering problem. Everything from powering it up and leaving it on for a day or two to charge up the capacitors, to actually replacing capacitors. ...Audio Technology at 5027 Industrial Way, Wall, NJ is experienced in repairing these guitars. Their phone number is 732-223-0274. Call for a quote. For Clarification: · The pictures are of the actual item being sold. · Pictures are part of the description. Please look closely at them. · Only items pictured are included. · This Item is being sold \"as is\" but guaranteed to be in working condition or as described when shipped Please take a good long look at the photos for physical condition. Items are examined prior to listing and we do our best to describe them as accurately as possible. Note: PLEASE READ TITLE, DESCRIPTION & TERMS CLOSELY Typo's are possible when I am listing multiple auctions for items with similar features. KINDLY ASK ALL QUESTIONS BEFORE BIDDING. ABSOLUTELY NO RETURNS ACCEPTED Accepted Payment Method: PayPal or Cash Only Payment Due within 3 days of close of auction. NO INTERNATIONAL SHIPPING Shipping costs include: Professional packaging, well padded or \"box-in-box\" method with tracking and insurance. This instrument will be fully insured and will require a signature at time of delivery, per eBay policy. Shipping charges that are calculated by the eBay shipping calculator depend upon package size, weight, and distance, extra insurance, and charges for signature requirements (if any). Some items are shipped flat rate. Please factor in the flat rate Shipping quote or the calculated shipping quote before bidding. This guitar will be shipped within 3 days of receiving cleared payment using FedEx Home or Ground Delivery. Shipped in a very nice hard shell case, inside a padded cardboard guitar outer box. Will not ship to PO Boxes or APO addresses. The following Quote is From Grant Muller from his article on PG 380's.. \" These guitars were made by Ibanez for Casio using high end components and is a great ?strat-like? guitar even without the synthesizer. PG380 guitars sold for $1500 when new in 1987. The Casio PG-380 is a guitar that translates the notes you pick on the strings into MIDI Notes. Think of it like a Keytar, only its ACTUALLY a guitar. You may think that the name brand somehow reduces the quality of this particular instrument, but you'd be mistaken; this baby is top of the line. It can translate amplitude, hammer-ons, and string bends with very little latency. I'd soon find out how hard to find, and how expensive, buying one of these would be.\" This PG380 is in exceptionally fine cosmetic conditionI SO GRAB THIS COLLECTIBLE GUITAR/synth UP NOW. Selling it only because I am planning on moving. SOLD STRICTLY \"AS IS\". Search the web\"CASIO PG-380 MIDI GUITAR , GRANT MULLER \" ... FOR ALL KINDS OF INFO ON THE PG-380including Electronics and capacitor transplant (replacement). He Provides other helpful links FROM OThER PEOPLE TOO.In the unlikely event that there are any problems, please contact me immediately and let me know. I will do my best to work out a reasonable solution with you in order to make this transaction agreeable to both parties.Items also being sold locally, so I reserve the right to cancel auctions and bids BEFORE 12 hours of closing.FREE PICKUP: I will travel up to 15 miles from 08831 in NJ to deliver in person. This excludes NJTPK and NJ Pkway rest areas. YOU MUST MAKE ARRANGEMENTS FOR FREE PICKUP BEFORE BIDDING by contacting me through the ebay messaging system. Payment arrangements will also have to be discussed and agreed upon for personal pickup.", "ItemID": "283329843083", "EndTime": "2019-01-14T18:59:30.000Z", "StartTime": "2019-01-10T09:00:14.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/CASIO-PG-380-BLACK-ELECTRIC-GUITAR-SYNTHESIZER-MIDI-IBANEZ-JAPAN-PG380-/283329843083", "ListingType": "FixedPriceItem", "Location": "Monroe Township, New Jersey", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2833298430838080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/DEMAAOSw42JZBQYS/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/knoAAOSwtGlZBeD3/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/2gEAAOSw~HBaMt4r/$_1.JPG?set_id=8800005007"], "PostalCode": "08831", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "ltquick", "FeedbackRatingStar": "Red", "FeedbackScore": 1732, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 628.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 628.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "m***k", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 831}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "CASIO PG-380 BLACK ELECTRIC GUITAR & SYNTHESIZER MIDI IBANEZ JAPAN PG380 ", "ItemSpecifics": {"NameValueList": [{"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["PG-380"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Model Year", "Value": ["1987"]}, {"Name": "Items Included", "Value": ["Hard shell case"]}, {"Name": "Features", "Value": ["Built-in Effects"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Brand", "Value": ["IBANEZ/CASIO"]}, {"Name": "Body Type", "Value": ["Solid"]}]}, "HitCount": 102, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "RU"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}