{"BestOfferEnabled": true, "Description": "Up for sale, a 1954 Gretsch Country Club 6193 in excellent condition and in perfect working order. A premier Gretsch model finished in original blonde nitro lacquer over lightly figured flame maple, this guitar boasts a full 17\" lower bout, 25 1/2\" scale, and an array of golden-era Gretsch features including hump block fretboard inlays, gold hardware, Melita bridge, G tailpiece, arrow knobs, and original DeArmond Dynasonic pickups. Acoustically the guitar has plenty of note attack and snap, and the fully hollow body allows for a rich, powerful sound that translates well through the Dynasonic pickups. The bridge position is sparkling and authoritative, with full, throaty bass response and a distinct character that comes with original DeArmond pickups. When both pickups are engaged the sound is equal parts full and snappy, and the neck pickup is girthy and thick without sacrificing clarity. The guitar weighs in at 7lbs 3oz and has been professionally setup with low action and 11-50 roundwound strings.The maple neck has a medium C shaped profile, with more heft in the higher registers of the fretboard, yet the profile shape is appreciably more slender and fast at the nut. The bound Brazilian rosewood fretboard retains the original very slender fretwire which is remarkably clean, showing just a touch of wear on the crowns of frets 1-2. A new carved bone nut measures a hair under a full 1 3/4\" in width, and the headstock boasts a set of Grover Imperials with stair-stepped buttons. While correct for this guitar, these tuners are a slightly later set from the early '60s. The back of the headstock has light black overspray to cover mounting holes of a previously removed tuner set, and the headstock face has light ghosting of slightly larger washers which were once placed around the current tuner bushings.The original arrow knobs and G tailpiece are present on the body, while the Melita bridge is a modern reissue. The pickguard is new as well, made from an original tracing for the correct '50s shape and withthick lucite construction. There is patina on the hardware, with oxidation on the original Dynasonic pickup covers and wear through the gold on the tailpiece. A strap button has been added to the neck heel. The Blonde lacquer finish is original with zero touchup or overspray and has ambered nicely, showing only small expected scuffs and light lacquer checking on the body, while the neck profile is very clean. The binding is flawless with zero deterioration, and this is a fine example of a well-kept Gretsch Country Club with zero cracks or repairs.The original Gretsch tweed hardshell case is included. All of the original latches work as they should and the case has the Gretsch banner intact on the interior purple plus case lid. Check out our shop \"Mike & Mike's Guitar Bar,\" and please let us know if we can answer any questions! Shipping in the continental USA will be $90, fully insured and shipped via FedEx Ground. Expedited shipping available for an additional fee at buyer's request. We will happily ship WORLDWIDE, but please contact us for an accurate international shipping quote before bidding or buying, as cost varies by buyer location. International orders will be declared as “merchandise,” and the value of merchandise will be declared as the amount paid. We cannot declare anything as a gift or for a lesser value. No exceptions! The customer is responsible for all taxes and duty, which may be collected upon delivery, as well as any additional charges involved with import. We have all necessary CITES paperwork in-hand to ship rosewood worldwide.We do our best to describe all items with honesty and accuracy, but to be sure, please contact us with any questions or concerns prior to bidding or buying. We require payment within 48 hours of auction end. In the unlikely event of a return, buyer pays all shipping costs. Your positive feedback and five star ratings are very important to us, and we appreciate your communication in resolving any issues!", "ItemID": "153301708638", "EndTime": "2019-01-06T10:12:50.000Z", "StartTime": "2018-12-13T09:14:36.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1954-Gretsch-Country-Club-6193-Vintage-Archtop-Electric-Guitar-w-Tweed-Case-/153301708638", "ListingType": "FixedPriceItem", "Location": "Seattle, Washington", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1533017086388080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/qIQAAOSwypZcEiKJ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/F-kAAOSw~VBcEiKW/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/icIAAOSwO-hcEiKU/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/a34AAOSwQqZcEiKc/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/3F4AAOSwK1RcEiKZ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/8JEAAOSwus5cEiLQ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/8ZYAAOSwtaBcEiKe/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/qIwAAOSwypZcEiKR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/DCcAAOSwd7FcEiKh/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/LEIAAOSw84ZcEiKM/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/j1oAAOSwKphcEiKO/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/NS8AAOSw5qdcEiLS/$_57.JPG?set_id=8800005007"], "PostalCode": "98117", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mmguitarbar", "FeedbackRatingStar": "Red", "FeedbackScore": 2591, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 5999.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 5999.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "b***e", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 4}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "1954 Gretsch Country Club 6193 Vintage Archtop Electric Guitar w/ Tweed Case", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Blonde"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Brand", "Value": ["Gretsch"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["1954"]}, {"Name": "Body Type", "Value": ["Hollow"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Body Material", "Value": ["Maple"]}, {"Name": "Model", "Value": ["Country Club 6193"]}, {"Name": "Soundboard Style", "Value": ["Archtop"]}]}, "HitCount": 334, "PrimaryCategoryIDPath": "619:3858:33034", "SecondaryCategoryID": "118985", "SecondaryCategoryName": "Musical Instruments & Gear:Vintage Musical Instruments:Vintage Guitars & Basses:Electric Guitars", "SecondaryCategoryIDPath": "619:181162:181163:118985", "Storefront": {"StoreURL": "https://stores.ebay.com/id=269063702", "StoreName": "Mike and Mikes Guitar Bar"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}