{"BestOfferEnabled": false, "Description": "You are bidding on: A very little used Epiphone solid body sunburst electric guitar in great condition. No signs of any cosmetic wear. Has been tested and is fully functional. Beautiful instrument. Look at photos and bid with confidence. Payment: Payment to be received by AV2YOU within 5 business days of close of auction. Shortly after your auction ends, we will email you payment instructions. Payments: PayPal payments must have matching billing and shipping addresses. Item Specifications: Rest assured the item sold to you is the one photographed and described. Shipping/Pickups: We ship items to the 48 lower states. We will ship to Puerto Rico, Alaska and Hawaii (for an added expense.) International shipments may be possible if size/weight permits. We will not ship large packages to P.O. boxes and APO/FPO addresses. Most of our items ship UPS Ground. Small items under 2 pounds will be shipped USPS priority at our discretion. If an item arrives damaged, we MUST be notified within 24 hours in order to assist you in filing a claim with the shipping company. If we do not hear from you within this time frame, it will be more difficult to process your claim and we will not be responsible for any declines on claims or delays. You MUST save all original packaging and inform your local delivery person if visible damage to the box is evident at the time of delivery. We will combine individual items into one order in an attempt to save shipping costs. When you are ready to pay, simply send an email requesting us to consolidate your order. DO NOT pay for items individually if you wish for them to be combined! Refund Policy: Your money will be refunded should the item arrive to you D.O.A. AV2YOU reserves the right to establish the nature of damage. If item was damaged by shipper we expect buyer to file a proper claim with the shipper and to save all original packing. By bidding on this auction you agree to all terms. Items are sold with a not-DOA* (dead on arrival) guarantee. If this product fails to work as described in the auction within 14 days from the date you receive it, let us know and we will gladly help you resolve the problem. Most of the time we can solve the issue with a simple service call as the item was operated incorrectly by user. If the item is actually DOA we will accept the return and provide a complete refund including shipping and handling. If operator error is the cause of DOA we will not issue a refund. Refunds are only given in the extreme case that the item is not the same model described and/or pictured. We cannot accept a return on any items that you \"may change your mind on.\" After the 14-day period has passed, we will not extend exchange privileges or refunds. NO EXCEPTIONS! Any item sold \"AS-IS\" in the auction condition line will not be accepted as a returned item nor will any refunds given. This means that the item has not been tested and therefore we cannot issue guarantees on such. BEFORE BIDDING, PLEASE READ THIS: Thank you for your interest in our item. My eBay reputation is important to us. We will work hard to make all of our customers satisfied. It is our goal to provide you with good service and a good deal on the products I list. If for some reason, there is any issue with our product, please do not leave bad feedback without making a fair attempt to resolve any issues. You may be surprised how hard we work to fix problems and make you a return customer. Please read carefully the description and look at the pictures before bidding! Please, serious bidders only. Once a feedback is left, we will leave a feedback for you. Contact me If you have any questions. International Bidders: We accept PAYPAL from our international bidders. We will not ship to Africa, Indonesia, or Mexico. The winning bidder is responsible for import fees and taxes. All items will be shipped with a commercial invoice for the full purchase price. Please get a quote for shipping cost prior to bidding. We will gladly use your forwarder if you have an established account with them. However, bear in mind that our packing and handling fee will apply. In the event of damage in shipping, you must report damage to the shipper immediately and allow for shipper to inspect the damage before taking any further steps to return the item. No shipping or related costs will be refunded. All items will ship with a commercial invoice for the full purchase price. Insurance: Insurance is mandatory on most items over $200. International bidders: expect insurance charges to be added to your shipping bill. Zero/Negative Feedback Bidders: We reserve the right to cancel bids from bidders with zero or negative feedback. We recommend and encourage bidders with zero or negative feedback to contact us prior to bidding on our items. Buy It Now: Please note, if there is a \"Buy It Now\" option, and you select that option, you will NOT hear from us until we close the rest of our auctions later today, usually between 4:00 - 6:00 EST. If there is no \"Buy It Now\" there was not one offered, or if the auction has a bid the \"Buy It Now\" goes away. Offers: If you are interested in an item that ends with no bids, contact us the next business day to find out if it is available.", "ItemID": "352536666210", "EndTime": "2018-12-12T23:20:51.000Z", "StartTime": "2018-12-05T23:20:51.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Epiphone-Les-Paul-Standard-Sunburst-Electric-Guitar-EXCELLENT-w-Squire-amp-/352536666210", "ListingType": "Chinese", "Location": "Ridgewood, New York", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/3525366662108080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/PzsAAOSwdUJb6tOV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/cnkAAOSw5cZb6tOv/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/4CQAAOSw~-Zb6tPF/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/4MoAAOSwrblb6tPo/$_57.JPG?set_id=8800005007"], "PostalCode": "11385", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "av2you", "FeedbackRatingStar": "Green", "FeedbackScore": 5108, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 249.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 249.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "g***t", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1524}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "CA", "GB", "DK", "RO", "SK", "BG", "CZ", "FI", "HU", "LV", "LT", "MT", "EE", "GR", "PT", "CY", "SI", "JP", "CN", "SE", "KR", "ID", "TW", "TH", "BE", "FR", "HK", "IE", "NL", "PL", "ES", "IT", "DE", "AT", "BS", "IL", "MX", "SG", "CH", "NO", "SA", "UA", "AE", "QA", "KW", "BH", "HR", "MY", "CL", "CO", "CR", "PA", "TT", "GT", "HN", "JM", "AG", "AW", "BZ", "DM", "GD", "KN", "LC", "MS", "TC", "BB", "BD", "BM", "BN", "BO", "GF", "GG", "GI", "GP", "IS", "JE", "JO", "KH", "KY", "LI", "LK", "LU", "MC", "MO", "MQ", "MV", "NI", "OM", "PK", "PY"], "Site": "US", "TimeLeft": "PT0S", "Title": "Epiphone Les Paul Standard Sunburst Electric Guitar EXCELLENT w/ Squire amp", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Sunburst"]}, {"Name": "Country/Region of Manufacture", "Value": ["China"]}, {"Name": "Non-Domestic Product", "Value": ["Yes"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Soundboard Style", "Value": ["Archtop"]}]}, "HitCount": 187, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 251.5, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Oceania"], "GlobalShipping": true, "ConditionDescription": "In very nice condition. The neck is straight and the frets are in good condition. It plays well. The guitar might have been used 3-4 times.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}