{"BestOfferEnabled": false, "Description": "All photos are of the actual item for sale. Used Item In nice condition overall. There is a small scratch by the output jack; 3 small dents on the back of the neck behind the 2nd fret; tone knobs need tightened up. Case is in excellent condition. Epiphone Ltd Ed ES-355 Semi-hollow Electric Guitar w/ Case - Alpine White - 8.8 lbs The ES-355 is one of the most iconic guitar designs in rock and Epiphone brought it back for a limited time in all its glory in three beautiful finishes--Alpine White, Ebony, and classic Cherry. When it was first introduced in 1958, the ES-355 was the world's first thinline archtop semi-electric guitar, a bold new design that combined the cutting, bell-like sustain of a solid body with the darker, complex tones of an archtop. The ES-355 also incorporated the humbucker pickup, a new design created, arguably, by famed Gibson pickup expert Seth Lover. Seth’s design eliminated the ‘hum’ found in single coil pickups and his invention quickly become legendary among guitar players. Many think of the ES-355 as one of the best electrics ever made and it can be found in the collection of all discriminating guitarists including B.B. King, Keith Richards, Jorma Kaukonen, Chuck Berry, and Noel Gallagher. Now with the Ltd. ES-355, you can have one in your collection, too. Note: The paper label inside the body states that the model is a Dot ES 355 AW. That has to be a factory error because we cannot find any reference of a DOT ES-355 in our research and \"DOT\" stands for the dot fret markers that were on the ES-335. This is not a DOT, at least not in the traditional sense. Features Classic ES-design Gold hardware and Bigsby™ vibrato Alnico Classic™ Humbuckers Tech Specs Body: 5-ply Maple pressed into Archtop profile Neck: Hard Maple Neck Profile: SlimTaper™ Scale: 24.75 Neck Pickup: Alnico Classic™ humbucker Bridge pickup: Alnico Classic™ humbucker Bridge: Epiphone Historic Tune-O-Matic™ Tailpiece: Gold Bigsby ™ Vibrato Fingerboard: Rosewood Fingerboard Radius: 12” Fingerboard Inlay: Pearloid “Blocks” Headstock Inlay: Pearloid “Split Diamond” Headstock: Clipped Dovewing Binding: Body, 5-layer white/black; Neck, 1-layer white Machine Heads: Grover® 14:1 ratio Color: Alpine White (AW) Includes Guitar SKB hard shell case, TSA approved Check out my other auction listings! and be sure to add me to your favorites list. CONTACT INFORMATION You can e-mail us with any questions you may have about an item. We are very easy to reach, and we are glad to help. Just click \"Ask a question\" in the questions and answers area below. Please note that we are not in the office after 5:00PM EST on weekdays, or all day Saturdays and Sundays. Questions asked over the weekend will be answered on the following business day. SHIPPING INFORMATION Items are shipped within one business day of payment. To avoid a lost or stolen item, your package may ship \"Signature Required.\" If you have special shipping instructions or would like your item shipped UPS instead of USPS or FedEx, please contact us before you make a purchase. We collect local sales tax here in Indiana. This applies to Indiana residents who we ship to, as well as non-Indiana residents who drive here for local pickups. We also collect sales tax in other states around the country. Please check eBay's tax information on the \"Shipping and payments\" tab above to see if we are collecting tax in your area. PLEASE NOTE Shipping quotes are estimates only. We use eBay’s shipping calculator, which provides estimated shipping charges on listings where “Free Shipping” is not offered. Ebay's FedEx calculator on the item page quotes eBay's discounted FedEx shipping rates, which we honor. At checkout, however, buyers in certain areas will see the calculator attempt to charge the full retail price. FedEx's full retail price is the price you pay if you were to walk into a FedEx retail location. The difference between eBay's discounted rate and this retail price can be as much as 40%. If you estimate shipping with a zip code that is different from the zip code registered to your User ID, eBay’s shipping calculator will make the adjustment at checkout. Additionally, FedEx charges a surcharge for delivery in certain rural areas of the country that does not, for some reason, show up in eBay’s estimate calculator; but it does at checkout (we wish we could control this, but we can’t — we have contacted eBay many times about this issue). FedEx does this based on the +4 extension of your primary 5-digit zip code. For example, eBay’s shipping calculator may quote you one price based on your primary 5-digit zip, and then figure out that your requested street address at checkout places you within the rural surcharge area, changing the shipping price to an alternate amount that was originally quoted. If there is a discrepancy in your shipping cost, please send us a screen shot of the quoted price to you on our item page and we can override the eBay checkout calculation to get you the cheapest rate. RETURN INFORMATION We want you to be completely happy with your purchase. If the item you receive is not as described or has been damaged in shipping, please contact us immediately. We will make every effort to promptly resolve any problem. Your satisfaction is our top priority. We are happy to offer free shipping on some of the items we offer. Please note that if you decide to return something where free shipping was offered, our shipping costs are non-refundable.", "ItemID": "372518384346", "EndTime": "2018-12-07T02:27:11.000Z", "StartTime": "2018-11-30T02:27:11.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Epiphone-Ltd-Ed-ES-355-Semi-hollow-Electric-Guitar-w-Case-Alpine-White-/372518384346", "ListingType": "Chinese", "Location": "Fort Wayne, Indiana", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/3725183843468080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTE1NVgxNjAw/z/87sAAOSwUm5cADSS/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg2MTU=/z/SgcAAOSw~odcADST/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU5OVgxMjgy/z/-GgAAOSwqnVcADSW/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg2NzY=/z/VZAAAOSwztVcADSX/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjcw/z/6MYAAOSwrAFcADSZ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU0MlgxNjAw/z/bUMAAOSwVMJcADSb/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE5N1gxNjAw/z/PNIAAOSwHF1cADSd/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI2N1gxNjAw/z/B0wAAOSwr7dcADSf/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE5MFgxNTk5/z/hEQAAOSw6~pcADSh/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzMwWDE2MDA=/z/pDkAAOSw~bhcADSO/$_57.JPG?set_id=8800005007"], "PostalCode": "46818", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jeffsmusicgear", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 14339, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 4, "ConvertedCurrentPrice": {"Value": 560.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 560.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "s***s", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 264}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Epiphone Ltd Ed ES-355 Semi-hollow Electric Guitar w/ Case - Alpine White", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Alpine White"]}, {"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "Model", "Value": ["ES-355"]}, {"Name": "Body Type", "Value": ["Semi-Hollow"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Features", "Value": ["Bigsby B7 vibrato"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Product Line", "Value": ["ES-355"]}, {"Name": "Soundboard Style", "Value": ["Archtop"]}, {"Name": "Country/Region of Manufacture", "Value": ["China"]}, {"Name": "Size", "Value": ["Full Size"]}, {"Name": "Body Material", "Value": ["5-layer Laminated Maple"]}, {"Name": "Model Year", "Value": ["2011"]}]}, "HitCount": 221, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=36123540", "StoreName": "jeffsmusicgear"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 570.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "TopRatedListing": true, "GlobalShipping": false, "ConditionDescription": "In nice condition overall. There is a small scratch by the output jack; 3 small dents on the back of the neck behind the 2nd fret; tone knobs need tightened up. Case is in excellent condition. Please see the photos above; they are of the actual item for sale.", "QuantitySoldByPickupInStore": 0, "SKU": "ConsignItem", "NewBestOffer": false}