{"BestOfferEnabled": false, "Description": "HEARTLAND PAWN OLATHE Schecter Diamond Series Omen-6 Walnut-Satin Electric Guitar w/ Hard case Description: ELECTRIC GUITAR: SCHECTER MODEL OMEN-6, 6 STRING, RIGHT HANDED SCHECTER DIAMOND SERIES OMEN-6 WALNUT-SATIN ELEC. GUITAR W/ HARD CASE Details Additional Details for eCommerceHARD SHELL CASE IS DAMAGED Musical Instrument Condition Rating90% - Very Good - In Great Condition and Primary Features Functional Instrument Appearance95% - Excellent Condition : Very Clean, might have some minor wear, dings, scratches, or finish cracks, but otherwise very close to new condition. Knobs - Tuners - Electronics - Input Jack95% - Guitar is like new - Very little wear - All original Musical Instrument CaseOriginal Manufacture Hard Case Included Number of Strings6 STRING Country of ManufactureMade in Korea Body StyleSOLID DexterityRight Handed Notes: Normal play/pick wear, some minor nicks and dings here and there! Great condition! Truss rod cover is flawed (bent) and not on the guitar, will be included! Includes hard case pictured! This item is guaranteed to work as designed and comes with a fourteen-day money-back guarantee. PLEASE REVIEW PHOTOS for exact cosmetic condition and design details Item will be carefully packaged & shipped fast! TERMS: If you have any questions that were not answered in the description above, feel free to send me a message prior to bidding/purchasing item. Photos are of actual item(s) being shipped unless stock photo present or otherwise stated. If you do not see an item that you believe should be included please send me a message to clarify: if it is not shown in the photos then it is considered not included unless stated otherwise Thanks for stopping by! Be sure to check out my other listings! Payment PayPal is the ONLY online payment method we accept at this time. Your PayPal account must be a Verified U.S. PayPal Account. We also recommend that you use a Confirmed Ship To Address. Shipping Your item will be shipped within 1-2 business day(s). After shipping your items will be delivered within 1-10 business days. Terms of Sale Tax applies in: KS About Us Heartland opened for business in 2010 with two brick-and-mortar locations- one in Olathe, KS and one in Overland Park, KS! We sell all types of electronics - laptops, tablets, Apple products, & cell phones.We sell all video game systems from the vintage to the latest.Bar lights, collectibles, coins, jewelry, car audio. We buy and sell pretty much anything! Whatever works best for our customer. Our goal is to do what's right for the customer first. With friendly staff and several bi-lingual associates, we provide top quality service. Everything we do is focused around our customer. People are amazed every day when they wander in to check out our store on-line or local. Clean, friendly, safe, and comfortable. Stop in today or any day! Things I Buy: Musical Instruments, Guitars, Televisions, Car Audio/Video, Jewelry, Gold, Power Tools, Vintage Video Games, Bar Lights, Coins Bravo Store Systems Point-of-Sale Operating System Bravo Omni-Commerce solutions offers Brick & Mortar stores the only fully integrated eBay API that seamlessly & effortlessly combines the in-store Point-of-Sale to all eBay commerce selling activities. Click here & find out why eBay stated \"Bravo has best solved Brick & Mortars can sell on eBay\"", "ItemID": "352544116296", "EndTime": "2019-01-12T15:14:07.000Z", "StartTime": "2018-12-13T23:38:07.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Schecter-Diamond-Series-Omen-6-Walnut-Satin-Electric-Guitar-w-Hard-HE1012902-/352544116296", "ListingType": "FixedPriceItem", "Location": "Olathe, Kansas", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/3525441162968080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/ODAwWDgwMA==/z/tPgAAOSwsRVcEu1Y/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDgwMA==/z/uBYAAOSwPYRcEu1Y/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDgwMA==/z/W4IAAOSwkvtcEu1Z/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDgwMA==/z/NkwAAOSwEONcEu1Z/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDgwMA==/z/VzMAAOSwJ3RcEu1a/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDgwMA==/z/7w4AAOSwgbdcEu1a/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDgwMA==/z/dl0AAOSwH1pcEu1b/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDgwMA==/z/O-0AAOSwTxhcEu1c/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDgwMA==/z/eFkAAOSwhrpcEu1c/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDgwMA==/z/D6QAAOSwqjhcEu1d/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDgwMA==/z/-S0AAOSwRfxcEu1d/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDgwMA==/z/jbEAAOSw~odcEu1e/$_1.JPG?set_id=2"], "PostalCode": "66061", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "hpjexpress", "FeedbackRatingStar": "Green", "FeedbackScore": 8914, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 279.85, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 279.85, "CurrencyID": "USD"}, "HighBidder": {"UserID": "b***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 19}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Schecter Diamond Series Omen-6 Walnut-Satin Electric Guitar w/ Hard  (HE1012902)", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Schecter"]}, {"Name": "Model", "Value": ["OMEN-6"]}]}, "HitCount": 811, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1002061809", "StoreName": "HPJexpress"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "Oceania", "Southeast Asia", "South America", "BM", "GL", "MX", "PM", "PO Box"], "TopRatedListing": true, "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}