{"BestOfferEnabled": false, "Description": "2011 Fender Esquire Custom Shop Relic Hand Pinstriped with Case, COA, Ash Tray, Strap, Cord etc...Serial # CZ 519411 Price drastically reduced for fast sale! There are two others of the run of 30 for sale on ebay right now for $4500 and $3600 respectively. This is a steal at $1995! They only made 30 of these in the Fender Custom Shop. Pickup hand wound by Abigail before she retired. Hand pinstriped by Dennis Ricklives. Plays and sounds awesome! From Fender: The Legendary Esquire Like Never Before! This Fender Custom Shop Limited Relic Pinstripe Esquire embodies the spirit and soul of the original 1950s Fender Esquire, Fender's original solidbody electric guitar. The foundation for the Broadcaster and, in turn, the Telecaster, this beautifully simple instrument captured the hearts of rock legends such as Billy Gibbons, Bruce Springsteen, and Paul McCartney. When you pick up your Fender Custom Shop Limited Relic Pinstripe Esquire, you'll get a connection with American music history that's down-right inspiring! But don't miss out, this Fender Custom Shop Limited Relic Pinstripe Esquire won't be available for long.Fender Custom Shop Limited Relic Pinstripe Esquire Solidbody Electric Guitar at a Glance:Artfully relic'd white blonde finish with custom pinstriping by Dennis RicklivesUnique capacitor/resistor network provides you with three fun and usable tonesOnly the perfect tonewoods will do for this Fender Custom Shop guitarArtfully relic'd white blonde finish with custom pinstriping by Dennis RicklivesProbably the first things you noticed about this stunning example of the Fender Custom Shop's craftsmanship is its artistically rendered relic treatment and beautiful pinstriping. From its one-of-a-kind AA birdseye maple neck to its classic nickel hardware, every inch of this Limited Relic Pinstripe Esquire has been worn, giving it the feel of a lifelong friend. What's more, the intricate pinstripe motif on the Limited Relic Pinstripe Esquire's body, a truly excellent added touch, was created by none other than world-famous pinstriper, Dennis Ricklives.Unique capacitor/resistor network provides you with three fun and usable tonesOne of the captivating things that guitarists ranging from Luther Perkins (Johnny Cash) to Michael Monarch (Steppenwolf) have always loved about the Fender Esquire is the marvelous range of tone you can get from just a single single-coil pickup. The Fender Custom Shop faithfully reproduced this quality in their Limited Relic Pinstripe Esquire guitar by giving it a unique capacitor/resistor network and Eldred esquire wiring. From bright and brassy to hot and unfettered, you'll find all the tone you'll ever need in this Limited Relic Pinstripe Esquire.Only the perfect tonewoods will do for this Fender Custom Shop guitarOne of the standards that the original Esquire set for Fender was the use of ash as a go-to body tonewood. Thinner than a standard Tele, this Limited Relic Pinstripe Esquire's hand-selected lightweight ash gives you the perfect combination of vivid resonance and comfortable feel. But compared to it's beautiful AA birdseye maple neck, the Limited Relic Pinstripe Esquire's body is really nothing to look at. Hand-aged and shaped to Fender Custom Shop perfection, this magnificent neck feels like a long-lost favorite guitar from the first time you pick it up.Fender Custom Shop Limited Relic Pinstripe Esquire Solidbody Electric Guitar Features:The perfect way to experience the sound and feel of a vintage Fender Esquire electric guitarClassic white blonde with pinstriping created by master pinstriper, Dennis RicklivesHand-selected lightweight ash body feels great and provides your tone with a rich resonanceCustom carved solid AA birdseye maple neck expertly balances comfort with fast actionUnique capacitor/resistor network and Eldred esquire wiring give you 3 distinct tones from a single Twisted Tele pickupFinished in nitrocellulose for a natural sound that will continue to get better with ageDocumentation and limited edition hardshell case included", "ItemID": "132892613303", "EndTime": "2018-12-19T05:41:23.000Z", "StartTime": "2018-12-18T20:28:01.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fender-Esquire-Custom-Shop-Relic-Limited-Edition-Pinstripe-1-30-COA-Case-/132892613303", "ListingType": "FixedPriceItem", "Location": "North Kingstown, Rhode Island", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1328926133038080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/19AAAOSwFu1b9964/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/n3gAAOSwkHFb9961/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/e1kAAOSw86Nb9968/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/8RQAAOSwoDFb996t/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/aZYAAOSw6jJb996~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/WooAAOSw0Ylb997L/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/VRYAAOSw-rxb996q/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/WeoAAOSwsrlb997y/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/1K4AAOSwsiFb998H/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/Y2sAAOSwGIZb998Q/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/dBAAAOSwz05b998C/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMTk5/z/SqUAAOSwEppb996x/$_57.JPG?set_id=8800005007"], "PostalCode": "02852", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "vintageguitarbuyers", "FeedbackRatingStar": "Red", "FeedbackScore": 1811, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1995.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1995.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "n***u", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1027}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "GB", "DK", "RO", "SK", "BG", "CZ", "FI", "HU", "LV", "LT", "MT", "EE", "AU", "GR", "PT", "CY", "SI", "JP", "CN", "SE", "KR", "ID", "TH", "BE", "FR", "HK", "IE", "NL", "PL", "ES", "IT", "DE", "AT", "BS", "IL", "MX", "NZ", "SG", "CH", "NO", "SA", "UA", "AE", "QA", "KW", "BH", "HR", "MY", "CO", "PA", "JM", "BB", "BD", "BM", "BN", "BO", "EG", "GF", "GG", "GI", "GP", "IS", "JE", "JO", "KH", "KY", "LI", "LK", "LU", "MC", "MO", "MQ", "MV", "NI", "OM", "PK", "PY", "RE"], "Site": "US", "TimeLeft": "PT0S", "Title": "Fender Esquire Custom Shop Relic Limited Edition Pinstripe - 1 of 30, COA & Case", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "Model Year", "Value": ["2011"]}, {"Name": "Model", "Value": ["Esquire"]}, {"Name": "String Configuration", "Value": ["Six"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Body Type", "Value": ["Solid"]}]}, "HitCount": 34, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": true, "ConditionDescription": "Pictures tell the story, super clean and sounds great!", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}