{"BestOfferEnabled": false, "Description": "Even though we've listed this item as \"used,\" it is simply an open-box unit that has been used temporarily for demonstration purposes or returned from another customer.This is an open-box deal. Please read this for product condition notes:There is a small crack on the bass side corner of the neck pocket. There is a small crack on the treble side corner of the neck pocket. There are light scratches on the back plate. There are other fine scratches on various parts of this guitar that are not shown in the pictures. These fine scratches do not show up well in pictures. Sweetwater is an Authorized Line 6 Dealer Sweetwater's 2-year warranty Fast, Free Shipping! Nearly every order received by 3PM Eastern ships the SAME DAY! FREE shipping to lower 48 states. Our central location reaches most states in 1-4 business days 99.95% warehouse accuracy Expedited shipping available We are proud to provide some of the fastest turnaround times on eBay. We use FedEx or UPS for most items, and USPS for smaller items. Residents of Hawaii, Alaska, and Puerto Rico should contact us for a shipping quote. Buy with confidence! Sweetwater's been selling on eBay since 2001, with 99.9% positive feedback! More than 30 years in business World-class customer service Fast, FREE shipping Free 2-year warranty on nearly every product Free tech support from audio experts Solidbody Modeling Electric Guitar with Alder Body, Maple Neck, Rosewood Fingerboard, 3 Single-coil Pickups, and Variax HD Modeling Engine - WhiteThe Variax Standard combines Line 6's remarkable tone-modeling electronics with Yamaha's craftsmanship to create an affordable, playable, and versatile guitar that lets you call upon an epic range of tones. This Variax offers the natural sound of custom Yamaha Alnico V single-coil pickups plus the smooth action of a tremolo bridge. On top of that, you get a full complement of Variax HD modeling, including a huge selection of guitars, tunings, and pickup styles. And with Line 6's Workbench HD software, you'll be able to turn your Variax Standard into any guitar you can imagine.Line 6 Variax Standard Modeling Solidbody Electric Guitar at a Glance:Yamaha craftsmanship makes this one extremely playable guitarVariax HD technology delivers amazing tones and instant tuningsWorkbench software lets you create your own dream guitarsYamaha craftsmanship makes this one extremely playable guitarOne of the things that's made Yamaha guitars a favorite around Sweetwater is that you always get more than you pay for when you pick up one of their instruments. Even without any of the frills Line 6's Variax HD technology has to offer, the Variax Standard is a wonderful guitar to play, with the smooth action and classic single-coil sound you'd expect out of a high-end axe. When you add in the expansive range of modeled tones and tunings, you're never going to want to put your Variax Standard down.Variax HD technology delivers amazing tones and instant tuningsYou're guaranteed to be well equipped for any studio or stage situation with the Line 6 Variax Standard. Right out of the case, your Line 6 Variax Standard comes with dozens of impeccable instrument models. Rare vintage electrics, fabulous acoustics, and even exotic instruments are waiting at your fingertips. What's more, changing tuning is as easy as turning a dial - no delay, no mechanized tuners, just instant results. The latest Variax HD software brings you more stellar HD instrument and pickup models than ever before, and the real magic happens when you tap into the Workbench HD software.Workbench software lets you create your own dream guitarsThis Line 6 Variax Standard packs the latest Variax HD technology, bringing you more stellar models of rare vintage electric guitars, classic acoustic guitars, and exotic instruments. You'll be blown away once you start exploring these with the Workbench HD software, which gives you more tonal control and all-around tweakability than you ever thought possible. Create your own unique instrument model, then use Workbench HD to fine-tune individual string pitch, string volume, pickup position, and much more. You've never tweaked your tone like you can with the Variax Standard!Line 6 Variax Standard Modeling Solidbody Electric Guitar Features:The next generation of Variax modeling guitarsCombines Line 6 modeling with Yamaha craftsmanshipSports an alder body, Alnico V single-coil pickups, and custom hardwareVariax HD modeling engine provides instrument, pickup, and tuning modelsFree downloadable Workbench HD software lets you customize your setupsIncludes charger, USB I/O with RJ45 cable, and Pilot's GuideGet Line 6's top modeling and Yamaha quality with the Variax Standard! RETURN INFORMATION We want you to be completely happy with your purchase from Sweetwater. If you are not satisfied with your product, you may return it for a refund of the purchase price within 30 days. If your purchase was eligible for Free Shipping, the shipping cost will be deducted from your credit or refund. Returns must be in the complete and original packaging with all accessories and complete documentation (Owner's Manual, warranty card, quick start guides, etc.), show no signs of wear or use, and include a Return Authorization number or be subject to a restocking fee. Some products are not returnable, including: Special orders Software Oversized or overweight items Discontinued products, closeouts, and used products Cymbals Tubes Speakers Drumsticks Guitar strings Personal items (earphones, harmonicas, mouthpieces, etc.)", "ItemID": "264140990467", "EndTime": "2019-01-17T16:08:57.000Z", "StartTime": "2019-01-15T20:39:41.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Line-6-Variax-Standard-Dent-and-Scratch-White-Open-Box-/264140990467", "ListingType": "FixedPriceItem", "Location": "Fort Wayne, Indiana", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2641409904678080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NzUwWDUwMA==/z/-0gAAOSwmaJcPkPc/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/NzUwWDUwMA==/z/eOQAAOSw5tNcPkPd/$_1.JPG?set_id=2"], "PostalCode": "46818", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "sweetwatersound", "FeedbackRatingStar": "RedShooting", "FeedbackScore": 275032, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 494.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 494.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "k***3", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 31}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Line 6 Variax Standard, Dent and Scratch - White (Open Box)", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Line 6"]}, {"Name": "MPN", "Value": ["99-700-0105-01-DNS"]}]}, "HitCount": 82, "Subtitle": "Great Value! Open box discount & free 2-year warranty!", "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=36121123", "StoreName": "Sweetwater Sound"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 0, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["US Protectorates", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "Oceania", "Southeast Asia", "South America", "BM", "GL", "MX", "PM"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "SKU": "VaxSTWHDnSd1", "NewBestOffer": false}