{"BestOfferEnabled": true, "Description": "DESCRIPTION: 2013 Gibson Les Paul Standard Gary Moore Tribute guitar in stunning lemon burst flame! They are legendary and timeless guitars with an enormous following of musicians of all kind. This GUITAR was played very little with zero fret ware and near MINT condition. No obvious dings, dents, or scratches whatsoever! Fantastic condition. Huge tone on this coveted Les Paul. This guitar has an awesome vibe! Really versatile and rich guitar. All original. Includes Gary Moore Gibson hard Case with paperwork. SEE many images below!! Great deal!! Some Basics about the Gary Moore from Gibson:Gary Moore Les Paul StandardFrom his scorching playing with Skid Row and Thin Lizzy to his incendiary solo work, Gary Moore produced some of the most powerful guitar performances known to stage and studio from the mid ’70s right up until his untimely death in 2011. Throughout his career, Moore virtually defined high-octane blues-rock, coining a signature tone that thousands have sought to emulate. Across three decades of playing, his weapon of choice remained the mighty Les Paul, one of which was the legendary ’59 Burst originally owned by Fleetwood Mac guitarist Peter Green.Now Gibson USA honors this certified guitar legend with the Gary Moore Les Paul Standard, a first-class Les Paul decked out to this demanding artist’s preferred specifications. Many details are reminiscent of the famed “Peter Green Les Paul,” formerly played by Gary Moore and now owned by collector Melvyn Franks. From its highly flamed maple top with Lemon burst finish, to its traditional Les Paul Model headstock with signature truss-rod cover, to its mismatched amber and gold top-hat knobs, the Gary Moore Les Paul Standard offers uncompromising looks. Plug in and fire up its BurstBucker Pro humbucking pickups via Orange Drop tone caps, all anchored with a quality TonePros™ hardware, and it rips it up with a tone fit to carry the name, Gary Moore.Body and NeckThe Gary Moore Les Paul Standard is rooted in Les Paul tradition, with a top carved from figured Grade-AA maple, and a back crafted from Grade-A mahogany. To better show of the luscious nitrocellulose Lemonburst finish, the body carries no binding or pickguard. It is strategically weight-relieved to render this a superbly comfortable guitar. The neck is made from quarter-sawn Grade-A mahogany and carved to a rounded ’50s profile that measures 0.818” at the 1st fret and 0.963” at the 12th. It is topped with an unbound Granadillo fingerboard with 22 medium-jumbo frets and traditional acrylic trapezoid inlays.Pickups and ElectronicsThe two BurstBucker Pro pickups on the Gary Moore Les Paul Standard blend the best of Gibson’s hallowed PAF humbuckers with the versatility required by today’s high-gain rockers. These pickups are made with Alnico V magnets and wound with 42 AWG wire—with extra turns in the bridge pickup’s coils for a hotter lead sound—but are wax potted to withstand high volume levels without microphonic squeal. The neck pickup is reversed in its mounting, in recognition of a similar modification to Peter Green’s Les Paul. The guitar carries the traditional control layout, with Orange Drop tone capacitors, and mismatched amber and gold top hat knobs on the neck and bridge pickup controls respectively.Hardware and AppointmentsA TonePros™ Tune-o-matic bridge and stopbar tailpiece with locking mounting hardware partner with TonePros™ Kluson green-key tuners to comprise a first-class hardware set.", "ItemID": "303004074094", "EndTime": "2018-12-26T18:29:59.000Z", "StartTime": "2018-12-20T22:56:01.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2013-Gibson-Les-Paul-Standard-Gary-Moore-Signature-Tribute-Lemonburst-/303004074094", "ListingType": "FixedPriceItem", "Location": "Virginia Beach, Virginia", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/3030040740948080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NjQwWDQ4MA==/z/V-kAAOSwi6dcHBs3/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjQwWDQ4MA==/z/3ywAAOSwjthcHBtI/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjQwWDQ4MA==/z/BAQAAOSwctJcHBta/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjQwWDQ4MA==/z/B3cAAOSwl5JcHBto/$_32.JPG?set_id=880000500F"], "PostalCode": "23464", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "chuck928surfing", "FeedbackRatingStar": "Blue", "FeedbackScore": 90, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 2000.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2000.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "r***o", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 217}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2013 Gibson Les Paul Standard Gary Moore Signature Tribute Lemonburst", "ItemSpecifics": {"NameValueList": [{"Name": "Product Line", "Value": ["Gibson Les Paul"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model Year", "Value": ["2013"]}, {"Name": "Model", "Value": ["Les Paul Standard"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}]}, "HitCount": 153, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}