{"BestOfferEnabled": true, "Description": "Guild Newark St. Collection Bluesbird in Gloss Black A Chambered Flamed Maple Solid Body Electric Guitar With USA Seymour Duncan Pickups Includes a Guild Deluxe Gigbag Vintage jazz guitar tone and style from the brand that helped define it! The Bluesbird reflects Guild’s return to yet another historic solid body model. Originally released in 1970 as the solid body counterpart to the M-75 Aristocrat, the Bluesbird was subject to a few design changes over the decades. Today’s reissue features a carved maple top and maintains many of the aesthetic traits of the M-75 Bluesbird of the late 60s. Its lightweight chambered mahogany body allows for improved resonance and unparalleled comfort, making this guitar one of the lightest in its class. The Bluesbird features a 24 3/4” scale, and fast-playing vintage C shaped neck. While many of the Bluesbird’s specifications remain faithful to the original model, today’s updated version comes equipped with USA-made Seymour Duncan pickups, as well as a TonePros locking tune-o-matic bridge and stopbar tailpiece to offer the most versatile version of this guitar to date. Grover Sta-Tite tuning machines Bluesbird Specifications Body Type: Chambered Solid Body Body Top: Maple Body Shape: Bluesbird Finish: Gloss Polyurethane Body Binding: Cream Body Depth: 1 1/2″ (38mm) at edge Body Width Lower Bout: 13 3/4″ (349mm) Body Width Upper Bout: 9 3/4″ (248mm) Overall Guitar Length: 39 1/2″ (1003mm) Neck Material: 1-Piece Mahogany Neck Shape: Vintage Soft “U” Neck Finish: Gloss Polyurethane Scale Length: 24 3/4″ (628 mm) Nut Width: 1 11/16″ (43 mm) Nut Material: Bone Neck Binding: Cream Fingerboard Material: Rosewood Fingerboard Radius: 10″ Fingerboard Inlays: Mother-Of-Pearl Block # of Frets: 22 Fret Size: Medium Jumbo Tuning Machines: Grover Sta-Tite 18:1 Hardware Finish/Plating: Nickel Plated Truss Rod: Dual-Action Truss Rod Wrench: 7mm Nut Driver Bridge: TonePros NVR2 Locking Tune-O-Matic Strings: D’Addario EXL110 .010-.046 Nickel Wound Gig Bag: Guardian Deluxe Padded Gig Bag in Black Bridge Pickup: Seymour Duncan USA JB SH-4 with nickel cover Neck Pickup: Seymour Duncan USA 59 Neck SH-1 with nickel cover Pickup Configuration: HH Pickup Switches: 3-Position Toggle: Position 1. Bridge Pickup Position 2. Bridge and Neck Pickups Position 3. Neck Pickup Control Knobs: Guild G Shield – Black/Silver Controls: Volume 1. (Neck Pickup) Tone 1. (Neck Pickup) Volume 2. (Bridge Pickup) Tone 2. (Bridge Pickup) Strap Buttons: Vintage-Style Pickguard: Black with Guild Logo Condition: When this model came into the refurbishing center they could not find anything wrong. It is in Excellent original clean condition and has had no modifications made to the instrument. May show minor signs of playing/handling from inspection, cleaning, testing, and setup. There are no flaws, dings, scratches, repairs, or imperfections noted. It is set up to standard specifications. o *If electronics are included and in the specifications section they will be working as they should*.o *The instrument is NOT stamped used on the back of the headstock and has the original serial number from the factory/manufacturer. o *Used and Re-Manufactured/Refurbished guitars do NOT include a factory warranty.An Amazing deal on a great sounding and playing instrument, as with any auction/sale please look at all the pictures, descriptions, etc. and ask question before bidding, making offers, or purchasing. Each guitar and stringed instrument we sell has been hand-picked, fully inspected, and cleared by a certified luthier from MIRC, the largest Refurbishment distribution/reclamation center in the USA that obtain guitars direct from the factory. Our Guitars Look and Play Great! Many of the guitars we sell are Discontinued Models, Old Stock, surplus, etc., (and are in excellent clean original condition with the exception of testing, inspection, cleaning, etc.) Per the manufacturer we are required to list Epiphone and Taylor guitars as seller refurbished. All our instruments are checked and double checked by both our store and the manufacturer refurbishing center in the USA. Any instruments with blemishes, visible flaws, or any repairs are detailed and outlined in the description and include pictures of the specific flaw. Free Shipping is for the lower USA 48 All other States, provinces, APO/FPO addresses, and/or international buyers please contact us prior to purchasing for a shipping quote/Price to your Location Shipping: Shipping guitars comes down to more than just the price shipping companies charge to ship your instrument. Due to cost variances by location of customer, we sell each instrument at the best price we can to provide you, the customer, a great value. By doing this we do not include any extras in the sale price for shipping 1. We carefully package and take the extra expense and time to package your item so it arrives safely 2. Each guitar that does not get shipped with a case is double boxed and securely wrapped in the first box to protect your investment, (guitars with cases are securely packaged in the case the same as if placed in the first containment box) 3. The instrument is detuned and the body, neck, and headstock are secured to prevent movement using packing paper or other materials 4. We then securely place the box into a heavy duty guitar box and carefully package for shipment using packing paper and other materials a. These boxes and packing materials cost extra and thus raise the cost to ship your guitar which is not reflected in the purchase price of each instrument but in the shipping cost; as destinations, insurance , etc. change the cost of each shipment 5. We strive to provide you with the best experience possible by a. Packaging and shipping within a 24 hour period once payment is received b. We offer economy and standard shipping selections c. Once shipped please let us know if there are delayed delivery times and/or delays so we may help by contacting d. All instruments require a signature for delivery. This is a best practice and provides for a safe and secure transaction for both the seller and buyer All International buyers are Responsible for any and all Duties, Taxes, and/or Import Fees All International Sales are Final International Buyers Must contact me for shipping fees prior to purchasing if not listed in the shipping section of the listing Pictures are of actual guitar for sale!! Due to the High Gloss Finish The Reflections you see are due to lighting They are not imperfections in or of the guitar", "ItemID": "401601265369", "EndTime": "2019-01-06T23:20:18.000Z", "StartTime": "2018-09-18T16:06:04.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Guild-Newark-St-Collection-Bluesbird-w-USA-Seymour-Duncan-Pickups-W-DLX-Gigbag-/401601265369", "ListingType": "FixedPriceItem", "Location": "Palmyra, Virginia", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/4016012653698080_2.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA0MFgxNjAw/z/n74AAOSwfzdboSII/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjM3WDE2MDA=/z/bk8AAOSw38VboSH3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDU5WDE2MDA=/z/uToAAOSwmO5boSH4/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTI0WDE2MDA=/z/WSEAAOSwtYJboSIF/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDUyWDE2MDA=/z/pjoAAOSwiFtboSH6/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzI3WDE2MDA=/z/pb8AAOSwDHFboSH8/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzY0WDE2MDA=/z/WC4AAOSwBydboSH9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNTY1/z/Au4AAOSwyMhboSID/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzU2WDE2MDA=/z/7dwAAOSw4n1boSIB/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODYwWDE2MDA=/z/u4UAAOSw3FNboSH~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTI2WDE2MDA=/z/JlcAAOSwb4VboSIG/$_57.JPG?set_id=8800005007"], "PostalCode": "22963", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "cogswheel_music", "FeedbackRatingStar": "Red", "FeedbackScore": 3246, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 540.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 540.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "h***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 322}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Guild Newark St. Collection Bluesbird w/USA Seymour Duncan Pickups W/DLX Gigbag", "ItemSpecifics": {"NameValueList": [{"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Bluesbird"]}, {"Name": "Country/Region of Manufacture", "Value": ["Korea, Republic of"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Brand", "Value": ["Guild"]}, {"Name": "Body Type", "Value": ["Chambered Solid Body"]}]}, "HitCount": 740, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=49435803", "StoreName": "Cogswheel Music and Guitar Co"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Middle East", "Oceania", "Southeast Asia", "South America", "RU", "AL", "AD", "BY", "BE", "BA", "BG", "HR", "CY", "CZ", "EE", "GI", "GR", "GG", "HU", "IT", "JE", "LV", "LI", "LT", "LU", "MK", "MT", "MD", "MC", "ME", "RO", "SM", "RS", "SK", "SI", "SJ", "UA", "VA", "GL", "MX", "PM"], "GlobalShipping": false, "ConditionDescription": "When this model came into the refurbishing center they could not find anything wrong. It is in Excellent original clean condition and has had no modifications made to the instrument. May show minor signs of playing/handling from inspection, cleaning, testing, and setup. There are no flaws, dings, scratches, repairs, or imperfections noted. It is set up to standard specifications. The instrument is NOT stamped used on the back of the headstock and has the original factory serial number. *Used and Re-Manufactured/Refurbished guitars do NOT include a factory warranty.An Amazing deal on a great sounding and playing instrument, as with any auction/sale please look at all the pictures, descriptions, etc. and ask question before bidding, making offers, or purchasing.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}