{"BestOfferEnabled": false, "Description": "This guitar is almost new. I rarely played it and it's been in its case for almost three years. It has a nitrocellulose lacquer finish over a transparent blue (Caribbean Blue) front and a dark navy blue back (I think together they are called Caribbean Night). It has a slim-taper, 60s profile neck with 12\" radius. Very easy to play. I'm not sure of the weight, but it's very light and very balanced, especially for a Les Paul. The G-Force tuners are great for standard tuning, but the best part is that if you like different tunings they can do it in a few seconds. If you've never used alternate tunings, this guitar is an excellent way to discover them. Just experiment with all the factory settings (32 of them). I had never used alternate tunings much but really liked this part of the G-Force system. If you want an instant drop D or open G, or drop double D, or anything else you can think of, they can do it within a few seconds. They are also fun to randomly change to different tunings and see what it sounds like. Both pickups have coil splitting and a boost circuit which is very useful. It has a small scuff on the back, shown in photo 6. That's not a chip or dent. It's just sort of a dull spot in the lacquer. The pickups are a 57 Classic in the neck and a 57 Super in the bridge. I tested everything and it works and sounds perfect. Here is a link to the factory video about the guitar https://www.youtube.com/watch?v=LzyTqBSLKRU It is in excellent condition. Comes with factory Gibson hard case and all paperwork. OverviewThe Les Paul Studio Deluxe III Electric Guitar raises the bar with the Super ™57 and Classic ™57 humbucking pickups, which are mounted on a carved maple top with a mahogany back. Both pickups offer coil splitting for single-coil sounds and a boost circuit via push/push switching in the volume controls. œStraight Split\u009d coil-splitting offers pure single coil tone and differs from LP Standards and Studios that have a œSuper Tap\u009d coil-tap, which still has a small amount of humbucking. The boost circuit has a user-adjustable 10-dB boost for added power and frequency range for solos, single-note picking and dirty chording (depending on amp settings) and features true bypass that disengages the boost completely, ensuring pure passive Les Paul tone. The Les Paul Studio Deluxe features a traditional-spec SlimTaper '60s neck that offers a comfortable playing experience for which Les Paul models of that era are famous. The hardware is finished in chrome including Gibson's pioneering tune-o-matic bridge and stopbar tailpiece. The Les Paul Studio Deluxe is dependable, affordable, and is built without any compromises. Classic ˜57 and Super ™57 Humbucking Pickups Since their introduction in the late 1950s, Gibson' famous \"Patent Applied For\" humbuckers have been considered the ultimate pickup because of their smooth, velvety tone. The Super ™57 uses slightly overwound balanced coils, exactly like the original PAFs of the late 1950s that accidentally received a few additional turns of wire. They are the perfect bridge-position companion to the ™57 Classic, delivering just a little more of \"the sweet stuff\" without sacrificing any of the rich vintage tone. The Super ™57 humbucker features the same enamel-like coated wiring, Alnico II magnet and maple spacers as in the original models, achieving a creamy, smooth output that sounds rich and full whether they'e being played clean or overdriven. The Super ™57 pickups are so authentic that they even carry the original \"Patent Applied For\" decal on the baseplate. All of them come with braided, two-conductor wiring and are fully wax potted to eliminate any chance of microphonic feedback. Notable features ¢ A user-adjustable 10-dB boost for added power and frequency range for solos, single-note picking and dirty chording (depending on amp settings) ¢ Traditional '60s-style neck shape¢ True bypass: disengaging boost completely removes active circuit, ensuring pure passive Les Paul tone ¢ Super ™57 humbucking pickup in the bridge position. Classic ™57 humbucking pickup in the neck position ¢ Easy-to-use push/push pots engage coil-splits and boost circuit ¢ œStraight Split\u009d coil-splitting offers pure single coil tone ¢ Gibson G FORCE tuning system ¢ Includes hardshell case FeaturesBodyBody shape: Single cutawayBody type: Solid bodyBody material: Solid woodTop wood: Maple CarvedBody wood: MahoganyBody finish: GlossOrientation: Right handedNeckNeck shape: '60s SlimTaperNeck wood: MahoganyJoint: Set-inScale length: 24.75\"Truss rod: StandardNeck finish: GlossFretboardMaterial: RosewoodRadius: 12\"Fret size: Medium jumboNumber of frets: 22Inlays: TrapezoidNut width: 1.69\" (43mm)PickupsConfiguration: HHNeck: '57 ClassicMiddle: Not applicableBridge: '57 ClassicBrand: GibsonActive or passive: PassiveSeries or parallel: Not applicablePiezo: NoActive EQ: NoSpecial electronics: 2 volume with boost circuit via push/push switching, 2 tone with coil-splittingControlsControl layout: Volume 1, volume 2, tone 1, tone 2Pickup switch: 3-wayCoil tap or split: Coil splitKill switch: NoHardwareBridge type: FixedBridge design: Tune-o-maticTailpiece: StopbarTuning machines: Gibson G FORCEColor: ChromeOtherNumber of strings: 6-stringSpecial features: Tektoid nut, exclusive model, quick-connect control pocket assemblyCase: Hardshell caseAccessories: NoneCountry of origin: United States Here's a link to a good factory product video https://www.youtube.com/watch?v=LzyTqBSLKRU", "ItemID": "123523517485", "EndTime": "2018-12-08T03:11:46.000Z", "StartTime": "2018-12-03T03:11:46.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-2015-Les-Paul-Studio-Deluxe-III-/123523517485", "ListingType": "Chinese", "Location": "Las Vegas, Nevada", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1235235174858080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/TNMAAOSw96ZcBJQf/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjE1WDg0MA==/z/3U0AAOSwCK1cBJWh/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI0OFgxNjAw/z/7gAAAOSw5EpcBJ9i/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/1FUAAOSw~BRcBJRV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI4MFgxMjc0/z/-DgAAOSwyRdcBJRY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTM2MFgxNTU0/z/EqoAAOSweX5cBJUt/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ5M1gxNjAw/z/y5kAAOSwvENcBJVb/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODg5WDE2MDA=/z/HgYAAOSwXWhcBJRS/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU5MFgxMzMy/z/wJIAAOSwujJcBJX2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA3MlgxNDMw/z/c4EAAOSwa1ZcBJRk/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA5MFgxNjAw/z/wXsAAOSwMjpcBJVd/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTExOVgxNjAw/z/834AAOSw0d1cBJYZ/$_57.JPG?set_id=8800005007"], "PostalCode": "89141", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "zebragarage", "FeedbackRatingStar": "Purple", "FeedbackScore": 552, "PositiveFeedbackPercent": 100.0}, "BidCount": 10, "ConvertedCurrentPrice": {"Value": 780.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 780.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "i***l", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 39}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson 2015 Les Paul Studio Deluxe III", "ItemSpecifics": {"NameValueList": [{"Name": "Product Line", "Value": ["Gibson Les Paul"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model", "Value": ["Les Paul Studio"]}, {"Name": "Model Year", "Value": ["2015"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Caribbean blue"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}]}, "HitCount": 293, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 790.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "This guitar has been in the case for three years. I've rarely played it and it's never left my house.There are no nicks, scratches or any other defect or wear, except one small apparent scuff on the back. This guitar has a nitrocellulose gloss finish that is perfect, except for that little scuff that I found while taking pictures. You can zoom in on photo 6 to see it. The front is Caribbean blue (it might be called Caribbean Night, I'm not sure) and the back is dark Navy blue. It has G-Force tuners and coil splitting. It has a Classic 57 in the neck position and a Super 57 in the bridge. 100% stock everything. Barely used. I don't think I ever even changed strings.Comes with factory Gibson hard case and original paperwork from Gibson including certificate and photo from Gibson factory. I charged and tested the G-Force tuners and they work great. If you haven't used electronic tuners, the cool thing is that you can change to different tunings pretty quickly.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}