{"BestOfferEnabled": false, "Description": "ITEM DESCRIPTION Ibanez RG2EX1 Electric Guitar 8TEN1944 SKU: 5309047494 he search for awe-inspiring sound is over with the Ibanez RG2EX1 guitar. The RG fixed series from Ibanez is comprised of highly acclaimed electric guitars that are sought for their ability to produce massive tones that really rock. The fixed bridge enhances sustain and delivers powerful chords that impress even the most devout of headbangers. The RG2EX1 electric guitar from Ibanez was forged for performance, strength, and speed. These instruments sound great with any musical style, but they really show their potential when cranked up for harder rock.The RG series guitar from the Ibanez brand is a great choice of gear from studio to stage. While RG stands for \"Roadstar Guitar,\" these instruments are workhorses that are more than ready for use by both weekend warriors as well as mega metal gurus playing to sold-out crowds. The solid but light basswood body makes it easy to rock and roll all night or until the end of the show without fatigue. The black glossy finish adds pizzazz under the lights. Dot inlays, die-cast posts, and matching headstock provide extra style for these guitars without additional accessories. Crafted in Indonesia, this electric guitar makes for high-quality gear for the metal enthusiast. Resonant and tonally balanced, this guitar is ideal for high-gain styles of playing, and it's designed with the vintage or modern hard rocker in mind.This outstanding electric guitar features a bolt-on Wizard II neck with a radius of 430mmR that is both thin and flat. This allows you to play quick, precise rhythms along with shredding leads. The neck on the guitar neck accommodates drop tuning, including drop B, which has become quite popular among many heavy metal musicians. Posts are die-cast and sealed for effective tuning. The 24 jumbo frets and 25.5-inch scale of the rosewood fingerboard give clear and tight low-end response. Good, strong tension is created for fast playing and well-intonated chords that take you all the way up the neck. These guitars from Ibanez use their good looks and amazing sound to allow you to shred your riffs and make music that properly honors the metal gods. The Ibanez RG2EX1 guitar comes equipped with solid state dual-humbucker passive pickups designed by EMG, allowing you the opportunity to deliver crushing metallic grind and clear, articulate highs no matter what amp and presets you run it through. The dark tone screams to drop the bass and deliver crushing sound that is sure to be the wager of all wars on silence. Have greater control of master tone and master volume with a blade switch that offer three positions for all of your hard-rocking needs.The lower-strap and upper-strap posts are die cast to hold your axe securely while you slay the crowd with your metal groove. When you want to stand up and be heard, just let the Ibanez RG2EX1 guitar sell you on heavy sound without resorting to flashy accessories. This guitar is all you need to really amp it up. SHIPPING INFORMATION Handling Time This item has a 1 business day handling time, which means it will ship from our warehouse within 1 business days, from the day after you ordered your item. Business days include Monday thru Friday excluding holidays. International Shipping We DO NOT ship any item Internationally RETURNS Returns are accepted within 30 days of confirmed delivery. Returns must be in resalable condition (same as purchased) and include a copy of the sales invoice you received with the item. Please contact us for more details -", "ItemID": "163458025973", "EndTime": "2019-01-03T05:02:06.000Z", "StartTime": "2018-12-30T01:26:38.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Ibanez-RG2EX1-Electric-Guitar-/163458025973", "ListingType": "FixedPriceItem", "Location": "Cass City, Michigan", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1634580259738080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NjQwWDQ4MA==/z/UJcAAOSwD1pcKB7S/$_1.JPG?set_id=880000500F"], "PostalCode": "48726", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "8ten1944", "FeedbackRatingStar": "TurquoiseShooting", "FeedbackScore": 47565, "PositiveFeedbackPercent": 99.6, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 156.95, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 156.95, "CurrencyID": "USD"}, "HighBidder": {"UserID": "v***r", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 30}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Ibanez RG2EX1 Electric Guitar", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Ibanez"]}, {"Name": "MPN", "Value": ["56454"]}]}, "HitCount": 371, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1513296273", "StoreName": "8TEN1944"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "DiscountPriceInfo": {"OriginalRetailPrice": {"Value": 263.99, "CurrencyID": "USD"}, "PricingTreatment": "STP", "SoldOneBay": false, "SoldOffeBay": false}, "ExcludeShipToLocation": ["Alaska/Hawaii", "APO/FPO", "US Protectorates", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "SKU": "5309047494", "NewBestOffer": false}