{"BestOfferEnabled": true, "Description": "CALL OR TEXT G-BRAT’S GUITARS ANYTIME; (972)816-7736 You are looking at a 2018 PRS Custom 24 Floyd wood library with a Charcoal Jade Burst finish on a monster quilted maple top, matching flamed maple neck, ripple birds fret inlays, and Floyd Rose tremolo!! If you’re a metal fan, this one will fit like a glove. In addition to the Floyd Rose, this one also comes loaded with an Ebony fretboard and a set of uncovered PRS \\m/ metal pickups. These awesome high output pickups were designed to bring the house down, so plug in and stand back! The guitar is set up nicely with a smooth easy action, and sounds like thunder. She's 100% original and ready to rock! Here is the lowdown on the features:Model: Custom 24 FloydColor: Charcoal Jade BurstTop: Carved quilted mapleBody: MahoganyNeck: Flamed maple, with matching Charcoal Jade Burst finish, set neckNeck Profile: Pattern thinFretboard: EbonyHeadstock Overlay: Ebony with Inlaid PRS LogoFret Inlays: Green Abalone Ripple BirdsHardware: NickelPickups: PRS \\M/ (Metal) bass & treble humbuckers, UncoveredControls: 1 volume, 1 tone, 5-way switchBridge: Floyd Rose original tremolo, w locking nutTuners: PRS phase III low-mass, lockingWeight: 7.8 lbs.Serial # 18 25xxxxShe was born just recently on July 2nd, 2018, and is in perfect, unplayed condition, with no play wear to report. The neck is straight, with no cracks or repairs... the frets are perfect, with their entire life ahead of them, and it sounds like a great Santana should! Also included is the original PRS Artist Paisley hard shell case, and even includes the case candy, adjustment tools and spec card, just as shown in the last picture! Whoever brings this baby home is gonna be STOKED!! LET'S GO!! If you have any questions, please call anytime at; (972)816-7736 WHILE YOU ARE HERE, GO AHEAD AND LOOK AT MY OTHER LISTINGS!! OUR CLIENTS ARE THE BEST IN THE WORLD!! Me- I have a 100% positive feedback rating, and intend to keep it that way! So please don't worry! You're in good hands here!! Shipping- We take pride in packing our guitars well, and shipping them quickly. Please note, if you are paying with Pay Pal, we will only ship to the address that is listed in Pay Pal. Here are the shipping rates, covering the planet earth:USA - $49 with UPSCanada, Hawaii, Alaska, Puerto Rico - $119Brazil, Argentina - $159Australia, New Zealand, Switzerland - $219 USPS Express or $249 UPSAll Other Worldwide Shipping - $219 - UPS Worldwide Expedited (in most cases); However, if UPS is more costly in certain countries, USPS will then be used instead. Payment Methods- Pay Pal is preferred!! We do also accept direct payment with Mastercard, Visa, American Express and even Discover! ~ TEXAS RESIDENTS ARE REQUIRED TO ADD 8.25% SALES TAX ~ Factory Warranty- We are an authorized dealer for: Knaggs, Ken Smith, F Bass, Trussart, Warwick, Breedlove and Warrior, so for these instruments, if listed as NEW, there is a full factory warranty. For all other brands, or if listed as USED, there is no warranty available. Return Policy- We do accept returns up to 14 days from the point of the initial sale, which means that the guitar must be back in our possession within this 14 day period. However, please be aware of the following conditions: If for any reason you wish to return the guitar, just call or email me directly, within 24 hours of your receiving the item, and let me know that you want to return it. Once we receive the guitar back, in the same condition, you will receive a refund, less a $50 restock fee. Also be aware that the initial shipping fee is not refundable under any circumstances. International Bidders- We, at G-Brat's Guitars, are HONORED to do business with anybody on the planet earth... So international buyers are VERY welcome here! That being said, please observe the following conditions: If you are paying with Pay Pal, please be completely registered with Pay Pal, prior to the purchase; this will help avoid shipment delays, and will assure that you will get your guitar as quickly as possible!International shipments usually require additional \"Customs Fees\" or \"Import Taxes\". These fees will vary, depending on the country, and are the responsibility of the buyer. If you want more information on what these fees entail, please contact your local customs office for this information. THANK YOU SO MUCH FOR LOOKING!!! _gsrx_vers_827 (GS 7.0.13 (827))", "ItemID": "302967235683", "EndTime": "2018-12-19T03:18:18.000Z", "StartTime": "2018-11-21T17:55:31.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2018-PAUL-REED-SMITH-PRS-CUSTOM-24-FLOYD-ROSE-QUILTED-10-TOP-WOOD-LIBRARY-/302967235683", "ListingType": "FixedPriceItem", "Location": "Red Oak, Texas", "PaymentMethods": ["PayPal", "VisaMC", "Discover", "AmEx"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/3029672356838080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/OWoAAOSwtJxbzgwn/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/HCwAAOSwJ6Vbzgwn/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/-YgAAOSwVBVbzgwo/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/o0gAAOSwRQFbzgwo/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/hIAAAOSwPxRbzgwq/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/q5AAAOSwqFBbzgwp/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/FVsAAOSwFxJbzgwq/$_3.JPG", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/aEIAAOSwJTNbzgwr/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/wQwAAOSw1Hdbzgwr/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/6soAAOSwlKRbzgws/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/RnsAAOSw4JZbzgwt/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/NqAAAOSwhhlbzgwt/$_3.JPG"], "PostalCode": "75154", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "guitarbrat1", "FeedbackRatingStar": "Red", "FeedbackScore": 3672, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 4199.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 4199.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***-", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 3}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "2018 PAUL REED SMITH PRS CUSTOM 24 FLOYD ROSE QUILTED 10 TOP WOOD LIBRARY", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Paul Reed Smith"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Model", "Value": ["CUSTOM 24 FLOYD ROSE QUILTED 10 TOP WOOD LIBRARY"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Color", "Value": ["Charcoal Jade Burst"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Model Year", "Value": ["2018"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}]}, "HitCount": 275, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=43416548", "StoreName": "guitarbrat1"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "14 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Perfect, unplayed, mint condition", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}