{"BestOfferEnabled": false, "Description": "Up for sale, a 1966 Mosrite Ventures Model in exceptional condition and in perfect working order. 100% original aside from a stunning Moss Green metalflake sparkle finish courtesy of Marty Bell and a professional refret, this Mosrite is easily among the best playing examples we've ever had in the shop. The Ventures model has been the most popular and enduring model ever produced by Mosrite, and with good reason, as this guitar can do everything from sizzling instrumental surf to country twang and all manner of rock & roll tones. The stock Mosrite overwound single coil pickups have an incredibly creamy and powerful midrange presence, with tight bass, round top end and a balanced, warm tone that will pair well with your favorite vintage Blackface Fender (and really all manner of vintage tube amps). You simply can't get a new guitar (or many vintage guitars for that matter) to react with the dynamic response and nuance of this Mosrite. Professionally setup with nickel roundwound 11s here at Mike & Mike's Guitar Bar and weighing only 8lbs, this Ventures model is a fantastic example of the golden era of the Mosrite company.The neck has the very slender C shaped profile and a refret with vintage-style fretwire that still retains the essential feel of a classic Mosrite, yet with a bit more height and crown to the frets. This guitar is effortless to play with action that is slinky and low with a very straight neck and responsive truss rod. The guitar has solid intonation and plays very well in all positions on the Brazilian rosewood fretboard with no buzzing or dead spots! On the headstock, the original Kluson Deluxe double line tuning machines are intact, turn smoothly and hold pitch well even with liberal use of the Moseley vibrato!On the body, all of the electronics work as they should, with two well balanced single coil pickups that have their \"Mosrite of California\" stamped plastic covers. The original Centralab pots are intact dating to the 29th week of 1966. The bridge, with its roller saddles and Moseley vibrato tailpiece are two pieces of expertly designed and machined hardware that work together like a Bigsby on steroids, with an extremely smooth and quick response. For quick surfy shimmies of deeper dives, the vibrato responds very well and jumps right back into tune. Plus, you simply can't beat all that chrome! Renamed from the \"Vibramute\" name used on the vibrato pre '65, the \"Moseley\" tailpiece is identical in construction and performance to the earlier model.Cosmetically, the guitar is as impressive as they come, and Marty Bell is renowned worldwide for his incredible metalflake sparke finishes (perhaps most notably for his work with G&L). The finish is glossy, three-dimensional and a rich shade of emerald with zero wear. New period-correct decals were applied to the headstock face at the time the guitar was refinished as well. And one can't talk about Mosrite without mentioning the very deep and pronounced contours of the German Carve top, which accentuate the visual appeal and elegant look of the Mosrite design. This Mosrite is an exceptional instrument for the collector or serious player, stacking up with the best early Ventures Models we've had the privilege to play!A vintage black tolex hardshell case with blue plush interior and faux alligator leather ends is included. The case has an open interior, but fits the guitar well. Check out our shop \"Mike & Mike's Guitar Bar,\" and please let us know if we can answer any questions!Shipping in the continental USA will be $80, fully insured and shipped via FedEx Ground. Expedited shipping available for an additional fee at buyer's request. We will happily ship WORLDWIDE, but please contact us for an accurate international shipping quote before bidding or buying, as cost varies by buyer location. International orders will be declared as “merchandise,” and the value of merchandise will be declared as the amount paid. We cannot declare anything as a gift or for a lesser value. No exceptions! The customer is responsible for all taxes and duty, which may be collected upon delivery, as well as any additional charges involved with import. We have all necessary CITES paperwork in-hand to ship rosewood worldwide.We do our best to describe all items with honesty and accuracy, but to be sure, please contact us with any questions or concerns prior to bidding or buying. We require payment within 48 hours of auction end. In the unlikely event of a return, buyer pays all shipping costs. Your positive feedback and five star ratings are very important to us, and we appreciate your communication in resolving any issues!", "ItemID": "153361733838", "EndTime": "2019-02-02T21:06:48.000Z", "StartTime": "2019-02-02T08:08:10.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1966-Mosrite-Ventures-Model-Vintage-Electric-Guitar-Green-Sparkle-Marty-Bell-/153361733838", "ListingType": "FixedPriceItem", "Location": "Seattle, Washington", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1533617338388080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/GAAAAOSwaVRcVTkm/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/PRgAAOSwzTJcVTk2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/h0wAAOSwJXNcVTk0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/1dIAAOSwf29cVTk5/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/oisAAOSw7D1cVTk-/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/lDAAAOSw6hNcVTko/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/15gAAOSwfBlcVTk7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/dEUAAOSwU65cVTkr/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/xF0AAOSwgrZcVTku/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/R7QAAOSws2dcVTkx/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Sz8AAOSwPDlcVTkh/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTk5WDE2MDA=/z/JrwAAOSwvwRcVTlA/$_57.JPG?set_id=8800005007"], "PostalCode": "98117", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mmguitarbar", "FeedbackRatingStar": "Red", "FeedbackScore": 2595, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 3099.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 3099.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "r***r", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 80}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "1966 Mosrite Ventures Model Vintage Electric Guitar Green Sparkle Marty Bell", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Mosrite"]}, {"Name": "Model", "Value": ["Ventures Model"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Moss Green Sparkle"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Material", "Value": ["Basswood"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["1966"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}]}, "HitCount": 75, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=269063702", "StoreName": "Mike and Mikes Guitar Bar"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}