{"BestOfferEnabled": true, "Description": "Please feel free to contact us with any questions you may have about this listingor any other items that we carry in our store! Thank you for taking the time to visit Blues Angel Music's eBay store! Blues Angel Music, est. in 1997 in Pensacola, Florida, has been named by NAMM (National Association of Music Merchants) as one of the \"TOP 100\" music stores in the USA since 2011!!! Your satisfaction is our #1 objective! Vintage 1977 Gibson Les Paul Standard w/ OHSC, Faded Cherry, Original T-Top Neck Pickup/Seymour Duncan JB Bridge Pickup, Schaller Tuners, Original T-Top Bridge Pickup & Mounting Ring, Pots & Control Knobs Also Included, Excellent Playing Condition!!! #73237037 *Please read shipping information at the bottom of the listing* Today, we're very pleased to offer this Vintage 1977 Gibson Les Paul Standard Electric Guitar w/ Original Hardshell Case! It shows noticeable cosmetic wear one would expect with a vintage instrument, yet is structurally sound and is in excellent playing condition! Loaded with its original T-Top neck pickup/Seymour Duncan JB bridge pickup and upgraded with Schaller Tuners! Original T-Top bridge pickup and mounting ring, pots & control knobs are also included! The original bridge pickup is non-functional and is in need of a rewind, but original neck pickup reads 7.6 ohms and works great! Original bridge pickup ring shows a crack, while original control knobs show some chips. Original pots are untested, but are very clean. A very cool Paul that looks, plays and sounds great! We ask that you observe its pictures closely and invite you to call our store with any questions you may have! BODYThe body shows noticeable scratches, dings, checks, pick wear and buckle rash, yet is structurally sound! Cherry finish has faded into a Walnut-like color on its top over the years. Very aesthetically pleasing with its cool, vintage, road worn vibe - tons of mojo! NECKNeck is straight as an arrow and frets show little play wear! A noticeable divot on the second fret under the G string can be found and frets are moderately low (about 30/1000ths of an inch), but play is not affected. Noticeable finish wear can be seen on back of neck. Fingerboard appears to be Brazilian rosewood. ELECTRONICSPickups: Original Gibson T-Top humbucker (neck) / Seymour Duncan JB humbucker (bridge)Controls: 2 Volume, 2 Tone, 3-way pickup selector switch HARDWARENon-original gold-plated bridge shows light oxidation and notable wear of gold finish. Tailpiece shows light scratches, as well as some tool marks on posts. Pickup mounting rings, control knobs and strap buttons are replacements. A crack in the neck pickup ring can be seen. Pickguard and mounting hardware is absent. DIMENSIONS/WEIGHTScale length: 24.75\"Nut width: 1-11/16\"Weight: 9.9 lbs CASEOriginal hardshell case is in very good cosmetic shape with normal scuffs/scratches and is fully functional. *Shipping Information*We use Fed Ex or USPS for our shipping services. Expedited shipping is available for an additional cost. \"ALL\" orders over $50.00 require a signature.If you do not wish to have a signature for your item you must submit to us that you do not wish to have a signature on your item and that you assume any and all responsibility in the event your purchased item is lost during shipment or stolen from your home. ALL shipped items include insurance\"Free Shipping\" applies only to the contiguous 48 states, and not to Alaska and Hawaii.Large Packaged Items such as Guitars, Basses, Amps, Drums, and Keyboards being shipped to Post Office Boxes will incur additional charges.We ship most of our new items in custom-made, double-walled boxes, as many original manufacturer's shipping boxes are not strong enough to withstand multiple shipments, and have already been used at least once to ship to us. As such, your item may not come in the original manufacturer's box. We do our very best to ensure that your instrument arrives safely and securely. See our feedback for positive comments on how well we ship!Packaging: Our items no matter the size or shape are professionally packed by our expert shipping department. Please see our feedback for what customers say about shipped items. ALL of our guitars at Blues Angel Music are professionally detailed and set up to factory specifications by our very own Master Luthiers! We want your guitar to arrive in the best condition possible and ready to play! Please note that temperature and humidity changes occurring during shipping may affect setup, and the responsibility of any desired changes to setup resides with the buyer. Rest assured that most customers are satisfied with setup upon arrival! If you're ever passing through Northwest Florida, be sure to stop by and say hello! We're home of the World's only full-scale Drum Set Fish Tank created by Animal Planet's hit TV show \"Tanked!\" WANT MORE? SEE OUR OTHER LISTINGS #JD#", "ItemID": "223321540072", "EndTime": "2019-02-02T21:27:36.000Z", "StartTime": "2019-01-12T00:00:21.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Vintage-1977-Gibson-Les-Paul-Standard-w-OHSC-Faded-Cherry-ORG-Pickups-ISS3525-/223321540072", "ListingType": "FixedPriceItem", "Location": "Pensacola, Florida", "PaymentMethods": ["PayPal", "VisaMC", "Discover", "AmEx"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2233215400728080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTE4MlgxNjAw/z/dxsAAOSwwXRb~FAN/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTg4WDE2MDA=/z/IF8AAOSwx9lb~FAK/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODUxWDE2MDA=/z/GhEAAOSwe9Vb~FAY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE0M1gxNjAw/z/lMcAAOSwQqZb~FAd/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMTkz/z/VUMAAOSwJaxb~GK2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTMyNlgxNjAw/z/jCoAAOSwa3lb~FAX/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/Njg5WDE2MDA=/z/6VYAAOSwDAdb~GPy/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/PgoAAOSwsupb~FAf/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA0MVgxNjAw/z/JSgAAOSwhfRb~FAh/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/B-QAAOSwAP9b~GQU/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/vM0AAOSw1Ihb~FAU/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjA0/z/0uAAAOSwAQVb~FAI/$_57.JPG?set_id=8800005007"], "PostalCode": "32507", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "bluesangelmusic850", "FeedbackRatingStar": "Red", "FeedbackScore": 4321, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 2499.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2499.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "u***t", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 142}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Vintage 1977 Gibson Les Paul Standard w/OHSC, Faded Cherry, ORG Pickups #ISS3525", "ItemSpecifics": {"NameValueList": [{"Name": "Size", "Value": ["Full Size"]}, {"Name": "Body Color", "Value": ["Faded Cherry"]}, {"Name": "Model", "Value": ["Les Paul Standard"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["1977"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "String Configuration", "Value": ["6"]}]}, "HitCount": 117, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=13970765", "StoreName": "Blues Angel Music"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["RU", "BR"], "GlobalShipping": false, "ConditionDescription": "This guitar shows noticeable cosmetic wear one would expect with a vintage instrument, yet is in excellent playing condition!", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}