{"BestOfferEnabled": true, "Description": "i got this guitar in 06...This guitar was in his hands...not the bogus pickguard autograph where the artist signs hundreds of them at home & then they put em on cheap guitars...its got a bash in it right by the autograph...i was told Kenny himself dropped it and signed it for the guy...who knows...ask Kenny i guess...& then played it and rubbed the autograph down right after he signed it...i believe it cuz other wise the guitar is mint with no scratches or dings & still has the peel off plastic on the pickguard...looks totally unplayed...either way the signiture is a bonus cause these guitars regularly go for $200 used...so get this piece of rock history...this has been in my mancave for 12 plus years and i never touched it...buy with confidence...and if ya get ahold of KWS let me know !!! packaged like a tank and goes out same or next day!!! Squier '51From Wikipedia, the free encyclopediaJump to navigationJump to searchSquier '51Squier '51 played by Chuck TreeceManufacturerSquier, FenderPeriod2003 - 2006 (Squier) 2011 - 2013 (Fender) 2013 - Present (Squier)ConstructionBody typeSolidNeck jointBolt-on neckScale25.5\"WoodsBodyBasswoodNeckMapleFretboardMapleHardwareBridgeFixedPickup(s)1 Single-coil, 1 Humbucker with coil splitColors availableBlack (Fender and 2004 - 2006 Squier only), Vintage Blonde, 2- Tone Sunburst, Candy Apple Red The Squier '51 is an electric guitar made by Squier, a subsidiary of Fender. The '51 is notable for being one of the few original designs made by Squier, which normally manufactures less expensive authorized copies of Fender's popular guitars and bass guitars.Contents1 Construction2 Sales3 Reissues4 References5 External linksConstruction The '51 combines aspects of several of Fender's best-known instruments. The body and neck pickup resemble that of the Fender Stratocaster, while the single-ply pickguard and the control plate is borrowed from the original incarnation of the Fender Precision Bass. The neck, neck pocket and headstock design are similar to a Fender Telecaster. The '51 uses a humbucker in the bridge position and a Stratocaster-style single-coil pickup in the neck position. The bridge of the '51 is slightly narrower than most US-made Fender guitars in order to better align over the humbucker's pole pieces, which are designed for the narrower string spacing of Gibson-style guitars. The neck pickup is slanted with respect to the strings axis, similar to a Stratocaster bridge pickup. While necessary to better center the strings over the wider-spaced single coil's poles, this placement affects tone less than on a Strat due to the up-neck location. The bridge pickup has a coil split, activated by pulling out on the volume control knob, to switch between single-coil and humbucker configuration. The second control knob, which normally would operate as a tone control on a Telecaster or early Precision Bass, is a three-position pickup selector switch for choosing between the neck alone, combined neck/humbucker, or humbucker alone. It has a six-saddle hardtail top-loading bridge. The guitar features a basswood body, with a maple neck and fretboard. Some rare specimens of the necks were constructed from two pieces, with a maple fingerboard laminated to a maple neck. Most were solid maple. Some specimens showed a significant amount of birds eye figuring. The '51 was offered in three colors: 2-Tone Sunburst, Black, and Vintage Blonde. The blonde model has a cream-yellow hue and typically, a black pick guard. The sunburst and black models have a white pick guard. Although all Squier promotional pictures depict the Vintage Blonde model with a black pickguard, they were manufactured with both black and white pickguards.[citation needed]White pickguards were standard from the beginning of production until October 2004, during which month the color was switched to black until the end of production in January 2007. It has been rumored that the white pickguard was dropped because many seemed to be prone to warping. Because of the much smaller production and relative rarity of the blonde body/white pickguard '51, these have become the most sought-after and highly valued '51s according to many fans. See the Area 51 thread in the Squier section of the FDP (Fender Discussion Page) Forum website, for over 800 entries of information and comments, and the Squier 51 Modders Forum for detailed illustrated information on modifying the guitar.Sales The Squier '51 originally sold for around US $150 through most large music retailers and catalog outlets, although various incentives and sales further reduced the sale price at times. In late 2004, several large music chains were selling the '51 for US $99.99, and even as low as US$69.99 in Guitar Center and Sam Ash stores, as recently as July 2007.[citation needed] Its low price, unique style and exceptional playability & tone makes it very popular with players who like to modify and upgrade their guitar components. The Squier '51 has developed a strong cult following because of its user-friendly neck and unique sound. Today used examples command a higher price than the guitar did when new; as of 2009 original examples in good condition sell for $150–$200 and up. The 2013 reissued version sells for US $199.Reissues In spring 2011, Fender introduced its own version of the Squier '51, also called a '51, under a new line of guitars called the Fender Pawn Shop Series. The Fender '51 had a MSRP of US$999[1] and was initially being advertised at popular online retailers for US$799.[2] By mid-June 2011, the MSRP had risen to US$1,099,[3][4] although online retailer prices remained unchanged.[5] Hardware and electronic component differences aside, the configuration of the Fender variant was almost identical to that of the Squier, with the only notable differences being the use of a full thickness Stratocaster alder body instead of a thinner (by approximately one quarter of an inch) basswood body, and a string-through-body hardtail Stratocaster bridge instead of a top-load bridge. The '51's signature features were all retained, including the Telecaster neck and headstock style, the Stratocaster body shape, and the original Precision Bass pickguard and control plate, humbucking bridge and single coil neck pickups, as well as the rotary pickup selector, single volume control with push-pull coil-tap switch, and absent tone control. The Pawn Shop Series included another new model - the '72 - which was a variation of the '51 that utilized a semi-hollow body, a rosewood fingerboard, dual humbucking pickups and a pickup blend control. In 2013, Fender discontinued the Pawn Shop '51 and reissued the original Squier '51. The specifications remain unchanged from the original '51 run, with the exception of a string through body and bridge on the reissues. The reissued run is also available in candy apple red, although the black finish did not return. [6]References Fender website April 19, 2011 Musician's Friend website April 19, 2011 Squier '51 Modders Forum post by user Slann on June 10, 2011 Fender website June 16, 2011 Musician's Friend website June 16, 2011 http://www.fender.com/squier/series/vintage-modified/squier-51-maple-fingerboard-vintage-blonde/External links", "ItemID": "153247656764", "EndTime": "2018-11-12T14:10:44.000Z", "StartTime": "2018-11-05T14:10:44.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/First-run-Squier-51-AUTOGRAPHED-KENNY-WAYNE-SHEPARD-NEAR-MINT-/153247656764", "ListingType": "Chinese", "Location": "Hamburg, New York", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1532476567648080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/X4QAAOSwz5Nb0N13/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/G6MAAOSwlelb0N16/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/uq8AAOSwHSRb0N19/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/D1oAAOSwhOxb0N1~/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/8RwAAOSw5Xpb0N2C/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/HcEAAOSwy-5b0N2E/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/ehcAAOSwtxlb0N2H/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/feUAAOSwXHxb0N2K/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/L-sAAOSw-2hb0ORz/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzIwWDgxMA==/z/LXoAAOSwORxb0OVU/$_32.JPG?set_id=880000500F"], "PostalCode": "14075", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "justgoodstuff4younow", "FeedbackRatingStar": "Yellow", "FeedbackScore": 42, "PositiveFeedbackPercent": 100.0}, "BidCount": 3, "ConvertedCurrentPrice": {"Value": 142.91, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 142.91, "CurrencyID": "USD"}, "HighBidder": {"UserID": "n***u", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 116}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "First run Squier '51 AUTOGRAPHED BY KENNY WAYNE SHEPARD NEAR MINT*", "ItemSpecifics": {"NameValueList": [{"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Brand", "Value": ["Squier"]}, {"Name": "Model Year", "Value": ["2004"]}, {"Name": "String Configuration", "Value": ["6"]}, {"Name": "Model", "Value": ["'51"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["Indonesia"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Modification Description", "Value": ["Autographed"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Body Color", "Value": ["Blonde"]}]}, "HitCount": 175, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 145.41, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}