{"BestOfferEnabled": true, "Description": "DJ GEAR INSTRUMENT GEAR LIVE SOUND RECORDING MICROPHONES HEADPHONES ACCESSORIES SOFTWARE LIGHTING BUNDLES Authorized Dealer EVH Striped Series Electric Guitar - Black With Yellow Stripes - Used 6-String Electric Guitar - Black With Yellow Stripes - Used - Description The EVH Striped Series guitar features a basswood Stratocaster-style body decked out in Eddie Van Halen&rsquo;s famed striped graphics, in red with black stripes, black with yellow stripes and white with black stripes. The guitar also has a graphite-reinforced quartersawn maple neck with a hand-rubbed oil finish and thumbwheel truss rod adjustment, compound-radius maple fingerboard (12&rdquo;-16&rdquo;) with 22 jumbo frets and black dot inlays, and a single ferocious direct-mount Wolfgang humbucking pickup. Other premium features include a single white volume control knob (labeled &ldquo;tone&rdquo;), single-ply black pickguard (white with black stripes model only), bar string retainer and Floyd Rose locking nut, EVH-branded Floyd Rose locking tremolo with EVH D-Tuna, EVH die-cast tuners, chrome hardware, vintage-style strap buttons and EVH neck plate. Features/Specs General Model Name : EVH Striped Series Series : Striped Series Body Body : Basswood Body Finish : (5107902503, 5107902528, 5107902576) Gloss Neck Number of Frets : 22 Fret Size : Jumbo Position Inlays : Dot Fretboard Radius : 12\" to 16\" Compound Radius (304.8 mm to 406.4 mm) Fretboard : Maple Neck Material : Maple Neck Finish : Hand-Rubbed Oil Nut Width : 1.6875\" (42.8 mm) Scale Length : 25.5\" (648 mm) Headstock : Standard Stratocaster Neck Plate : EVH-Branded Electronics Pickup Configuration : H Bridge Pickup : Direct Mount Wolfgang Humbucking Controls : Master Volume HARDWARE Hardware : Chrom Bridge : EVH-Branded Floyd Rose Locking Tremolo with EVH D-Tuna String Nut : Floyd Rose Locking Miscellaneous Strings : EVH Branded (.009-.042 Gauges) Unique Features : EVH Neckplate, Bar String Retainer, Thumb Wheel Truss Rod Adjustment, Vintage Strap Buttons, 1-Ply Black Pickguard (576 Only) Accessories Control Knobs : One White \"Tone\" Knob on Volume Pot We are authorized dealers for all these brands. Click a logo to see our listings. We collect NYS Sales Tax for items shipping within New York. Local duties, taxes and fees out of the USA are not included in the sale price or ship charge. Proaudiostar is not responsible for any taxes outside of NY and or the USA. If an item is refused by the buyer, ship costs to and from the destination in which the item was shipped to are not refunded. Please note the cost of return shipping is usually double of what the original ship cost. Shipping is not free to HI, AK, and PR. FREE SHIPPING ONLY TO THE LOWER 48 STATES. We provide free shipping to the contiguous 48 United States, on most items. Shipping fees to ALL OTHER LOCATIONS will be calculated individually and added to customer invoices. Local duties, taxes and charges are not included in the sale price or ship charges. ProAudioStar is not responsible for any taxes outside of NY and or the USA. In the event that the customer refuses a shipment, all shipping costs to and from the country or State in which the item was shipped to are not refunded. Please note, in some cases return shipping can cost as much as double the original ship cost. We operate a 30-day return period. Items must be returned with all original packaging as well as all included items. Items that are not returned in original, resalable condition are subject to a 15% restocking fee. We charge a 15% restocking fee on returned items only if the item is clearly used and or the packaging is tarnished. A 10% re-stock is more likely if the unit comes back in mint condition. The ship cost we paid to ship your item will be deducted as well. In some cases restock fees and ship costs can be applied as a store credit. We will exchange a defective unit for the same unit within the 30-day period. After that period, you will have to work directly with the manufacturer for warranty service. Items that can not be returned include: software, units with contents or packaging that is damaged/missing, and items that are considered for personal use (such as earphones, headphones, microphones, instrument mouthpieces, harmonicas or other items that you wouldn't want to purchase if someone else had previously used them). Also, Items which we do not normally stock (i.e. \"Special Orders\", discontinued products, close-outs, used products, etc.) are non-returnable. We strongly suggest that you check your order after receiving it to be sure that it is in proper working order. Please contact us for a Return Authorization before returning any items.", "ItemID": "401651337006", "EndTime": "2018-12-20T21:35:16.000Z", "StartTime": "2018-12-05T20:59:13.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/EVH-Striped-Series-Electric-Guitar-Black-Yellow-Stripes-/401651337006", "ListingType": "FixedPriceItem", "Location": "Winchester, Virginia", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/4016513370068080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/OTg0WDEyMTU=/z/WGgAAOSwKV9cCDwc/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/OTg0WDEyMTU=/z/ReoAAOSweX5cCDwd/$_1.JPG?set_id=2"], "PostalCode": "22601", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 2, "Seller": {"UserID": "proaudiostar", "FeedbackRatingStar": "RedShooting", "FeedbackScore": 211096, "PositiveFeedbackPercent": 98.8, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 699.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 699.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "t***-", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 0}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "EVH Striped Series Electric Guitar - Black With Yellow Stripes --", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["EVH"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "UPC", "Value": ["Does Not Apply"]}]}, "HitCount": 208, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=336450849", "StoreName": "proaudiostar"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "DiscountPriceInfo": {"OriginalRetailPrice": {"Value": 999.0, "CurrencyID": "USD"}, "PricingTreatment": "STP", "SoldOneBay": false, "SoldOffeBay": false}, "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "BR"], "GlobalShipping": false, "ConditionDescription": "Used", "QuantitySoldByPickupInStore": 0, "SKU": "EVH-51079025-28-B", "NewBestOffer": false}