{"BestOfferEnabled": true, "Description": "Up for sale is this 1963 fender Stratocaster refinished in a nice shoreline gold. Note: the case candy you see in photo number one is just for the picture and is not included with the sale. Video demo here: https://youtu.be/4M0UK4Bfky0 This Stratocaster is a players guitar. The body and neck are original parts. The neck has clay dots and dated to May of 1963. The body looks to have been refinished a few different times. I see sonic blue in the neck pocket. The current finish is nicely done. The neck is, as mentioned above, original. The frets look to be vintage correct spec, but the fretboard seems to show evidence of a possible refret at some point. It might also just be evidence of where the fretboard was cleaned. Either way, the frets are in good shape and it plays nicely. The neck has also obviously been refinished. The guitar is currently stocked with a set of “aero“ pick ups. They are a boutique pick up company that hand winds all their own stuff. They sound really good. The bridge pick up has a metal base plate attached to it, which is supposed to increase bass response. I think it really does help. The body retains its original routes, although it looks like some kind of a repair has been done between the neck pocket and bridge route. See the photo for this. The L-series plate is an early one, and is original to the instrument. I think the upper strap button is also original. The rest of the parts are modern replacements. Comes with what looks like a mid-1960s Stratocaster case that looks to have come from the CBS era. The case is in decent shape, all the latches clothes, and it does the job to protect the guitar. There are a few areas along the edge where different models of guitars have been written in silver marker. Apparently this case had been used for several different instruments over the years. You can remove these if you want to put the work in, but I think it’s fine as it is. The neck also has some plugged holes in the back of the butt. These have been filled. You can see a little bit of other repair work, paricularly some chips just above the neck pocket area on the back of the neck. The finish is also slightly sanded away in that area as well. It looks like there’s a few chips near the bushings are. This is highlighted in the photos. This probably also indicates they were other tuners on here at one time. You can tell that the neck and body were both sanded before the refinish. there’s a couple dings on the edge of the neck but you can’t feel them when you play. The decal also is not quite right, especially the “contour body“ part on the top of the headstock. You could easily remove this and put an era correct decal on there if you’d like. Overall this is a nice player Strat that you could enjoy as is or put a little work into to restore. Guitar is sold as is and as described. Please read the listing carefully and see pictures for all other details.", "ItemID": "292929794999", "EndTime": "2019-01-25T15:18:20.000Z", "StartTime": "2019-01-22T17:50:37.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1963-Fender-Stratocaster-Shoreline-Gold-Refinish-/292929794999", "ListingType": "FixedPriceItem", "Location": "Lake Stevens, Washington", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2929297949998080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/PvQAAOSw8U9cR1em/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzQzWDExMjU=/z/Yn4AAOSwD1pcPn8-/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/Dc4AAOSwkFZcR1ep/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/ewkAAOSwC9hcR1er/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/QKkAAOSwnCdcPn8z/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/qiwAAOSwv0dcR1ej/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/XbMAAOSwa1hcPn89/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzUwWDExMjU=/z/gZEAAOSwjrFcPn8q/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTMxOVg4OTE=/z/EacAAOSwsO5cPopC/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/Yq8AAOSwFZZcR1eg/$_12.JPG?set_id=880000500F"], "PostalCode": "98258", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "swinbad", "FeedbackRatingStar": "Purple", "FeedbackScore": 506, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 6999.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 6999.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "s***f", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1045}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "1963 Fender Stratocaster Shoreline Gold Refinish", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "Body Color", "Value": ["Gold"]}]}, "HitCount": 66, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=87310389", "StoreName": "Swin&#39;s Deals and Steals"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}