{"BestOfferEnabled": true, "Description": "Please view pictures and read ad carefully before bidding on this item! We strive to make your buying experience enjoyable, so please feel free to message us with any questions or concerns and we will everything we can to help! Thank you! Hello and thank you for viewing our listing for... Epiphone Les Paul Standard Right Handed 6 String Electric Guitar This guitar is in good working condition it, NOTE it needs to replace the rhythm/treble switch , besides that this guitar is in excellent condition , it comes with a shoulder strap and carrying case. Great addition to have in your collection. There are NO returns on broken for part items. Please review photo's closely as item will ship as seen in pictures. Bid confidently and good luck! MA5028134WXX If you have any questions, feel free to message me through eBay. Happy bidding!Thank you again for looking at this listing!With all our auctions we strive for a 5 star experience and would be more than happy to help our customers with any problems they incur with any of our transactions. Please contact us with any problems prior to leaving feedback and we will try to solve any situation you do come across.If you have any questions about the item feel free to ask. Also feel free to look at the store for more merchandise.We also offer local pickup on all items that are listed here on eBay (see details for full info). We do not allow for local eBay customers to enter the establishment where items are held to test the items. We test all items prior to listing to assure that they operate properly and note any errors on the item. Thank you. Bid With Confidence! See Our Feedback! Check out Our Store For More Great Items!! ************AUCTION TERMS AND INFORMATION********PLEASE READ BEFORE BIDDING******Terms: We are an honest seller and do our best to provide the most accurate information in all auctions. If you feel there is an error or need clarification please feel free to contact us. E-mails should be sent through eBay only; we can answer any e-mails outside of eBay as this violates eBay policy. In most cases we are a re-seller not the original owner of the item being auction. We do our best to assure all items are in good working condition unless otherwise stated. Before you leave a neutral or negative feedback, please contact us; let us know what we can do to assist you further. We love our customers and we are here to make you happy!Payment information: We accept PayPal and prefer this be our main method of payment. If you cannot pay with PayPal please contact us for further assistance. All payments should be received within 48 hours of the end of the auction. This allows us to ship your item in a timely manner. If you cannot pay within 48 hours you must contact us. We will take action against any payment later than 7 days. Any payment later than 10 days, the auction will be canceled and items will be re-listed.Shipping information: Our goal in most cases is to ship within 1 business day of receipt of payment. We send almost all of our items with FedEx ground, but since they do not have a shipping calculator, we are using the UPS calculator. Differences in shipping will be refunded. We find this is the most economical and cost effective choice for the majority of our customers. With some exceptions like smaller packages or locations where it is price prohibitive we occasionally ship USPS. Shipping Charges can be estimated on either Website respectively.International purchases - we do not ship internationallyLocal pickup:All local pickup items require cash or credit payment at the time of pickup in our store locations All applicable MA state sales taxes apply for local pickup in store purchasesPayPal is NOT accepted for payment of local pickup purchasesReturn Policy:Ultimately, your satisfaction is most important to us. If the item you receive is not as described, I will refund your purchase minus the shipping and handling charges. We CANNOT refund shipping charges. You will also be responsible for the return shipping costs. Items must be returned in their original condition within 30 days of purchase. Please contact me before returning any items.", "ItemID": "362543581732", "EndTime": "2019-02-01T04:53:00.000Z", "StartTime": "2019-01-28T17:24:49.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/MA5-Epiphone-Les-Paul-Standard-Right-Handed-6-String-Electric-Guitar-/362543581732", "ListingType": "FixedPriceItem", "Location": "Fall River, Massachusetts", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/3625435817328080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg2OTk=/z/MQIAAOSwDEBcTzf2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg2OTE=/z/PlMAAOSwPA1cTzf7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg3ODk=/z/2QQAAOSw6o5cTzf0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/zu8AAOSw~bhcTzf4/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDU3/z/94MAAOSwQSlcTzf9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5NzY=/z/yYAAAOSww2hcTzf-/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg3OTA=/z/Pf8AAOSw11BcTzgA/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/eHQAAOSwachcTzgC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/J2QAAOSwyn1cTzgE/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIxOFgxNjAw/z/wEUAAOSwIbpcTzgG/$_57.JPG?set_id=8800005007"], "PostalCode": "02724", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "quasi098", "FeedbackRatingStar": "PurpleShooting", "FeedbackScore": 90295, "PositiveFeedbackPercent": 99.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 270.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 270.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "3***3", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 2346}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "(MA5) Epiphone Les Paul Standard Right Handed 6 String Electric Guitar ", "ItemSpecifics": {"NameValueList": [{"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "Model", "Value": ["Les Paul Standard"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}]}, "HitCount": 152, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=28661090", "StoreName": "Fall River Pawnbrokers"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "This guitar is in good working condition it, NOTE it needs to replace the rhythm/treble switch , besides that this guitar is in excellent condition , it comes with a shoulder strap and carrying case. Please read below for full item description and details. What you see in the pictures its what comes with .", "QuantitySoldByPickupInStore": 0, "SKU": "HP UNION", "NewBestOffer": false}