{"BestOfferEnabled": false, "Description": "Up for sale, a 2008 Fender Jaguar '62 vintage reissue model in a rare left-handed configuration with a gloss black finish. A faithful reissue of the Jaguar's original specs from the model's 1962 introductory year, this guitar was manufactured in Japan exclusively for the Japanese domestic market and rarely seen outside its country of origin. Tonally, this Jag does everything a good Fender should, with plenty of twang and snap in the top end, with the slightly aggressive chime and sinewy snarl that sets this model apart. The stock pickups have balanced, sweet output and great clarity for strummed passages and sparkling lead lines. Engage the Rhythm Circuit for even darker, meatier tones (great for use with fuzz pedals) or click on the \"strangle\" switch in the Lead Circuit for even thinner tic-tac sounds. Top it off with more chrome than a Cadillac and you have the model that was Fender's flagship guitar when it was introduced in '62, with every bell and whistle Leo Fender and his team could conjure. This guitar weighs 8lbs 5oz, with a warm and clear acoustic tone that translates well through the pickups. Professionally setup here at Mike & Mike's Guitar Bar where we specialize in Fender Offset instruments, this Jag plays very well with fresh 11-50 strings and low, comfortable action.The one-piece maple neck has a gloss finish, medium C profile, and thick rosewood fretboard with pearl dot inlays. The 24\" scale neck retains its original, vintage style fretwire, which shows moderate wear beneath the plain strings on frets 1-3, with fainter wear until fret 6, and virtually no wear further up the fretboard. The frets have well rounded crowns, the truss rod is responsive, and the guitar plays cleanly up the neck with no untoward buzzes or dead spots. The nut has Fender's traditional 1 5/8\" width, and the fretboard radius also matches vintage spec at 7 1/4\". The headstock retains the original Gotoh, Kluson-style tuning machines which turn smoothly and hold pitch as they should.All of the electronics are in good working order, with individual on/off switches for each pickup on the Lead Circuit, in addition to the bass cut (or \"strangle\" switch) on/off toggle and Master Volume and Tone knobs. The Rhythm Circuit has its own pair of Volume and Tone wheels in addition to the on/off toggle switch that engages this circuit, which adds a darker tone cap exclusively for use on the neck pickup. The vibrato unit works well for surfy warbles and dives and comes complete with its uniquely curved left handed vibrato arm. Cosmetically, this guitar has a sleek gloss Black finish with some buckle rash on the back, along with various small nicks, and a few shallow marks on the profile, but nothing that affects playability in the slightest. The guitar comes complete with a padded gigbag. ***We are dealers for the Mastery bridge, Offset Vibrato, and Lollar Jaguar pickups, any or all of which can be installed prior to shipment for an additional charge*** Check out our shop \"Mike & Mike's Guitar Bar,\" and please let us know if we can answer any questions! Shipping in the continental USA will be $65, fully insured and shipped via FedEx Ground. Expedited shipping available for an additional fee at buyer's request. We will happily ship WORLDWIDE, but please contact us for an accurate international shipping quote before bidding or buying, as cost varies by buyer location. International orders will be declared as “merchandise,” and the value of merchandise will be declared as the amount paid. We cannot declare anything as a gift or for a lesser value. No exceptions! The customer is responsible for all taxes and duty, which may be collected upon delivery, as well as any additional charges involved with import. We have all necessary CITES paperwork in-hand to ship rosewood worldwide.We do our best to describe all items with honesty and accuracy, but to be sure, please contact us with any questions or concerns prior to bidding or buying. We require payment within 48 hours of auction end. In the unlikely event of a return, buyer pays all shipping costs. Your positive feedback and five star ratings are very important to us, and we appreciate your communication in resolving any issues!", "ItemID": "163504022523", "EndTime": "2019-01-25T18:20:31.000Z", "StartTime": "2019-01-25T10:38:12.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2008-Fender-Jaguar-62-Vintage-Reissue-Left-Handed-Guitar-Black-Japan-CIJ-Lefty-/163504022523", "ListingType": "FixedPriceItem", "Location": "Seattle, Washington", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1635040225238080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/pl0AAOSwuvFcSuQS/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMTk5/z/VVcAAOSw8kRcSuQZ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMTk5/z/XsUAAOSwiyhcSuQb/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/O2AAAOSw2zRcSuQe/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/n1cAAOSwtYZcSuQX/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/PCgAAOSwRWZcSuQp/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA3MlgxNjAw/z/QNIAAOSwzExcSuQi/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/rvkAAOSwxHlcSuQl/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE5MFgxNjAw/z/paIAAOSwwDJcSuQU/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/FfYAAOSwiOZcSuQn/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/-NIAAOSwBjxcSubf/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/aTIAAOSwp3dcSuQg/$_57.JPG?set_id=8800005007"], "PostalCode": "98117", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mmguitarbar", "FeedbackRatingStar": "Red", "FeedbackScore": 2591, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1099.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1099.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "o***t", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 437}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "2008 Fender Jaguar '62 Vintage Reissue Left Handed Guitar Black, Japan CIJ Lefty", "ItemSpecifics": {"NameValueList": [{"Name": "Right-/ Left-Handed", "Value": ["Left-Handed"]}, {"Name": "Model Year", "Value": ["2008"]}, {"Name": "Brand", "Value": ["Fender"]}, {"Name": "Model", "Value": ["'62 Jaguar JG66"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}]}, "HitCount": 40, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=269063702", "StoreName": "Mike and Mikes Guitar Bar"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}