{"BestOfferEnabled": false, "Description": "Beautiful Gibson Les Paul Standard HP 2016 Gold Top (don't confuse with 2015 and older models!) in excellent condition for sale. All original, barely played, no wear. G-Force tuners work like a charm, but if it's not your style, I'm throwing in a set of Grover locking tuners with the same style keys. Also including an extra pick guard. See the details below for the rest of the story. Please ask any questions you have. Thanks for looking! Gibson 2016 HP Les Paul Standard Guitar The Les Paul Standard 2016 HP is the utmost in luxury and performance in Gibson's 2016 lineup, with an unprecedented set of premium and high performance features. On top of the flamboyant AAAA flamed maple top, it boasts an exclusive fast-access heel, developed specifically for the Gibson USA High Performance lineup, to allow unprecedented access to the high notes. Combined with the soloist neck width, the pair provides the fastest and most comfortable Les Paul neck you've ever played. Titanium metal for the saddles and the adjustable zero-fret nut delivers a bright, crisp tone, while being virtually indestructible and ensuring total, personalized control over the action. Dual Burstbucker Pro humbuckers deliver roaring Les Paul tones, while genuine mother of pearl inlays - and the most luxurious aluminum case ever made - complement the cutting-edge soul of this premium guitar. Playability: Gibson USA's sublimely ergonomic asymmetrical SlimTaper profile and compound-radius fingerboard go hand in hand with our innovative soloist neck width and fast-access heel for outstanding playability. Our zero-fret titanium nut yields faster action than you've ever experienced, for the most truly High Performance Les Paul Standard ever. Tone: The timeless pairing of carved maple top with mahogany body is enhanced by modern weight relief for added sonic depth. Two Burst Bucker Pro pickups are inspired by Gibson's legendary PAFs, upgraded with potted coils to withstand high-gain playing without microphonic squeal. A titanium zero-fret nut and titanium saddles maximize clarity and sustain, while push-pull coil splitting on the tone knobs offers accurate single-coil tones. Quality: A thicker one-piece fingerboard with hand-rubbed oil finish, G-Force tuners, genuine mother-of-pearl inlays, improved knobs and plastics, and an exclusive labor-intensive hand-applied process for a smooth high-gloss nitrocellulose finish all result in superior quality for optimum looks, feel and tone. Features: - Tuners: Next-generation Gibson G Force - Switch: Sturdier, noiseless toggle switch - Bridge: Titanium saddles - Case: Luxury aluminum case - Neck: Soloist next width - Inlays: Mother of pearl inlays - Heel: Fast access heel - Nut: Titanium adjustable zero-fret nut Additional Features & Specs - Back: Mahogany Back - Weight Relief: Modern - Neck Wood: 1 Piece Mahogany - Neck Profile: Slim Taper, Asymmetrical Neck - Joint: Sculpted Access Joint - Fingerboard: 1 Piece Dark Rosewood - Nut: Titanium Zero Fret Nut - Tuners:Next Generation Gibson G Force - Switch: Sturdier Noiseless Toggle Switch - Bridge: Titanium bridge saddles - Jack: Gold plated multi-contact jack - Case: Luxury Aluminum Case", "ItemID": "292884107589", "EndTime": "2019-01-01T02:41:38.000Z", "StartTime": "2018-12-21T20:48:25.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2016-Gibson-Les-Paul-Standard-HP-Gold-Top-Goldtop-NICE-/292884107589", "ListingType": "FixedPriceItem", "Location": "Silver Springs, Florida", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/2928841075898080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/NksAAOSwWAhcHVDY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/q44AAOSwWrxcHVDa/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/0HQAAOSwAP9cHVDc/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/WnoAAOSwO6NcHVDe/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/38kAAOSwmfhcHVDg/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/fHYAAOSwADxcHVDi/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/DkUAAOSwXF5cHVDk/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/Ns4AAOSwAbxcHVDm/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/8HcAAOSwA3xcHVDo/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/zeAAAOSwlx9cHVDp/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/m~0AAOSw1jpcHVDs/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/wMcAAOSwJ7RcHVDu/$_57.JPG?set_id=8800005007"], "PostalCode": "34488", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jaxtrader", "FeedbackRatingStar": "Red", "FeedbackScore": 1137, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 2195.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2195.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "e***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 393}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2016 Gibson Les Paul Standard HP Gold Top Goldtop NICE!", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model", "Value": ["Les Paul Gold Top"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Gold"]}]}, "HitCount": 171, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "ConditionDescription": "Barely played.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}