{"BestOfferEnabled": false, "Description": "This is a Zim Gar EJ-2-T and from what I can gather these are the first electric guitars built in Japan in the mid 60's to be imported to the US. They were sold under a few different names and they tend to get lumped in with the Teisco guitars that came later but technically they weren't manufactured by Teisco. I think this is one of the first Fujigen guitars made in Japan after the war but I admit I might be wrong about that. You can read more about this by following the links below: https://www.premierguitar.com/articles/26256-wizard-of-odd-a-1963-marvel-ej2-returns-home https://www.vanwyckgazette.com/fall-2015/history-of-japanese-guitars This guitar is probably most famous for being played to great effect by Jon Spencer of Jon Spencer Blues Explosion: https://www.youtube.com/watch?v=wN4Jjd3R_Qs Here's a Marvel EJ-2 (more or less the same guitar I have listed here just rebranded) played in a more traditional, less punky/fuzzed out way: https://www.youtube.com/watch?v=aXGIZF5emgo The pickups are the original gold foil pickups, Jason Lollar actually makes modern versions of these because they have such a unique/distinct sound. I read somewhere that the \"good\" sounding gold foils were the ones like this guitar has, they have the pole pieces on one side instead of down the center like on later Teisco type guitars. I've also read where these were referred to as \"true\" gold foils, the idea being that the gold foils with the pole pieces down the center that later came on Teisco type guitars were inferior for some reason. I don't know enough about gold foil pickups to know if any of that is true or not but I do notice that the Lollar gold foil pickups have the pole pieces on one side (like this guitar has) instead of in the middle so make of that what you will. I've been asked about parting it out by a few eBay members but I honestly really don't want to. I've also been asked about lowering the price but I've got it where I'd feel comfortable selling it. If you use the \"advanced search\" function on eBay you'll see the type of gold foil pickups on this guitar routinely sell for $80 to $90 each and I don't think the $120 left is too much to ask for the body/neck/hardware on a guitar this old and in this good of shape. That's how I came to the price and I don't think I'm too far out of line setting a $277 starting bid. This guitar is in great shape considering it's age which is around 1965 from what I can tell. There are a few nicks in the paint (see pics above) and some tarnish on the chrome hardware but it's in excellent shape overall. The only reason I've decided to sell it is because the neck is somewhat chunky and I have smaller hands, it just doesn't get played enough so I've finally decided to let it go. It plays pretty good though, these kind of guitars are notorious for being kind of wonky in the playability department but this one was good right out of the box when I got it a few years ago so I've never felt the need to make any adjustments. It's a great little rock guitar. From a smoke and pet free home. Bidders with zero or low feedback need to contact me before bidding or your bid will be cancelled. I'll only ship USPS to the lower 48 states. *Also* note where I have the shipping at $85, if it costs less to ship it I will refund you the difference via PayPal. I have a good solid shipping box and tape for it already but I may need to buy some bubble wrap to secure it safely as I don't have a case for it. Just be aware of this should you decide to place a bid. If you have any questions please ask before bidding! Thanks for looking!", "ItemID": "153239968850", "EndTime": "2018-11-07T06:00:53.000Z", "StartTime": "2018-10-31T06:00:53.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Zim-Gar-EJ-2-Guitar-MIJ-Teisco-Guyatone-Kawai-Univox-Harmony-Silvertone-Kay-Eko-/153239968850", "ListingType": "Chinese", "Location": "Moultrie, Georgia", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1532399688508080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTE1N1gxNjAw/z/5BkAAOSwRQFbpWm4/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE0M1gxNjAw/z/0bUAAOSwBzpbj2Ff/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTEwMVgxNjAw/z/BhgAAOSwb4VbpWnH/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTEyOVgxNjAw/z/DtIAAOSwoM5bpWnY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAwMFgxNTk5/z/l~YAAOSwEDJbpWoO/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTExWDE2MDA=/z/mA8AAOSwEDJbpWoe/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIyNVgxNjAw/z/P30AAOSwtM1bpWou/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE5NVgxNjAw/z/xqQAAOSwpXRbpWo9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI1M1gxNjAw/z/9oYAAOSwO-xbpWpK/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE5NFgxNjAw/z/lEgAAOSw-YtbpWpY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwNVgxNTk5/z/MpIAAOSwDOpbpWpl/$_57.JPG?set_id=8800005007"], "PostalCode": "31788", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "gitahsan", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 218, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 277.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 277.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "i***v", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 32}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Zim Gar EJ-2 Guitar MIJ Teisco Guyatone Kawai Univox Harmony Silvertone Kay Eko", "ItemSpecifics": {"NameValueList": [{"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Brand", "Value": ["Teisco"]}]}, "HitCount": 132, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 282.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 5, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}