{"BestOfferEnabled": true, "Description": "You are bidding on a 1977 Ibanez Electric Guitar, Model 2350bl. This model is one of the last copy models to hit the market before the big model change in Late 1977. This guitar has the transition headstock, not the often mentioned \"Lawsuit\" headstock. This guitar is 100% original with the exception of the pickups & upgraded Schallar sealed gear tuners. . At some point in its 40 year existance, the pickups were changed out to an Epiphone Neck and a Duncan Distortion (Vintage) in the Bridge. The result is ....WOW ! This guitar sounds friggin fantastic ! That early Duncan (probably wound by Seymour) really screams and handles the high end wonderfully... This particular guitar is in Good Player condition and , although this guitar has been played-its also been taken care of and hasn't really been played much in the last couple of years due to a bad pickup. The guitar exhibits typical \"character marks\" and small pickmarks etc as you would expect from a 40 year old-especially a black guitar, but-overall- the guitar is in pretty good shape. When the tuners were upgraded, the owner just left the extra holes from the original tuners (see picture).Yea, we know its a bummer the S70's are gone, but that VINTAGE Duncan is an AWESOME sounding pickup ! Lots of vintage growl ! All our guitars are from a vast PRIVATE COLLECTION , not GC wallhangers ! Each and every one of our guitars have been hand selected and is vintage and unique.... The guitar shows normal wear to the frets/board-no divots or excessive wear and enough meat to do a dressing or two should the new owner desire to. This guitar is in good player condition with only the small pings ( as pictured)and some edge wear (as pictured). ! This guitar is easily a 8.5/10 (not bad for a nearly 4 decades old ! Super sound, very responsive all the tone and growl you would expect.....make the LP snobs turn their heads to see what rig your playing-OR USE THIS GUITAR AS A MODDING PLATFORM FOR A LP killer ! ! Its a great looking head turner and a rare (only made a couple of years) and fantastic sounding guitar ! This is a great example of the quality of the imports at the end of the 70's-the peak of Japanese Lutherie-this budget level copy guitar may not have the bling of its high end cousins like the ARTIST, but its a fine instrument where it counts-nice thin fast neck, low action....beautiful craftmanship-all the same massive hardware as the top of the line Artists -a great opportunity to try one of these vintage gems without breaking the bank...... These are getting harder and harder to find-and you rarely see one in this condition.......(last one sold for $799 and was pretty beat up). No case for this one, but we will pack it secure for the shipping. Sorry, no case for this one-but we will provide a high quality gig bag at no additional cost. Someone is going to get a fantastic bargain on this one, as I am out of room and have to sell some guitars... I have tons of feedback, will answer all questions so bid with confidence.... Shipping is a flat rate of $45...SORRY, no international shipping. We accept Paypal and we can only ship to Paypal confirmed address..... Check out our impeccable feedback rating and bid with confidence.", "ItemID": "283314707651", "EndTime": "2019-01-07T11:24:34.000Z", "StartTime": "2018-12-23T21:25:11.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Vintage-Ibanez-Electric-Guitar-1977-Black-Beauty-Custom-PLAYER-/283314707651", "ListingType": "FixedPriceItem", "Location": "Toms River, New Jersey", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2833147076518080_2.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NDgwWDY0MA==/z/L1UAAOSwPXFcISSr/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAwMFgxNTAw/z/UrkAAOSw19dcH~pI/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDgwWDY0MA==/z/LwgAAOSwHPdcISSs/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDgwWDY0MA==/z/Ln8AAOSwXMxcISSs/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDgwWDY0MA==/z/-5YAAOSw5-hcISSt/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDgwWDY0MA==/z/xygAAOSwL-xcISSu/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDgwWDY0MA==/z/V68AAOSwVRBcISSw/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDgwWDY0MA==/z/TRQAAOSwCNlcISSx/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDgwWDY0MA==/z/cL0AAOSwvERcISSy/$_1.JPG?set_id=8800005007"], "PostalCode": "08755", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "ecomtrust", "FeedbackRatingStar": "Red", "FeedbackScore": 2345, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 525.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 525.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "l***l", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 190}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Vintage Ibanez Electric Guitar 1977 Black Beauty Custom PLAYER", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Ibanez"]}]}, "HitCount": 504, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=25739688", "StoreName": "Closet Classic Vintage Vault"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}