{"BestOfferEnabled": true, "Description": "Made in JapanFender Black Strat, Custom Shop Quality. This is an unusually wonderful (1982-4 from available info, neck date is 11-8-84) \"Made in Japan” Fender Stratocaster, very resonant, amazing sounding and playing, with a one-piece maple neck with a skunk stripe, basically a '59 reissue. This is really Custom Shop quality at a fraction of the price! The Japanese workmanship back then was simply the best, and they used really good wood! Weighs an unusually light under 8 pounds, with an alder body (many USA Fenders with alder weigh well over 10 pounds and sound quite dead!), a real plus for both sound and comfort. This has many dings and scars that are normal wear for a 34 year-old guitar, though not quite the relic look. Guitars get better with age and with playing, and a huge bonus is that the necks get more and more stable over time, so you don't need to keep tweaking the truss rod. This guitar stays in tune for weeks!I can tell you that if you like good old vintage Strats you will probably REALLY like this guitar, because it is a truly excellent version of that, for much less money than an old USA model (or a Custom Shop one), and plays and sounds great. The medium C-shaped neck is very straight and the small vintage Fender style frets are in good shape, not grooved, and very level,allowing excellent action. It’s 1 11/16” wide at the nut (on the wider side fora Strat), medium thick, staying medium as you go up the neck. The body vibrates strongly right into your chest when you play it acoustically in a way that only great guitars do. I won’t even plug in a guitar unless it does that, because the electronics can only amplify what’s there, and if the guitar is dead sounding acoustically then you will also have a dead sounding, but loud, amplified guitar. BTW, some people actually prefer that less resonant sound! Go figure.The bridge it set up so it floats a bit (the way Leo designed it to do), but if you prefer it's easy to adjust the springs to make it flat against the body, which makes tuning more stable if you break a string. But floating adds more of the sound of the springs resonance, and allows you to use the trem to bend both up and down, and tremolo a whole chord in a rather beautiful way. The Pickups were upgraded to Fender Noiseless, which are very nice,very quiet pickups that still sound like single coils with that delicious chime and quack. It has a bypass treble cap so you can turn it down without it getting muddy, great for rhythm work, and the volume and tone pots were upgraded to the best available ones, which make a real difference in sound fidelity compared with the ones that came with it. This has a trem bar customized to have almost no play in it, which is really fun to play!So why am I selling? I’m getting old (just over 72 now) and a bit deaf, plus pretty terrible tinnitus (constant ringing in my ears, which gets much worse when I play even a little loud), and I have way too much stuff (just ask my wife!) So I must tearfully say goodbye to nearly all of it. Sigh. And I’d prefer that I don’t burden my kids with having to get rid of it after I die.I started on eBay in 1997. My eBay user names are edch, and sdhark858, both with tons of great feedback, which you can easily check. In a previous life I founded Guitar Trader in San Diego, and then sold it about 30 years ago. I’ve owned just about every rare guitar (including real vintage 50’s and 60’s Les Pauls, Strats, Teles, 335s, etc etc), as well as just about every old amp and pedal there is. So when I tell you something is exceptional (and really I’ve only kept the exceptional gear) I do have the experience to know. Does that mean you will love what I love? Probably, but it ain’t necessarily so. First off, everyone has their own preferences. Then there is how things are setup. Do you prefer high action or low? I prefer a bit high for the increased clarity of tone. Fat strings or skinny? For me, 9's are easier to play, but 10's are preferred by many. The type of pickups, hardware, wiring, caps, tubes, etc ALL make a difference. Also, somethings work better together, some don’t, so most people find that a Tube Screamer sounds better with a Fender amp than a Marshall,whereas a Fuzz Face likes Marshalls better. So with a different amp or guitar you might prefer something different,plus your ears are different too, so don’t let anyone tell you what you should like;doesn’t work with food, art, music, or anything else, really.So if you play through a Marshall, a Vox or a Fender you might prefer different guitars, effects, and so on for each amp. Jimi used an old oil cord which killed the treble with high capacitance, then used a treble booster. Doesn’t matter, it WORKED! I never argue with what works :<) Fun link about simulating old coil cords:premierguitar.com/articles/The_Vintage_Coiled_Cable_Simulator_Mod Willing to ship internationally if I can do so safely.", "ItemID": "173715434779", "EndTime": "2019-01-04T22:28:49.000Z", "StartTime": "2018-12-31T01:02:08.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/RARE-Fender-Japan-1984-Blackey-Stratocaster-Custom-Shop-Quality-34-years-old-/173715434779", "ListingType": "FixedPriceItem", "Location": "San Diego, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1737154347798080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NTY2WDE2MDA=/z/r1MAAOSwMpFcKWdF/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/ZeAAAOSwVCpcKWdq/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzQxWDE2MDA=/z/5i4AAOSwGUpcKWdy/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODQyWDE2MDA=/z/iNEAAOSwu4dcKWd1/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjAzWDE2MDA=/z/pPkAAOSw27lcKWd4/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/GaIAAOSwnfRcKWd9/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/rIIAAOSwUm5cKWd~/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/DfcAAOSwTEZcKWeo/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/cgQAAOSwzd9cKWer/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/rnwAAOSwsftcKWe6/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/Pc4AAOSwztVcKpLy/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/e3wAAOSwrHtcKpMA/$_32.JPG?set_id=880000500F"], "PostalCode": "92122", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "sdhark858", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 154, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 759.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 759.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "c***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1071}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "RARE Fender Japan 1984 \"Blackey\" Stratocaster Custom Shop Quality 34 years old!", "ItemSpecifics": {"NameValueList": [{"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Model Year", "Value": ["1983"]}, {"Name": "Model", "Value": ["Eric Clapton Stratocaster"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "Brand", "Value": ["Fender"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Series", "Value": ["Custom"]}, {"Name": "Body Material", "Value": ["Alder"]}, {"Name": "Non-Domestic Product", "Value": ["Yes"]}]}, "HitCount": 175, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}