{"BestOfferEnabled": false, "Description": "Up for sale, a 1980 Fender Telecaster in excellent condition and in perfect working order. Part of the rare International Series available only from 1979-81, this Tele is finished in Sahara Taupe and outfitted with an aftermarket Bigsby B5 vibrato. Less common with a rosewood fretboard like the example seen here (most have maple boards), this ash-bodied Tele has stock pickups which deliver twang and snap, complimented by the rich and complex midrange character inherent in ash. The guitar has a clear, authoritative acoustic voice with bell-like top end and chimey cut when plugged into your favorite tube amp. Weighing in at a not surprising 10lbs 4oz given the added Bigsby, this Tele has great punch and has been professionally setup with fresh 11-50 strings. The maple neck has a medium C shaped profile with good shoulder and consistent depth. The original slender frets are present on the rosewood fretboard, with well rounded crowns and only light wear beneath the plain strings of frets 1-3. There is virtually no wear further up the fretboard, and the guitar plays cleanly in all registers with a responsive truss rod and low, comfortable action. A new nut has been installed, measuring 1 5/8\" in width. The original chrome Fender \"F\" tuners are intact on the headstock, turn smoothly, and hold pitch well, even with liberal use of the Bigsby. All of the electronics are stock and work as they should, with original CTS pots that date to the 40th week of 1980. Additionally, it's worth noting that like many Teles produced in the '70s, this guitar has 1Meg pots which have a very clear, open sound that delivers the full top end range of the pickups. The stickers in the neck pocket on the body also match the \"S8\" prefix serial number on the headstock. The bridge is a replacement with a similar footprint to the original, and the neck angle and saddle height are perfectly calibrated so that the strings pass over the back edge of the bridge and under the Bigsby roller unimpeded. The Bigsby B5 is notably older than the guitar, with an aluminum spacer below the vibrato to again assure that the string height and break angle relationship between the saddles and vibrato is ideal. The stock neck plate, control plate, strap buttons, and knobs are all intact. Cosmetically, this guitar is extremely clean and well cared for, with light patina on the Bigsby roller and treble side front edge of the bridge base. There is also a bit of light scuffing and wide checking on the back, as well as one finish chip at the neck pocket. Don't miss out on this rare custom color Sahara Taupe Tele from the International Series! A hardshell case is included. Check out our shop \"Mike & Mike's Guitar Bar,\" and please let us know if we can answer any questions!Shipping in the continental USA will be $65, fully insured and shipped via FedEx Ground. Expedited shipping available for an additional fee at buyer's request. We will happily ship WORLDWIDE, but please contact us for an accurate international shipping quote before bidding or buying, as cost varies by buyer location. International orders will be declared as “merchandise,” and the value of merchandise will be declared as the amount paid. We cannot declare anything as a gift or for a lesser value. No exceptions! The customer is responsible for all taxes and duty, which may be collected upon delivery, as well as any additional charges involved with import. We have all necessary CITES paperwork in-hand to ship rosewood worldwide.We do our best to describe all items with honesty and accuracy, but to be sure, please contact us with any questions or concerns prior to bidding or buying. We require payment within 48 hours of auction end. In the unlikely event of a return, buyer pays all shipping costs. Your positive feedback and five star ratings are very important to us, and we appreciate your communication in resolving any issues!", "ItemID": "153304096484", "EndTime": "2018-12-20T02:00:22.000Z", "StartTime": "2018-12-15T02:00:22.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1980-Fender-Telecaster-Vintage-Guitar-Sahara-Taupe-International-Series-Bigsby-/153304096484", "ListingType": "Chinese", "Location": "Seattle, Washington", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1533040964848080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTI4MFgxNjAw/z/iN8AAOSwjM9bcpsF/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMTkx/z/pjAAAOSwW2NbcpsZ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjMw/z/XiwAAOSw7ZFbcpsc/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE5OVgxNjAw/z/XmQAAOSwr7RbcpsU/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/NBoAAOSw6-1bcpsX/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/wHwAAOSwSoRbcpsI/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/hqwAAOSw9YJbcpsg/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/CzsAAOSw5WVbcpsK/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/iPsAAOSwjM9bcpsO/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/8tQAAOSwgB5bcpsQ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/n8YAAOSwMCdbcpsi/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/TaEAAOSwhhRbcpsl/$_57.JPG?set_id=8800005007"], "PostalCode": "98117", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mmguitarbar", "FeedbackRatingStar": "Red", "FeedbackScore": 2590, "PositiveFeedbackPercent": 100.0}, "BidCount": 61, "ConvertedCurrentPrice": {"Value": 1427.05, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1427.05, "CurrencyID": "USD"}, "HighBidder": {"UserID": "p***r", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 147}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "1980 Fender Telecaster Vintage Guitar Sahara Taupe International Series, Bigsby", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Sahara Taupe"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Telecaster International Series"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["1980"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Material", "Value": ["Solid Wood", "Ash"]}, {"Name": "Brand", "Value": ["Fender"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}, {"Name": "Body Type", "Value": ["Solid"]}]}, "HitCount": 937, "PrimaryCategoryIDPath": "619:3858:33034", "SecondaryCategoryID": "118985", "SecondaryCategoryName": "Musical Instruments & Gear:Vintage Musical Instruments:Vintage Guitars & Basses:Electric Guitars", "SecondaryCategoryIDPath": "619:181162:181163:118985", "Storefront": {"StoreURL": "https://stores.ebay.com/id=269063702", "StoreName": "Mike and Mikes Guitar Bar"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 1452.05, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}