{"BestOfferEnabled": false, "Description": "Our eBay Store About Us Jackson JS Series Dinky Arch Top JS22 Electric Guitar (Satin Black, Rosewood Fingerboard) The ultimate weapon for aspiring rockers or musicians on a budget, the JS22 Dinky Arch Top makes it possible for players to get a Jackson-quality, rock-ready axe with killer style, tone and playability at a great price.Made from poplar (nato on Natural Oil model), the sleek double cutaway Dinky body sports a classy arch top design for added visual appeal. Built for high-velocity playing and effortless chording, soloing and string bending, the bolt-on maple speed neck is capped with a 12\"-16\" compound radius fingerboard featuring 24 jumbo frets. The graphite neck reinforcement ensures optimum stability and performance. The bound headstock and neck cater to the deluxe vibe while pearloid sharkfin fretboard inlays offer that unmistakable classic Jackson touch.A killer choice for rock and metal players, the Jackson JS22 Dinky Arch Top comes equipped with a pair of Jackson high-output humbuckers with ceramic magnets to deliver a rich sound, incredible sustain, and great tone when you crank up the overdrive, gain or distortion. Switch between the pickups or combine them with the 3-position pickup selector switch. Shape your sound with quickly and with ease via the no-nonsense Master Volume and Master Tone controls.The Jackson JS22 Dinky Arch Top comes loaded with black hardware including a set of Jackson die-cast tuners and a 2-Point Fulcrum Tremolo for amazing stability and performance even after the most epic vibratos. Case not included.Get your Jackson JS Series Dinky Arch Top JS22 Electric Guitar today at the guaranteed lowest price from Sam Ash Direct with our 45-day return and 60-day price protection policy. Product Details - Archtop Dinky™ Double Cutaway Body - 1pc. Maple Speed Neck and a Compound Radius (12\"-16\") Fretboard with 24 Jumbo Frets - Jackson® High Output Humbucking Bridge and Neck Pickups - Black Hardware Includes a 2-Point Synchronized Fulcrum Tremolo and Jackson® Sealed Die-Cast Shipping Information Your gear will ship out within 2 days of order confirmation. At this time we can not ship PO Boxes, APO and FPO locations. Industry Leading 45-Day Return Policy We stand by the products we sell, and we'll certainly stand by you as well! We truly appreciate your business, and we want you to be 100% happy with your purchase. However, we know that one of the drawbacks of internet shopping is that you can't try something before you buy it. That's where our money-back guarantee comes in. If you are not completely satisfied with an item, for any reason, you can return it within 45 days of the shipping date for a complete refund of the merchandise price.* Due to the complexity of international shipping, we are unable to accept any returns on international orders. Before making a purchase outside of the United States, please know that products sold by Sam Ash use the standard 120V/60Hz voltage standard. Sam Ash is not responsible for any damage caused by not adhering to the voltage requirements. *All returns must be within 45 days of the date the item was shipped. Please do not accept any shipment if the packaging appears damaged in any way. We strongly suggest that you check your order after receiving it to be sure that it is in proper working order. Returned items must be in resalable condition. Resalable Condition means that the product(s) is exactly in the same condition as you received it. All exchanges must be pre-paid, returned in original packing, complete with blank warranty cards, owner's manual and show no sign of wear or abuse. In the event that the product is not in the same condition as you received it you may be subject to a minimum 15% restocking fee, repair charge or disqualification. Shipping and handling charges are non-refundable. Please call our Customer Service department if you have any questions about returning an item. CDs, DVDs, video tapes, sheet music, books, strings, computer hardware/software, drum heads, harmonicas, mouthpieces, sound cards, microphones, raw speakers, studio furniture, blank CDs/Tapes or Special Orders are not covered by this return policy.", "ItemID": "183600970827", "EndTime": "2018-12-23T23:34:45.000Z", "StartTime": "2018-12-23T16:21:26.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Jackson-JS22-Dinky-Archtop-Electric-Guitar-Satin-Black-Used-/183600970827", "ListingType": "FixedPriceItem", "Location": "Tampa, FL", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1836009708278080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYxWDUwMA==/z/T1EAAOSwC85cH7YY/$_1.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "samashdirect", "FeedbackRatingStar": "PurpleShooting", "FeedbackScore": 58755, "PositiveFeedbackPercent": 99.2, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 149.77, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 149.77, "CurrencyID": "USD"}, "HighBidder": {"UserID": "c***a", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 699}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Jackson JS22 Dinky Archtop Electric Guitar (Satin Black) (Used)", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Jackson"]}, {"Name": "MPN", "Value": ["2910120576"]}]}, "HitCount": 7, "Subtitle": "Sam Ash - Serving Musicians Since 1924.", "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1111655870", "StoreName": "Sam_Ash_Music_Direct"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalRefund": "MoneyBack", "InternationalReturnsWithin": "30 Days", "InternationalReturnsAccepted": "ReturnsAccepted", "InternationalShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "DiscountPriceInfo": {"OriginalRetailPrice": {"Value": 266.65, "CurrencyID": "USD"}, "PricingTreatment": "STP", "SoldOneBay": false, "SoldOffeBay": false}, "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Central America and Caribbean", "South America", "BM", "GL", "PM", "DZ", "AO", "BJ", "BW", "BF", "BI", "CM", "CV", "CF", "TD", "KM", "CD", "CG", "CI", "DJ", "EG", "GQ", "ER", "ET", "GA", "GM", "GH", "GN", "GW", "KE", "LS", "LR", "LY", "MG", "MW", "ML", "MR", "MU", "YT", "MA", "MZ", "NA", "NE", "NG", "RE", "RW", "SH", "SN", "SC", "SL", "SO", "SZ", "TZ", "TG", "TN", "UG", "EH", "ZM", "ZW", "BH", "IQ", "JO", "KW", "LB", "OM", "QA", "SA", "TR", "AE", "YE", "AF", "AM", "AZ", "BD", "BT", "CN", "GE", "IN", "JP", "KZ", "KG", "MV", "MN", "NP", "PK", "LK", "TJ", "TM", "UZ", "AS", "CK", "FJ", "PF", "GU", "KI", "MH", "FM", "NR", "NC", "NU", "PW", "PG", "SB", "TO", "TV", "VU", "WF", "WS", "AL", "AD", "AT", "BY", "BE", "BA", "BG", "HR", "CY", "CZ", "DK", "EE", "FI", "FR", "DE", "GI", "GR", "GG", "HU", "IS", "IE", "IT", "JE", "LV", "LI", "LT", "LU", "MK", "MT", "MD", "MC", "ME", "NL", "NO", "PL", "PT", "RO", "SM", "RS", "SI", "ES", "SJ", "SE", "CH", "UA", "VA", "BN", "KH", "HK", "LA", "MO", "MY", "PH", "SG", "TW", "VN", "PO Box"], "GlobalShipping": false, "ConditionDescription": "Like New", "QuantitySoldByPickupInStore": 0, "SKU": "J0120576X", "NewBestOffer": false}