{"BestOfferEnabled": true, "Description": "Very nice condition with only minimal wear. Rear plates still have protective covering. No discernible fret wear. All functions work as designed. Includes guitar, whammy bar, original gig bag, battery and charger. Made in Korea. \"Lower 48\" US states only. Sorry, no foreign buyers. Please don't ask. From the internet: The Variax JTV-69S Electric Guitar w/ Single Coil Pickups is now available with all single-coil pickups and offers an innovative design and boutique playing experience courtesy of master luthier James Tyler, and the world's most advanced guitar modeling technology from the people who invented it, Line 6. Plug this guitar into any amp and hear all the models, all the tunings, and both acoustic and electric tones you've ever wanted. No more dragging around multiple acoustics and electrics to gigs or recording studios. Variax gives you an endless variety of sounds from classic acoustic and electric tones all the way to sitar and banjo, all in one instrument.The JTV-69S features a beautiful flamed maple top, alder back, and a bolt-on maple neck with a rosewood fingerboard. A recessed heel makes reaching the upper frets a breeze. The JTV-69S is loaded with three single-coil pickups designed by James Tyler. Controls include a 5-way blade pickup selector switch, a master volume & tones. A rotary model selector dials the 25 virtual guitars plus sitar, banjo, and resonator guitar tones. A rotary alt tuning selector lets you pick from 12 alternate tunings. Comes standard with a durable, padded gig bag with a stitched Line 6 logo and 2 pockets big enough for all your gig essentials.Redesigned tremolo bridgeThe JTV-69S has a redesigned tremolo bridge that offers improved tone and tuning stability. This design lets the string go into the bridge through the front of the tremolo, which brings the ball end as close to the saddle as possible, instead of stringing it through the tremolo block. This also makes restringing much easier. The knife edges and tremolo pivot posts were designed to provide nearly zero resistance. This, in conjunction with locking tuners gives this standard tremolo bridge much more tuning stability. A Graph Tech Black TUSQ XL nut keeps the strings from gripping and sticking. James Tyler Custom tremolo bridge is also fitted with an LR Baggs Radiance hex pickup system for sweet acoustic guitar tones.Dual-core ProcessorDual-core processor delivers 4 times the punch. This new chip is smaller, faster, and more powerful. It has allowed Line 6 to run fuller, clearer models of guitar bodies and pickups; let all their models have alternate tunings; improved alternate tuning purity and speed; provided alternate tuning customization; and improved modes of operation and editing. The JVT sounds and responds surprisingly more like a traditional guitar.The Alt Tune Knob Each James Tyler Variax modeling guitar has a dedicated Alt Tune knob. This knob has 12 settings, including two labeled \"Model\" and \"Standard.\" Set to \"Model,\" the Alt Tune knob lets you access the alternate tunings you created using Variax Workbench virtual guitar workbench software. These tunings are stored on your Variax's Model knob. Set to \"Standard,\" the Alt Tune knob overrides saved tunings to set every model to standard \"E-to-E\" tuning. The Alt Tune knob's remaining 10 settings are the most commonly used tunings found in the popular genres of the day.The Virtual capo feature lets you easily transpose any song to the key that suits you vocalist. And you can adjust your tuning on the fly without having to do on \"Workbench\" software.Battery powered DSPA proprietary lithium-ion battery delivers at least 12 hours of continuous performance. A 4-LED battery life meter lets you know how much rocking time you have left. Rolling down the volume knob when not playing will automatically put the DSP to sleep and helps maximize battery life. So even with your cable still plugged in, you will not be using battery power. DSP wakes up instantly when you turn the volume back up. The JTV-69S functions as a standard electric guitar whether the battery installed or not. Variax models based on:1960 Fender Telecaster Custom1968 Fender Telecaster1968 Fender Telecaster Thinline1959 Fender Stratocaster1958 Gibson Les Paul Standard1952 Gibson Les Paul \"Goldtop\"1961 Gibson Les Paul Custom (3 PU)1956 Gibson Les Paul Junior1976 Gibson Firebird V1955 Gibson Les Paul Special1959 Gretsch 61201956 Gretsch Silver Jet1968 Rickenbacker 3601966 Rickenbacker 360-121961 Gibson ES-3351967 Epiphone Casino1957 Gibson ES-1751953 Gibson Super 4001959 Martin D-281970 Martin D 12-281967 Martin O-181966 Guild F2121995 Gibson J-2001935 Dobro AlumiliteDanelectro 3021Coral Dano Electric SitarGibson Mastertone Banjo1928 National Style 2 \"Tricone\"Alternate tunings for JTV-69S:MODELSTANDARD: E A D G B EDROP D: D A D G B E1/2 DOWN: Eb Ab Db Gb Bb EbDROP Db: Db Ab Db Gb Bb Eb1 DOWN: D G C F A DDADGAD: D A D G A DOPEN D: D A D F# A DBLUES G: D G D G B DRESO G: G B D G B DOPEN A: E A C# E A EBARITONE: B E A D F B", "ItemID": "223205666864", "EndTime": "2018-11-02T23:26:37.000Z", "StartTime": "2018-10-26T23:26:37.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Line-6-JTV-69S-Variax-Modeling-Guitar-Black-/223205666864", "ListingType": "Chinese", "Location": "Northridge, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2232056668648080_2.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/ulwAAOSwFURb06-y/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/OYAAAOSwpsBb06-4/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/SwAAAOSw96Zb06--/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/BowAAOSwsRVb06~D/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/WbcAAOSwaepb06~I/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/ArkAAOSwuMRb06~R/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/Ht8AAOSwXMxb06~f/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/09cAAOSwTwBb06~o/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/SWQAAOSw1IVb06~v/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/gB8AAOSwMuZb06~4/$_32.JPG?set_id=880000500F"], "PostalCode": "91324", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "ailuroi", "FeedbackRatingStar": "Purple", "FeedbackScore": 514, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 460.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 460.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***o", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1948}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Line 6 JTV-69S Variax Modeling Guitar, Black", "ItemSpecifics": {"NameValueList": [{"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "Brand", "Value": ["Line 6"]}]}, "HitCount": 234, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 465.0, "CurrencyID": "USD"}, "ProductID": {"Value": "219515905", "Type": "Reference"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}