{"BestOfferEnabled": false, "Description": "only only only, \"USA or global program\", only only only a nice original gibson guitar. never gigged. played and put away in a closet. in mint condition, a couple small minor scratches. electronics work as they should. playable right outa the original gibson gigbag. shipping 65 dollars UPS. \"any shipping overpayment will be refunded immediately after shipment\" adding more pics after christmas. i have found a stock description of guitar specific info. QUESTIONS????? Your guitar was made at the Nashville Plant, TN, USA on December 12th, 2012 Production Number: 199 As part of the 2013 Year of Les Paul celebrations, Gibson USA brings you a new Les Paul model that’s available at an entry-level price to suit any budget. The LPJ offers all the ingredients that made the most desirable Les Paul Standards legendary—classic tonewoods, innovative hardware, two genuine humbucking pickups, and of course Gibson’s acclaimed build quality and playability—all wrapped up in a stripped-down, no-nonsense package that makes this guitar a flat-out performer. Simpler esthetics and a cool worn-look finish technique add up to big savings for the player, and the LPJ still looks great in your choice of Cherry, Chocolate, Hand-Rubbed Vintage Burst, Hand-Rubbed Transparent White, or, for an extra charge, Goldtop with Brown Satin Back, all in grain-textured nitrocellulose lacquer. The most revered Les Paul Standards ever made had bodies constructed of a mahogany back with a two-piece carved maple top, and the LPJ begins with these same cornerstones of tone. When paired, these woods offer a tonal depth and complexity unmatched by any single-wood construction, with warmth and richness from the wood, and superb clarity and “snap” from the maple, all of which translates beautifully into the guitar’s amplified sound. The back is strategically weight relieved to improve comfort and enhance resonance. A neck made from hard-wearing maple is glued into the body and carved to our popular rounded ‘50s profile that measures .818” at the 1st fret and .963” at the 12th. It is topped with a genuine roseewood fingerboard that carries 22 medium-jumbo frets and traditional trapezoid inlays. There’s no pickguard or fingerboard binding to clutter the straight-on, stripped-down look of the LPJ, while quality touches continue with a PLEK-cut nut made from black Corian™ to subtly echo the black speed knobs and black pickup rings and covers. The traditional back-angled headstock is silkscreened with a gold Gibson logo that stands out clear and proud. A pair of Gibson’s popular Modern Classics™ humbucking pickups fire up the LPJ through your amp of choice. Made in the image of the legendary PAF humbucker and modified to suit the needs of the contemporary guitarist, the set includes a 490R in the neck position, made with an Alnico II magnet and standard-wound coils for plenty of warmth and clarity, and a 498T in the bridge position, with over-wound coils and an Alnico V magnet for more punch and sizzle in your lead playing. An independent volume and tone control per pickup plus a three-way toggle selector switch allows a broad range of sonic variations, while Gibson USA’s legendary Tune-o-Matic bridge and Stopbar tailpiece ensure solid sustain and outstanding intonation. A set of vintage-style tuners with black keys provides an impressive 16:1 gear ratio for precise and efficient tuning. Put it all together, and the new LPJ is the fastest road to a genuine Les Paul, while sparing none of the tone. Features · Body shape: Les Paul · Body Material: Weight relieved woodmahoggany with a two-piece carved maple cap · Body Finish: Grain-textured nitrocellulose lacquer · Neck: Hard-wearing maple set neck (glued in) · Neck profile: ‘50s profile that measures .818” at the 1st fret and .963” at the 12th fret · Neck Finish: Satin Urethane Finish on Back, Gloss Urethane Finish on Front · Plastics: Black plastics, no pickguard, black speed knobs and black pickup rings and covers · Fingerboard Material: Rosee-wood · Number of Frets: 22 · Fret Size: Medium Jumbo · Scale Length: 24.75” · Position Inlays: Traditional Pearloid Trapezoid · Truss rod: Adjustable truss rod · Nut Material: PLEK-cut Black Corian™ · Nut Width: 1.650” (42 mm) · Headstock: Traditional back-angled headstock is silkscreened with a gold Gibson logo · Neck Pickup: Gibson USA 490R – Alnico II “Modern Classic” · Bridge Pickup: Gibson USA 498T – Alnico V “Hot alnico” · Controls: Vol, Vol, Tone, Tone, 3-Way Selector Switch · Control Knobs: Black Speed Knobs · Bridge: Gibson USA’s legendary Tune-o-Matic bridge and Stopbar tailpiece · Tuning Machines: Gibson vintage-style tuners with black keys and a 16:1 gear ratio · Hardware Finish: Chrome · Manufacture Country: United States", "ItemID": "123588760781", "EndTime": "2019-01-16T17:09:38.000Z", "StartTime": "2019-01-10T13:58:39.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2013-Gibson-Les-Paul-Junior-LPJ-Chocolate-blackout-CASE-collection-/123588760781", "ListingType": "FixedPriceItem", "Location": "Hamilton, Ohio", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1235887607818080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMDMx/z/K98AAOSwTiVcKO7F/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg1OTY=/z/b2MAAOSwIddcIFm9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg1ODA=/z/XZEAAOSwRfxcKO7B/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg3NzA=/z/LEYAAOSwYV5cKO7K/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg4Mjg=/z/~b0AAOSwjlVcKO8F/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMTE2/z/lPsAAOSwEUdcKO7S/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg1Mjc=/z/2r8AAOSwuvFcKO7Z/$_57.JPG?set_id=8800005007"], "PostalCode": "45013", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "vishus427", "FeedbackRatingStar": "Red", "FeedbackScore": 2378, "PositiveFeedbackPercent": 98.4}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 459.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 459.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "e***d", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 129}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "2013 Gibson Les Paul Junior LPJ Chocolate blackout with CASE collection", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Product Line", "Value": ["Gibson Les Paul"]}, {"Name": "Model Year", "Value": ["2013"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Les Paul Junior"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Soundboard Style", "Value": ["Archtop"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Color", "Value": ["Brown chocolate"]}, {"Name": "Size", "Value": ["Full Size"]}]}, "HitCount": 270, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "14 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "RU"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}