{"BestOfferEnabled": false, "Description": "You are looking at a used Schecter Hellraiser Hybrid Solo II Floyd Rose Electric Guitar Ultraviolet. This is such a unique guitar. The finish is in excellent condition. The color of the guitar changes in the light from a deep purple, to a midnight blue, to green, and every color in between. It is very difficult to capture the color changing effect of this guitar. Google images has tons of great photos to really see the true colors and uniqueness of this piece! The factory tech sticker is still on the back, and it was inspected by number 32. The film on the back plastic pieces is still intact. It has never been removed. The guitar features Floyd Rose Tremolo with bar and EMG pickups. It also includes a hard locking case with keys. The case has a Schecter sticker on the outside. The guitar has been tested and everything is working on it to our knowledge. This is a very pretty guitar! It would make a great addition to anyone's collection. Please see all pictures. PLEASE READ THESE 15 THINGS BEFORE BIDDING: Make sure to read every listing completely and carefully and look at all photos before bidding. This store sells mainly used items and we describe any damage in the listing (condition description/details). Minor cosmetic blemishes and signs of use might not be mentioned, so PLEASE ASK if you're concerned about such things and can't tell by looking at the pictures what to expect. If the item is perfect or almost perfect (near new), the listing will let you know, otherwise please assume it has some signs of use if it is listed as used. This store uses UPS and USPS shipping. If either is a problem, ask about it before purchasing. The winning bidder pays shipping. Sales Tax will be added if winning bidder lives in Illinois. All items must be paid for within seven days after the close of the auction. We do not end our auctions early for BUY IT NOW prices so please do not email and ask for an early ending price. In fairness to all bidders, we let all auctions end at their scheduled times. Items will ship within 4 business days of payment unless combined shipping or some other special circumstance is involved. We only ship products to the United States. That means to the Lower 48 States ONLY. WE DO NOT SHIP TO CANADA. No exceptions. If you'd like to arrange a local pickup, you are welcome to. Please contact us before purchase. Combined shipping discounts are offered on multiple listings purchased at the same time. We will charge right around our actual shipping cost. It would help if you would contact us before purchasing to let us know, especially if you need details. Any questions at all should be asked before purchase, though most questions will be answered in the listing. Also, please contact us if for some reason you have a problem with your purchase! We are eager to help. Payments are to be made via PayPal ONLY. We do offer a 14 Day Return Policy if the item contains a defect or any damage that we did not list in the description. This does not apply to cosmetic damage shown in the pictures. Please, serious bidders only. Thank you for looking and bidding! Gold Rush Inc.", "ItemID": "302985414936", "EndTime": "2018-12-12T23:14:33.000Z", "StartTime": "2018-12-05T23:14:33.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Schecter-Hellraiser-Hybrid-Solo-II-Floyd-Rose-Electric-Guitar-Ultraviolet-w-Case-/302985414936", "ListingType": "Chinese", "Location": "Danville, Illinois", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/3029854149368080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTMzMVgxMDc2/z/5gIAAOSwVHpcCFrH/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/BOcAAOSwdgxcCFr~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/tTgAAOSwN5hcCFrl/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMTk5/z/hVgAAOSwhEhcCFji/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/9aIAAOSwVYhcCFsT/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/xN4AAOSwhnlcCFsf/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAxMlgxNjAw/z/UqwAAOSwJOJcCFjd/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/vjoAAOSwbKdcCFrc/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMTQz/z/ToEAAOSwolpcCFjn/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDI5/z/ZhoAAOSwGYhcCFjr/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/fpkAAOSwtvZcCFru/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjM0/z/naUAAOSwoQhcCFjw/$_57.JPG?set_id=8800005007"], "PostalCode": "61832", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "gold-rush-inc", "FeedbackRatingStar": "Green", "FeedbackScore": 7489, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 2, "ConvertedCurrentPrice": {"Value": 619.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 619.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "3***o", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 150}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Schecter Hellraiser Hybrid Solo II Floyd Rose Electric Guitar Ultraviolet w/Case", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Schecter"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}]}, "HitCount": 253, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=109220999", "StoreName": "gold-rush-inc"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 629.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Has been plugged in and tested. Beautiful paint job. Finish is excellent. Nice hard case.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}