{"BestOfferEnabled": false, "Description": "Series 10 Electric Guitar with Roadrunner Gig Bag (270) Series 10 Electric Guitar with Roadrunner Gig BagGood working condition.  Both pick ups work fine.  Rhythm pick up is missing bottom two screws, but still feels pretty snug.  The pick up switch is missing the very top part of knob, but it's still easy to switch and the guitar works in all three positions. Volume and tone pots all work. Has a few scuffs and scratches, but nothing big, no major dings-- looks pretty nice. Has a tiny drill hole just above neck pick up and and another small drill hole in bottom side edge. Some mild wear to chrome and tuning knobs.  Tuning pegs are in good working condition.A great sounding Series 10 Electric guitar, ready to play. ABOUTCustomer service is our top priority. If you make a purchase from us and an issue arises, please give us a chance to make things right by contacting us before leaving negative feedback or opening a case. We promise to resolve your concerns quickly and professionally. All of our items are sold as-is, but will comply with eBay's Money Back Guarantee if your item is not as described. Our products are donated to us and sold directly from stores in the Western Territory Salvation Army. Proceeds are used to support local programs and services. Please study our photos carefully and read our description thoroughly. We maintain office hours Monday through Friday and operate on Pacific Time. Purchases or inquiries made after hours will be processed on the next business day. We do not end auctions early for “Buy It Now” offers. ** The Salvation Army is not an authorized dealer. ** Warranty not provided by manufacturer even if the item condition is new (All items sold through The Salvation Army are donated). ** Please note that this is a previously owned item; imperfections are a unique aspect of a vintage or antique product. ** Our quality control team has inspected this item and verified that it is in the condition described above. PAYMENTSPayPal payments and credit cards processed through PayPal is the only form of payment we accept. If payment has not been received within 4 days of the auction end, eBay will automatically open an Unpaid Item Case. We unfortunately cannot modify your order once a case has been opened, so please contact us immediately if an issue arises or if you need more time (at the time of auction end).Once the UPI case opens, you will have an additional 4 days to complete the payment before the order is cancelled, and eBay records the nonpayment on your account.Tax: We represent The Salvation Army Western Territory as one business entity, which resides in Hawaii, Washington, California, Idaho, Wyoming, Nevada, Utah, Colorado, Arizona, New Mexico, Oregon and Montana. The average state sales tax is applied on all orders shipped to one of these states, if applicable. DOMESTIC SHIPPINGPayment must clear before we can ship out an order.We do not ship internationally, to US protectorates, or to FPO/APO/DPO addresses.All shipments are subject to a $1.95 handling fee, plus tax where applicable.Tracking is provided with all orders.We can only ship to your registered eBay address. Please make sure your address is current before purchase. COMBINED SHIPPING: All of our items are sold directly from Salvation Army stores in the Western Territory. We do offer combined shipping upon request, but can only combine items sold from the same physical location. Please double check the item’s location before requesting combined shipping.If you are awaiting multiple auctions and wish to combine these future orders, please give us advance notice. LOCAL PICKUP: All of our items are sold directly from Salvation Army stores in the Western Territory. Please verify that you can reasonably travel to the location selling the item before requesting local pickup.Choose Local Pickup before checkout to pay the invoice without any shipping fees.Contact us after the sale to arrange pickup and get detailed pickup information.Store hours may vary.Orders must be retrieved within 10 days of sale.Payment must be tendered through PayPal prior to your arrival. INTERNATIONAL SHIPPINGWe do not ship internationally", "ItemID": "372542490083", "EndTime": "2018-12-27T19:19:10.000Z", "StartTime": "2018-12-20T19:19:10.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Series-10-Electric-Guitar-Roadrunner-Gig-Bag-270-/372542490083", "ListingType": "Chinese", "Location": "Long Beach, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/3725424900838080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Rh4AAOSwa3lcG-sn/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/QbwAAOSwNepcG-sn/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/q9YAAOSwCVtcG-sm/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/gjEAAOSw7R9cG-sn/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/csoAAOSwisxcG-sm/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/1NAAAOSwPGtcG-so/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/pD0AAOSwcnJcG-so/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/zhYAAOSw0TBcG-so/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/1gUAAOSw6X1cG-sp/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/m-UAAOSwseFcG-sp/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/3q0AAOSwIqxcG-sp/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/KmsAAOSwKOZcG-sq/$_12.JPG?set_id=880000500F"], "PostalCode": "90813", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "salvationarmystore", "FeedbackRatingStar": "TurquoiseShooting", "FeedbackScore": 27003, "PositiveFeedbackPercent": 99.4}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 99.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 99.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "-***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 10}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Series 10 Electric Guitar with Roadrunner Gig Bag (270)", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Series 10"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Color", "Value": ["Gold"]}, {"Name": "UPC", "Value": ["N/A"]}]}, "HitCount": 164, "PrimaryCategoryIDPath": "619:3858:33034", "Charity": {"CharityID": "102688", "CharityName": "The Salvation Army", "CharityNumber": 122696, "DonationPercent": 100.0, "Mission": "The Salvation Army, an international movement, is an evangelical part of the universal Christian \r\nChurch. Its message is based on the Bible. Its ministry is motivated by the love of God. Its mission \r\nis to preach the gospel of Jesus Christ and to meet human needs in His name without discrimination.", "LogoURL": "https://i.ebayimg.com/00/s/MzU5WDMwMA==/z/yA0AAOSwTxhb9nBp/$_1.PNG?set_id=8800005007", "Status": "Valid"}, "Storefront": {"StoreURL": "https://stores.ebay.com/id=1216768135", "StoreName": "The Salvation Army Online Store"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 100.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["US Protectorates"], "GlobalShipping": false, "ConditionDescription": "Good working condition.  Both pick ups work fine.  Rhythm pick up is missing bottom two screws, but still feels pretty snug.  The pick up switch is missing the very top part of knob, but it's still easy to switch and the guitar works in all three positions.  Volume and tone pots all work. Has a few scuffs and scratches, but nothing big, nor any major dings-- looks pretty nice. \nHas a tiny drill hole just above neck pick up and and another small drill hole in bottom side edge. \nSome mild wear to chrome and tuning knobs. Tuning pegs are in good working condition. A great sounding Series 10 Electric guitar, ready to play.", "QuantitySoldByPickupInStore": 0, "SKU": "IF_21B6510E", "NewBestOffer": false}