{"BestOfferEnabled": false, "Description": "At top 40 guitarsour customers satisfaction is our first concern.All of out items have a 14 day return policy.If after 14 days you are not completely satisfiedwith your purchase, please return it for a full refund....Peace be with you... *all returned items must be in the same condition theywere at the time of sale. All original packing must be included. # Up for Sale is a2017 Fender Standard Telecaster! Beautiful Candy Apple Red Finish! Made In Mexico! This is Really Cool. You are looking at a 2017 Fender Standard Telecaster. This is an Iconic Model that Leo Fender designed back in the early 1950's. This model has been updated giving it some modern attributes but still has that \"Classic Tele Twang\" Beautiful Lake Candy Apple Red Finish with Maple Fretboard. From The Web: The Fender Standard Telecaster solidbody electric guitar gives you that classic Tele sound and feel you know and love, and adds some very cool improvements for modern players! The Standard Telecaster sports a pair of single-coil pickups voiced a bit hotter than standard, which works very well when you're cranking up for distorted tones. The wiring cavities are now shielded, giving you a big reduction in hum and quieter operation. This Tele features an alder body, a maple neck and fingerboard, and chrome hardware. Medium Jumbo frets make the Standard Telecaster easier to play than ever. Fender Standard Telecaster Solidbody Electric Guitar at a Glance:Hotter pickups for smokin' tones The simple beauty of a classic design Why is Tele tone so legendary? Hotter pickups for smokin' tones Fender outfitted the Standard Telecaster with two single-coil pickups voiced hotter than what might be considered \"standard\" output. Why? They know that, although the Tele has been around a long time and has pleased a ton of players just fine, the added punch of hotter pickups would help the Standard Tele drive modern amps even better, giving you that classic Tele vibe while allowing you to kick your sound into overdrive. The control cavities are now shielded, giving you quieter operation. What's more, the modern C-shaped neck is topped with Medium Jumbo frets for even easier playing. The simple beauty of a classic design You've probably heard the story before: Leo Fender began designing and building his soon-to-be-iconic guitars over a half-century ago, even though he didn't play guitar himself. The Telecaster represents Fender's first real success, and the fact that it remains such a sought-after guitar today speaks volumes about its quality and playability. It's been copied countless times, tweaked, mutated, modified, gutted, and bedecked with extras, but the original always shines through. The Standard Telecaster continues this legacy by respecting the original while making it very suitable for the modern player. Why is Tele tone so legendary? Descended from one of the true \"grandaddies\" of guitar designs, the Standard Telecaster retains all the characteristics that make the Tele so popular across all musical genres. Its tone can range from articulate \"chicken pickin'\" cluck to warm sustain, crunchy power chords to crystal-clear chime. Only a handful of instruments stand out decade after decade, and the Tele's magical blend of playability, utility, and tone definitely puts it in among a select few. Fender Standard Telecaster Solidbody Electric Guitar Features:Color: Lake Placid Blue Series: Standard Series Body: Alder Neck: Maple, Modern C Shape, Fingerboard: Maple, 9.5\" Radius No. of Frets: 21 Medium Jumbo Frets Scale Length: 25.5\" Fingerboard Width at Nut: 1.650\" Hardware: Chrome Machine Heads: Fender/Ping Standard Cast/Sealed Tuning Machines Bridge: Vintage Style Pickguard: 3-ply WBW Pickups: Two Standard Single-Coil Tele Pickups with Hotter Voicing for Distortion Pickup Switching: 3-Position Blade Controls: Master Volume, Master Tone Shielded Cavities for Quieter Operation and Reduced Hum Strings: Fender Super Bullets 3250L, Nickel Plated Steel, (.009 to .042) New Bridge Block The Fender Standard Telecaster combines classic tone, improved playability, and hotter output! Our luthier did a complete setup. Brand new strings were installed. Gig ready on Arrival! Serial Number: #MX17921073 Weight: 7.95 lbs. Case is NOT Included Due to CITES Treaty for Endangered Wood (Mahogany, Rosewood) We no longer ship out of the USA. Cosmetics: Excellent Condition. Some light strumming scratches on the pickguard. Top and Back are very clean. Neck, Fretboard and Headstock in great shape. Pristine. Dripping with \"Mojo\". It is used. Not perfect. Overall, a really nice guitar. Look at the pictures closely. They will tell the story. Top 40 guitars is a Veteran owned business.", "ItemID": "143094425311", "EndTime": "2019-01-28T02:05:10.000Z", "StartTime": "2019-01-18T02:05:10.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2017-Fender-Standard-Telecaster-Candy-Apple-Red-w-Maple-Fretboard-NO-RESERVE-/143094425311", "ListingType": "Chinese", "Location": "Santee, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1430944253118080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NjU5WDUxOA==/z/xsQAAOSwkVVbUS10/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ5OFgxMDA2/z/opAAAOSwuMNbUS2o/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/8KEAAOSwNDVbUSvs/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/Q8gAAOSwrVRbUSuT/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQxOVg5NDA=/z/V94AAOSwW55bUSu-/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/W1EAAOSwQxpbUSs2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ5MFg4ODc=/z/zFsAAOSwy7tbUSvk/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQxOVg5NDk=/z/iFYAAOSwk69bUSsd/$_57.JPG?set_id=8800005007"], "PostalCode": "92071", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "top40powertrio", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 13196, "PositiveFeedbackPercent": 99.7}, "BidCount": 41, "ConvertedCurrentPrice": {"Value": 594.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 594.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "s***-", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 0}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2017 Fender Standard Telecaster! Candy Apple Red w / Maple Fretboard! NO RESERVE", "ItemSpecifics": {"NameValueList": [{"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Body Color", "Value": ["Candy Apple Red"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Standard Telecaster"]}, {"Name": "Country/Region of Manufacture", "Value": ["Mexico"]}, {"Name": "Model Year", "Value": ["2017"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Brand", "Value": ["Fender"]}, {"Name": "Body Type", "Value": ["Solid"]}]}, "HitCount": 585, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=47416021", "StoreName": "Top 40 Guitars"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 604.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "2017 Fender Standard Telecaster Electric Guitar, Excellent Condition, See ad below for Full Description", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}