{"BestOfferEnabled": false, "Description": "Item DescriptionTitle:2000 Gibson SG Supreme Midnight Burst Blue with 1962 Patent # Pickups in CaseDescription:Gibson SG Supreme in midnight burst this is a 2000 model SG Supreme; and it is made from mahogany wood with an AA flame maple top. The set neck is the slim tapered 1959 style and mahogany also; with an ebony board and split diamond inlays. This SG Supreme has beautiful binding on neck/headstock and the hardware is chrome; including the tune 'o matic bridge and stop tailpiece and the tuners are Grovers. This SG Supreme has 4 vol/tone knobs and a 3 way pickup switch. Gibson only made the SG Supreme from around 1999/2000-2008; and they all had 24 frets and the 24 frets on this SG are like new still. The original 57 classic humbucker pickups that came with the guitar; have been swapped out for an upgrade to a set of early 1962 patent # pickups; and these vintage patent # pickups sound very nice in this SG Supreme. The Gibson patent # pickups are basically the same as a pre 1962-63 Gibson PAF pickup; except for there is no \"PAF\" sticker on them; but a patent # sticker and also changed pickup leads. This SG Supreme is in very excellent condition there are a few slight surface scuffs here and there; mostly this appears in the area of the guitar by the neck pickup and one small scuff on the front bevel of the body (happened after the photos were taken, see the last photo on eBay). There is no belt buckle rash or any dings or defects to mention that I can see on this beautiful SG Supreme; and the guitar is in excellent and very clean well kept condition showing some very light playwear. The guitar was set up with proper intonation and neck relief checked; and this unique Gibson SG plays super easy and fast with low action. This SG Supreme in the original excellent condition Gibson HSC. Size: 40 inches long. Condition: See above. Stock Number: A021979 Terms of Sale Buy It Now: If this item has a Buy It Now option, then we have reviewed comparable sale prices on eBay for this item and have established a Buy It Now price based on our research. If you feel the price is fair, please use the Buy It Now button to immediately purchase and pay for the item. If you are buying multiple items from us, please do not use the Buy It Now button, rather please follow the instructions below for buying multiple items. Make Offer: If this item has a Make Offer option, then please submit a reasonable offer, based on comparable eBay sale prices, which we can accept. We are more likely to accept your offer if the price is close to the Buy It Now price and you add a comment supporting your offer. We want to sell items quickly, so we can continue to bring new items to market, so we will try our best to work with you. Keep in mind that we may be negotiating with multiple buyers at the same time, so the first offer we accept wins the item. If we already have the lowest price on eBay, please use the Buy It Now option. Buying Multiple Items: To purchase multiple items from us using the eBay website: 1) add all the items to your shopping cart by clicking the \"Add to cart\" button on each eBay listing, 2) from your eBay shopping cart, click the \"Request total from seller\" button located at the top right of the page, 3) on the next page (Request total from seller page), click the \"Commit to buy & submit request\" link at the bottom of the page. This will reserve the items in your cart and send us a request to combine the shipping. We will then send you a single combined invoice to pay with the correct combined shipping amount. Please note: the eBay app may not support this functionality. Payment: We accept Paypal on all our listings. If you use the Buy It Now option, an immediate payment will normally be required. If you are buying multiple items from us, please do not use the Buy It Now button, rather please follow the instructions above for buying multiple items. If we accept your offer, we will send you an invoice through eBay, and payment is due within 24 hours. If you win an auction, we will send you an invoice through eBay, and payment is due within 24 hours. Shipping: We ship all of our items in-house using all new boxes and cushioning materials. We use shipping services from the USPS and UPS, so more than one option may be available under the 'Shipping and Payments' tab above. We will ship most of our items internationally directly through the USPS. All international shipments will be declared as commercial and at their full value. Any customs charges and/or import duties are always paid directly by the buyer in their local country. The eBay Global Shipping Program may also be an option for certain items (please contact us before buying the item, so we can add that option to the listing). Please use the eBay shipping calculator to obtain the cost of shipping and handling. In some cases, the eBay shipping calculator may not work, so please contact us directly for a shipping quote. We try to keep our shipping costs as low as possible and only charge our actual cost of shipping. If our actual cost of shipping turns out to be less than what we charged, we will refund you the difference. We always combine shipping on multiple items to save you money (see the instructions above for buying multiple items). Our handling time is one business day. Free local pickup is always available (please contact us before buying the item, so we can add a local pickup option to the listing). Kansas Sales Tax: Sales tax will only be collected on non-exempt shipments within the state of Kansas and on local pickups. If you live in Kansas and are exempt from Kansas sales tax, please email us your Kansas Resale Exemption Certificate, and we will remove the tax at checkout. Sales tax will not be collected on shipments outside the state of Kansas. Return Policy: We carefully inspect all of our items before listing, so we only allow returns if the item you receive differs significantly from the description and photos. Please ask any questions you may have about an item before purchasing the item. Please contact us within 48 hours after receiving the item if there is a problem. If we determine that a return is warranted, we will pay the return shipping. We want happy customers, so we always try to make it right. Feedback: If this transaction has met with your satisfaction, please leave us positive feedback and high seller ratings on eBay. If you cannot leave positive feedback or a 4 or higher seller rating, please contact us directly, before contacting eBay or Paypal, and give us a chance to make it right. We automatically return all positive feedback left for us. About Us Sunflower Auction Gallery is a Top Rated Plus eBay seller located in Overland Park, Kansas. We have been selling on eBay since 1999. We primarily sell items in the following categories: Antiques, Collectibles, Dolls, Pottery & Glass and Toys, although we will list pretty much anything of value on eBay. All of our items come from a smoke and pet-free environment. We look forward to doing business with you. Get business information that counts! - Vendio Counters are active content free.", "ItemID": "223298377713", "EndTime": "2019-01-06T01:28:37.000Z", "StartTime": "2018-12-25T20:46:05.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2000-Gibson-SG-Supreme-Midnight-Burst-Blue-1962-Patent-Pickups-Case-/223298377713", "ListingType": "FixedPriceItem", "Location": "Overland Park, Kansas", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/2232983777138080_3.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTM0M1g1MzQ=/z/DTwAAOSwjrFcIpdI/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTM3OFg2MTA=/z/uoIAAOSwlfNcIpdJ/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTQ1N1g2MTU=/z/~tUAAOSw-QBcIpdK/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA0NVg5MDA=/z/50AAAOSwIjFcIpdM/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMTMx/z/72UAAOSwmE9cKWht/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAzNlg3MTU=/z/E~QAAOSwj5BcIpdN/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTMwOVg2Njc=/z/qv8AAOSwMQ1cIpdP/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NTUyWDE0OTY=/z/Ba4AAOSwe9VcIpdQ/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NTcyWDE1OTQ=/z/xO0AAOSwm-FcIpdR/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NDU3WDgzNA==/z/g8kAAOSwlypcIpdS/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/Njc3WDE0NzA=/z/PB0AAOSwwFNcIpdT/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzE5WDE2MDA=/z/aioAAOSwMKFcIpdW/$_57.JPG?set_id=880000500F"], "PostalCode": "66223", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "sunflowerauctiongallery", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 10377, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 2195.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2195.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "l***c", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 2142}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2000 Gibson SG Supreme Midnight Burst Blue with 1962 Patent # Pickups in Case", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Body Color", "Value": ["Blue"]}, {"Name": "MPN", "Value": ["Does not apply"]}]}, "HitCount": 187, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=47548865", "StoreName": "Sunflower Auction Gallery"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "TopRatedListing": true, "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "SKU": "A021979", "NewBestOffer": false}