{"BestOfferEnabled": true, "Description": "Bought from a local music store in Oct 2017. Guitar is incredible. I own 2 of these. Sky Blue Metallic is beautiful. Not going to see it everywhere. These retailed for $1899.99 and were usually sold out. I put up a deposit and waited 9 weeks for mine. Has spent its' life in a climate controlled, non-smoking environment. Very good condition. Has all the case candy. View pictures well. Look at my seller feedback and bid with confidence. Original Hard Shell Case is included. Fender American Elite Stratocaster Electric Guitar (Maple, with Case) Externally the American Elite Stratocaster has Fender's timeless style, but under the hood it's a breed of guitar designed for 21st-century players who constantly push the envelope. With over a dozen new innovations, each guitar is a true performer with eye-catching style, exceptional feel and versatile sound from the very first moment you plug it in and play. Featured on all American Elite instruments, the fourth generation Noiseless pickups are only available in this series, and represent a quantum leap in pickup design. Combining vintage-style sound with effectively noise-free performance, these are the pinnacle of Fender's noiseless pickup designs, offering pristine cleans and fat, overdriven tones that scream with pure rock 'n' roll power. Designed for fast playing and effortless position changes, the compound profile neck is ideal for all playing styles. A modern \"C\"-shape at the nut, the profile morphs along the length of the neck to a modern \"D\"-shaped profile at the updated neck heel, providing plenty of comfortable support for fret hand antics. Locking short-post tuning machines provide increased break angle at the bone nut for buzz-free performance while the smooth two-point modern tremolo adds emotive touches to your performance without sacrificing your tuning.Fender is renowned for head-turning style, and this guitar is no different--from the redesigned sleek back and forearm contours that hug the player's body for an enhanced playing experience to the black chrome headstock logo and large pearloid fret markers this instrument will dazzle the audience with elegant style. The American Elite Stratocaster is a bold guitar for the brave guitarist who is setting out to cross uncharted musical terrain. Includes a redesigned Elite Molded Case with TSA locks to provide increased protection for your cherished instrument. Features- Fourth generation Noiseless pickups- Compound profile neck, ideal for all playing styles- A modern \"C\"-shape at the nut, the profile morphs along the length of the neck to a modern \"D\"- Smooth two-point modern tremolo- Includes a redesigned Elite Molded Case with TSA locks Series: American Elite- Body Material: Alder- Body Finish: Gloss Polyurethane- Neck: Maple, Compound Back Shape, Modern \"C\" to \"D\"- Neck Finish: Satin Urethane with Gloss Urethane Headstock Face- Fingerboard: Maple, 9.5\"-14\" Compound Radius (241 mm-355.6 mm)- Frets: 22, Medium Jumbo- Position Inlays: Large Black Pearloid Dots- Nut (Material/Width): Synthetic Bone, 1.685\" (42.8 mm)- Tuning Machines: Deluxe Cast/Sealed Locking (All Short Posts)- Scale Length: 25.5\" (648 mm)- Bridge: 2-Point Deluxe Synchronized Tremolo with Pop-In Arm- Pickguard: 3-Ply Mint Green, except 4-Ply Tortoiseshell on Champagne finish- Pickups: 4th Generation Noiseless (Bridge, middle, neck)- Pickup Switching: 5-Position Blade: Position 1. Bridge Pickup, Position 2. Bridge and Middle Pickup, Position 3. Middle Pickup, Position 4. Middle and Neck Pickup, Position 5. Neck Pickup- Controls: Master Volume (with S-1 switch), Tone 1 (Neck Pickup), Tone 2 (Middle and Bridge Pickups; No-Load Tone control)- Control Knobs: Aged White Soft Touch Knobs- Hardware Finish: Chrome- Strings: Fender USA, NPS, (.009-.042 Gauges)- Case/Gig Bag: Elite Molded Case- Other Features: Modern String Tree, Asymmetrical Neck Heel, Black Chrome Fender Headstock Decal- Included Accessories: Strap Locks, Pop-in Trem arm, Adjustment wrenches Weight, Dimensions, and Manufacturer Part NumbersOcean TurquoiseShipping Weight: 23 lbsShipping Dimensions: 45 x 18 x 6 inManufacturer Part Number (MPN): 0114002708 Tobacco SunburstShipping Weight: 22 lbsShipping Dimensions: 44 x 19 x 6 inManufacturer Part Number (MPN): 0114002752 ChampagneShipping Weight: 22 lbsShipping Dimensions: 43 x 17 x 7 inManufacturer Part Number (MPN): 0114002774 Aged CherryShipping Weight: 22 lbsShipping Dimensions: 43 x 17 x 7 inManufacturer Part Number (MPN): 0114002731 Sky Burst MetallicShipping Weight: 23 lbsShipping Dimensions: 44 x 19 x 6 inManufacturer Part Number (MPN): 0114002736 Olympic PearlShipping Weight: 22 lbsShipping Dimensions: 43 x 17 x 7 inManufacturer Part Number (MPN): 0114002723 3-Color SunburstShipping Weight: 22 lbsShipping Dimensions: 43 x 17 x 7 inManufacturer Part Number (MPN): 0114002700", "ItemID": "283351646870", "EndTime": "2019-01-26T15:46:30.000Z", "StartTime": "2019-01-24T20:25:06.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fender-American-Elite-Maple-Stratocaster-Electric-Guitar-Sky-Burst-Metallic-/283351646870", "ListingType": "Chinese", "Location": "Spring, Texas", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2833516468708080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTU0NVgxMDA4/z/36UAAOSw0LhcSh44/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTU3M1g1NTI=/z/N1YAAOSwBAZcSh4C/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzA2WDE0MzY=/z/WCUAAOSwRL1cSh5h/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/zj0AAOSw5bxcSh5t/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTU0M1g5ODY=/z/3bIAAOSw7MNcSh6P/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NTAxWDExOTU=/z/khoAAOSwj9hcSh6k/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTU5N1g1ODY=/z/nMoAAOSwXitcSh63/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/p5YAAOSwCNlcSh6~/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzI1WDE1NTI=/z/fTkAAOSwrfRcSh4d/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODk3WDEzNzg=/z/E-cAAOSw5wNcSiIB/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/2N0AAOSw0ylcSiIJ/$_12.JPG?set_id=880000500F"], "PostalCode": "77381", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "davidwbickle", "FeedbackRatingStar": "Purple", "FeedbackScore": 531, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 1300.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1300.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "n***f", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1197}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Fender American Elite Maple Stratocaster Electric Guitar Sky Burst Metallic", "ItemSpecifics": {"NameValueList": [{"Name": "Style 1", "Value": ["Sky Burst Metallic"]}, {"Name": "Brand", "Value": ["Fender"]}, {"Name": "Model Year", "Value": ["2017"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Professional Elite Strat"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["0114002736"]}, {"Name": "Body Color", "Value": ["Sky Burst Metallic"]}]}, "HitCount": 29, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 1325.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "2017 model in used but very good condition.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}