{"BestOfferEnabled": false, "Description": "Used in a Non-Smoking Home Studio for about 4 Hours.No Scratches or Visible marks.Includes to USB to Amp and Computer Cable.Sold for $400.00 new. Built-in LED Learning System Lets You Practice More Efficiently  SHAPE  \\* MERGEFORMAT Visualizing your guitar's fretboard as a musical roadmap is one of the keys to stellar playing, and that's what makes the Fretlight FG-411 such a special solidbody electric guitar. The FG-411 feature's Fretlight's unique Advanced Polymer fretboard with built-in LED learning system - just connect the FG-411 to your computer via USB, load the included Fretlight Studio software, and scales, chords, riffs, and even full songs come to life right under your fingers. Whether you're a beginner navigating scales for the first time, or a seasoned pro needing to learn new songs fast and accurately, the Fretlight learning system is amazingly efficient and effective. And with an alder body, maple neck, and one humbucking pickup, you'll love the sound and feel of the Fretlight FG-411 solidbody electric guitar. Fretlight FG-411 Solidbody Electric Guitar at a Glance: · A real guitar that helps you learn and advance · Advanced Polymer fretboard with built-in LED learning system · A time-saving learning tool for any guitarist A real guitar that helps you learn and advance The Fretlight FG-411, like all Fretlight guitars, is a real electric guitar through and through. With an alder body, maple neck, and a humbucking pickup, you've got everything you need for great tone. And it's designed to be played for years - it's got an adjustable truss rod to keep the neck playing perfect, and the chrome bridge has fully adjustable saddles for precise intonation. Long story short, the Fretlight FG-411 is a capable electric guitar even without the built-in LED learning system. Advanced Polymer Fretboard with built-in LED learning system The real magic of the Fretlight FG-411 is its built-in LED learning system. The Advanced Polymer Fretboard has LED lights embedded in it to show you riffs, scales, songs, and chord fingerings. Just connect the Fretlight FG-411 to your computer via USB, load the included Fretlight Studio software, and you're ready to learn! You can even use Fretlight Studio to play Hal Leonard Fretlight Ready instructional videos to learn the styles of your favorite guitarists. A time-saving learning tool for any guitarist The Fretlight FG-411 will make playing and learning guitar more enjoyable for any player, because you're still forming the solid foundation every guitarist needs. If you're a beginner, you'll love seeing your scales and chords lit up on the fretboard - no more looking back and forth between a book and your guitar! Intermediate players will love how the Fretlight system can inspire you out of a rut by making it fast and easy to learn new chords and scales. And if you're a gigging pro and constantly need to learn new songs, or new scales to solo with, the quality feel and great sound makes the Fretlight FG-411 a guitar you'll love practicing with. Fretlight FG-411 Solidbody Electric Guitar Features: · Electric guitar with innovative LED learning system to help you practice more enjoyably and efficiently · Built-in LED learning system shows you how to finger chords, scales, riffs, and even full songs · Connects to your Mac or PC via USB for use with Fretlight Studio software (on the web site) · Standard 1/4\" output lets you connect to your amplifier, multi-pin output interfaces with your computer · Perfect for beginners, eliminating the need to look between a book or video and your guitar · Ideal for intermediate players, helping you expand your skills to new chords, scales, and licks · Great for pro players too - quickly try new scales and modes for your solos, learn new songs fast, and improve your improvisation skills", "ItemID": "223278858116", "EndTime": "2018-12-16T23:15:06.000Z", "StartTime": "2018-12-10T16:04:27.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fretlight-FG-411-Electric-Guitar-Built-In-Lighted-Learning-System-Nice-/223278858116", "ListingType": "FixedPriceItem", "Location": "Fort Worth, Texas", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2232788581168080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg2NzU=/z/wakAAOSwvg1bXfST/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg4MjI=/z/eJwAAOSw4fZbXfSV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAwNlgxMjAw/z/X94AAOSw441bXfSW/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODQyWDEyMDA=/z/owEAAOSwThtbXfSX/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDEyMDA=/z/KowAAOSwNppbXfSY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDEyMDA=/z/qMAAAOSw3XlbXfSZ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAzOVgxMjAw/z/8fkAAOSwXjRbXfaE/$_57.JPG?set_id=8800005007"], "PostalCode": "76133", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "advansys4ynz", "FeedbackRatingStar": "Red", "FeedbackScore": 1063, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 139.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 139.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "c***a", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 6}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Fretlight FG-411 Electric Guitar Built-In Lighted  Learning System Nice!", "ItemSpecifics": {"NameValueList": [{"Name": "Model", "Value": ["FG411"]}, {"Name": "Brand", "Value": ["Fretlight"]}]}, "HitCount": 43, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "14 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Used in a Non-Smoking Home Studio for about 4 Hours", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}