{"BestOfferEnabled": false, "Description": "MIJ, made in japan, Gibson, Lespaul, White, SG, Höfner, Duesenberg, Ibanez, ATELIER Z, ARIA, ESP, Caparison, Killer, COMBAT GUITARS, GUYATONE, Greco, Sugi Guitars, TEISCO, DEVISERA, Nil, Bacchus, VANZANDT, Fernandes, Fender Japan, Fujigen, MOON GUITARS, momose, Yairi Guitar, YAMAHA, TOKAI, Zemaitis, VOX, B, C, Rich, Epiphone, Gibson, Gretsch, Suhr, Schecter, Charvel, Jackson, Dean, Tom Anderson, Fender, Paul Reed Smith, Melancon, Mosrite, Rickenbacker, Robert Benedetto, Washburn, Ibanez, kramer, EDWARDS, Burny, Grassroots, 1984 YAMAHA LP-400BL Lord Player Model ~ All Original ~ Very Good condition.Made in Japan Down from here, Photo is dent and scratches etc.. About scratches that are hard to see. To make it easy to understand the condition of the scratches, I lighted the light strongly. 1984 YAMAHA LP-400BL Lord Player Model ~ All Original ~ Very Good condition.Made in Japan Body Maple Top / Mahogany Back. Neck Mahogany. Frets 22F. Scale 24.57inch (624mm) Old Les Paul Scale. Nut Width About 1.69 inch (43mm). Pickup YAMAHA Alnico V. Control 2 Volume, 2 Tone, 3-Way PU Toggle switch. Bridge Tune O Machic. Stop Tailpiece. Color Black. Weight About 8.62 Pound ( 3.91 Kg ). This is Used Guitar. When I got it, The electric circuit was in a no good condition due to deterioration. Therefore,I changed all electric circuits to New ones. It is 4 Pots and 3way toggle switch and Output jack and Capacitor and Wiring. There are 3 small holes on the top of the body, they are filled in and touch-up painted. There are scratches and dents. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. It was manufactured in 1980. It was made 38 years ago. This is a very old YAMAHA Les Paul standard type. I sold a lot of the electric guitars in eBay. And I always feel so. Vintage Greco and vintage Aria proII and vintage Epiphone japan are very similar. Vintage Tokai and vintage Burny are very similar. However, I feel Yamaha is not similar to any brand. YAMAHA is characteristic. And I always think about the all old YAMAHA. I think the quality of wood is high anyway. It can consistently say to the old YAMAHA. That can be said for low price SL-380 too. High quality wood is used for this LP-400BL. I think that you can understand immediately. Making is polite anyway. Current, Some High end model guitars are made in Japan, but others are produced in Yamaha's own factory in China. It may be the cause, but currently in Japan, Yamaha's electric guitar is not popular. This is a Yamaha guitar of a very popular era. Produced by Kasuga musical instrument manufacture. Kasuga musical instrument manufacture was producing acoustic guitar, banjo, violin. Representative brands are \"Heerby\" \"ELECTRA\" \"Gaban\" \"Ganson\" \"RK Herby\" \"The KASUGA\" etc. Currently, it is all evaluated as Japan Vintage. This LP400BL has dignity of vintage guitar. About guitar play, Current state, the space between the strings and the frets is standard. The accuracy of the product is high. Therefore Un pluged sound is very powerful. You can feel vibrations transmitted to the body. Gibson's Old Scale (624mm) is adopted for this LP-400RS. My fingers are short, so I feel easy to play the guitar. The pickups is YAMAHA's Alnico-V. I feel the very good distortion sound. Of course, Clean sound is very well. Old YAMAHA is Great !! It is cleanliness. I polished with guitar exclusive polish, so it is in a very clean state. I after the finger board cleaning, painted beeswax. The aim is moisturizing and and protection. Current neck condition, very good ! roughly straight ! There is no problem with the Truss rod and it can be adjusted. Remaining the frets are 92% on average. You can play immediately after it is delivered to you. I was set new strings. Regular tuning. ( Inch : 009, 011, 016, 024, 032, 042 ) Guitar playing, is comfortable. All is working well. It is in a very good condition. The Truss rod Wrench is not included. All Original.Note : I changed all electric circuits to New ones. Look at the photos, please verify by yourself! It will be professionally pack. Double air packing. And ships inside a sturdy cardboard box. This electric guitar is USED. Please consider it when bidding. Thank you. Payment I accept PayPal only. Please pay within 3 days after the auction closed. Shipping Worldwide shipping from Japan! EMS / Shipping includes a tracking number. / / / Destination cost Delivery time / / / Asia : $1004 ~ 7daysUS Canada : $1205 ~ 8 daysEurope : $1406 ~ 10 daysOceania : $1205 ~ 8 daysSouth America : $2408 ~ 12 days This item is shipped within 3 business days after payment is confirmed. Terms of Sale International buyers - Please Note: Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer's responsibility. Please check with your country's customs office to determine what these additional costs will be prior to bidding/buying. These charges are normally collected by the delivering freight (shipping) company or when you pick the item up -do not confuse them for additional shipping charges. Please contact us first with 30 working days for any returns, Buyer pays shipping cost from buyer's country to Japan when being returned. In case of return, the shipping cost won't be refunded. We sell various kinds of Electric guitars to international customers. Our goal is to provide the best quality products and service and your satisfaction is the most important to us. Happy bidding!! Thank you !!", "ItemID": "254059431020", "EndTime": "2019-01-16T04:59:33.000Z", "StartTime": "2019-01-09T04:59:33.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1984-YAMAHA-LP-400BL-Lord-Player-Model-All-Original-Made-Japan-/254059431020", "ListingType": "Chinese", "Location": "Nagoya-shi,Kita-ku, Aichi", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2540594310208080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/rZAAAOSwsZhcJEaa/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/YjMAAOSw~flcJEag/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/PBkAAOSwZddcJEan/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/OV4AAOSwxtVcJEav/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/I~gAAOSwENVcJEaw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/Z4UAAOSwFs1cJEa3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/P~wAAOSwl7dcJEa8/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/mx8AAOSwOWdcJEa~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTExOFgxNjAw/z/YPkAAOSwTxJcJEbG/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/YQQAAOSwTxJcJEbS/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg2MDY=/z/Er0AAOSwBPRcJEbU/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjYw/z/VrQAAOSwUpFcJEbZ/$_57.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jguitar-shop", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 369, "PositiveFeedbackPercent": 100.0}, "BidCount": 4, "ConvertedCurrentPrice": {"Value": 298.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 298.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "j***s", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 189}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Americas", "Europe", "Asia", "AU"], "Site": "US", "TimeLeft": "PT0S", "Title": "1984 YAMAHA LP-400BL. Lord Player Model. All Original. Made in Japan.", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Yamaha"]}, {"Name": "Model Year", "Value": ["1984"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Modified Item", "Value": ["Yes"]}, {"Name": "Model", "Value": ["LP-400BL"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Series", "Value": ["Original"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Modification Description", "Value": ["I changed all electric circuits to New ones."]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "MPN", "Value": ["311812"]}]}, "HitCount": 304, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "JP", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 303.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["APO/FPO", "Africa"], "GlobalShipping": false, "ConditionDescription": "Very Good Condition. This is Used Electric Guitar. The electric guitar when connect to the amplifier, sound output is normal. There are scratches and Dents. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. Please Read the descriptions for details.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}