{"BestOfferEnabled": false, "Description": "****** Scroll down for 55 High Definition images and pictures inside ****** Here's a 2017 Gibson Les Paul Classic HP model in a super clean Ocean Green finish. It is in excellent condition and has light playwear. There's a few light indents on the top of the body- and that's about it. It has a fresh set up and is ready to go! The G force tuners were changed to standard tuners. Gibson's Les Paul Classic 2017 HP solidbody electric guitar blends everything we all love about Les Pauls with many enhancements that turn them into high-performance instruments. The mahogany body is still capped with the familiar maple top. But this Les Paul Classic HP's Soloist neck profile delivers a new and extremely fast feel. Additions such as an adjustable zero-fret nut, and a fast-access neck heel make the guitar a dream to play. The Les Paul Classic 2017 HP delivers familiar tones with a high-performance attitude.Gibson Les Paul Classic 2017 HP Electric Guitar at a Glance:Plek'd for precision playabilityLegendary constructionExtra-wide Soloist neckPunchy pickups plus HP appointmentsPlek'd for precision playabilityThis Les Paul Classic 2017 HP feels fast and precise, thanks in large part to Plek processing. Typically reserved for top-dollar custom guitars, this process levels the frets with pinpoint precision, providing you with the most playable fretboard you're likely to own. Each note rings loud and clear, and the fret edges feel smooth as silk.Legendary constructionThe Gibson Les Paul Classic 2017 HP solidbody electric guitar boasts all the features and design elements that have made the Les Paul one of the most beloved electric guitar designs in history. The single-cutaway body sings with the familiar balance of mahogany's warmth and maple's clear sustain. Like many LPs through the years, the body has been weight-relieved to provide extra comfort. And the mahogany and rosewood neck is carved to Gibson's popular SlimTaper profile that delivers during chording and single-note runs.Extra-wide Soloist neckIf you like the look of a classic Les Paul, but long for a more modern-feeling guitar, you'll love the Gibson Les Paul Classic 2017 HP's comfortable Soloist neck. This extra-wide neck was tailor-made for high-speed soloing, providing you with added width but the same string spacing. This moves the high and low E strings away from the fretboard edges, aiding in wide bends. And the neck's fast-access heel adds to the comfort by giving you unimpeded access to all 22 of the guitar's highly polished frets.Punchy pickups plus HP appointmentsTwo of Gibson's best-loved humbuckers - a '57 Classic in the neck position and a Super '57 Classic in the bridge - give the Les Paul Classic 2017 HP the power, punch, and clarity of Gibson's legendary PAF pickups. Pull up on the volume controls, and you'll access bell-like single-coil tones. And every guitarist at Sweetwater has fallen for this Les Paul's high-performance appointments, including Supreme Grip speed knobs, a titanium adjustable zero-fret nut, and a chrome Tune-o-matic bridge with titanium saddles and stopbar.Gibson Les Paul Classic 2017 HP Electric Guitar Features:Iconic Les Paul with modern features for today's guitaristsFamiliar maple-capped mahogany bodyComfortable and fast SlimTaper Soloist neck profileGibson '57 Classic and Super '57 Classic humbucking pickups deliver a vintage voice with splittable optionsTitanium zero-fret nut makes dialing the guitar into your preferences a cinch Comes with the Gibson Deluxe hardshell flight case, and G-force tuners as seen in the pictures. This guitar will be safely packed and shipped. Buyer to pay $60 FedEx shipping anywhere in the U.S. Full insurance included in shipping. California residents please add 8 % sales tax. Local San Diego pickup always welcome. Will ship worldwide. International shipping guidelines: Buyer is responsible for any import duties. We can declare a low value. FedEx Ground to Canada is $175 with full insurance. FedEx or USPS Express is $245 to most parts of Europe and the UK. FedEx is $295 to Asia and Australia. Full insurance available.", "ItemID": "183652022009", "EndTime": "2019-01-24T19:49:10.000Z", "StartTime": "2019-01-24T16:30:22.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2017-Gibson-Les-Paul-Classic-HP-Ocean-Green-Burst-Standard-Set-Up-/183652022009", "ListingType": "FixedPriceItem", "Location": "San Diego, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1836520220098080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/xQgAAOSwbKdcIC1z/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/mb8AAOSwQ5pcIC1v/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/hVcAAOSwHrlcIC1x/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/iB0AAOSwIS9cIC11/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/cKwAAOSw6dhcIC13/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/FRMAAOSwNqRcIC14/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/0gsAAOSwcqxcIC16/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/2dwAAOSwusdcIC18/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/ZHsAAOSwN5hcIC1-/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/xA0AAOSwEONcIC2A/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/xmUAAOSw6PxcIC2B/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/FBsAAOSwtcRcIC2D/$_57.JPG?set_id=8800005007"], "PostalCode": "92109", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "cwh1", "FeedbackRatingStar": "Red", "FeedbackScore": 3938, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1995.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1995.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "-***c", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 0}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "2017 Gibson Les Paul Classic HP Ocean Green Burst with Standard Set Up", "ItemSpecifics": {"NameValueList": [{"Name": "Country of Manufacture", "Value": ["USA"]}, {"Name": "Body Color", "Value": ["Green"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Les Paul Classic HP"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Dexterity", "Value": ["Right handed"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}]}, "HitCount": 4, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1897962", "StoreName": "cwh1"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Very clean condition- scroll down to see 55 HD images", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}