{"BestOfferEnabled": true, "Description": "Vintage 1984 Aria Pro II RS Classic Series Electric Guitar - Matsumoku Japan - Phantom Blue Metallic - Excellent Please make your offer before the auction endsFrom the Yngwie Malmsteen endorsed series (Classic, Elite, Esprit)Produced in 1984 at the famed Matsumoku plant in JapanFeaturing Aria's RSP pickups (single and dual coil)Alder bodyMaple neck with rosewood fretboard22 regular frets, hand finished edgesModerate curvature, butter smooth neckBone nutTwo RSP-V single coil pickups, and one RSP-IV dual coil pickup in the middle positionTone and volume controlsFive-position pickup selectorAria ACT-1 floating tremolo bridgeSigned MHG machine heads Finish: Phantom Blue (\"PB\") MetallicHardware: GoldYear: 1984Plant: MatsumokuCountry: Japan An excellent (and pretty rare) guitar designed by Nobuaki Hayashi (H. Noble) for Aria, built at the Matsumoku plant for the 1983-1984 production season, and only offered during those two years. The most prominent features of these series were the stacked coil RSP pickups, and a range of translucent metallic finishes, such as \"phantom blue\", featured on this guitar, combining tints of blue, gray, and moss with a fine metallic sparkle.The finish is a lot more intricate and warm in person, mixing in shades of gray, gold, and green, quite hard to capture in the photos. The guitar is in excellent physical and musical condition. The action and intonation adjust as expected, electronics work fine, and the famed RSP pickups produce a wide variety of tones - from light semi acoustic to traditional blues to intense leads and rock fills.The floating ACT-1 tremolo bridge provides massive sustain and dramatic tone ups and downs with the included tremolo bar. The finish is very well preserved and shiny, with only minimal light traces of use if you look close. The neck is straight, the frets have practically no wear. I verify my guitars against available Aria catalogs and corroborated information from collectors. Please be aware of the many built-from-parts and look-alike guitars, as well as unauthorized restorations. This is not one of them. My instruments are kept in a climate controlled, smoke-free and dust-free environment. They are regularly maintained and never taken to gigs. Any signs of prior use come from previous owners and are carefully documented. Please take a look at the included high-resolution photos and feel free to ask any questions prior to bidding or purchase. The guitar is sold as-is with no returns. It will be packaged safely and shipped promptly with full insurance and tracking. Thanks, and good luck! This auction description and images are Copyright (C) by travellight at cyberalia com. All rights reserved. Unauthorized duplication of these materials is a violation of law.", "ItemID": "232875072593", "EndTime": "2019-01-16T16:42:10.000Z", "StartTime": "2018-08-05T03:54:31.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Vintage-1984-Aria-Pro-II-RS-Classic-Strat-Electric-Guitar-Matsumoku-Japan-/232875072593", "ListingType": "FixedPriceItem", "Location": "Silver Spring, Maryland", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/2328750725938080_3.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg4OTY=/z/yD4AAOSwlulbZmmg/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg4OTY=/z/YVUAAOSwhCBbZmmj/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg4OTY=/z/YV4AAOSwhCBbZmmp/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg4OTY=/z/ebUAAOSwwAVbZmmm/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg4OTY=/z/UdAAAOSwCFNbZmmt/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg4OTY=/z/w2gAAOSw~~NbZmmw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg4OTY=/z/w2sAAOSw~~NbZmmy/$_57.JPG?set_id=8800005007"], "PostalCode": "20910", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "travellight", "FeedbackRatingStar": "Purple", "FeedbackScore": 855, "PositiveFeedbackPercent": 99.1}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 455.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 455.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "e***b", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 858}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Vintage 1984 Aria Pro II RS Classic Strat Electric Guitar Matsumoku Japan", "ItemSpecifics": {"NameValueList": [{"Name": "Modified Item", "Value": ["No"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}]}, "HitCount": 966, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "Oceania", "Southeast Asia", "South America", "BM", "GL", "MX", "PM"], "GlobalShipping": false, "ConditionDescription": "Made in Japan - 1983-1984 production season - rare model - mint condition.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}