{"BestOfferEnabled": false, "Description": "G & L Ascari GT-90 Electric Guitar P-90 Pickups Beautiful Finish Excellent NR G & L Ascari GT-90 Electric Guitar, P-90 Pickups, Beautiful Finish, Excellent No Reserve! This guitar is really unique with the P-90 Pickups. 22 Fret fretboard, 1 Volume control and 1 Tone control. This guitar has a beautiful Tobacco Sunburst finish.Some of the features on this guitar are Set Neck, Dot Position Markers, Sealed Back Tuners, 24 3/4 Scale, Chrome Hardware, Cream Colored Body And Neck Binding as well as Cream Colored Pickup Covers, P-90 Pickups. The guitar may have some light scratches that will not show in pics. This is a good quality guitar and will bring many years of enjoyment. This guitar is made in Indonesia. We will post pics for a closer inspection. This guitar has no case but will be packed well for safe transport. make offer if needed, can't locate the option. Thanks for looking! We are liquidating our 5,000 square foot store at 214 N 3rd Ponca City, OK 74601, 1:30 to 5 pm Monday thru Saturday, Everything is 15% to 70% off. We hope to have it closed by the end of the year and would love to hear from other stores who carry classic toys, guitars, amps, games, action figures, Star Wars, Star Trek, DC Comics, Marvel Comics characters, Elvis, Beatles, 7,000 plus Record albums & 45rpm & 78 rpm. Railroad lanterns. Please feel free to call us with any questions regarding this item or any other items that we have in our eBay Store! Thank you! I am not an expert in all things so please ask specific questions about the item before bidding. I am located in Ponca City, Oklahoma and local pickup is always available, free of charge. I have a HUGE inventory of collectibles including over 1,000 Lunch boxes & thermoses, over 6,000 record LP, 45rpm, 33rpm, & over 1,000 Hallmark ornaments & Merry Miniatures available, email wants & I will try to list them for you! All items come from a SMOKE free home, although many items are bought secondhand and as a non-smoker, if I notice a smell I will list that information. We describe every item honestly and to the best of our ability, therefore we do NOT offer refunds. Sometimes we make HONEST mistakes in descriptions so please ask all questions and view all photos before bidding. We leave feedback only after it is left for us. If for any reason you need to contact us we prefer that you do so via ebay message systems. Check seller's other listings, Multiple purchases could save on S&I. Thanks for viewing. Paypal payments NOTICE, buyers must have a confirmed address and be a verified Paypal buyer. Paypal payments to be made in 3 days from auction end. If you are pleased/satisfied with the transaction, upon receipt of your item, please leave positive feedback. I am ALWAYS glad to leave feedback for those who purchase items from us. I can ship it the next business day after paid. If you are in a hurry for any reason, please email me as soon as you bid on it so I can be aware of the urgency so I can locate the item in my storage area. I ship alot of items through Fed Ex Ground/Home. I need your telephone number for Fed Ex form and if you are international buyer I need your telephone number for the customs forms. The service here does not show Fed Ex as a shipping option but I use it for large or heavy items. Thank you! I do not ship until the payment has cleared. Payment expected withing 3 days through Paypal or within 8 days through the mail. DO NOT DUPLICATE OR COPY! Template Made By: © InkFrog.com Auction Templates, Logos, Store fronts and more! inkfrog terapeakOn Jan-12-19 at 15:46:47 PST, seller added the following information: Wanted to call you attention to the neck as it has some bow but still plays great. I was going to adjust the neck but the truss rod is out of adj. Not a big deal as it still plays well but wanted to mention everything we know about guitar.", "ItemID": "312421911317", "EndTime": "2019-01-16T21:37:04.000Z", "StartTime": "2019-01-09T21:37:04.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/G-L-Ascari-GT-90-Electric-Guitar-P-90-Pickups-Beautiful-Finish-Excellent-NR-/312421911317", "ListingType": "Chinese", "Location": "Ponca City, Oklahoma", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/3124219113178080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTAyNFg3Njg=/z/jwkAAOSwHDdcNmii/$_10.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg3Njg=/z/YYgAAOSwgotcNmii/$_10.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg3Njg=/z/SsAAAOSwoEFcNmii/$_10.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzY4WDEwMjQ=/z/AlMAAOSwK0tcNmii/$_10.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg3Njg=/z/CRMAAOSwEHhcNmii/$_10.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg3Njg=/z/eTUAAOSwLgpcNmii/$_10.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzY4WDEwMjQ=/z/L7AAAOSwS2lcNmik/$_10.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg3Njg=/z/sFAAAOSw8L5cNmik/$_10.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzY4WDEwMjQ=/z/cxAAAOSw1rpcNmik/$_10.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg3Njg=/z/vqgAAOSwJFBcNmik/$_10.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg3Njg=/z/lysAAOSwqLRcNmik/$_10.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg3Njg=/z/TtUAAOSwaiBcNmik/$_10.JPG?set_id=880000500F"], "PostalCode": "74601", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "toylady2", "FeedbackRatingStar": "Red", "FeedbackScore": 2994, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 299.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 299.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "w***w", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 109}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "Europe", "Asia", "CA", "AU", "BS", "MX", "NZ", "CL", "CO", "CR", "PA", "TT", "GT", "HN", "JM", "AG", "AW", "BZ", "DM", "GD", "KN", "LC", "MS", "TC", "BB", "BM", "BO", "EG", "GF", "GP", "KY", "MQ", "NI", "PY", "RE"], "Site": "US", "TimeLeft": "PT0S", "Title": "G & L Ascari GT-90 Electric Guitar P-90 Pickups Beautiful Finish Excellent  NR", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["G & L"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["NA"]}, {"Name": "Model", "Value": ["Ascari"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Body Color", "Value": ["Sunburst"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Model Year", "Value": ["NA"]}, {"Name": "Country/Region of Manufacture", "Value": ["Indonesia"]}]}, "HitCount": 219, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=69622", "StoreName": "Terri&#39;s Toys and Nostalgia"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 304.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": true, "ConditionDescription": "Excellent, beautiful tobacco sunburst finish electric guitar, no case.", "QuantitySoldByPickupInStore": 0, "SKU": "7 day auction", "NewBestOffer": false}