{"BestOfferEnabled": false, "Description": "Hi all, got a rare one here. If you are looking at this you probably know more about these guitars than I do. Unfortunately, I don’t think this one isn’t all original, and has had some repaired damage. First, please see photos and understand that the pictures are part of the description. I am no expert on these guitars, nor have I fully “explorered” this one. I will describe guitar to the best of my knowledge, but this is being sold as is. I recently had a person return a different guitar because the “Floyd rose sat higher than he liked” and TBH I’m not willing to accept returns for this or similar reasons, especially given the conditional issues here. That said, I have never tried to deceive anyone in anything I sell, please check my feedback. Starting with the neck: The tip of the headstock has some minor damage, please see pictures. The tuners look to be original, but you tell me. The low E tuning peg sits at a slight angle, not sure if this is normal for this model, but all tuners appear to be fully functional and hold tune well after some of my “wacky sting bending tests”. The nut (replacement?) was placed poorly about a centimeter too close to the high E side; you can tell the low E string is just a little too far away from the low E side of the fretboard. This would be the first thing I would replace to make this a real player. That said, the action is nice and set to what I would call med/low, frets have some wear (not sure if original) but guitar plays well as is with no fret buzz, besides the nut being slightly off. The back of the neck is very nice but there are 2 small (can feel to the touch) divots around the 5th fret on the high E side. Doesn’t effect play and not super noticeable. As you get up the neck there is a slight indentation under the 19th fret on the low E side, does not affect play. Where the neck meets the body of guitar is the main area of damage. At some point the neck was separated from the guitar, please see pictures. The neck has been reglued/reset, and there are two screws next to the strap knob. Not sure the length of these screws, but they are recessed about 1/4 inch into the body. I was told this was a professional repair when I bought the guitar, but let the pictures tell you. I have not removed the pick guard to view the side of the crack/damage on the front end of the guitar. When playing the guitar it feels very solid and I have not noticed any issues with resonance or anything like that. To the body: Both pickups are functional, and sound great. I am not sure of their originality, and again, I have not removed the pick guard to investigate further. The neck pickup plastic casing is badly cracked, see pics. The pickup switching knob cover is missing, volume and tone knobs appear to be original but have chipping. I do not know anything about originality of the bridge and saddle (bridge prob not original, saddle might be?). The bridge is missing the black “knob screw” or whatever on the low E string, but I honestly do not know what the function of this screw is, and doesn’t seem to have any affect. The body has numerous dings and marks, please see pictures. The output jack has a bit of resistance that pushes the cord away after plugging in, but the cable doesn’t seem to regularly fall out or anything. All in all, this guitar is already a player; If I were to keep it I would just replace the nut and be good to go and maybe check the output jack, but I’m easy to please. I think it sounds great currently. No HSC included but I will package well, I've shipped over a hundred guitars and never had any damage. Will require signature confirmation for this one..", "ItemID": "163437636984", "EndTime": "2018-12-19T03:24:18.000Z", "StartTime": "2018-12-17T22:25:19.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1976-1977-Ibanez-Korina-destroyer-lawsuit-electric-guitar-/163437636984", "ListingType": "FixedPriceItem", "Location": "San Diego, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1634376369848080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/bpcAAOSw7OdcFi-2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/lPsAAOSwhzhcFi--/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/CbQAAOSw-V1cFi~G/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/bIAAAOSwJ3RcFi~N/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/t-YAAOSwfwpcFi~t/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/STkAAOSw651cFi~a/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Q40AAOSwTQNcFi~0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/wgYAAOSwe~lcFjAg/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/ihkAAOSwvfpcFi3N/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/0XwAAOSwRDJcFi~9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/nOMAAOSwa55cFi3I/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/MV0AAOSwu4dcFjA3/$_57.JPG?set_id=8800005007"], "PostalCode": "92102", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "silverstrandedcm", "FeedbackRatingStar": "Red", "FeedbackScore": 1129, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1100.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1100.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "1***r", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 1}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "1976 1977 Ibanez Korina destroyer lawsuit electric guitar", "ItemSpecifics": {"NameValueList": [{"Name": "Body Material", "Value": ["Korina"]}, {"Name": "Brand", "Value": ["Ibanez"]}]}, "HitCount": 106, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 5, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "READ ITEM DESCRIPTION! THIS AMONG OTHER THINGS HAS A REPAIRED CRACK WHERE NECK MEETS THE BODY! PHOTOS ARE PART OF DESCRIPTION!", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}