{"BestOfferEnabled": false, "Description": "Powered by Frooition Pro Shop Search 2011 Line 6 JTV-69 James Tyler Variax Electric Guitar - Candy Apple Red w/G-Bag Click here to view full size. Full Size ImageClick to close full size. Item Description Line 6 JTV-69 Variax Electric Guitar in very good condition but with various light dents, dings and scratches on the front and back. Cool Candy Apple Red finish with a white pickguard and chrome hardware. The guitar has a nice action and the soft \"V\" profile maple neck that has a great feel. The frets are in excellent condition. The two single coils paired with the bridge humbucker have great tone and make this a versatile guitar. Add in all the different guitar modeling and the different tunings and you have an extremely versatile tone machine. The guitar is equipped with a two point tremolo and staggered height locking tuners. Looks, plays and sounds great. Includes a gig bag, battery, battery charger, breakout box, cable and straplocks. The tremolo arm is missing and is no included. Serial Number: W11120116 Weight: 7 lbs. 15 oz. Record and Perform with Unlimited Tonal Potential The Line 6 JTV-69 James Tyler Variax with Variax HD software gives you the amazing ability to create any guitar tone you need for studio or stage. The JTV-69 James Tyler Variax is also an amazing instrument in the conventional sense, and the ability to select different HD instrument models, HD pickup models, and alternate tunings on the fly sets this guitar apart from all the rest. And with the incredible Workbench HD software, you can fine-tune your Variax tone more than ever. Built to the specifications of master luthier James Tyler, the Line 6 JTV-69 James Tyler Variax is your ticket to unlimited tonal excellence. Line 6 JTV-69 James Tyler Variax Solidbody Electric Guitar at a Glance: Variax HD Upgrade and Workbench software give you unlimited tonal potential It's like owning dozens of different instruments, plus your own workshop Designed by a master luthier for top-notch performance and playability Variax HD Upgrade and Workbench software give you unlimited tonal potential This Line 6 JTV-69 James Tyler Variax packs the latest Variax HD upgrade, bringing you more stellar models of rare vintage electric guitars, classic acoustic guitars, and exotic instruments. You'll be blown away once you start exploring these with the Workbench HD software, which gives you more tonal control and all-around tweakability than you ever thought possible. Create your own unique instrument model, then use Workbench HD to fine-tune individual string pitch, string volume, pickup position, and much more. You've never tweaked your tone like you can with the JTV-69 James Tyler Variax! It's like owning dozens of different instruments, plus your own workshop Right out of the case, your Line 6 JTV-69 James Tyler Variax comes with dozens of impeccable instrument models. Rare vintage electrics, fabulous acoustics, and even exotic instruments are waiting at your fingertips. The latest Variax HD software brings you more stellar HD instrument and pickup models than ever before, and the real magic happens when you tap into the Workbench HD software. It lets you combine your favorite body styles, pickup models, and components to create your own unique instruments. You're guaranteed to be well-equipped for any studio or stage situation with the Line 6 JTV-69 James Tyler Variax. Designed by a master luthier for top-notch performance and playability With its alder body and maple neck, the Line 6 JTV-69 James Tyler Variax is primed from the start for iconic electric guitar tone. It was designed by master luthier James Tyler, who has created instruments for countless session players and performers. Equipped with pickups custom-designed by James Tyler and wound to his exacting specs, you'll find the JTV-69 James Tyler Variax to be an amazingly playable guitar even before you ever try out the superb modeling technology. Line 6 JTV-69 James Tyler Variax Solidbody Electric Guitar Features: Innovative guitar with onboard instrument models, pickup models, and on-demand alternate tunings Included HD upgrade gives you even more HD instruments and HD pickup models than ever before Workbench HD software lets you fine-tune individual string pitch, volume, pickup position, and more Solid alder body and maple neck are a classic recipe for fantastic tone GraphTech nut and custom tuners give you top-notch tuning stability and reliability Completely designed by master luthier James Tyler, including custom-wound pickups Includes lithium-ion battery, switching power supply, and Workbench USB adapter The Line 6 JTV-69 James Tyler Variax is like a Pandora's box of tone!Variax models based on: 1960 Fender Telecaster Custom 1968 Fender Telecaster 1968 Fender Telecaster Thinline 1969 Fender Stratocaster 1958 Gibson Les Paul Standard 1952 Gibson Les Paul \"Goldtop\" 1961 Gibson Les Paul Custom (3 PU) 1956 Gibson Les Paul Junior 1976 Gibson Firebird V 1955 Gibson Les Paul Special 1969 Gretsch 6120 1956 Gretsch Silver Jet 1968 Rickenbacker 360 1966 Rickenbacker 360-12 1961 Gibson ES-335 1967 Epiphone Casino 1957 Gibson ES-175 1953 Gibson Super 400 1969 Martin D-28 1970 Martin D 12-28 1967 Martin O-18 1966 Guild F212 1995 Gibson J-200 1935 Dobro Alumilite Danelectro 3021 Coral Dano Electric Sitar Gibson Mastertone Banjo 1928 National Style 2 \"Tricone\" Alternate tunings for JTV-69: MODEL STANDARD: E A D G B E DROP D: D A D G B E 1/2 DOWN: Eb Ab Db Gb Bb Eb DROP Db: Db Ab Db Gb Bb Eb 1 DOWN: D G C F A D DADGAD: D A D G A D OPEN D: D A D F# A D BLUES G: D G D G B D RESO G: G B D G B D OPEN A: E A C# E A E BARITONE: B E A D F B About Us Payment Shipping Terms Returns About UsWe offer a large selection of quality pre-owned musical instruments and equipment from the industries finest manufactures including Akai, Ampeg, Boss, Denon, Digidesign, DigiTech, Epiphone, Fender, Gibson, Gretsch, Guild, Ibanez, Korg, Lexicon, Line 6, Mackie, Mesa Boogie, Marshall, Martin, MusicMan, MXR, Neumann, Peavey, Pioneer, PRS, Roland, Shure, Tascam, Taylor, TC Electronic and Yamaha. New gear arrives daily so check our store often. Lighthouse Sound, Inc. is proud to be an authorized dealer of the following brands of guitar effects pedals, pedal boards, amplifiers and accessories: Bearfoot FX, Bigsby, Cooper Stands, Dunlop, Earthquaker Devices, Ernie Ball, EVH, Fender Accessories, Keeley Electronics, Gretsch Accessories, Ken Smith Strings, Lava Cable, Martin Accessories, Mojo Hand FX, RotoSound, SnaKe Oil Strings, Snark Tuners, Suhr Guitars, Amps, Pedals and Pickups, Voodoo Lab and Wampler Pedals About Us Payment Shipping Terms Returns PaymentWe accept PayPal payments. All major Credit Cards are accepted through PayPal including Master Card, Visa, American Express and Discover. About Us Payment Shipping Terms Returns ShippingLighthouse Sound specializes in prompt, safe shipping. We take great care packaging every item to ensure safe shipment to you. We get your gear to you fast, most orders ship within 1 business day of payment clearance. Tracking information is uploaded to eBay and can be viewed from your eBay account. International customers are responsible for any duties, taxes, brokerage or other fees. Please check with your country's customs office to determine what these additional costs will be. These fees vary from country to country and we have no way to calculate them. About Us Payment Shipping Terms Returns TermsSales Tax - 7 % Ohio Sales Tax will be added to the total amount for all purchases delivered to Ohio. We take pride in our customer service and your satisfaction is very important to us. In the rare event that you have a problem with your item please contact us and we'll be happy to help. While all care is taken, any errors, omissions or variations in the item details are unintentional. About Us Payment Shipping Terms Returns ReturnsWe offer a 14 day return policy. Items must be returned to us within 14 days of the original delivery date. We ask that you please return the product in the original product packaging along with all included materials (manual, warranty card, all accessories) and in the original condition that it was received. Buyer is responsible for return shipping and insurance cost. Refunds will be issued upon return of the item less the original shipping charge and a 15% restocking fee will apply. Helpful Links More Items! This listing is currently undergoing maintenance, we apologize for any inconvenience caused. Powered by SixBit's eCommerce Solution", "ItemID": "233030858015", "EndTime": "2018-12-20T16:23:49.000Z", "StartTime": "2018-12-03T03:33:58.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2011-Line-6-JTV-69-James-Tyler-Variax-Electric-Guitar-Candy-Apple-Red-w-G-Bag-/233030858015", "ListingType": "FixedPriceItem", "Location": "Salem, Ohio", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2330308580158080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/rpoAAOSwdUJcAGI0/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/kPIAAOSwaiBcAGI3/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/x0IAAOSw-ghcAGI6/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/MJUAAOSww-lcAGI8/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/ahoAAOSwsGpcAGI~/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/IdEAAOSwjrFcAGJC/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/SEsAAOSwwkRcAGJG/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/DI8AAOSwmT1cAGJI/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/4qUAAOSwNepcAGJO/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/HdEAAOSwWSlcAGJL/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/69YAAOSwADxcAGJU/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/IdcAAOSwBMpcAGJR/$_57.JPG?set_id=880000500F"], "PostalCode": "44460", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "lighthouse_sound", "FeedbackRatingStar": "TurquoiseShooting", "FeedbackScore": 33092, "PositiveFeedbackPercent": 99.6, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 699.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 699.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "e***d", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 949}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "CA", "GB", "DK", "RO", "SK", "BG", "CZ", "FI", "HU", "LV", "LT", "MT", "EE", "AU", "GR", "PT", "CY", "SI", "JP", "CN", "SE", "KR", "ID", "TW", "TH", "BE", "FR", "HK", "IE", "NL", "PL", "ES", "IT", "DE", "AT", "BS", "IL", "MX", "NZ", "SG", "CH", "NO", "SA", "UA", "AE", "QA", "KW", "BH", "HR", "MY", "CL", "CO", "CR", "PA", "TT", "GT", "HN", "JM", "BB", "BD", "BM", "BN", "BO", "EG", "GF", "GG", "GI", "GP", "IS", "JE", "JO", "KH", "KY", "LI", "LK", "LU", "MC", "MO", "MQ", "MV", "NI", "OM", "PK", "PY", "RE"], "Site": "US", "TimeLeft": "PT0S", "Title": "2011 Line 6 JTV-69 James Tyler Variax Electric Guitar - Candy Apple Red w/G-Bag ", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Line 6"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Model", "Value": ["JTV-69"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Color", "Value": ["Candy Apple Red"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Features", "Value": ["Modeling"]}, {"Name": "Model Year", "Value": ["2011"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["Korea"]}, {"Name": "Accessory Specifics", "Value": ["Tremolo arm is missing and no included"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}]}, "HitCount": 260, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=22579709", "StoreName": "LHSound"}, "Country": "US", "ReturnPolicy": {"Refund": "Money back or replacement (buyer's choice)", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": true, "ConditionDescription": "Line 6 JTV-69 Variax Electric Guitar in very good condition but with various light dents, dings and scratches on the front and back. Cool Candy Apple Red finish with a white pickguard and chrome hardware. The guitar has a nice action and the soft \"V\" profile maple neck that has a great feel. The frets are in excellent condition. The two single coils paired with the bridge humbucker have great tone and make this a versatile guitar. Add in all the different guitar modeling and the different tunings and you have an extremely versatile tone machine. The guitar is equipped with a two point tremolo and staggered height locking tuners. Looks, plays and sounds great. \n\nIncludes a gig bag, battery, battery charger, breakout box, cable and straplocks. The tremolo arm is missing and is no included.\n\nSerial Number: W11120116", "QuantitySoldByPickupInStore": 0, "SKU": "43455", "NewBestOffer": false}