{"BestOfferEnabled": false, "Description": "MIJ, made in japan, Gibson, Lespaul, White, SG, Höfner, Duesenberg, Ibanez, ATELIER Z, ARIA, ESP, Caparison, Killer, COMBAT GUITARS, GUYATONE, Greco, Sugi Guitars, TEISCO, DEVISERA, Nil, Bacchus, VANZANDT, Fernandes, Fender Japan, Fujigen, MOON GUITARS, momose, Yairi Guitar, YAMAHA, TOKAI, Zemaitis, VOX, B, C, Rich, Epiphone, Gibson, Gretsch, Suhr, Schecter, Charvel, Jackson, Dean, Tom Anderson, Fender, Paul Reed Smith, Melancon, Mosrite, Rickenbacker, Robert Benedetto, Washburn, Ibanez, kramer, EDWARDS, Burny, Grassroots, 1973 Burny by Tokai FTV-45Y Les Paul Jr DC Type All Original Very Good condition.Made in Japan Down from here, Photo is dent and scratches etc.. About scratches that are hard to see. To make it easy to understand the condition of the scratches, I lighted the light strongly. 1973 Burny by Tokai FTV-45Y Les Paul Jr DC Type All Original Very Good condition.Made in Japan Body Mahogany. Neck Mahogany. Deep bolt on joint. Frets 22F. Scale 24.75inch (628mm) Gibson Medium Scale. Nut Width About 1.65 inch (42mm). Pickup Burny Fernandes Original. Control 1 Volume, 1 Tone. Bridge Burny Fernandes Original. Wrap-around Bridge. Machine heads GROVER. Color TV Yellow. Weight About 8.53 Pound ( 3.87 Kg ). This is Used Guitar. The mark of the head, the logo of \"Burny\" and the mark of \"Les Paul\" are deteriorated. There are scratches and dents. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. This guitar is the oldest among the guitars I sold in eBay. This FTV does not have a serial number. It is a feature of the Fernandes 70's early model. The bolt-on structure of the deep joint can be said to be a precious model. It was manufactured by Tokai in 1973. That is 45 years ago. It is very very old guitar. Fernandes has not received a license of \"Les Paul\" from Gibson. Nevertheless, there is a mark of \"Les Paul\" on the head. It is not thought at present. This was a big problem at the time. For that reason, after 1979 the \"Les Paul\" mark has disappeared. And the mark has been changed to \"Super Grade\". On the machine head of this FTV, an expensive GROVER is installed. It still works comfortably and still works well as a guitar. And this FTV is deep joint by bolt on. Thanks to that, Un pluged sound is be powerful. From the body, the vibration of the sound is transmitted well. Making is very polite. You can feel a made in japan. It is very rare guitar. This FTV has dignity of vintage guitar. Please add it to your Burny collection. It is cleanliness. I polished with guitar exclusive polish, so it is in a very clean state. I after the finger board cleaning, painted beeswax. The aim is moisturizing and and protection. Current neck condition, very good ! roughly straight ! There is no problem with the Truss rod and it can be adjusted. Remaining the frets are 40% on average. You can play immediately after it is delivered to you. I was set new strings. Regular tuning. ( Inch : 009, 011, 016, 024, 032, 042 ) Guitar playing, is comfortable. All is working well. It is in a very good condition. The Truss rod Wrench is not included. All Original.Note : The hard case key has been lost. Note : The Strap pin has been changed to lock type. The Used Hard Case is included. Look at the photos, please verify by yourself! It will be professionally pack. Double air packing. And ships inside a sturdy cardboard box. This electric guitar is USED. Please consider it when bidding. Thank you. Payment I accept PayPal only. Please pay within 3 days after the auction closed. Shipping Worldwide shipping from Japan! EMS / Shipping includes a tracking number. / / / Destination cost Delivery time / / / Asia : $1204 ~ 7daysUS Canada : $1405 ~ 8 daysEurope : $1606 ~ 10 daysOceania : $1405 ~ 8 daysSouth America : $2608 ~ 12 days This item is shipped within 3 business days after payment is confirmed. Terms of Sale International buyers - Please Note: Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer's responsibility. Please check with your country's customs office to determine what these additional costs will be prior to bidding/buying. These charges are normally collected by the delivering freight (shipping) company or when you pick the item up -do not confuse them for additional shipping charges. Please contact us first with 30 working days for any returns, Buyer pays shipping cost from buyer's country to Japan when being returned. In case of return, the shipping cost won't be refunded. We sell various kinds of Electric guitars to international customers. Our goal is to provide the best quality products and service and your satisfaction is the most important to us. Happy bidding!! Thank you !!", "ItemID": "254016983563", "EndTime": "2018-12-15T05:00:41.000Z", "StartTime": "2018-12-08T05:00:41.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1973-Burny-Tokai-FTV-45Y-Les-Paul-Jr-DC-Type-All-Original-Made-Japan-/254016983563", "ListingType": "Chinese", "Location": "Nagoya-shi,Kita-ku, Aichi", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2540169835638080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/7NwAAOSwJ~xcCzbr/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTEzN1gxNjAw/z/nqYAAOSwO7dcCzcL/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY3/z/7X4AAOSweOdcCzbt/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTEyM1gxNjAw/z/~vgAAOSwjTtcCzci/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/wm0AAOSwh39cCzcq/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/85YAAOSwWlVcCzcy/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/mb8AAOSw5wFcCzc5/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIzMlgxNjAw/z/86IAAOSwWlVcCzc-/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTUzMVgxNjAw/z/aHMAAOSwcs1cCzdJ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/7V4AAOSwJ~xcCzdQ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/P0AAAOSw9m5cCzdW/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTMzMVgxNjAw/z/WJsAAOSwdhdcCzdd/$_57.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jguitar-shop", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 369, "PositiveFeedbackPercent": 100.0}, "BidCount": 10, "ConvertedCurrentPrice": {"Value": 406.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 406.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "u***s", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 7}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Americas", "Europe", "Asia", "AU"], "Site": "US", "TimeLeft": "PT0S", "Title": "1973 Burny by Tokai FTV-45Y. Les Paul Jr DC Type. All Original. Made in Japan.", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Burny by Tokai"]}, {"Name": "Model Year", "Value": ["1973"]}, {"Name": "Model", "Value": ["FTV-45Y"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Exact Year", "Value": ["1973"]}, {"Name": "Series", "Value": ["Original"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["TV Yellow"]}]}, "HitCount": 1085, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "JP", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 411.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["APO/FPO", "Africa"], "GlobalShipping": false, "ConditionDescription": "Very Good Condition. This is Used Electric Guitar. The electric guitar when connect to the amplifier, sound output is normal. There are scratches and Dents. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. Please Read the descriptions for details.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}