{"BestOfferEnabled": false, "Description": "This posting is for a Used 2010 Discontinued Epiphone Les Paul Nightfall Electric Guitar in Beautiful Glossy Ebony Finish with Serial number #1012120759 in Excellent condition. It features Mahogany Body, Hard Maple neck with 24.75 Scale length and 12\" Fingerboard radius, Rosewood fingerboard with special inlay on 12th fret, EMG HZ-4, EMG HZ-4A Humbucker pickups with 2 Volumes, 2 tones controls, Floyd Rose Special Tremelo system, Grover machine tuners, and Black Hardware. All electronics are in great working condition without any scratchy noises or interference. Cosmetically, it is in excellent condition with no cracks, defects, or damages except a few dings, light scratches, and light buckle rashes on the back. Also the finish on the back of the neck is a little faded in finish with light texture. Looks like it had a reaction to sweat from playing but does not effect play-ability. The neck is super straight with great low action setup for fast tapping, shredding. It has been re-fretted so the frets are brand new, super clean with full of life left. The pickguard cover, Toogle switch cover, truss rod cover, and humbucker pickup rings had been upgraded to real skull designed metal pieces. I do not have the back plate cover but you can get one for real cheap online. Overall, this Epiphone Les Paul Nightfall is a Gibson made for Rock Guitar with unique Gothic look and great quality of wood. It is a true insane shredding machine with amazing great rock and metal tones. This guitar will come with its original tremelo arm and a Brand New Road Runner Deluxe molded hardshell case. Please see pictures and Specs. below for more details! Good luck and thank you! OVERVIEW: Les Paul Nightfall Epiphone's history with legendary guitarist and innovator Les Paul dates back to the early 1940's when Les, working late at night at the Epiphone factory in New York City on 14th St., created perhaps the world's first solidbody electric guitar, better known as \"The Log.\" Les Paul was a tireless innovator and with that same spirit in mind, Epiphone engineers took a page from the Les Paul drawing book and combined those ideas with something new that could cut through today’s edgier sound. The result is the Les Paul Nightfall which has everything Les Paul admired about Epiphone--fearless innovation, value, and great sound. “Epiphone always made a good guitar,” Les liked to say fondly and if Les could have tried the Les Paul Nightfall, even the hard-to-please innovator would have easily changed that declaration to ‘great.’ Time Tested Legendary Design The Les Paul Nightfall starts with the classic Les Paul Studio design. The Les Paul Studio was an important innovation of Les Paul’s dream guitar. As the name implies, the Les Paul Studio was geared toward studio musicians who desired a basic, unadorned Les Paul weighing slightly less than the heavier on-stage models. Introduced in the early ‘80s, the Les Paul Studio instantly became a favorite for Les Paul lovers of all ages. From that bold yet practical idea, the Les Paul Nightfall veers into the hard rock and metal world for a new super stunning look. FEATURES: SPECIFICATIONS BodymahoganyNeckHard maple, Hand-set,Scale24.75”Fingerboardrosewood with inlay on 12th fretFingerboard Radius12”Nut Width1.68”PickupsEMG HZ-4, HZ-4AControlsNeck Volume, Neck Tone, Bridge Volume, Bridge ToneTailpieceFloyd Rose SpecialMachine HeadsGrover®Colorebony (EB)Black Hardware", "ItemID": "202323402243", "EndTime": "2019-01-18T16:42:50.000Z", "StartTime": "2018-05-27T02:12:41.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2010-Epiphone-Les-Paul-Nightfall-Ebony-Electric-Guitar-Excellent-Condition-/202323402243", "ListingType": "FixedPriceItem", "Location": "Sterling, Virginia", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2023234022438080_2.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/W~sAAOSw1-5bChK9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/pcwAAOSwfshbChK0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/CxIAAOSwn8pbChK6/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/ez8AAOSwDPNbChK3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/9dEAAOSw8StbChLA/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/AYEAAOSwq4lbChLH/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/XLkAAOSwh2FbChLL/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/~ooAAOSwGkVbChLN/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/jm8AAOSwkbpbChLQ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/64sAAOSwQFNbChLU/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/Y8AAAOSwZsFbChLX/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/OZ0AAOSwKOJbChN0/$_57.JPG?set_id=8800005007"], "PostalCode": "20164", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "kelvee06", "FeedbackRatingStar": "Red", "FeedbackScore": 1384, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 495.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 495.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "q***b", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 0}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "CA"], "Site": "US", "TimeLeft": "PT0S", "Title": "2010 Epiphone Les Paul Nightfall Ebony Electric Guitar (Excellent Condition)", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Black"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Les Paul Nightfall"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["2010"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "Body Type", "Value": ["Solid"]}]}, "HitCount": 1965, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1013530636", "StoreName": "Guitars Rock Outlet"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}