{"BestOfferEnabled": false, "Description": "Kramer Electric Guitar Bengal / Tiger Pattern - Pacer Series Made in Korea Features Floyd Rose and Seymour Duncan Pickups Guitar was tested and is in normal working condition. No issues with sound output. Guitar has some faint scratches around the body. Listing is for the guitar only and does not include a case or stand. 150835-1 ZAL SNMLOAY Payment Any purchases made from our eBay listings must be paid via PayPal. All in state residents within our state will be charged state and/or local sales tax at the time of checkout. Payment must be received within 3 days of the close of auction. If payment isn't received within 3 days, the auction will be revoked and a Non-Paying Bidder alert will be filed. Shipping Packages are usually shipped within 48 hours of payment receipt (excluding Saturday/Sunday) Shipping costs for all orders can be determined by the shipping calculator in this auction. All orders are shipped via UPS, FedEx, DHL, or USPS. We reserve the right to choose carrier based on shipping method selected at time of payment. Combined shipping is done at the sellers discretion. If you purchase more than one item from us, they may arrive in separate packages. We take great care packaging every item to ensure safe shipment to you. We charge a shipping fee only to cover our costs of materials and labor. The shipping fee also covers insurance and signature confirmation. WE SHIP EVERY ORDER WITH SIGNATURE CONFIRMATION AND INSURANCE SO PLEASE MAKE SURE SOMEONE WILL BE HOME TO SIGN FOR THE PACKAGE! We ONLY ship to a confirmed PayPal address. We DO NOT ship to PO Boxes. NO International Shipping. Returns Genuinely faulty goods not sold AS IS will be replaced or money refunded, however we must be advised of any faulty goods upon receipt of the item. It is the customer's responsibility to pay for and ship the item back to us. Items must be shipped with a tracking number and signature confirmation provided to us within 30 days for a full refund. ONCE A PURCHASED ITEM IS RECEIVED, WE DO NOT RENEGOTIATE OR ISSUE PARTIAL REFUNDS! We do our best to present accurate, detailed information about every item we sell. If you have any questions, please contact us before placing your bid. About We are a small family owned business, providing over 20 years of service in our local area. We have another ebay user id with over 6,000 feedback. Please check it out at fcpdiamonds on ebay. We strive to offer our customers the best prices, products and support. RI Licensed Checkcasher Precious Metals License #200477 Legal The Seller is not the owner or seller of these goods, but merely a bailee acting on behalf of the seller to facilitate the sale of the goods by holding the goods until such time as a sale is completed and the goods are shipped to the buyer. The Seller has used its best efforts to inspect the item(s) for sale and create descriptions and furnish photographs that fairly and adequately depict the type, condition and image of the goods at the time of sale. The Seller makes no express or implied warranties or representations regarding the condition or suitability of the goods and to the extent allowed by law, specifically disclaims any express or implied warranties, including but not limited to any warranty of merchantability or fitness for purpose. The Seller reserves the right to cancel bids on any item due to feedback. The weight of the diamond/gemstone is estimated based upon measurement with a millimeter gauge, therefore carat weight listed is an approximation. Customer is advised that actual weight cannot be ascertained without removing the stone from the setting. If there is no certification listed, then the grade/cut/color of the diamond is based upon our own appraisal from our GD Certified Personnel. The grade listed is an approximation since the actual grade cannot be determined without removing the stone from the setting. Checkout Paypal payment is required immediately after auction end. Normal 0 false false false EN-US X-NONE X-NONE", "ItemID": "173615522182", "EndTime": "2018-11-05T02:00:21.000Z", "StartTime": "2018-10-31T02:00:21.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Kramer-Pacer-Series-Orange-Tiger-Electric-Guitar-w-Seymour-Duncan-Floyd-Rose-/173615522182", "ListingType": "Chinese", "Location": "Pawtucket, Rhode Island", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1736155221828080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTUzOFg5NzU=/z/LY8AAOSwP~lbrVew/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU4Nlg2NzY=/z/oYcAAOSwtAtbrVfF/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTUxMlg5ODQ=/z/mBMAAOSwk3RbrVfY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/GPgAAOSwu~5brVf2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/UMgAAOSwSupbrVUk/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/ZskAAOSwfPlbrVUo/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/O6AAAOSwZl1brVUs/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/FWMAAOSw4WFbrVUw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE4MVgxNDM5/z/HOcAAOSwVBtbrVgJ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Ne8AAOSwe7BbrVU3/$_57.JPG?set_id=8800005007"], "PostalCode": "02861", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "fastcashri", "FeedbackRatingStar": "Yellow", "FeedbackScore": 49, "PositiveFeedbackPercent": 100.0}, "BidCount": 3, "ConvertedCurrentPrice": {"Value": 385.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 385.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "g***4", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1465}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Kramer Pacer Series Orange Tiger Electric Guitar w/ Seymour Duncan & Floyd Rose", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Kramer"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Color", "Value": ["Orange"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}]}, "HitCount": 220, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 390.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "SKU": "150835-1 ZAL SNMLOAY", "NewBestOffer": false}