{"BestOfferEnabled": true, "Description": "NOBODY does a goldtop relic like Dax&Co! If you look at a 50's LP that's been playing smoky bar room gigs for nearly 70 years...chances are THIS is what it looks like. The gold turns dark and brown-ish....there is greening from the bronze powder oxidizing...lacquer checking covers the entire top like fine artwork...and the binding turns almost orange. We started with a genuine USA Gibson Les Paul Traditional 2009 guitar and completely aged it to look like a VERY well played vintage guitar. The first step is to completely disassemble the guitar and age every part by hand. The thick plasticized finish is stripped off down to the bare wood, then re-finished in 100% nitrocellulose lacquer with actual bronze powder just like a vintage gold-top... keeping it thin for superior resonance. After curing, the guitar gets the complete aging treatment. The edges of the fretboard are hand rolled for a super smooth vintage feel. The back of the neck remains (sealed) exposed wood for fast, comfy playing with no \"drag\". (50's profile neck) The bridge is upgraded to an ABR-1, and the guitar is then completely hand wired with low friction CTS 500k pots and Bumble bee tone caps. The pickups are '57 Classic's and sound fantastic! The guitar comes fully set up with Ernie Ball slinky 10's. Any high frets are leveled and the intonation/action is set. If you just can't justify spending over $5k on a Nash or Gibson Custom Shop guitar...maybe this is for you? (Our price is still less than a new Les Paul Traditional) A Hard Shell Gibson case (with some minor cosmetic damage) and Dax&Co. Custom Shop COA are included. CHECK OUR 100% POSITIVE REVIEWS and see what people are saying! Happy Jamming! Want checking lines on the back? No problem! Just specify light or heavy at checkout and we'll add them before shipping...no extra cost! WE WANT YOU TO LOVE your new guitar! If not, send it back within three days in its original packaging for a full refund (minus all shipping costs) Here are some testimonials about guitars we've sold… \"Love it! Custom shop at a working man's price! Thanks!!\" \"After 15 years of collecting aged and relic’d guitars, I’ve a amassed quite the collection; Including many Fender instruments Masterbuilt by John Cruz, Jason Smith and Dale Wilson, Suhr Extreme Antiques and Tom Murphy painted & aged guitars. I can honestly say that upon close inspection, the Heavily Aged Les Paul Gold Top that I purchased from Dax & Co. is on the SAME level as the instruments fabricated by the master builders listed above. Dax has brilliantly painted the guitar top in satin gold along with his signature “checking,” aged EVERY single part of the instrument with unabashed detail, rolled the edges of the fretboard perfectly and masterfully dressed the frets. I honestly could not believe the quality, playability and sound that my new instrument possessed as I played it for the very first time. It felt EXACTLY as if I had ordered a $7K US Gibson Custom Shop instrument! Believe me— I know!! “This guitar is incredible. Haven't put it down for hours and I doubt I'll want to pick up another guitar anytime soon. It's everything it was advertised as and Dax shipped it out immediately. The next time I'm in the market for a guitar I'm definitely going to check Dax's shop first.” “What a fantastic guitar and everything about it is exactly what I had hoped it would be. I can't get over how absolutely effortless it is to play up and down the neck and how beautifully smooth it is. You have created a truly wonderful guitar and everything about the transaction has been a true pleasure.” Thanks so very much.\" \"I am in awe of the craftsmanship on display here in this instrument...it has such character...I fell in love instantly upon placing this beauty into my hands. The tone is out of this world, the neck pocket is precise, resonance throughout the instrument and the noiseless pickup set is spectacular. Dax is a top notch builder and his relic work is just phenomenal. I knew when I first laid eyes on this Tele it had to be mine and it's showing me everyday how true it is! Thank you Dax.\" \"I took a chance on using Dax & Co and I'm so glad I did! Dax took a cheap Squire Strat and turned it into an absolute Gem!! The work he did on it is absolutely amazing, my guitar now looks like a 1956 Stratocaster! The neck and fretboard are silky smooth. Great Job! Looking forward to using your company again!\" \"I own 12 teles including a Nash T52, various Fenders, 2 MJTs, and this guitar went straight to the top of the class. It looks killer and feels like it's actually 60 years old. Packed well, shipped fast.\" Dax&Co. is NOT affiliated with Fender Musical Instrument Corp., Nash, Murphy, Palir, Gibson Brands inc. or any other musical instrument company. The guitar may have a faint smell of paint which is the nature of nitrocellulose lacquer, but will dissipate over time. We recommend storing it out of the case in a spare room for the first week or two.", "ItemID": "273655286344", "EndTime": "2019-01-17T13:32:58.000Z", "StartTime": "2019-01-13T19:44:30.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Dax-Co-Aged-Gibson-Les-Paul-Traditional-Goldtop-HEAVY-Relic-W-Case-and-COA-/273655286344", "ListingType": "FixedPriceItem", "Location": "Columbia, Pennsylvania", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2736552863448080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTEyM1gxNjAw/z/cQUAAOSw5EpcMlhP/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/Njk2WDE2MDA=/z/eHgAAOSwUHBcMlhC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODY2WDE2MDA=/z/8YoAAOSw5wJcMlhB/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/Njg5WDE2MDA=/z/UZgAAOSwk4RcMlhb/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwOVgxNjAw/z/EIAAAOSwmy9cMlhZ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI0OVgxNjAw/z/TKgAAOSwVN1cMlhI/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MTc=/z/V3gAAOSw2fRcMlg-/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5OTY=/z/2UkAAOSwEVlcMlhF/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5NTI=/z/oMsAAOSwoPpcMlhK/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/C3oAAOSw8a9cMlhM/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDg1/z/jwAAAOSwTSlcMlhT/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMTgw/z/CAwAAOSwtvZcMlhW/$_57.JPG?set_id=8800005007"], "PostalCode": "17512", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "thedaxman", "FeedbackRatingStar": "Red", "FeedbackScore": 1004, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 2250.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2250.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***t", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 2678}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Dax&Co. Aged Gibson Les Paul Traditional Goldtop HEAVY Relic W/ Case and COA!", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Body Color", "Value": ["Aged Gold"]}, {"Name": "Model", "Value": ["Les Paul Traditional"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Model Year", "Value": ["2009"]}]}, "HitCount": 210, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "ConditionDescription": "Amazing guitar that will turn heads!", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}