{"BestOfferEnabled": false, "Description": "Up for grabs is a now discontinued Reverend Rick Vito Signature in Lakeshore Gold and a factory BIGBY!! I purchased this BRAND NEW and have barely played this and it has never been out of the house. This is as close to new as you will find, BARELY USED. OVERVIEW Designed in collaboration with Grammy-nominated rock and blues artist Rick Vito. This Art Deco masterpiece is a visual and sonic treat with unique features including: ebony fretboard, stairstep tuner buttons, pickup pan knob, and included two-tone tapered case. But the big news is the Dual-Pro bridge pickup, based on a mid-1960s Supro pickup. Its a hot single-coil with a second blade polepiece in addition to the standard screw polepieces. Imagine P90 meets Tele with humbucker output fat, raw and clear. And it all fits into a standard-size humbucker cover - a first in the industry. Custom Pickups Reverend designs their own proprietary custom pickups, to achieve the best tonal match with our instruments. Reverend pickups are also specifically designed for each position, for balanced volume and tone when switching. Korina Body Korina (aka White Limba) is a medium-lightweight wood, highly prized for consistency and tonal qualities. Often found in boutique and vintage instruments, all Reverends feature Korina bodies. A highly resonant wood, Korina is a key factor to producing our lively, responsive instruments that are rich in harmonics. Bass Contour This passive bass roll-off is great for tightening up the low end, or re-voicing the pickups. It can make a humbucker sound like a single-coil, or give a P-90 that classic twang. Variable pickup voicing at your fingertips! Pin-lock Tuners A thumbwheel under the tuner pushes a steel pin up through the post, locking the string in place for exceptional tuning stability and super-fast string changes. Dual-action Truss Rod Our dual action rod adjusts in both directions, allowing back bow or forward bow. This assures correct adjustment range is possible regardless of string tension, extreme climate conditions, or the effects of long term aging. It's also located at the headstock for easy access. Graphite Nut Reverand uses a graphite impregnated nut on all their instruments. Graphite reduces friction, allowing the strings to easily slide through the nut slots, improving tuning stability. FEATURES BodyBody shape: Single cutawayBody type: Solid bodyBody material: Solid woodTop wood: Not applicableBody wood: KorinaBody finish: Gloss polyesterOrientation: Right handedNeckShape: Oval mediumWood: KorinaJoint: Set-inScale length: 24.75\"Truss rod: Dual-actionFinish: Gloss polyesterFretboardMaterial: EbonyRadius: 12\"Fret size: Medium-jumboNumber of frets: 22Inlays: Pearl blockNut width: 1.69\" (43mm)PickupsConfiguration: HSNeck: CP90Middle: Not applicableBridge: Dual-ProBrand: ReverendActive or passive: PassiveSeries or parallel: ParallelPiezo: Not applicableActive EQ: Not applicableSpecial electronics: Bass contourControlsControl layout: Master volume, tone and blendPickup switch: Not applicableCoil tap or split: Not applicableKill switch: Not applicableHardwareBridge type: Tremolo/VibratoBridge design: Floating vintage tremoloTailpiece: Bigsby B-50Tuning machines: Pin-LockColor: ChromeOtherNumber of strings: 6-stringSpecial features: Versatile electronicsCase: Hardshell case- NOT INCLUDED Accessories: Info not availableCountry of origin: South KoreaFlat rate shipping to lower 48 states only Stand out from the crowd with this great sounding work of art. Order today.", "ItemID": "233020664785", "EndTime": "2018-12-26T00:01:53.000Z", "StartTime": "2018-11-25T23:13:02.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Reverend-Rick-Vito-Signature-Electric-Guitar-Lakeshore-Gold-MINT-/233020664785", "ListingType": "FixedPriceItem", "Location": "Beaverton, Oregon", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/2330206647858080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/ODEwWDEwODA=/z/55UAAOSwbbJb-ys9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODEwWDEwODA=/z/z3EAAOSwrpJb-ysw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ0MFgxMDgw/z/alYAAOSwnWpb-ysz/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ0MFgxMDgw/z/O-cAAOSw7thb-ys1/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODEwWDEwODA=/z/a8YAAOSwDAdb-ys3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODEwWDEwODA=/z/yPYAAOSwgotb-ys6/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODEwWDEwODA=/z/4FkAAOSweWdb-ytA/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODEwWDEwODA=/z/xMUAAOSw44db-ytD/$_57.JPG?set_id=8800005007"], "PostalCode": "97005", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "digitalbusta", "FeedbackRatingStar": "Red", "FeedbackScore": 1026, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 759.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 759.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***r", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 474}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Reverend Rick Vito Signature Electric Guitar Lakeshore Gold  MINT!!", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Reverend"]}]}, "HitCount": 396, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 4, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}