{"BestOfferEnabled": false, "Description": "This is a Greg Bennett-designed Samick JZ-1 model, six-string, full-sized (16 3/4 inches wide) hollow body, electric jazz guitar in excellent condition. I bought it new a year ago this Fall. I have played it as much as I could in the last year but some physical problems have limited my usage and the guitar has never been outside my house. There are some light, normal use marks that are very hard to see without looking closely. The pick-ups and hardware look almost new. It is the nicest sounding hollow body I have had and it is very easy to play. A very beautiful. Before listing I had the guitar professionally set-up. A protective piece of material under the bridge since it was placed there at the factory was removed because the set-up man said it would even further enhance the sound of the guitar. It was essentially a one-year tune-up to dress and check everything, including intonation. I have a hand condition so the guitar has a relatively new set of light D'Addario 9.5 round wound nickle strings on it that were perfect for my light touch. The guitar originally came with, I believe, flat wound 11's but they were replaced before it was shipped to me. It comes with the original padded, molded, four-hasp, hard shell case -- which is in excellent condition but one of the hasps has never worked very well. The case comes with a key. The two wrenches that came with the guitar are in the case. Although it is a molded case there is a good deal of room to put things in the case compartment and around the head of the guitar. The guitar is listed on other specialty sites so the listing may end abruptly if no bids are received before a sale on another site. The JZ-2 I had listed sold last week. I believe this guitar has even a richer tone than the JZ-2. I will miss sit. I am only selling it because I invested a chunk of my savings in a Gibson L-5 and I play it all the time now. I hate to see this nice JZ-1 sit idle! These Samick guitars are made in Korea by a company Gibson hired years ago to make their top-line Epiphone models. Samick guitars have a very good reputation and were listed among the Favorite Jazz Guitars in an on-line survey by one of the top Jazz Guitar sites. The person I sold the JZ-2 to this week personally knew the designer of these guitars, and spoke very highly of them. If you are not familiar with Samick Jazz models I suggest you review some of the Samick videos on You Tube. There are some great-sounding videos of JZ models. In fact, those videos convinced me to buy a JZ model guitar. It is easy to see why so many players believe these guitars provide the most value for the money of any jazz guitars on the market. I actually spent most of my life savings on an expensive guitar this month and that is the only reason I am selling these very nice Samicks. The pick-ups have plenty of punch and the neck pick-up has the traditionally mellow jazz tone. The guitar has the standard 3-way selector switch and two tone and volume controls. This is a big jazz guitar. But I will carefully pack it. The strings will be loosened a bit too. I do not charge anything for handling, packaging, or taking the guitar on the 30 mile trip to the shipper -- if UPS or FedEx shipping is selected. It is only a ten mile trip to the Post Office, I live in a rural area. But the indicated shipping charges are entirely from E-Bay. I have provided shipping options so the buyer can decide how quickly the item will arrive. I will ship as soon as possible (same day if possible) but in no case longer than one business day after payment clearance. I can NOT make direct international sales because E-Bay will not ship wooden musical products overseas due to the fact many countries now do not allow them in. So anyone who buys this guitar will need a shipping address in the USA. And any further shipments of the guitar will be fully at the Buyer's risk.", "ItemID": "223237226646", "EndTime": "2018-11-25T21:10:59.000Z", "StartTime": "2018-11-18T21:10:59.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Samick-Greg-Bennett-JZ-1-Full-Sized-Hollow-Body-6-St-Electric-Guitar-RH-OHSC-/223237226646", "ListingType": "Chinese", "Location": "Traphill, North Carolina", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2232372266468080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/OTY5WDc2OA==/z/RzQAAOSwMHtbitNs/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTQ5WDEwMjQ=/z/rjsAAOSwsj5bitN5/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTIxWDEwMjQ=/z/v9AAAOSwJWxbitOI/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MjIzWDEwMjQ=/z/BZsAAOSwV01bitOW/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzE1WDEwMjQ=/z/bCkAAOSw8W1bitOl/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzY4WDg1OA==/z/9B4AAOSwq4dbitOx/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjgzWDEwMjQ=/z/IeQAAOSwS9BbitPC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTU5WDc2OA==/z/SMwAAOSwMHtbitPR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAyNFg3NjQ=/z/ncYAAOSwjkxbitPl/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAyNFgzNDE=/z/wZUAAOSwJWxbitP7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjgzWDEwMjQ=/z/oY0AAOSwsNBbitQI/$_57.JPG?set_id=8800005007"], "PostalCode": "28685", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "wscott336", "FeedbackRatingStar": "Red", "FeedbackScore": 1012, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 389.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 389.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "4***o", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 2}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Samick Greg Bennett JZ-1 Full Sized Hollow Body 6-St Electric Guitar, RH, OHSC", "ItemSpecifics": {"NameValueList": [{"Name": "Size", "Value": ["Full Size"]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["JZ-1"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Product Line", "Value": ["Samick"]}, {"Name": "Brand", "Value": ["Samick"]}, {"Name": "Body Type", "Value": ["Hollow Body"]}]}, "HitCount": 102, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 394.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "This guitar is in excellent condition.  The original plush molded case is also in excellent condition.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}