{"BestOfferEnabled": false, "Description": "All photos are of the actual item for sale. Great Condition This guitar has a lot of scratches on its boy and pick-guard from moderate play wear. Tested to factory spec. Please see the photos above; they are of the actual item for sale. B.C Rich Masterpiece Mockingbird Solidbody Electric Guitar - Dragon Blood The B.C. Rich Mockingbird with Double Locking Tremolo Electric Guitar features classic B.C. Rich style without sacrificing anything at an affordable price. A beautiful quilt maple top, excellent fretwork, mother of pearl diamond inlays, die cast machine heads, double locking tremolo, and proprietary electronics are but a few hallmarks of this affordably priced Double-Locking tremolo model. Dual high-output humbuckers and a simplified control layout with single volume, tone, and pickup selector give your plenty of power and versatile tone. Tech Specs Body Body shape: Double cutaway Body type: Solid body Body material: Solid wood Top wood: Not applicable Body wood: Basswood Body finish: Gloss Orientation: Right handed Neck Neck shape: Mk3 Neck wood: Maple Joint: Bolt-on Scale length: 25.5 in. Truss rod: Dual-action Neck finish: Satin Fretboard Material: Rosewood Radius: 13.75 in. Fret size: Medium Number of frets: 24 Inlays: Diamond Nut width: 1.656 in. (42 mm) Pickups Configuration: HH Neck: High-output humbucker Middle: Not applicable Bridge: High-output humbucker Brand: B.C. Rich Active or passive pickups: Passive Series or parallel: Series Piezo: No Active EQ: No Special electronics: None Control layout: Master volume, tone Pickup switch: 3-way Coil tap or split: No Kill switch: No Bridge type: Tremolo/Vibrato Bridge design: Double-locking tremolo Tailpiece: Not applicable Tuning machines: Die-cast Color: Black INCLUDED Guitar Only Check out my other auction listings! and be sure to add me to your favorites list. CONTACT INFORMATION You can e-mail us with any questions you may have about an item. We are very easy to reach, and we are glad to help. Just click \"Ask a question\" in the questions and answers area below. Please note that we are not in the office after 5:00PM EST on weekdays, or all day Saturdays and Sundays. Questions asked over the weekend will be answered on the following business day. SHIPPING INFORMATION Items are shipped within one business day of payment. To avoid a lost or stolen item, your package may ship \"Signature Required.\" If you have special shipping instructions or would like your item shipped UPS instead of USPS or FedEx, please contact us before you make a purchase. We collect local sales tax here in Indiana. This applies to Indiana residents who we ship to, as well as non-Indiana residents who drive here for local pickups. We also collect sales tax in other states around the country. Please check eBay's tax information on the \"Shipping and payments\" tab above to see if we are collecting tax in your area. PLEASE NOTE Shipping quotes are estimates only. We use eBay’s shipping calculator, which provides estimated shipping charges on listings where “Free Shipping” is not offered. Ebay's FedEx calculator on the item page quotes eBay's discounted FedEx shipping rates, which we honor. At checkout, however, buyers in certain areas will see the calculator attempt to charge the full retail price. FedEx's full retail price is the price you pay if you were to walk into a FedEx retail location. The difference between eBay's discounted rate and this retail price can be as much as 40%. If you estimate shipping with a zip code that is different from the zip code registered to your User ID, eBay’s shipping calculator will make the adjustment at checkout. Additionally, FedEx charges a surcharge for delivery in certain rural areas of the country that does not, for some reason, show up in eBay’s estimate calculator; but it does at checkout (we wish we could control this, but we can’t — we have contacted eBay many times about this issue). FedEx does this based on the +4 extension of your primary 5-digit zip code. For example, eBay’s shipping calculator may quote you one price based on your primary 5-digit zip, and then figure out that your requested street address at checkout places you within the rural surcharge area, changing the shipping price to an alternate amount that was originally quoted. If there is a discrepancy in your shipping cost, please send us a screen shot of the quoted price to you on our item page and we can override the eBay checkout calculation to get you the cheapest rate. RETURN INFORMATION We want you to be completely happy with your purchase. If the item you receive is not as described or has been damaged in shipping, please contact us immediately. We will make every effort to promptly resolve any problem. Your satisfaction is our top priority. We are happy to offer free shipping on some of the items we offer. Please note that if you decide to return something where free shipping was offered, our shipping costs are non-refundable.", "ItemID": "132855623630", "EndTime": "2018-11-23T03:01:45.000Z", "StartTime": "2018-11-16T03:01:45.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/B-C-Rich-Masterpiece-Mockingbird-Solidbody-Electric-Guitar-Dragon-Blood-/132855623630", "ListingType": "Chinese", "Location": "Fort Wayne, Indiana", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1328556236308080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg2NTY=/z/El4AAOSw84Zb7DcK/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMTc0/z/5pkAAOSwBMpb7DcM/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg2NTg=/z/suQAAOSwylBb7DcN/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMTAy/z/bsIAAOSwT2Bb7DcP/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg3NTc=/z/V8AAAOSwoVZb7DcR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg3ODg=/z/2F8AAOSwxPNb7DcT/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjkzWDE2MDA=/z/WgwAAOSwmT1b7DcV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/wgsAAOSwVYhb7DcY/$_57.JPG?set_id=8800005007"], "PostalCode": "46818", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jeffsmusicgear", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 14344, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 199.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 199.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "o***m", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 136}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "B.C Rich Masterpiece Mockingbird Solidbody Electric Guitar - Dragon Blood", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["B.C. Rich"]}, {"Name": "MPN", "Value": ["Masterpiece"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}]}, "HitCount": 232, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=36123540", "StoreName": "jeffsmusicgear"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 202.49, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "TopRatedListing": true, "GlobalShipping": false, "ConditionDescription": "Great Condition. This guitar has a lot of scratches on its boy and pick-guard from moderate play wear. Tested to factory spec. Please see the photos above; they are of the actual item for sale.", "QuantitySoldByPickupInStore": 0, "SKU": "MasterpieceU", "NewBestOffer": false}