{"BestOfferEnabled": false, "Description": "Up for sale, a 1974 Fender Musicmaster II, well maintained and featuring a professional refret, brass saddles, and a hand-carved bone nut. A simple and elegant Fender model, this Musicmaster has a clear, chiming tone. Weighing just 6lbs 12oz, this guitar is the perfect couch strummer or studio secret weapon, with a bold and cutting sound with surprising fullness. Essentially a Strat pickup of the era with flat pole pieces hidden beneath the cover, the sweet, singing tone of this guitar has heaps of warmth and complexity. Professionally setup and strung with 11-50 strings, this Musicmaster II boasts low, slinky action and accurate intonation.The maple neck has a medium C shaped profile bordering on the chunky side of things with generous shoulder and notable heft. The rosewood fretboard has pearl dot inlay and has been professionally refretted with wire that has more meat and height than the original frets. The new frets are incredibly clean, with only a touch of wear on the fret crowns beneath the plain strings on frets 1-2. The guitar plays cleanly in all registers with no buzzing or dead spots, and the scale length measures 24\". The new hand-carved bone nut ensures optimal sustain and note clarity and measures 1 5/8\" in width. On the headstock, the original Fender \"F\" tuners are intact.The simple electronics work as they should, with the single gray bobbin pickup wired to Master Volume and Tone knobs. All solder joints are untouched, and the CTS pots date to the 10th week of '73. The pickup bobbin is also stamped with a 1973 date code, and the neck heel stamp is from early '74. The original brass shielding plates are present in the unmodified body routes, and curiously enough, all Musicmasters were routed for a bridge pickup, even though this feature was something only seen on the Duo Sonic, which shared the same body. The original parchment pickguard is intact, along with the original chrome control plate and bridge base, while the brass saddles are modern. A welcome addition, the new saddles offer a distinct top end articulation and zing typically reserved for a Telecaster, and these saddles really help the neck position pickup cut and sing. The witch hat knobs are genuine vintage Fender knobs, but not original to the guitar. The original Dakota Red finish on the body exhibits scuffs and finish chips around the edges of the slab body, with wear through the Dakota Red on the outside edge of the treble side body horn in particular. The neck retains its original smooth gloss as well. A Fender-branded gigbag is included. Check out our shop \"Mike & Mike's Guitar Bar,\" and please let us know if we can answer any questions! Shipping in the continental USA will be $60, fully insured and shipped via FedEx Ground. Expedited shipping available for an additional fee at buyer's request. We will happily ship WORLDWIDE, but please contact us for an accurate international shipping quote before bidding or buying, as cost varies by buyer location. International orders will be declared as “merchandise,” and the value of merchandise will be declared as the amount paid. We cannot declare anything as a gift or for a lesser value. No exceptions! The customer is responsible for all taxes and duty, which may be collected upon delivery, as well as any additional charges involved with import. We have all necessary CITES paperwork in-hand to ship rosewood worldwide.We do our best to describe all items with honesty and accuracy, but to be sure, please contact us with any questions or concerns prior to bidding or buying. We require payment within 48 hours of auction end. In the unlikely event of a return, buyer pays all shipping costs. Your positive feedback and five star ratings are very important to us, and we appreciate your communication in resolving any issues!", "ItemID": "173679680485", "EndTime": "2018-12-17T21:09:36.000Z", "StartTime": "2018-12-07T09:02:51.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1974-Fender-Musicmaster-II-Vintage-Offset-Electric-Guitar-Dakota-Red-/173679680485", "ListingType": "FixedPriceItem", "Location": "Seattle, Washington", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1736796804858080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/G48AAOSwHAxcCjDp/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/HZMAAOSwXF5cCjDu/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/WLYAAOSwlelcCjD~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/G28AAOSwlAFcCjEC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/lLAAAOSwvENcCjEE/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Cd4AAOSwXTVcCjDz/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/QRIAAOSwCNlcCjD2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/5gQAAOSwzgtcCjDr/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/uWkAAOSwSONcCjDx/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/cFoAAOSwN3NcCjD9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/K2kAAOSwTSlcCjD4/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwNVgxNjAw/z/8IAAAOSwQqZcCjD7/$_57.JPG?set_id=8800005007"], "PostalCode": "98117", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mmguitarbar", "FeedbackRatingStar": "Red", "FeedbackScore": 2591, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 899.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 899.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "c***r", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 0}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "1974 Fender Musicmaster II Vintage Offset Electric Guitar Dakota Red", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "Model", "Value": ["Musicmaster II"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Dakota Red"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Model Year", "Value": ["1974"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}]}, "HitCount": 189, "PrimaryCategoryIDPath": "619:3858:33034", "SecondaryCategoryID": "118985", "SecondaryCategoryName": "Musical Instruments & Gear:Vintage Musical Instruments:Vintage Guitars & Basses:Electric Guitars", "SecondaryCategoryIDPath": "619:181162:181163:118985", "Storefront": {"StoreURL": "https://stores.ebay.com/id=269063702", "StoreName": "Mike and Mikes Guitar Bar"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}