{"BestOfferEnabled": true, "Description": "Please note that I am a long-time guitar seller on eBay with over $171,000 in sales. SALE......... This Week (buy before price goes up!) And just some advice, buy your guitars from the U.S......... not Japan (way too many hassles). OK........ what makes this particular Les Paul so different from the many others selling on eBay. This beautiful guitar has been customized with Bare Knuckle \"Stormy Monday\" humbuckers matched with Bare Knuckle capacitors. These pups creat the best tone you can get on a Les Paul...... read about them! This is an exceptional 2011 GIBSON both in tonal quality, appearance and playability. It is an absolutely beautiful example of a classic GIBSON Les Paul at its very best. It boasts a solid mahogany body (and neck) with an AAA figured maple cap. Condition??? on a scale of 1 (worst) to 100 (best), this beautiful Les Paul is easily a 95. I inspected it closely only to find a small ding on the upper back of the neck and slight pick scratches on the lower right side of the body. These are so small, they can only be seen under bright lighting. And these Bare Knuckles are especially attractive with matching cream color on the pickups, mounting rings, and toggle switch. This guitar not only sounds great.......it looks great! Check out the spectacular figuring covering the entire body into the black edges. I've only played it one time on stage and I received multiple compliments about its beauty. Now for the \"coup de gras\". If you know anything about guitar pickups, you have heard about the exceptional pups made by the Bare Knuckle company in England. The Les Paul has the \"best of the best\"......... STORMY MONDAY HUMBUCKERS! Please take a minute to research Bare Knuckle pickups. Read about these special Stormy Monday humbuckers. For example, go to \"The Gear Page\" and you will read the extensive praise for these pups. ......... (quote) \"I just installed a calibrated set of Bare Knuckle Stormy Mondays into my guitar and I am simply floored by how good they sound and feel. They replaced a Seymour Duncan 59 (neck) and Jb (bridge). These Stormy Mondays made the SD's sound like toys.\" ......... (quote) \"very defined, big dynamically.The crunch or distortion is clear and powerful, without being greasy or slimy. In clear sounds, they easily do jazz, funk to rockabilly. In short, if your guitar is worth ind you want a boost to you sound, these Stormy Mondays are for you.\" ......... \"You won't even believe how much better they are. Honestly, if you are thinking about it - order a set - the difference is astonishing. It's not even subtle. Best tone upgrade I've ever done.\" And as an additional upgrade, this guitar has matching Bare Knuckle capacitors. These create a much fuller range of tonality with both the neck and bridge buckers. The wonderful Les Paul is now 7-years old and hardly shows any sign of wear. In fact, at this age, it will be moving into its best tonal capacities. Comes with a matching, original guitar case (see pic). Look....... this is a spectacular Les Paul. The only reason I am selling it now is that I am growing older and do not need so many guitars around the house. If you have any questions about it at all, please email. If you prefer, you can also call me at 772-492-3699. Great Deal on an exceptional Gibson Les Paul!", "ItemID": "283152737149", "EndTime": "2019-01-05T21:58:30.000Z", "StartTime": "2018-09-10T16:40:11.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/GIBSON-Les-Paul-Classic-AAA-figured-cream-Bare-Knuckle-Stormy-Mondays-/283152737149", "ListingType": "FixedPriceItem", "Location": "Vero Beach, Florida", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/2831527371498080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/BHEAAOSwBFpbkFH2/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1N1gxNjAw/z/C3UAAOSwk6dbkFIb/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/l-4AAOSwRtNbkFIu/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/tNwAAOSwwJ5bkFI1/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/fRYAAOSwlgFbkFJR/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/-2gAAOSwIFRbkFJk/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/CfwAAOSw-ctbkFJ1/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/U90AAOSwvuhbkFKH/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/A~wAAOSw3JRbkFKV/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/AwEAAOSwGXlbkFK0/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/scoAAOSwyH5bkFLd/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/080AAOSwhE9bkFh2/$_32.JPG?set_id=880000500F"], "PostalCode": "32968", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "ramdoc333bc", "FeedbackRatingStar": "Red", "FeedbackScore": 1547, "PositiveFeedbackPercent": 98.6}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1750.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1750.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "h***l", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 703}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "GIBSON Les Paul Classic (AAA figured with cream Bare Knuckle Stormy Mondays)", "ItemSpecifics": {"NameValueList": [{"Name": "Product Line", "Value": ["Gibson Les Paul"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model", "Value": ["Custom"]}, {"Name": "Body Type", "Value": ["Classical"]}]}, "HitCount": 1734, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "14 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}