{"BestOfferEnabled": false, "Description": "--> Schecter Kenny Hickey Signature C-1 EX Electric Guitar Used This item is slightly used and has been thoroughly checked out by our experts to make sure it is in perfect working condition. We then re-sealed it in its original packaging with all factory included accessories. This item is guaranteed to be in \"as new\" condition and has virtually no cosmetic imperfections. This item is covered with a one year warranty from Sam Ash. Schecters Kenny Hickey Signature C-1 EX guitar boasts a Mahogany body, mahogany set-neck with Ultra Access, a 26.5\" baritone scale with factory B tuning, Seymour Duncan JB bridge pickup, Sustainiac system in the neck (harmonic mode, mix mode, and regular) for infinite controllable sustain, a Kill-Switch, \"Steele Green\" finish with black binding, green inlays, and more. This guitar sounds incredible. It has a very punchy aggressive tone with a tight bottom end. The neck is thin and comfortable, and the Sustainer system is fun and responsive. 3-pc Mahogany NeckMade with 3 pieces of mahogany for extra stability. 3 piece necks can withstand the test of time. Where standard necks may show aging defects from temperature and moisture changes throughout the years, the 3 piece neck will stay nice and straight for a lifetime of playability.Seymour Duncan JB (SH-4)/Sustainiac® PickupsBridge: The worlds most popular humbucker. Provides slammin output while retaining singing highs, aggressive harmonics, and just the right blend of sustain and distortion. Goes from sweet warm tones to raw rock n roll. Sustainiac®: This Driver/Pickup produces beautiful Humbucker tones when Sustain switch is off, and works as the Sustainiac Driver when switched On. The Sustainiac Driver creates an infinite feedback sustain of string vibrations by electromagnetic feedback. Rosewood Fingerboard The most common fretboard, Rosewood is naturally oily, and works well for any surface that sees frequent human contact. The sound is richer in fundamental than Maple because the stray overtones are absorbed into the oily pores.Schecter Locking TunersSchecter Locking Tuners feature a locking screw pin to lock the string into place for greater tuning stability. Details include a 19:1 gear ratio allowing for precise fine tuning adjustments, removable knobs, threaded peghead bushing, and a 10mm diameter peg hole.Set Neck w/Ultra Access ConstructionMahogany Body3-pc Mahogany NeckRosewood Finger Board24X Jumbo FretsGreen Block InlaysBlack Multi-ply BindingSchecter Locking TunersSeymour Duncan JB (SH-4)/Sustainiac® PickupsVolume/Tone/3-Way Toggle (pickups)/ On-Off Mini Toggle/ 3-Way Normal-Mix-Harmonic Mode Mini Toggle TonePros Tune-O-Matic Bridge w/String-Thru-Body 26.5\" ScaleBlack Chrome HardwareB/E/A/D/F#/B TuningCase Not IncludedOrder your Schecter Kenny Hickey Signature C-1 EX Electric Guitar from Sam Ash Direct today with the security of our 45/60 day return/price protection policy. Shipping Information Your gear will ship out within 2 days of order confirmation. At this time we can not ship PO Boxes, APO and FPO locations. Industry Leading 45-Day Return Policy We stand by the products we sell, and we'll certainly stand by you as well! We truly appreciate your business, and we want you to be 100% happy with your purchase. However, we know that one of the drawbacks of internet shopping is that you can't try something before you buy it. That's where our money-back guarantee comes in. If you are not completely satisfied with an item, for any reason, you can return it within 45 days of the shipping date for a complete refund of the merchandise price.* Have a question about your order? A Sam Ash Customer Service specialist is available to help! Call 800-472-6274, Monday - Saturday, from 10:00AM - 6:00PM EST. Due to the complexity of international shipping, we are unable to accept any returns on international orders. Before making a purchase outside of the United States, please know that products sold by Sam Ash use the standard 120V/60Hz voltage standard. Sam Ash is not responsible for any damage caused by not adhering to the voltage requirements. *All returns must be within 45 days of the date the item was shipped. Please do not accept any shipment if the packaging appears damaged in any way. We strongly suggest that you check your order after receiving it to be sure that it is in proper working order. Returned items must be in resalable condition. Resalable Condition means that the product(s) is exactly in the same condition as you received it. All exchanges must be pre-paid, returned in original packing, complete with blank warranty cards, owner's manual and show no sign of wear or abuse. In the event that the product is not in the same condition as you received it you may be subject to a minimum 15% restocking fee, repair charge or disqualification. Shipping and handling charges are non-refundable. Please call our Customer Service department if you have any questions about returning an item. CDs, DVDs, video tapes, sheet music, books, strings, computer hardware/software, drum heads, harmonicas, mouthpieces, sound cards, microphones, raw speakers, studio furniture, blank CDs/Tapes or Special Orders are not covered by this return policy.", "ItemID": "192813687948", "EndTime": "2019-02-03T19:16:32.000Z", "StartTime": "2019-02-03T16:10:03.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Schecter-Kenny-Hickey-Signature-C-1-EX-Electric-Guitar-Used-/192813687948", "ListingType": "FixedPriceItem", "Location": "Tampa, FL", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1928136879488080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwWDUwMA==/z/GNIAAOSwH61cVxJd/$_1.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "samashdirect", "FeedbackRatingStar": "PurpleShooting", "FeedbackScore": 58828, "PositiveFeedbackPercent": 99.2, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 799.88, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 799.88, "CurrencyID": "USD"}, "HighBidder": {"UserID": "e***u", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 519}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "CA", "GB", "SK", "AU", "KR", "ID", "TH", "IL", "MX", "NZ"], "Site": "US", "TimeLeft": "PT0S", "Title": "Schecter Kenny Hickey Signature C-1 EX Electric Guitar Used", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Schecter"]}, {"Name": "MPN", "Value": ["0221"]}]}, "HitCount": 4, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1111655870", "StoreName": "Sam_Ash_Music_Direct"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalRefund": "MoneyBack", "InternationalReturnsWithin": "30 Days", "InternationalReturnsAccepted": "ReturnsAccepted", "InternationalShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "DiscountPriceInfo": {"OriginalRetailPrice": {"Value": 1399.0, "CurrencyID": "USD"}, "PricingTreatment": "STP", "SoldOneBay": false, "SoldOffeBay": false}, "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Central America and Caribbean", "South America", "AS", "CK", "FJ", "PF", "GU", "KI", "MH", "FM", "NR", "NC", "NU", "PW", "PG", "SB", "TO", "TV", "VU", "WF", "WS", "AL", "AD", "AT", "BY", "BE", "BA", "BG", "HR", "CY", "CZ", "DK", "EE", "FI", "FR", "DE", "GI", "GR", "GG", "HU", "IS", "IE", "IT", "JE", "LV", "LI", "LT", "LU", "MK", "MT", "MD", "MC", "ME", "NL", "NO", "PL", "PT", "RO", "SM", "RS", "SI", "ES", "SJ", "SE", "CH", "UA", "VA", "BN", "KH", "HK", "LA", "MO", "MY", "PH", "SG", "TW", "VN", "BM", "GL", "PM", "DZ", "AO", "BJ", "BW", "BF", "BI", "CM", "CV", "CF", "TD", "KM", "CD", "CG", "CI", "DJ", "EG", "GQ", "ER", "ET", "GA", "GM", "GH", "GN", "GW", "KE", "LS", "LR", "LY", "MG", "MW", "ML", "MR", "MU", "YT", "MA", "MZ", "NA", "NE", "NG", "RE", "RW", "SH", "SN", "SC", "SL", "SO", "SZ", "TZ", "TG", "TN", "UG", "EH", "ZM", "ZW", "BH", "IQ", "JO", "KW", "LB", "OM", "QA", "SA", "TR", "AE", "YE", "AF", "AM", "AZ", "BD", "BT", "CN", "GE", "IN", "JP", "KZ", "KG", "MV", "MN", "NP", "PK", "LK", "TJ", "TM", "UZ", "PO Box"], "GlobalShipping": true, "ConditionDescription": "Like New", "QuantitySoldByPickupInStore": 0, "SKU": "S0221XXXX", "NewBestOffer": false}