{"BestOfferEnabled": true, "Description": "Olympic White Squier Classic Vibe 50's Stratocaster Modified With The Deaf Eddie Fat-O-Caster Switch Gig Bag Included Stand Not Included What it is: Fat-O-Caster ! The FAT-O-Caster (c) is a three position ROTARY switch that expands the potential pickup combinations available in your Stratocaster or other \"S-type\" guitar. It installs where one of your old tone controls was. The FAT-O-Caster (c) does NOT replace your 5-way pickup selector switch - your 5-way still works just like it always did. The FAT-O-Caster (c) works in conjunction WITH the 5-way to give you new combinations. You lose a tone control, but gain a lot of tones! The traditional Strat 5-way selector gives you only 5 of the seven parallel combinations possible, and no series connections. With the FAT-O-Caster (c), you can get all seven parallel combinations, PLUS two series settings, and a series/parallel setting, for a total of TEN different pickup combinations. That's a lot of tones! BEST OF ALL, NO NEW HOLES, Guitar Still Looks Stock! Just put your old tone knob back on the FAT-O-Caster (c) switch, and your Strat looks completely stock! How it works: To reference the rest of these instructions, we'll say that the pickup selections on the 5-way are numbered like this: (1) = neck; (2) = neck and middle; (3) = middle; (4) = middle and bridge; (5) = bridge. Basically, it re-routes the hot and ground leads of the pickups to different places in the guitar's circuitry. Each of the three \"clicks\" connects the pickups' leads to a specific point in the guitar's wiring to get the desired combination of pickups and series/parallel wiring. These \"clicks\" - I call them \"NOTCHES\" - are named for how they route the pickups into the circuit. The NOTCHES: NOTCH ONE (tone control on \"10\") is \"NORMAL\" It is selected when you have the knob turned completely CLOCKWISE. The FAT-O-Caster (c) routes the Bridge pup's hot to the 5-way switch (where it would be, stock), and its ground to the guitar's ground, along with the Middle pup's ground.. Plain ol' Strat tones. NOTCH TWO (tone control at \"9\") is \"BRIDGE with NECK\" It is the first \"click\" as you turn the knob COUNTER-CLOCKWISE . This jumpers the NECK pup's output so that when you select the bridge pup, you get the neck pup as well. As you work the your Strat's 5-way pup selector switch, from neck to bridge, you will hear: (1) Neck alone; (2) Neck and Middle pups; (3) Middle; (4) Neck, Middle and Bridge; (5) Neck and Bridge. Those LAST two tones are the tones EVERY Strat player sez they wish they had! NOTCH THREE ( tone control at about \"8\") is \"SERIES with NECK PICKUP\" When you select (5) on the 5-way, instead of just the Bridge pup you will get the Bridge and Neck pup in SERIES. In (3), you have the Middle and Neck pup in SERIES. In (4), you have both of those tones, parallel. In (2) and ( 1), you hear the Neck alone. Pickups wired in series make the current flow through first one coil and then the other, effectively doubling the resistance/impedance of the circuit. In a very real way, the Neck and Bridge (or Neck and Middle) coils become rather like a single big humbucker! This is usually characterized as a \"fatter\" sound than that produced by a single-coil pickup - though on your Strat, still plenty bright. It's a good way to add some \"ooomph\" that Bridge pickup's \"lead\" tone, and some \"sass\" to the middle pup.. The Guitar was made in 2009, it has been moderately played in my smoke free home for the past 7 years as I bought it used. It is the 1950's Classic Vibe by Squier and of course backed by Fender. The protective plastic cover has just begun to peel away from The tremolo block cover on the back. The body is alder. The frets are medium jumbo with a modern C shape maple neck and finger board, the fret edges are dressed perfectly, action is low, neck straight no issues. There is some beginnings of fret wear on the first 4 frets but nothing to be alarmed about, plenty of life left in the frets. The anodized aluminum pickguard is showing some color change where the picks come in contact with it. I found one little tiny speck of a nick on the bottom edge near the jack feed (really small). There is a slight hairline in the finish near the top neck pocket edge (typical of strats) I highlighted it in the photos. The controls and truss rod work 100%. The tuners are the early split post style and really stay tuned well. The tremolo rod is included and it is the vintage tremolo system. The control knobs, pickup covers and tremolo rod tip are the aged white color. The pickups are the Custom Vintage Style single coil type. What's really cool about this guitar is the Fat-O-Caster system that give double the traditional pickup combinations total of 10 combinations ! Also the looks of the guitar are not changed, you just sacrifice one tone pot for the 3 way rotor selector switch and the remaining tone knob controls all the pickups.I will include some manual pages I printed off line, its available, for free just google it. Anyway Thanks for stopping in. Before You Bid, Please View All 12 Pictures and Read Description ! Buyer Pays All Shipping and Handling Shipping & Handling : Buyer pays all shipping and Handling, There are 2 different shipping services offered at check out on this item, whichever the buyers chooses will determine how fast the item will arrive. Payment : We only accept payment Through PayPal. If you don't have a pay pal account, click on the link to sign up for PayPal; the fast, easy, and secure way to pay online. Be sure to add me to your favorites list! Check out my other items!", "ItemID": "123621446688", "EndTime": "2019-02-02T04:15:23.000Z", "StartTime": "2019-01-31T01:05:02.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Modified-Classic-Vibe-50s-Olympic-White-Squier-Stratocaster-Anodized-Pickguard-/123621446688", "ListingType": "FixedPriceItem", "Location": "Wilmington, North Carolina", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1236214466888080_3.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/dw4AAOSwlt9cU4zT/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/gesAAOSwoFNcU4zh/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/QRYAAOSwjfBcUkmm/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/DIAAAOSwvpVcUkmp/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/IFkAAOSwFGNcUkms/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/JU8AAOSwpRxcU41P/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/QhcAAOSw~M5cUkmw/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/yBUAAOSwQZdcU4yV/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/9AMAAOSwwPRcU4yl/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/EtoAAOSwiSVcU4y~/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/sy8AAOSwMYtcU40H/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/KDEAAOSwgfRcU40p/$_1.JPG?set_id=8800005007"], "PostalCode": "28405", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "oldasmoney", "FeedbackRatingStar": "Purple", "FeedbackScore": 909, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 269.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 269.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "6***l", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 459}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Modified Classic Vibe 50's Olympic White Squier Stratocaster Anodized Pickguard", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Squier"]}, {"Name": "Model", "Value": ["Stratocaster Classic Vibe"]}, {"Name": "Series", "Value": ["Classic Vibe 50's"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Material", "Value": ["Alder"]}, {"Name": "Body Color", "Value": ["Olympic White"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Features", "Value": ["Deaf Eddie Fat-O-Caster"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Soundboard Style", "Value": ["Flat Top"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}, {"Name": "Modified Item", "Value": ["Yes"]}, {"Name": "Modification Description", "Value": ["Deaf Eddie Fat-O-Caster 3 way Rotor Switch 10 Different Pickup Combinations"]}, {"Name": "Size", "Value": ["Full Size"]}, {"Name": "Product Line", "Value": ["Fender Squier"]}, {"Name": "Country/Region of Manufacture", "Value": ["China"]}]}, "HitCount": 170, "Subtitle": "Fat-O-Caster Switch Ten Differant Pickup Combinations !", "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "ConditionDescription": "The Pickguard shows color fade where picks hit it. I found one small nick on edge and barely noticable finish hairline on one side of neck pocket.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}