{"BestOfferEnabled": true, "Description": "HohnerRockwoodLP-CopyGloss Ebony FinishElectric GuitarUsed - Very Good Condition Sporting a slightly thinner body than a standard LP, this Hohner Rockwood still has the charm and tone that will convince you that it's the real deal. This Rockwood LP-copy is decked out in a classic ebony finish, cream binding around top and fretboard, and chrome hardware, too. The extremely high price associated with the real deal LP is the one thing you'll definitely notice missing from this sweet sounding Hohner! Cosmetic and Functionality DescriptionBody: the top, back, and sides show some obvious surface scratches and scuff marks as well as some small to medium-sized dings and indentations--moderate amount of buckle rash; a few small chips in the finish, not the wood or binding, can be found around the edges of the body; the pickguard and the electronics cover have some small scuff marks and scratches from typical use Neck, Fretboard, and Headstock: the fretboard looks almost flawless except for a couple of extremely super small dings that can only really be seen upon very close inspection; the back of the neck has a few very light surface scratches on the lacquer that are really only noticeable upon close inspection, plus there are a few small dings, one at the 1st fret position and two at the 5th fret position, that are noticeable to the touch but should not affect comfort or playability; the headstock has some very light surface scratches and tiny nicks that can be found on the front and back, plus the very end edge has some scuff marks and tiny nicks in the finish--light scratches can be seen on the truss rod cover Action and Playability: the action is about medium, plus the neck is straight and the truss rod functions flawlessly Frets: light wear Hardware: all looks great except the pickup covers have some light scratches on them and the bridge pickup cover has a small dent under the high E-string Electronics: all functions flawlessly Includes: electric guitar (pickguard, case, and gig bag are not included) Features 3-piece bound top5-piece body Gloss ebony finish Bolt-on neck Slim neck profile Rosewood fretboard 22 frets Pearl trapezoid inlays Chrome tuners and hardware Tune-O-Matic bridge and stopbar 2 x humbuckers 2 x volume knobs and 2 x tone knobs 3-way selector switchBody thickness: 1-3/4\" Scale: 25\" Nut Width: 1-11/16\" Weight: 8 lbs. 2 oz. Buy used and save big! We've been selling used guitars and amplifiers for over 27 years in the same location! Metro Sound & Music Company Richmond, VirginiaUSA(804) 643-7125 Open Tuesday - Saturday 11 am to 6 pm Est. 1991 BUY SELL TRADE We reserve the right to end this auction early. This guitar is also for sale in our showroom. SHIPPING All items sold by Metro Sound & Music (metrosound117) are shipped with full insurance coverage included in the indicated shipping price shown in the listing above. For inquires concerning coverage, expedited shipping and international parcels please feel free to message us. We are always happy to provide a quote for shipping and insurance for our customers outside of the United States and those requiring special services. All domestic orders (Continental United States, Alaska and Hawaii) will be shipped using FedEx Home or Ground delivery, where applicable. International orders will be shipped by United States Postal Service Priority International. Both FedEx and USPS offer expedited shipping services and we are always happy to utilize any of these at our customer’s request. Please inquire for additional information concerning these options or any specific shipping questions you might have, we are always happy to find the right solution. 117 West Broad Street Richmond, Virginia 23220 804.643.7125 Since 1991, Metro Sound, Music and Recording Studios has been selling and servicing vintage, new and used musical gear worldwide. We take great pride in our eBay listings and assure each buyer that we will do our best take make sure each item is accurately described, packaged safely and shipped from our showroom to your destination as quickly as possible. We appreciate you taking the time to look at this auction and invite any comments or questions in reference to it. For those driving through Richmond, Virginia via I-95, we are located just 5 minutes from the interstate. Our 40,000 square foot facility houses a recording studio, lesson rooms, band rehearsal spaces, and Factory Authorized Warranty Repair Center. There is no other music store like Metro Sound! Buy with confidence knowing that we will make sure every guitar or amplifier sold in our store will be sounding its best when it leaves. \"More than a music store\" for over 27 years! Offering the finest new, used and vintage gear Furnished Rehearsal Spaces Friendly and Knowledgeable Customer Service", "ItemID": "143039633012", "EndTime": "2018-12-27T13:32:45.000Z", "StartTime": "2018-12-04T19:04:29.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Hohner-Rockwood-LP-Copy-Gloss-Ebony-Finish-Electric-Guitar-/143039633012", "ListingType": "FixedPriceItem", "Location": "Richmond, Virginia", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1430396330128080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MjUwWDcwMA==/z/6ZMAAOSw78xbZc3D/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTI3WDcwMA==/z/i2YAAOSwzIJbZc3K/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTMwWDcwMA==/z/cw0AAOSw1iFbZc3N/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTg1WDcwMA==/z/8LoAAOSwLURbZc3R/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTM3WDcwMA==/z/gp4AAOSwyCNbZc3V/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDU5WDcwMA==/z/q-gAAOSwrFxbZc3b/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTFYNzAw/z/UNEAAOSw0C9bZc3e/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDU0WDcwMA==/z/PR8AAOSwksBbZc3j/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTUyWDcwMA==/z/dL0AAOSwaVNbZc3o/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA0WDcwMA==/z/b~4AAOSwjRFbZc3t/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTI0WDcwMA==/z/i44AAOSwzIJbZc3z/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MjQ2WDcwMA==/z/QnwAAOSwyXVbZc33/$_57.JPG?set_id=8800005007"], "PostalCode": "23220", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "metrosound117", "FeedbackRatingStar": "Red", "FeedbackScore": 1580, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 179.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 179.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "n***d", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 268}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "Hohner Rockwood LP-Copy Gloss Ebony Finish Electric Guitar", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Gloss Ebony"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Rockwood"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Product Line", "Value": ["Rockwood"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Style", "Value": ["LP-Copy"]}, {"Name": "Features", "Value": ["Volume Knob", "With Pickup"]}, {"Name": "MPN", "Value": ["Rockwood"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Brand", "Value": ["HOHNER"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}, {"Name": "Body Type", "Value": ["Solid"]}]}, "HitCount": 204, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=15447741", "StoreName": "Metro Sound and Music"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Case/gig bag not included.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}