{"BestOfferEnabled": true, "Description": "Up for auction is a CoolZ ZTE-10RTelecaster electric guitar in very rare Ocean Turquoise Metallic (OTM) made by the Fujigen factory in Japan exclusively for Shimamura Music Store. It is based on the classic design but the body has contours similar to a Strat which I think it feels much better than the traditional design.The Fujigen factory is famous for manufacturing guitars in the 80’s and 90’s for Ibanez and Fender Japan among other brands. This factory has been very famous for their impeccable quality on fit and finish on all guitars they produced and continues to produce. For some of you that are not aware, the Fujigen factory started producing guitars with their own brand name called Fujigen also (FGN). This particular model features a unique and proprietary design for the frets called CFS – circle fretting system which greatly improves tuning, intonation and playability – below is a link explaining the CFS that is employed by many Fujigen made guitars. https://www.ultimate-guitar.com/forum/showthread.php?t=1638110 I imported this guitar from Japan a while back, never played it much all and never took it outside the house. It stayed in its original semi-hard gig bag for the most part. I really like it a lot but I need to “downsize” my guitar collection. Below is the link for the Shimamura Music website showcasing this model (note this particular color has been discontinued). https://www.shimamura.co.jp/originalbrand/coolz/zte-10r.html The neck shape is a comfortable oval shape – not very thin but definitely not too thick. The width at the nut is about 1 5/8” (42mm) and the scale is the traditional 25.5”. There is almost no visible wear on the frets (medium jumbo) and the radius on the fretboard is 9 1/2”. The neck is very straight and I did not have to adjust the truss rod – the action currently is set up somewhat low with new D’Addario XL strings (09 – 42). The finish on the back of the neck is almost like a satin finish and not high gloss – but at the back and front of the headstock high gloss finish can be seen. This is very smart since the satin finish in the back of the neck feels much easier to play. There is a very light nick on the side of the body and scuff marks on the side on the other side – I tried to show these in the photos but they are not too obvious unless you look really close. All the electronics are original and in proper working order. The pickups sound really good, like a typical good Telecaster should – I would say the output is medium not too hot but not weak either. The fit and finish of these guitars are excellent rivaling other more famous brands that costs way more. The guitar will be shipped in the original semi-hard gig bag that I originally got with this guitar – see photo attached – it really is interesting to see how well designed it is. Since I'm starting the bid low and without reserve, it will be sold \"as is\" (no returns). But bid with confidence - this is a great sounding guitar in excellent condition! The guitar plays very well, I believe that the CFS system do help with playability – I have other Fujigen made guitars with CFS and compared to other guitars they tend to feel easier to play. Payment method is Paypal and it is expected within 48 hours after the end of the auction. Note that the actual shipping charges shown do not include insurance – if you would like to add insurance please contact me so I can re-calculate and add to the shipping charges. Sorry but no international bidders for this one! If you don’t have at least 10 positive feedback or if you have negative feedback, please do not bid. I’m tired of getting “burned” with non-paying bidders. Good luck and happy bidding! Please check my other auctions.", "ItemID": "132896668066", "EndTime": "2019-01-02T00:14:55.000Z", "StartTime": "2018-12-23T00:14:55.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/CoolZ-ZTE-10R-Telecaster-OTM-Fujigen-Fender-V-Rare-NR-Great-Guitar-L-K-/132896668066", "ListingType": "Chinese", "Location": "Sumter, South Carolina", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1328966680668080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NzMxWDE2MDA=/z/LrwAAOSwcBZb1hMH/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTQ1WDE2MDA=/z/QaMAAOSwOsFb1hMQ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzU1WDE2MDA=/z/D8IAAOSwvhxb1hMe/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzA0WDE2MDA=/z/LVkAAOSwNCtb1hMw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzQ1WDE2MDA=/z/OD0AAOSwSTpb1hM6/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjkwWDE2MDA=/z/E1oAAOSwaEJb1hNI/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjgyWDE2MDA=/z/AY8AAOSwcnxb1hNS/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAyNVgxNDkz/z/ItYAAOSw7Spb1hNd/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzkzWDE2MDA=/z/ikIAAOSwYi5b1hNi/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzUwWDE2MDA=/z/WocAAOSwNmxb1hNv/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/Njg4WDE2MDA=/z/NOIAAOSwvx1b1hN~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODEwWDE2MDA=/z/16EAAOSw~jxb1hOy/$_57.JPG?set_id=8800005007"], "PostalCode": "29150", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "starstruck2014", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 232, "PositiveFeedbackPercent": 100.0}, "BidCount": 3, "ConvertedCurrentPrice": {"Value": 560.01, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 560.01, "CurrencyID": "USD"}, "HighBidder": {"UserID": "k***4", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 864}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "CoolZ ZTE-10R Telecaster OTM Fujigen Fender V.Rare NR Great Guitar L@@K!!!", "ItemSpecifics": {"NameValueList": [{"Name": "Body Material", "Value": ["Alder"]}, {"Name": "Brand", "Value": ["CoolZ"]}, {"Name": "Model", "Value": ["Telecaster Special"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Body Color", "Value": ["Ocean Turquoise Metallic"]}]}, "HitCount": 122, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 570.01, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["CN"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}