{"BestOfferEnabled": false, "Description": "Pawn America has 14 years of experience selling a wide range of items online. We take pride in serving you! Check out our huge selection of diverse products. Everything we sell is guaranteed as described or your money back! Your satisfaction is our number one goal. Keep in mind that we offer hassle-free returns with prepaid return shipping. If you have any questions or problems please contact our Customer Service Representatives. _______________________________________________________________ ITEM DESCRIPTION Jamstik JSI152100 Portable Blutooth SmartGuitar 238086480 Features: Works wirelessly with your device and our apps to teach you guitar Sensors detect your finger placements giving you instant feedback Play chords in minutes with simple interactive tutorials and games Jamstik SmartGuitar comes with real strings and frets Never needs tuning Good for traveling Also a creative MIDI tool: play any sound with hundreds of other apps Compatible with iPhone, iPad, Mac and select Android M devices What's Included: Jamstik JSI152100 Portable Blutooth SmartGuitar Soft Case What’s not included: Charging Cable Original Packaging Condition: This Jamstik Smart Guitar is previous owned and used but in good working condition. It is missing the covers fro the middle and end of the guitar that it came with when new, but functions as intended without these. See pictures for actual condition and items included. 11/6B1-238-086480-KB Payment & Checkout Checkout: After the auction has ended please click the checkout button to proceed with your payment. Payments: Payments must be received within 3 days. Unpaid cases will automatically be open by eBay 7 days after purchase. Taxes: Sales tax is charged for items shipped to: MN*(6.875%), WI*(5.0%) All Emails and Invoices will be sent to your registered eBay Email Address. If you are not receiving our emails please check your email spam filters. Shipping We Ship to confirmed addresses only! Make any changes to your address before paying. All items will be shipped to your confirmed billing address! Shipping Carriers: SurePost, UPS & USPS 1-6 Day. We choose the shipping carrier at our discretion. Local Pickups: Please contact us for local pickup information. Product Guarantee We offer a 30 Day Money Back Guarantee unless noted \"As Is\" or \"For Parts or Not Working\". We do not offer returns on international orders. We do our very best to accurately describe our items, however If you have any problems please contact us right away. Frequently Asked Questions What are your operating hours? M-F 9:00am - 5:00PM Central Standard Time Do you ship internationally? We ship internationally on select items. What is the history of the item? Most of our items are used and we do not know the history. We test them and picture their current condition. What's Included? 99% of the time If it's pictured it's included. Please also read \"What's included\" How long do I have to make payment? You have 3 days to make payment. Prestalia e-commerce solutions. Protect Your Product With a Consumer Priority Service Warranty", "ItemID": "232995865741", "EndTime": "2018-11-14T00:29:24.000Z", "StartTime": "2018-11-13T03:00:20.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Jamstik-JSI152100-Portable-Blutooth-Right-Handed-SmartGuitar-/232995865741", "ListingType": "Chinese", "Location": "Inver Grove Heights, Minnesota", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/2329958657418080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTEwMFgxMTAw/z/zoQAAOSwOU9bzdlx/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTEwMFgxMTAw/z/~egAAOSwEJlbzdlx/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTEwMFgxMTAw/z/qK0AAOSw0rBbzdlx/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTEwMFgxMTAw/z/2OAAAOSwWSlbzdlx/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTEwMFgxMTAw/z/DQsAAOSwfEdbzdlx/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTEwMFgxMTAw/z/kOwAAOSwHTlbzdlx/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTEwMFgxMTAw/z/BIIAAOSwhBhbzdlx/$_1.JPG?set_id=880000500F"], "PostalCode": "55077", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "epawnamerica", "FeedbackRatingStar": "RedShooting", "FeedbackScore": 150867, "PositiveFeedbackPercent": 99.5, "TopRatedSeller": true}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 149.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 149.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "l***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 123}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Jamstik JSI152100 Portable Blutooth Right-Handed SmartGuitar", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Jamstik"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Model", "Value": ["Smart Guitar"]}, {"Name": "String Configuration", "Value": ["6 String"]}]}, "HitCount": 20, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=16525387", "StoreName": "ePawnAmerica"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 152.49, "CurrencyID": "USD"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "APO/FPO", "US Protectorates", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "This Jamstik Smart Guitar is previous owned and used but in good working condition. It is missing the covers fro the middle and end of the guitar that it came with when new, but functions as intended without these. See pictures for actual condition and items included.", "QuantitySoldByPickupInStore": 0, "SKU": "11/6B1-238-086480-KB", "NewBestOffer": false}