{"BestOfferEnabled": false, "Description": "This terrific Gibson Les Paul Junior offers you both afantastic, customized version of a classic and the ability to return theinstrument to stock, as the changes are all reversible. As customized, theguitar features an excellent Mojotone Gold Foil pickup. (You can read aboutthese online. I did a lot of research before choosing this really beautifully made,finely voiced pickup.) I am an experienced builder/tech and was able to mountthis pickup in the existing cavity, at the optimum height, by handmaking anunderlying (removable) mount requiring no modification of the guitar. Thecombination of this guitar and this pickup will speak for itself. It absolutelysings and is IMO way more versatile than the usual P90, dishing out everythingfrom very clear, articulate (notshrill or tinny) lines to powerful drive tones. I will include a Lollar P90,which I used at first, (I chucked the original ordinary Gibson) should you wantto go back to standard. I created a lacquered/leafed/pearl dragon image on theoriginal pickguard, repeating this in miniature on the truss rod cover. The designincludes a print of a section of the \"9 Dragons Scroll\" overlaid withlacquer and leaf, with pearl dot inlaid where the \"dragon ball\" shouldappear. It cannot be photographed well. The instrument can be brought rightback to stock by buying a replacement, widely available. I installed classic,better-functioning Grovers, but include the original Gibson (Kluson?)white-buttoned tuners in the sale. An excellent Mojoaxe compensated bridge isinstalled; the original crap Gibson bridge is gone. The two custom black ebony buttons I addedare really nice, but I will also include the two gold top hats that came on theguitar when I bought it, and the chintzy original black plastic jack plate. (Ireplaced it with a good metal plate.) I do not know the year the guitar wasmade, but the serial no. shown on the paperwork can be used to get that info. Thecase is somewhat scuffed but basically very good. Keys included. The guitar hasbeen played and shows the minor scuffs that come from being handled and usedwith decent care. There is one significant mark on the side (see pic) and onesmall area of buckle rash (maybe 2 in square) on the back which refuses to showin a photograph because of the reflective surface. Both were present on theguitar when I bought it from the original owner. The back of the neck ispristine. But if you want a mint guitar, please buy a new one. It's pointlessto talk about how good a guitar may be, since it's subjective, so I will simplysay that I am a lifelong player with some great guitars, and bought this on alark, itching to try a Junior. But it became my go-to over much more expensiveguitars because I was able to set it up ideally for how I play, and I reallyloved the sounds I got out of the gold foil. The frets are great. When this wasmade, Gibson seems to have really been nailing it with the playability of itsJuniors. I'm retiring and downsizing, and my old SG/Les Paul Custom is staying,so Junior has to hit the road. This is an as-is, final sale, and there are noreturns unless I have made a substantive error in my description. Ignore Ebay shipping estimates: Free UPS Ground to continental US only.", "ItemID": "143071447109", "EndTime": "2019-01-05T19:35:58.000Z", "StartTime": "2018-12-29T19:35:58.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-Les-Paul-Junior-electric-guitar-Lollar-P90-plus-gold-foil-/143071447109", "ListingType": "Chinese", "Location": "Carpinteria, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1430714471098080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/g~gAAOSw651cJ8nG/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/~tYAAOSw8kRcJ8nO/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/SJ0AAOSwcapcJ8nn/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/tZIAAOSwp3dcJ8nv/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/piwAAOSwXgxcJ8n2/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/VSIAAOSwQhBcJ8n7/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/RHgAAOSwSe5cJ8oF/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/T5UAAOSwG25cJ8oa/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/UVUAAOSwpYxcJ8oc/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Q5wAAOSwVIBcJ8os/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/TbkAAOSwZ2tcJ8rT/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/MvkAAOSwEqVcJ8rz/$_32.JPG?set_id=880000500F"], "PostalCode": "93013", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "ptwangerc", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 307, "PositiveFeedbackPercent": 100.0}, "BidCount": 27, "ConvertedCurrentPrice": {"Value": 825.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 825.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "t***b", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 789}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson Les Paul Junior electric guitar Lollar P90, plus gold foil", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Product Line", "Value": ["Gibson Les Paul"]}, {"Name": "Model", "Value": ["Les Paul Junior"]}, {"Name": "Body Color", "Value": ["Gold"]}]}, "HitCount": 893, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 835.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}