{"BestOfferEnabled": false, "Description": "Welcome! Please read entire description before bidding or asking questions! Winning bidder must pay for auction within 48 hrs of auction close. Bidders with less than 5 feedbacks, and/or multiple bid retractions, must contact me before bidding. I reserve the right to cancel bids from bidders with a sketchy bidding history. If you have questions, please ask before bidding! You are checking out a 1986 Trans Red Hamer Electric Guitar with factory Floyd Rose and Boomerang Mother of pearl Inlay. It is tested and all working as should! Brand new set of D'Addario Regular Light EXL110-B25 strings just put on. Mahogany Body, Flame Maple neck, Gibson scale, 24-3/4 scale with 24 fret rosewood fingerboard. Comes with the original Hamer Hardshell case with some special stickers and markings on the case from being on tour. Bridge Pickup is a factory original Seymour Duncan, rest are Hamer single coil rail pickups. All appears to be original! Cosmetically it is in great condition, some minor marks and wear. Rear has what looks like some belt buckle marks, nothing crazy bad in my opinion. The top pickup cover has a small crack, but functions fine. Please see pics and judge for yourself! RETURNS I will accept returns up to 14 days from your receipt of item provided it's not as described and shows up here in the condition it left. I've had buyers try to swap their non-working components with mine before and then claim it doesn't work. It will have tamper proof tape on it. If that is broken, the return option is void. Auction includes the 1986 Hamer TLE Electric Guitar as described. I highly recommend using Uship for Very delicate heavy or bulky items. They come to me pick it up and deliver it to you safely. You must go to their website and setup an account, (it takes 5 minutes) and make the arrangements yourself. I have had great dealings with this service, but in no way am I responsible for damage during their handling. It is located in West Ft Lauderdale area. Just give them your location and approximate dimensions, for example, \"Drum set with hardware\" they take bids with drivers passing my area to yours, or you can set a price you are willing to spend for the transaction, It works and its easy! Costs less than UPS or Fedex for heavy or bulky items! I use a great deal of packing material to make sure everything arrives safely and this will be shipped in a strong box. . Please keep that in mind when calculating your shipping . Check out my feedback regarding packing! Yes my shipping may be more money then the other guys....but isn't spending a couple of bucks more, better than getting your merchandise damaged? My handling fee covers extra packing material, and or my time to find the best box for your item! FYI, If you pay fast I ship fast! International bidders are responsible for duties. All shipping labels are being created through Paypal. When the label is made, Paypal will send you an email with the tracking information for your order. If you haven't received the email in a reasonable amount of time please make sure to check your SPAM folder. Payment is expected within 2 days of auction close. I accept PayPal only, for your protection and mine. If you don't have a Paypal account, please do not bid. Please note: I log all serial #'s so if you plan to purchase this for parts or swapping purposes then please don't even bother! Winning bidder must contact me within 48 hrs of auction close. If you have no feedback or multiple negative feedback, you must contact me before bidding or your bid will be withdrawn from the auction. If you have questions, please ask before bidding! My feedback rating is very important to me. So please contact me before leaving negative, or neutral feedback if you think your item has been represented incorrectly. I am only interested in a 100% positive experience for my buyers. Things can always be worked out. Thank you for looking. Paypal only within 48 hrs of auction close. _gsrx_vers_837 (GS 7.0.15 (837))", "ItemID": "173734164828", "EndTime": "2019-01-11T07:14:22.000Z", "StartTime": "2019-01-11T03:34:16.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1986-Hamer-TLE-Electric-Guitar-Trans-Red-Floyd-Rose-Boomerang-Inlay-/173734164828", "ListingType": "FixedPriceItem", "Location": "Fort Lauderdale, Florida", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1737341648288080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA2M1gxNTk5/z/3ssAAOSwXF5cOAzZ/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2M1gxNTk5/z/rf0AAOSwCI5cOAzZ/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2M1gxNTk5/z/B~AAAOSwTSlcOAzc/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2M1gxNTk5/z/~FsAAOSwMflcOAzb/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2M1gxNTk5/z/i8AAAOSwLgpcOAzc/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2M1gxNTk5/z/6DMAAOSwZupcOAzd/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2M1gxNTk5/z/wu4AAOSwqKNcOAzf/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2M1gxNTk5/z/BagAAOSwsZhcOAzf/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2M1gxNTk5/z/kRQAAOSw-QBcOAzh/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2M1gxNTk5/z/wu8AAOSwqKNcOAzg/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2M1gxNTk5/z/ZcoAAOSwq2xcOAzj/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2M1gxNTk5/z/PBYAAOSwHSdcOAzj/$_3.JPG"], "PostalCode": "33321", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "protoolshd3-88", "FeedbackRatingStar": "Red", "FeedbackScore": 1072, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1250.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1250.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "o***n", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 2149}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "1986 Hamer TLE Electric Guitar Trans Red Floyd Rose, Boomerang Inlay  ", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Hamer"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Model", "Value": ["TLE"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Scale", "Value": ["61"]}]}, "HitCount": 23, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=19142343", "StoreName": "protoolshd3-88"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Middle East", "Southeast Asia", "RU"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}