{"BestOfferEnabled": false, "Description": "Up for sale, a 1999 Gibson Custom Shop '59 reissue Les Paul Standard in exceptional condition and in perfect working order. This \"R9\" reissue comes from Gibson's Custom, Art & Historic series of instruments which preceded the current VOS line, and this model in particular is the pinnacle of Gibson's Custom Shop quality. With a premium carved maple top, non-weight relieved one-piece mahogany body, PAF reissue humbuckers, meaty '59 neck profile, and a stunning nitro lacquer Washed Cherry finish, this Les Paul truly delivers on the promise of its heritage and legacy. Unique to the 1999-2000 Custom Shop models, the fretwire has notably more height and crown, and the plain top iteration of the R9 is another unusual aspect more in line with many genuine '50s Bursts.Tonally, everything stems from the acoustic properties of the instrument, and this Les Paul has a clear and pronounced voice when strummed unplugged, with great bark in the low end, and full, round sounding plain strings that deliver plenty of zing and also a richness that makes lead lines come through with great clarity and body. Weighing in at 9lbs 2oz and balancing well on a strap, this guitar makes the most of the classic tone wood combination of a carved maple top on a solid mahogany body. The sound is clear, lively, and harmonically complex in all registers, and the original PAF-style pickups do an excellent job of capturing everything we love about the sound of a true, vintage Les Paul Standard. There's plenty of power and articulation in the bridge position, with thick and round sounds from the neck pickup that are ideal for lead work while still staying defined. Both pickups deliver the great string to string balance and clarity that the guitar inherently has acoustically as well. The guitar features a professional setup, playing flawlessly with low, comfortable action and accurate intonation.The neck has a full and chunky C shaped profile worthy of the \"baseball bat\" moniker, and there's a touch of light figuring in the mahogany on the bass side of the profile too. The profile has full, generous shoulders while still being more slender than some of Gibson's more massive R7 and R8 neck profiles.The bound Indian rosewood fretboard has correct vintage spec pearl trapezoid inlays, as well as stock fretwire that shows zero wear, with perfectly rounded crowns. The guitar plays up the neck perfectly, with no buzzing or dead spots, and bending is effortless. Notes sing out clearly even when bending to the far edges of the fretboard without choking out, and the sustain of the guitar is truly phenomenal. The upgraded carved bone nut measures 1 11/16\" in width, and the string spacing allows for comfortable chording and accurate lead work up the neck. The headstock has the correct 17 degree angle, holly veneer, stock truss rod cover, and original Gibson Deluxe single line tuning machines with transparent pearloid tulip buttons.All of the electronics work as they should, with stock pickups, an untouched wiring harness, and a pair of the famed \"Bumblebee\" tone capacitors. The nickel hardware has the lightly brushed appearance as applied from the factory with minty pickup covers, ABR-1 bridge, and tailpiece. The aged plastic hardware is also minty, with the stock pickup rings, pickguard, and amber bell knobs present. Cosmetically, this instrument shows only a few pinhead-sized shallow nicks on the top adjacent to the knobs, as well as a light finish scratches on the back, but well shy of what's typically considered \"buckle rash.\" This Les Paul R9 is from a celebrated era of Gibson production and a notably well cared for example with flawless tall fretwire. The original Gibson Custom, Art & Historic hardshell case is included. Check out our shop \"Mike & Mike's Guitar Bar,\" and please let us know if we can answer any questions! Shipping in the continental USA will be $75, fully insured and shipped via FedEx Ground. Expedited shipping available for an additional fee at buyer's request. We will happily ship WORLDWIDE, but please contact us for an accurate international shipping quote before bidding or buying, as cost varies by buyer location. International orders will be declared as “merchandise,” and the value of merchandise will be declared as the amount paid. We cannot declare anything as a gift or for a lesser value. No exceptions! The customer is responsible for all taxes and duty, which may be collected upon delivery, as well as any additional charges involved with import. We have all necessary CITES paperwork in-hand to ship rosewood worldwide.We do our best to describe all items with honesty and accuracy, but to be sure, please contact us with any questions or concerns prior to bidding or buying. We require payment within 48 hours of auction end. In the unlikely event of a return, buyer pays all shipping costs. Your positive feedback and five star ratings are very important to us, and we appreciate your communication in resolving any issues!", "ItemID": "163387280265", "EndTime": "2018-12-20T16:40:26.000Z", "StartTime": "2018-11-21T11:07:58.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1999-Gibson-Custom-Shop-R9-1959-Historic-Les-Paul-Standard-Plain-Top-w-ohc-/163387280265", "ListingType": "FixedPriceItem", "Location": "Seattle, Washington", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1633872802658080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/H3oAAOSwdzhb9TV~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/sGIAAOSwHOZb9TWN/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/nkMAAOSw-GNb9TWQ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/8DAAAOSwpTBb9TWS/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/TrUAAOSwmXpb9TWH/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/nf8AAOSwa1Zb9TWC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/~VYAAOSwE9Bb9TWF/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Y7wAAOSwrmRb9TWV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/DIUAAOSwP8db9TWY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE5NlgxNjAw/z/79EAAOSwCK1b9TWb/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/l-oAAOSwsDZb9TWe/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/44AAAOSwztVb9TWK/$_57.JPG?set_id=8800005007"], "PostalCode": "98117", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mmguitarbar", "FeedbackRatingStar": "Red", "FeedbackScore": 2591, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 3999.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 3999.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "k***i", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 78}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "1999 Gibson Custom Shop R9 1959 Historic Les Paul Standard Plain Top w/ohc", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Washed Cherry Sunburst"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model", "Value": ["1959 Les Paul Standard Historic R9"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["1999"]}]}, "HitCount": 684, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=269063702", "StoreName": "Mike and Mikes Guitar Bar"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}