{"BestOfferEnabled": true, "Description": "Beautiful Fender Mustang electric guitar! White with pearloid pickguard.This has been my own personal guitar for some time now. Plays and sounds great with the 2 P-90 pickups. Can get nice clean tones, and sounds awesome overdriven!Neck is very nice and smooth. Rosewood fretboard, before they changed to the new fingerboard wood type - all other specs below are same. Only a few minor scratches and flaws. Overall very good condition! Comes with very nice Fender Gigbag.See pictures for condition! --------------------------------------Specs from manufacturer: Fender's Mustang 90 electric guitar reintroduces one of the most popular offset body styles with modern updates that are a hit with a new wave of guitar players. The Mustang 90's 24\" scale length keeps string tension low and is ideal for players with a naturally smaller frame. The duet of MP-90 single-coil pickups sounds absolutely massive when played clean or through your favorite fuzz pedal. And the Fender Mustang 90's electronics and controls are an intuitive affair that allow you to focus solely on your music.Iconic offset construction The Fender Mustang is one of the most identifiable and sought-after offset body styles in the world. Its compact dimensions not only imbue it with plenty of character, but also help it remain lightweight and extremely comfortable for smaller players. This Mustang 90 carries with it the standard Mustang 24\" scale length that maintains lower string tension for easy chording and a warm tone. One look at the Mustang 90, and you'll know this guitar was built for today's boundary-pushing guitarists. Two Fender MP-90 single-coil pickups The Mustang 90 separates itself from vintage Mustangs with a duet of Fender MP-90 single-coil pickups. Many players agree that the MP-90s are a great addition because of the way they maintain the clear and bell-like tones of traditional Mustang single-coils while offering more output and midrange grunt for players wanting to work their amps a bit harder. And the Mustang 90's 2-knob and 3-way switch controls make dialing in your tone a simple affair.Neck designed for the modern player Another aspect of the Mustang 90 that has been updated for the demands of today's players is its neck. While this pau ferro-on-maple affair does boast a vintage-style 24\" scale length, the fretboard is designed with a 9.5\" fretboard radius. Fender has been using this radius for a long time because it offers comfortable chording and unimpeded single-note playing and bending. The neck profile is a \"C\" shape that fills your hand in a very satisfying manner. And 22 medium-jumbo frets are a wonderful middle ground for all sorts of styles.Tech SpecsBody Type: SolidbodyBody Shape: MustangLeft-/Right-handed: Right-handedNumber of Strings: 6Body Material: AlderBody Finish: Gloss PolyesterColor: 2-Tone SunburstNeck Material: MapleNeck Shape: C profileRadius: 9.5\"Fingerboard Material: Pau FerroFingerboard Inlay: DotsNumber of Frets: 22, Medium JumboScale Length: 24\"Nut Width: 1.650\"Nut Material: Synthetic boneBridge/Tailpiece: String-throug hardtail Strat bridge with bent steel saddlesTuners: Standard cast/sealedNeck Pickup: MP-90 Single-coilBridge Pickup: MP-90 Single-coilControls: 1 x master volume, 1 x master tone, 3-way toggle pickup switch---------------------------- Seller statements: Please accept that these are used items, and cannot be guaranteed, therefore, each item is sold AS-IS with no warranty or returns accepted. This item is offered with Flat Rate $40.00 Shipping to the lower 48 USA States only. PAYPAL is the only form of payment accepted at this time. Please ensure that payment is made within 2 business days after end of sale. No international shipping.Thanks.", "ItemID": "183661749655", "EndTime": "2019-02-03T00:56:35.000Z", "StartTime": "2019-01-30T18:55:44.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2016-Fender-Mustang-P-90-Pickups-White-Pearloid-Electric-Guitar-w-Nice-Gigbag-/183661749655", "ListingType": "FixedPriceItem", "Location": "Greer, South Carolina", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1836617496558080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg5OTY=/z/emQAAOSwwfFcRLQs/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMzUy/z/ec0AAOSwEfVcRLQ6/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ3OFgxNjAw/z/ZykAAOSwUlFcRLRA/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDMx/z/eDkAAOSwDEBcRLRN/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5ODI=/z/GrYAAOSwy6NcRLRQ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTM5MVgxNjAw/z/aOUAAOSwwqVcRLRm/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAyNFgxNjAw/z/Y28AAOSwQLVcRLRo/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMTg3/z/Yo8AAOSwgadcRlyT/$_57.JPG?set_id=8800005007"], "PostalCode": "29651", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "guitarstobuy", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 145, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 374.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 374.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "h***_", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 0}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2016 Fender Mustang P 90 Pickups White Pearloid Electric Guitar w Nice Gigbag!", "ItemSpecifics": {"NameValueList": [{"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Body Color", "Value": ["White"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Mustang 90"]}, {"Name": "Country/Region of Manufacture", "Value": ["Mexico"]}, {"Name": "Model Year", "Value": ["2016"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Brand", "Value": ["Fender"]}, {"Name": "Body Type", "Value": ["Solid"]}]}, "HitCount": 119, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}