{"BestOfferEnabled": false, "Description": "YOU ARE BIDDING ON A YELLOW/DESERT SAND (?) 1996/1997 FENDER AMERICAN USA STRATOCASTER. IT IS IN GOOD PLAYING AND PHYSICAL CONDITION BUT DOES SHOW MINOR SCRATCHES FROM NORMAL USAGE. (1 ON THE FRONT AND ANOTHER NEAR THE KNOBS) IT DOES COME IN A FENDER PLUS HARD SHELL CASE. NICE GUITAR FOR THE YEAR. FeedbackWE WANT POSITIVE FEEDBACK - Feedback left after feedback received! Did you know? On eBay, a NEUTRAL feedback rating is treated exactly the same as a NEGATIVE feedback? Please do not leave a negative or neutral feedback without contact from us to help resolve any issue!We are committed to satisfaction of your purchase.?? If you are not satisfied with your purchase in anyway please give us an opportunity to make it right before leaving feedback. Please give us an opportunity to make it right Monday - Friday 9-5 Central time 217-258-7296 or you may ask a question through ebay's contact a seller section. Please do not email us directly, as you many not get a response.CUSTOMER SERVICE 1. We are try to be knowledgeable of all products we sell, on occasion we may not have the answer to your question or in rare cases there may not be an answer to your question. We would appreciate one business day to answer all questions. Please do not ask a question to try to stump us or if you have no true interest in the item. 2. Please feel free to contact us by Ebay at any time. Please do not contact us directly with any pre-purchase questions or requests for information, we will only respond to Ebay-sent mail as this is a trail for Ebay representatives to follow if there is any issues after the sale. 3. We are a very honest and legitimate seller. We take pride in everything we sell and advertise. We legally purchase all of our items. We describe our items as accurately as we can. New is new. We have a very small profit margin, so if an item is advertised for a large reduction one has to believe this person is not selling it to lose money. We are sure you, as the consumer, do not want to be part of any illegal activity. If you have found a similar item we sell at a significant price reduction, there is usually a good reason and requires general common sense. PAYMENT 1. We only accept PayPal for shippable orders. IL residents will be charged 7% sales tax. We will accept cash for local pick-up orders. The acceptance of cash at time of pick-up is at our discretion. 2. If bidding on an auction item or submitting a Best Buy offer, you are agreeing to make payment for that amount plus any applicable shipping fees and taxes. If you are not interested in purchasing an item, please do not bid or submit an offer. If you are the winning bidder or your offer is accepted and payment is not made within two (4) business days, we will file a no payment strike and open a no payment case with Ebay. 3. We will only ship to the address that is on your Paypal payment. 4. We will process and ship your item within one (1) business day of your payment clearing. Paying with PayPal by check will delay the process, as this may take up to five (5) business days for the payment to clear. SHIPPING 1. We primarily use USPS for our shipping. If you require shipping via UPS or FEDEX, please let us know prior to purchase so we can get you a quote for the shipping. If you want it shipped a certain way, and it is not the way we are going to ship it anyways, let us know prior to purchase so we can get you a quote for the shipping. In some cases, we will use UPS for large or heavy items as that is the most cost effective way to ship. 2. Free shipping is free to you, the buyer; it is NOT free for us, the seller. Contrary to popular belief EBay does not offer sellers free shipping. As such, when an item is advertised with free shipping, please take that into account when comparing prices. On average, free shipping can account for between 50% and 80% of the asking price of an item. OUR SHIPPING AND HANDLING COVERS NOT ONLY POSTAGE, BUT PACKING SUPPLIES, LABELS, TAPE, AND MOST OF ALL OUR TIME. IF YOU DON'T LIKE THE SHIPPING COST, PLEASE DO NOT BID. IT TAKES TIME TO PACK AND SHIP ITEMS NO MATTER HOW SMALL. SHIPPING WILL NOT BE ADJUSTED AFTER AUCTION HAS ENDED. IF YOU HAVE A QUESTION, ASK BEFORE YOU BIDWE SHIP OUT MONDAY THROUGH FRIDAY. ITEMS PAID FOR ON FRIDAY MIGHT NOT GET SHIPPED OUT TILL MONDAY. 3. “Local Pick-Up” is defined as you, the buyer, will travel to the location of the item and pick-up yourself. There is no shipping involved in Local Pick-Up. Items are generally located Charleston/Mattoon, IL area. We can be somewhat flexible and meet at an agreed upon mid-way point or provide a local curbside delivery for an additional fee. However, this would need to be worked out prior to your purchase. 4. All items we sell are available for free local pick-up if you would like to save the shipping cost. 5. All orders are processed within one ( 1) business day of your payment clearing PayPal. RETURNS 1. Prior to any return you need to contact us to let us know what is going on and why. 2. If we make an error, we will do our very best to correct it. If you have buyer's remorse, did not read description, did not understand what you were purchasing, used for your special occasion and then want to return, or failed to use or operate the item properly we will not accept any return. 3. Return shipping is paid for by the buyer, unless specified differently. OUR CUSTOMER PROMISE AND OUR FEEDBACK 1. We pride ourselves on our customer service. Without customers, we are out of business. 2. If you feel we are undeserved of a five (5) star rating, please contact us prior to leaving any feedback. In most cases, we can correct any issues you may be having but, unfortunately, we cannot correct that which we don't know about. 3. If we have exceeded your expectations for service, please respond to the Ebay survey of service to let the whole community know how we are doing. 4. We usually leave feedback in a timely manner, and we expect the same from our customers. NO INTERNATIONAL SHIPPING FOR ANY ITEM.", "ItemID": "143066918880", "EndTime": "2019-01-14T20:23:49.000Z", "StartTime": "2018-12-26T20:40:23.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1996-Fender-50-Year-American-USA-Stratocaster-Electric-Guitar-Hard-Case-/143066918880", "ListingType": "FixedPriceItem", "Location": "Charleston, Illinois", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1430669188808080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/NwIAAOSwMBdbygvL/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/RacAAOSw0Rlbygve/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/8ucAAOSwdzRbygvp/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/O0EAAOSwwvtbygv2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Pz0AAOSwhBhbygv~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/M7YAAOSwE95bygwG/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/5NgAAOSwT0pbygwR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/2zIAAOSw48Vbygwf/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/tSMAAOSwMWpbygw3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/wSYAAOSwredbygxH/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/3B4AAOSweIlbygxZ/$_57.JPG?set_id=8800005007"], "PostalCode": "61920", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mfsalesstore", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 15536, "PositiveFeedbackPercent": 99.3, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 949.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 949.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "e***d", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 497}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "CA", "GB", "DK", "RO", "SK", "BG", "CZ", "FI", "HU", "LV", "LT", "MT", "EE", "AU", "GR", "PT", "CY", "SI", "JP", "CN", "SE", "KR", "ID", "TW", "TH", "BE", "FR", "HK", "IE", "NL", "PL", "ES", "IT", "DE", "AT", "BS", "IL", "MX", "NZ", "SG", "CH", "NO", "SA", "UA", "AE", "QA", "KW", "BH", "HR", "MY", "CL", "CO", "CR", "PA", "TT", "GT", "HN", "JM", "BB", "BD", "BM", "BN", "BO", "EG", "GF", "GG", "GI", "GP", "IS", "JE", "JO", "KH", "KY", "LI", "LK", "LU", "MC", "MO", "MQ", "MV", "NI", "OM", "PK", "PY", "RE"], "Site": "US", "TimeLeft": "PT0S", "Title": "1996 Fender 50 Year American USA Stratocaster Electric Guitar With Hard Case", "ItemSpecifics": {"NameValueList": [{"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Brand", "Value": ["Fender"]}, {"Name": "Body Material", "Value": ["Alder"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "MPN", "Value": ["111800800", "310620532"]}, {"Name": "MPN", "Value": ["111800800"]}]}, "HitCount": 269, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1031416871", "StoreName": "MFsalesstore"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "ProductID": {"Value": "78654738", "Type": "Reference"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["VN", "LA", "PH", "EC", "GY", "UY", "SR", "VE", "BR", "FK", "PE", "AR", "MW", "GH", "LY", "GQ", "BW", "MG", "NG", "LR", "TG", "ZW", "TN", "BI", "NE", "KE", "LS", "TD", "ZM", "SL", "SZ", "GM", "BF", "ZA", "NA", "TZ", "CF", "UG", "AO", "SC", "ML", "GA", "ET", "CD", "SO", "MZ", "YT", "CI", "SH", "GW", "DZ", "KM", "MA", "CV", "MU", "EH", "BJ", "RW", "GN", "ER", "DJ", "MR", "CM", "SN", "CG", "TR", "YE", "IQ", "LB", "AF", "BT", "MN", "UZ", "TJ", "IN", "NP", "AZ", "GE", "AM", "RU", "KG", "KZ", "TM", "NC", "PG", "MH", "NU", "SB", "GU", "FJ", "TO", "FM", "NR", "PW", "WS", "TV", "KI", "VU", "AS", "WF", "PF", "CK", "BY", "BA", "SM", "MK", "MD", "VA", "ME", "AD", "SJ", "AL", "RS", "KN", "VI", "DO", "LC", "AW", "SV", "BZ", "VG", "DM", "TC", "PR", "VC", "AG", "AI", "HT", "AN", "MS", "GD"], "GlobalShipping": true, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}