{"BestOfferEnabled": false, "Description": "I bought this Fender American Professional Stratocaster, new, in April 2017 (from Sweetwater dot com), and I have played it only in my home, and it is in excellent, mint, condition, with no alterations. It has been played only a few hours. Includes the Fender elite molded hardshell case, the tremolo arm, the case keys, the hex wrenches, and the documents that came with the guitar shown in the picture. The color is sienna sunburst, and it has a rosewood fingerboard. The serial number can be seen in the pictures. After I took the photos, I put a new set of Ernie Ball super slinky strings on the guitar, which are on it now. I will ship the guitar in its case, placed in a Fender box (that I have from another Fender guitar) which I will put in another larger box (so the guitar in the case will be double boxed for protection during shipping). I recommend viewing online instructions for loosening and tightening the tremolo arm with the hex nut in the metal tremolo block. Payment by paypal only. Shipping via UPS ground only, and the shipping address must be an ebay confirmed address. I can ship only to the continental U.S.A., and I cannot ship to P.O. Boxes. Thank you. The following is from Fender: THE EVOLUTION OF A REVOLUTIONOften copied, but never surpassed, the Stratocaster is arguably the world's most-loved electric guitar. Electrifying the music world since its debut in 1954, its natural, versatile sound made the Stratocaster the benchmark for exceptional guitar tones. The American Professional Stratocaster isn't a re-imagining of the classic design; it's the authentic original model, evolved.FEATURESThree Tim Shaw-designed V-Mod single-coil Stratocaster pickupsNew modern \"Deep C”-shaped neck profileBone nut; 22 narrow-tall frets for easier bendingPop-in tremolo arm for enhanced stabilityTreble bleed circuit maintains highs when reducing volumeIncludes Elite Molded hardshell case V-MOD PICKUPSV-Mod Stratocaster pickups are engineered using a proprietary blend of alnico magnet types for the neck and middle pickups. Each pickup is voiced specifically for its position, creating high-output tone with vintage warmth and the crisp, clear sound that made Fender a legend.NEW “DEEP C” NECK PROFILEDesigned for comfort and speed, the new American Professional “Deep C” neck profile sports more substantial shoulders. The increased mass and altered geometry creates a more natural feel that’s perfect for chord and single-note playing alikeNARROW-TALL FRETSNarrow-tall frets are taller and narrower than their medium jumbo cousins, making them especially effective for bending notes and playing chords up the neck with perfect intonation. POP-IN TREMOLO ARMThe new pop-in tremolo arm securely stays in position, no matter how hard you play. The arm tension can also be adjusted for a perfectly dialed-in feel that matches any player’s preference.TREBLE-BLEED CIRCUITThe treble-bleed circuit maintains the high end when turning down the volume knob to reduce gain, letting your tone shine through, no matter where the instrument’s volume is set. BONE NUTAn original-era Fender design element, a bone nut contributes to superior tone and performance. Many players consider bone nuts to be more “organic” sounding.", "ItemID": "333006279142", "EndTime": "2019-01-15T20:38:37.000Z", "StartTime": "2019-01-09T23:39:39.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fender-American-Professional-Stratocaster-Sienna-Sunburst-mint-condition-/333006279142", "ListingType": "FixedPriceItem", "Location": "La Jolla, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/3330062791428080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/p0IAAOSwPrdcNn9s/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/t2sAAOSw11BcNn-K/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/XFoAAOSwJ~xcNn-N/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/I9sAAOSw6~pcNn-Q/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/U-IAAOSwa1hcNn-U/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Tw0AAOSwEqVcNn-X/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/IugAAOSw0xtcNn-a/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/BGcAAOSwpJ5cNn-d/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/P~kAAOSwLeFcNn-g/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/ONQAAOSw7wFcNn-j/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/pssAAOSwVoNcNn-0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/UkQAAOSwO7dcNn~C/$_57.JPG?set_id=8800005007"], "PostalCode": "92037", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "ztimdog", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 242, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 899.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 899.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "0***m", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 277}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Fender American Professional Stratocaster, Sienna Sunburst, mint condition", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}]}, "HitCount": 416, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}