{"BestOfferEnabled": false, "Description": "Last production year of the American Standard Tele! I purchased this beauty new, and it has seen VERY little playing time... I'd say under 4 hours total. The Crimson Transparent is one of the most brilliant colorings I've seen on any guitar. The neck profile, in my opinion, is much easier to play than every other Tele model I've held over the years, in that it tapers and flattens out as you near the 12th fret... makes playing leads higher on the neck a delight. Pickups sound amazing, operates with zero electronic issues, and is a very comfortable play with the contoured back.This guitar is in very much near mint, the only issues are a small amount of buckle worming on the back (about the diameter of a dime), and some light pick marks on the top side of the pick guard.. see pics 11 and 12.Comes with original Fender hardshell case.. in full disclosure.. i'm not certain why they chose this particular case design.. there is the slightest bit of play that can cause the guitar to shift ever so slightly during transport.. i usually keep a strap or piece of foam wedged up against the butt and the case to secure.. which i will of course do for shipping. I'm positive you will love this guitar,,, and the only reason i'm parting with it is that I can't get away from being a Strat guy,,, so buy this sucker at a significant discount from what i paid! Ships USPS to CONTINENTAL UNITED STATES only. NO zero feedback bidders please...Thanks for the view! Here's the Specs: Classic Tele Tone - With a TwistThe Fender American Standard Telecaster continues the legacy of the solidbody electric guitar that's inspired players for decades. Fender has juiced the Tele with a pair of magnificent-sounding Custom Shop pickups - a Twisted Tele in the neck position and and Broadcaster at the bridge. That's a huge deal, but there's more! You finally get a comfy body contour to keep you rockin' during marathon gigs. And with a new thinner undercoat, this Tele resonates more - which can only be good for tone. Factor in the comfortable rolled fingerboard edges, improved bridge design, staggered tuning machines, and premium case, and you've got an irresistible guitar: the American Standard Telecaster. Fender American Standard Telecaster Solidbody Electric Guitar at a Glance:Premium Custom Shop pickups serve up tone for daysImproved bridge design gives you increased sustainThinner body undercoat for optimal body resonancePremium Custom Shop pickups serve up tone for daysFender's American Standard Telecaster sports a pair of incredible-sounding Custom Shop pickups: a Twisted Tele in the neck position and and Broadcaster at the bridge. This combo gives you the ultra-premium tone you'd expect from a Custom Shop guitar - at a US production model price. That alone makes the American Standard Tele a total steal. But there's so much more under the hood... Improved bridge design gives you increased sustainThe Fender American Standard Telecaster features an improved bridge design that serves up mondo sustain. The five-screw-mounted brass bridge plate is loaded with bent-steel saddles with elongated string slots for increased resonance and sustain. The result is impressively improved sustain - which in a way brings us full circle, back to the Tele's origins. As the first production solidbody guitar, Leo Fender's idea with the Esquire, and later the Broadcaster (as the Tele was originally called) was to mimic the solidity of the pedal steel, juicing sustain and volume, while avoiding the feedback issues that tended to plague hollowbody guitars onstage. Thinner body undercoat for optimal body resonanceAn undercoat serves to give the paint a smooth surface to adhere to so you have a nice looking finish. The thicker the undercoat, the more glass-like the finish, but the more constricted the guitar's body wood, which could affect tone. Fender has switched to a new undercoat that is thinner, and that allows the body to flex and resonate more, while retaining the cosmetic advantages of an undercoat. The result? You get the tough-as-nails resilience of a modern poly finish, with tonal characteristics that are more in line with classic lacquer finishes. With Fender's American Standard Telecaster, you get the best of both worlds. Fender American Standard Telecaster Solidbody Electric Guitar Features:Classic Tele sound, playability, and comfortYummy Tele sounds from two Custom Shop Twisted Tele (neck) and Broadcaster (bridge) pickupsFive-screw-mounted brass bridge plate for sonic stability and great sustainThinner finish undercoat that lets the body breathe and improves resonanceEminently playable fast-action neck and buttery rolled fingerboardUS-made in Fender's Corona, CA factoryIncludes Hardshell case, cable, strap, and polishing cloth", "ItemID": "273632294802", "EndTime": "2019-01-23T03:10:51.000Z", "StartTime": "2018-12-30T16:48:02.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fender-American-Standard-Telecaster-2015-Crimson-Red-Transparent-Excellent-Cond-/273632294802", "ListingType": "FixedPriceItem", "Location": "Murfreesboro, Tennessee", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2736322948028080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/egMAAOSwn~Rb5eBW/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/PasAAOSwEVtb5eDW/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/WrAAAOSwE8Vb5eDT/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/IvUAAOSwXbFb5eBP/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/HI0AAOSw~odb5eBR/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/1VgAAOSwy2pb5eDV/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/WXcAAOSwZ4Rb5eBV/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/lbYAAOSwE~Zb5eDU/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/r6IAAOSwSlpb5eBR/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/iw0AAOSwNmxb5eBT/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/NMoAAOSwWrxb5nF6/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/ebMAAOSw4xpb5m72/$_32.JPG?set_id=880000500F"], "PostalCode": "37129", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "forbeens", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 485, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 899.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 899.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "t***t", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 357}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Fender American Standard Telecaster 2015 Crimson Red Transparent Excellent Cond", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "Product Line", "Value": ["American Standard"]}, {"Name": "Model Year", "Value": ["2015"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Red"]}]}, "HitCount": 251, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}