{"BestOfferEnabled": true, "Description": "For Sale: GIBSON LES PAUL CUSTOM EBONY & GOLD 7.3 LBS THIN BODY. INCLUDES CASE, STRAP, PAPERS AND MANUALS. PLEASE SEE PICS. LIKE NEW CONDITION. IT WAS A GIFT I DIDN'T END UP USING AND THE LAST OWNER BOUGHT IT AS AN INVESTMENT. PROTECTIVE STICKER STILL INTACT ON PICKGUARD. Genuine Mahogany body with carved maple topMahogany neck with rounded '50s profileRosewood fingerboard with acrylic split-diamond inlaysPowerful 490R and 498T humbucking pickups in the neck and bridge positionsGold plated Grover™ keystone tuners with 16:1 ratioLes Paul Custom LiteWhen guitar star Les Paul and Gibson president Ted McCarty sat down at the start of the 1950s to design a revolutionary new solidbody electric guitar, they originally envisioned two versions of the Les Paul Model: a “standard,” which arrived first in the Goldtop of 1952, and a black Custom model with gold hardware, intended to be the crème de la crème. The 1954 Custom debuted with two single-coil pickups, but McCarty had already set Seth Lover and a team of Gibson designers the task of developing a revolutionary new humbucking pickup, which first hit the scene on the Les Paul Custom and Les Paul Goldtop in 1957. While the Les Paul Custom has always been a supremely elegant instrument—a “black tie” guitar for the formal crowd, as Les originally conceived it—many have come off the line over the years considerably heavier than the typical Les Paul Standard. The Les Paul Custom Lite, new from Gibson USA, redresses that disparity: made with a considerably thinner body and traditional weight relief, it lightens the load for a superbly playable Custom that still packs all the elegant looks and dual-humbucker tone that has made this Les Paul legendary. In crafting the Les Paul Custom Lite, Gibson USA starts with time-tested ingredients, including the legendary tonewood pairing of a carved maple top and genuine mahogany body, the latter treated with Gibson’s traditional weight relief to reduce the load and enhance resonance. The quarter-sawn mahogany neck is carved to a rounded ’50s profile and topped with a Grade-A, rosewood fingerboard with single-ply binding and classic acrylic block inlays. The body and headstock are trimmed in multi-ply binding, and the headstock carries an Acrylic Gibson logo and traditional acrylic split-diamond inlay. Dressed entirely in high-gloss Ebony Black, in genuine nitrocellulose lacquer, the Les Paul Custom Lite simply oozes class from every angle. The beauty of this gorgeous black Les Paul Custom Lite is more than skin deep, and Gibson USA has also packed added versatility into the traditional formula. Two of Gibson’s most popular humbucking pickups from the Modern Classics series offer all the tone that made the Les Paul legendary in the first place, plus added single-coil sounds thanks to the coil-splitting mini-toggle switch added in place of the second tone control. The 490R in the neck position is made with a genuine Alnico II magnet and wound with 42 AWG wire in the image of the original PAF humbuckers, for plenty of depth and warmth with impressive articulation. The 498T in the bridge position has an Alnico V magnet and extra turns of coil wire for added punch and growl. A traditional Tune-o-matic bridge and stopbar tailpiece enhance the sustain that has long made the Les Paul legendary, and a set of Grover™ keystone tuners—all in gold, as are the pickup covers and strap buttons—ensure a lifetime of smooth tunings. Check out the Les Paul Custom Lite today, from Gibson USA, and grab a more comfortable hunk of that classic elegance.", "ItemID": "264096796933", "EndTime": "2018-12-20T21:18:35.000Z", "StartTime": "2018-12-20T20:50:23.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-Les-Paul-Custom-USA-LITE-Ebony-Gold-7-3lbs-Thin-Body-Guitar-2013-Model-/264096796933", "ListingType": "FixedPriceItem", "Location": "Burbank, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/2640967969338080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/n1kAAOSwkQhcGBwE/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE5OVgxNjAw/z/-5cAAOSwVMJcGBvz/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/i8AAAOSwZ4RcGBva/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/78gAAOSwaPpcGvmd/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/CqgAAOSwH1pcGvmW/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/LnsAAOSw8LZcGvm~/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/zbEAAOSwMKxcGvmU/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/QlwAAOSwt0dcGvmQ/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/sVcAAOSwOVlcGvmM/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/4c8AAOSwn01cGvmI/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/V~0AAOSw0YlcGvnK/$_12.JPG?set_id=880000500F"], "PostalCode": "91504", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mephisto15243", "FeedbackRatingStar": "Purple", "FeedbackScore": 811, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 2000.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2000.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "j***a", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 319}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson Les Paul Custom USA LITE Ebony & Gold 7.3lbs Thin Body Guitar 2013 Model", "ItemSpecifics": {"NameValueList": [{"Name": "Product Line", "Value": ["Gibson Les Paul"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model Year", "Value": ["2013"]}, {"Name": "Model", "Value": ["Custom"]}, {"Name": "Body Color", "Value": ["Black"]}]}, "HitCount": 22, "Subtitle": "Includes Gibson Case, Strap, Manuals etc... See pics! ", "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Great Condition - Still has protective sticker on pickguard.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}