{"BestOfferEnabled": false, "Description": "Carvin DC150 Double Cutaway Right Handed Tobacco Sunburst Quilt Guitar w/ Case Carvin DC150 Double Cutaway Right Handed Tobacco Sunburst Quilt Guitar w/ Case Click images to enlarge Description Welcome to Our-Great-Goods! Carvin DC150 Double Cutaway Right Handed - Tobacco Sunburst Quilt - Guitar w/ Case In very nice used condition!! Carvin DC150 Double Cutaway Right Handed - Tobacco Sunburst Quilt - Guitar w/ Case Double cutaway mahogany body, through-body mahogany neck, 22-fret ebony fingerboard with dot inlays, sperzel locking tuners, tune-o-matic bridge/stop tailpiece, three-per-side tuners, gold hardware, two Carvin C22 humbuckers, volume/tone controls, three-position switch, two mini coil splitting switches. Product Specs: Brand: Carvin Model: DC150 Deterity: Right Handed Finish: Tobacco Sunburst Quilt Hardward: Gold Categories: Solid Body Made In: United States This was identified from searching pictures on the internet, finally found the exact one and took specs from that description. I really couldn't find anything wrong with this guitar, no obvious knicks or scratches, tiny ones maybe but overall it's in excellent shape, case on the outside has scuffs but overall a nice set. Includes Carvin case, key and truss rod tool. I Have Attempted to Photograph and Describe Any and All Imperfections But May Have Missed a Few! Please view photos carefully We combine shipping on mulitple orders! Payment We accept & prefer Paypal for all payments All sales are expected to be paid within 4 days otherwise an unpaid case will be opened. No exceptions to payment rules. Shipping We do Allow Pick Up In Our Store During Business Hours! We will ship all purchases the next business day after payment is made. We Will Combine Shipping On All Items You Purchase from us. Please wait for invoicing before paying to receive combined shipping. Continental US shipping is quoted in the auction. We no longer will sell or ship overseas or internationally. Shipping & handling is quoted flat rate first class or priority for the continental U.S. Hawaii, Alaska & Puerto Rico is 2x quoted price. Larger packages will be assessed according to the current shipping carrier prices. All items selling for over $750.00 will include signature confirmation. Please contact us for a quote on larger items. If you feel that our shipping & handling is too high---PLEASE do not bid. Handling charges are included in the shipping charges. We do not include insurance on our packages, If the package arrives with any damage, please do not open & return to sender via the carrier it was sent with. Terms of Sale We stand behind all products we sell. If you have any issue, please contact us & allow us the opportunity to make it right. We do not entertain Buy It Now offers We do offer pick up in our store during business hours We accept returns within 30 days after end of auction. Payments are required within 4 days after end of auction. Unpaid cases will open on unpaid items after that time. NO EXCEPTIONS! Please wait for invoicing on combined shipping items to receive discounted rates. Do not pay before receiving invoice. We do not reimburse paid shipping expenses. About Us We are OUR-GREAT-GOODS Please read all of our terms & conditions carefully! We do sell used items, in addition to our new items, and will do our best to describe its functionality & condition. This is our business & if you bid, please intend to buy. We do not accept buy it now offers once it is up as an auction PLEASE address all questions before bidding. You may contact us through Ebay messages with questions. We are open 10-6 EST Mon-Fri. & will respond to all questions within those times We will only respond to e-mail through Ebay! We take pride in our sales & will strive to make all sales smooth & effortless. We reserve the right to cancel the bid from suspicious or bad history bidders We reserve the right to end any auction early! This is a full time operation. We will answer questions during business hours only. 10-6 EST Monday-Friday If you are unhappy with your sale, please contact us & we will do our best to fix the problem. Returns are accepted within 30 days of receipt of item. Refunds are given as money back. Return shipping is the responsibility of the buyer. Contact Us Please contact us through eBay messages. We respond to eBay messages ONLY! Get images that make Supersized seem small.Tailor your auctions with Auctiva's Listing Templates! THE simple solution for eBay sellers. Track Page Views With Auctiva's FREE Counter", "ItemID": "123587932408", "EndTime": "2019-01-16T22:52:42.000Z", "StartTime": "2019-01-09T22:52:42.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Carvin-DC150-Double-Cutaway-Right-Handed-Tobacco-Sunburst-Quilt-Guitar-w-Case-/123587932408", "ListingType": "Chinese", "Location": "Coatesville, Pennsylvania", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1235879324088080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTAyNFg2ODI=/z/D5IAAOSwdRFcKXk0/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg2ODI=/z/-TwAAOSwuNNcKXk0/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg2ODI=/z/OqQAAOSwiwZcKXk0/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg2ODI=/z/JToAAOSwnfRcKXk0/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg2ODI=/z/sj0AAOSwkFZcKXk0/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg2ODI=/z/jBMAAOSwP8dcKXk0/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzIwWDEwODA=/z/mbsAAOSwd7FcKXk7/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzIwWDEwODA=/z/m9UAAOSw96ZcKXk0/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzIwWDEwODA=/z/1lUAAOSwoZlcKXk0/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzIwWDEwODA=/z/kGAAAOSw1ExcKXk0/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzIwWDEwODA=/z/DWMAAOSwLNxcKXk0/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzIwWDEwODA=/z/xh4AAOSweiFcKXk1/$_1.JPG?set_id=880000500F"], "PostalCode": "19320", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "our-great-goods", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 16043, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 20, "ConvertedCurrentPrice": {"Value": 510.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 510.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "o***g", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 9}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Carvin DC150 Double Cutaway Right Handed Tobacco Sunburst Quilt Guitar w/ Case", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Carvin"]}, {"Name": "MPN", "Value": ["DC150"]}]}, "HitCount": 310, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller"}, "MinimumToBid": {"Value": 520.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "TopRatedListing": true, "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}