{"BestOfferEnabled": false, "Description": "More Pictures at the bottom of this item description;You can see a lot of other detailed pictures at the bottom of this item description. Please see all of them to check the item condition before placing a bid or purchasing the item. *****WORLDWIDE SHIPPING****** ***** We ship the item to Europe, Oceania, Asia, Middle East and North South Asia. ****** The details of shipping fee is stated further below the item description below. *****Per gli utenti di eBay italiano/To Italian buyers***** Ti ringrazio per il tuo interesse. Se tu non sai bene l'inglese, cioe' non capisci bene la descrizione di sotto, non esitare a chiedermi qualsiasi domanda in italiano!! Parlo io italiano (ma non molto bene), quindi provo di risponderti nella lingua vostra/ in italiano!! Grazie. Thank you for looking at my auction! This auction is for a Fender Japan Mini Built-in Amp Stratocaster Early 90s. Fender Japan ST-Champ is a mini bodied travel electric guitar, with a built-in amplifier, and speaker (powered by 9 volt battery). This one is one of the early models with 530mm/20.9 in scale made in Fujigen factory. Instead, the later model has a 610mm/24 in scale. Both models are discontinued. The model made for the Japanese market only. You could say the item is in near mint condition except a few dings, paint cracks, uneven paints, slight discolorations for ages and so on. The item This guitar has the serial number starting from O.(The last two digits of the serial number in the pictures are hidden for the sake of the next owner.) According to the Fender Japan's website, this one was made between 1993 and 1994. Specs Body: looks Basswood Neck: Maple / unknown Neck width at nut: 38.5 mm / 1.52 in Weight: approx. 2.8 kg / 6.2 lb. **The specs above are extracted from the catalog or are based on my research, so they could be misinformed or mistaken. The weight and the neck width are based on actual measurement. **I am not the original owner so I cannot say whether this item has all original parts or whether the item is modified, so please judge them by the pictures. Condition of the item **Please refer to the photos & ++TERMS/CONDITION OF ITEM++ section below regarding guitar condition. The neck looks straight and the truss rod works fine. The neck looks straight and the truss rod works fine. The fretboard is smooth and fine. The frets show minimal wear. Tuners work fine. The electrics are good but the item is not brand new and some of the electric parts might have got to work after a contact cleaner had been sprayed on them so they might need to be fixed or to be replaced at your expense after you purchase; in some cases as soon as you receive the item. Or at least they might have a slight scratchy sound which can removed by a contact cleaner. There are some blemishes, dents, scratches and so on, as you can see the pictures but on the whole you could say that the guitar is in excellent condition. (There are some more blemishes, dents, scratches and so on that cannot be identified by photos because they are so slight, shallow or small. ) Some wood screw holes of the item could be loose as well as those of many other old or used guitars/basses. The above comment on the condition is my own subjective judgment and I cannot describe all about the item because it is used, so please check the pictures both at the top and at the bottom of this item description and judge the condition for yourself. **Before listing on eBay, I cleaned it up and set it up as far as possible. Accessories No accessories are included. More Pictures at the bottom of this item description;You can see a lot of detailed pictures at the bottom of this item description other than ones at the top of the item description. Please see all of them to check the item condition before placing a bid or purchasing the item. **Please read the ++TERMS/CONDITION OF ITEM++ section below (further down the following four items: Tax and duties, payment, packing and shipping) for full details of the items grade or condition before placing a bid or clicking \"By it now\" button!!, Thank You. Tax and Duties:* International Buyers Please Note: Before placing a bid or clicking the \"Buy it now\" button PLEASE READ THE INFORMATION BELOW: * Import duties, taxes and charges are not included in the item price. These charges are the buyers responsibility. ** The auction winner/buyer is responsible for ALL and ANY applicable taxes and duties levied by their government. *** please enquire with your local customs or post office for detailed information regarding your countries import duties to determine what these additional costs may be prior to bidding/buying because I cant be responsible for these charges as I'm sure you can appreciate. Payment:Only PayPal is accepted. The auction winner (the buyer) must pay the winning bid (item price) and the shipping fee.The payment must be made within 2 days after the end of the auction (the purchase). If you are interested in purchasing the item but cannot provide the fund by the due date, please let me know that before placing a bid or clicking the Buy It Now button. I could extend the due date, depending on the circumstances. Packaging:The guitar will be packed with great care in bubble wrap and posted in a thick cardboard box for the safest shipping. (The pictures below shows how a guitar including a gig bag is wrapped. ) Shipping:* I ship during Japanese business hours (Monday - Friday except on Japanese holidays) by EMS with full insurance)Asia...US$105North America/Central America (Second Zone)..........US121Oceania (Second Zone).........US$121Middle East (Second Zone) ..........US$121Europe (Second Zone)..........US$130South America (Third Zone)..........US$170 **Please see the section \" ++DETAILED INFORMATION ABOUT SHIPPING++\" at the end of the page** !!!IMPORTANT!!! ++TERMS/CONDITION OF ITEM++ Please read the following items before bidding or purchasing. If you don't accept all of them then please do not bid or purchase. Condition of the guitar: Almost all of the guitars in my store are not a brand new, but a used one, so they are not always be in \"PERFECT\" condition. This can be especially true of \"VINTAGE\" guitars that have had many years of use and because of this they can sometimes have issues with playability, so for many reasons they may need care and maintenance before reaching an optimal playing condition. Please read the following detailed information that should always be considered when buying a used guitar. *NeckNowadays a lot of guitar players know the term \"JV\" (Japan Vintage) and that the values of guitars made in and around the JV era are getting higher. I am glad and proud as a Japanese person that these guitars were made by expert craftsmen with selected materials and I totally agree with the reputation that these guitars have earned. However, in Japan, there is a significant humidity difference through the year which can have a bad influence on the materials in guitars if they are not well kept & carefully maintained. Additionally these guitars were often purchased by beginners or students and can tend to be poorly treated without ever having any maintenance. Sometimes they are stored away for ages after a very short period of use, as a result it is often the case that they have issue's about the neck. I have played guitar for many years and all the guitars in my store were listed only after I checked & played them personally. All of the guitars in my store passed the normal standards/my standards unless particularly stated otherwise. However that does not mean \"perfect\" condition as most guitars in the world have some issue be it a scratch or a break. Additionally, the pressure change, humidity change and change in temperature have a bad influence on the guitars during the shipping or after arriving in your country so they may need some adjustment before playing. *FretsAs the guitars are used the frets are worn more or less. I cannot say 70% or 80% left or something like that,,,,,because who can count the degree in a precise way? So please check the degree by the pictures. If the guitar needs refreting or if there is any defect with the frets (judging by my standards) it will be stated in the description. *(Fret /String) BuzzI check the Fret (String) Buzz by picking normally with light gauge strings (009-046), adjusting the bottom string height (low E) to 2.0 / 2.5 mm and the top string height (high E) to 1.8 / 2.2 mm.(For basses, the bottom string height/E to 2.8 / 3.3 mm and the top string height/G to 2.3 / 2.8 mm.)The guitars are used, so slight buzz could occur. If the fret buzz of the guitar is above the normal standard, the detail is described in the description of the guitar. Anyway, how you feel the fret buzz depends on the player, so any requests to settle repair fee is not accepted. *Cosmetic conditionAs the guitars are used, they might have a number of dents, scratches, blemishes, chips and so on. Unless they are in mint or near mint condition, you cannot describe all of them, so please judge the condition by the pictures. *Electrical partsALL the electrical parts work fine unless there is a particular fault in which case it will be mentioned in the description, but they might have a slight scratchy sound. *Tax and dutiesAs stated above, the auction winner or the buyer is responsible for any and all applicable taxes and duties levied by their government. Before placing a bid or clicking \"Buy it now\" button, please enquire with your local customs for detailed information. *ReturnPlease check the guitar within two days of it being delivered to you. If it differs significantly from the description I will accept the return. Payment made for returned goods and the outward shipping fee you paid will be refunded to you within three business days after the guitar is returned and checked by me on received. Please note that any return freight charges, taxes &/or duties you pay for returning an item are not settled. *Insurance for transportationThe insurance of EMS would cover any damage, loss or the robbery/theft of an item during transportation. The EMS insurance reimbursements might take more than a month to process. ++My Attitude toward business transactionsAs a seller, I do not want to disappoint any buyers when they receiving an item and check it. *Other conditionIf you are new to eBay and have zero feedback or have negative feedback, please contact me before bidding and provide me with your name and your email address for PayPal or your bid will be withdrawn. ++DETAILED INFORMATION ABOUT SHIPPING++*To Asia (First Zone) ..............US$105 such as China (People's Rep.), Guam, Hong Kong, India, Indonesia, Korea (Rep.), Malaysia, Saipan, Singapore, Taiwan, Thailand and so on. *To North America/Central America (Second Zone)..........US$121such as United States, Canada, Mexico and so on. *To Oceania (Second Zone).........US$121such as Australia, New Zealand and so on. *To Middle East (Second Zone) ..........US$121such as United Arab Emirates, Israel, Qatar, Saudi Arabia, Syria, Turkey, Bahrain, Cyprus, Jordan, Kuwait and so on. *To Europe (Second Zone)..........US$130such as Austria, Belarus, Belgium, Bulgaria, Czech, Croatia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland, Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Russia, Slovak, Slovenia, Spain, Sweden Switzerland, Ukraine, United Kingdom and so on. *To South America (Third Zone)..........US$170such as Brazil, Chile and so on. The fees above are by EMS (Express Mail Service) via Japan Post Office from Japan. EMS is the cheapest, safest and fastest of all safe shipping methods from Japan *It takes 3 to 6 days from JAPAN to USA, CANADA, ASIA, and 5 to 10 days to AUSTRALIA and EUROPE. *You can check the status via Track & Trace (The EMS Tracking Service) *Insurance and the handling charge are included in the shipping fee. *Some countries and some regions are not covered by EMS. If the shipping address is not covered by EMS, it needs another shipping method and additional charge. ++Please specify which zone your country belongs to and also please check if the shipping address is covered by EMS at Japan Post website. ++Combine Shipment Discount++Combined shipping will be provided for multiple purchases to save on shipping fees. The rate is dependent on the combined weight of the items. If you like to know it before bidding please let me know the item's listing numbers and I will let you know the combined shipping rate/fee. Please do not hesitate to email me with any questions. Thanks a lot for looking and good luck!", "ItemID": "113335186347", "EndTime": "2018-11-02T10:20:29.000Z", "StartTime": "2018-10-28T10:20:29.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Limited-Offer-Price-FENDER-JAPAN-ST-CHAMP-MINI-BUILT-IN-AMP-STRAT-90S-MINTY-/113335186347", "ListingType": "Chinese", "Location": "Kanagawa", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1133351863478080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/B58AAOSwHYpaC6Ic/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/LagAAOSwAaJaC6If/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/u84AAOSwz~paC6Ij/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/tUwAAOSwIJlaC6Im/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/mlIAAOSwbw1aC6Iq/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/wnQAAOSwA~VaC6Is/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/1wsAAOSwoVNaC6Iw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/DdwAAOSw~vpaC6Iz/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/VYoAAOSwY~1aC6I1/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/oi8AAOSwmBhaC6I5/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/VnYAAOSwUchaC6I9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/KPsAAOSwnCFaC6JA/$_57.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "solemettere", "FeedbackRatingStar": "Red", "FeedbackScore": 2066, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 299.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 299.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "o***h", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 55}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "Limited Offer Price!! FENDER JAPAN ST-CHAMP MINI BUILT-IN AMP STRAT 90S MINTY", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Sunburst"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Brand", "Value": ["Fender"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}, {"Name": "Body Type", "Value": ["Solid"]}]}, "HitCount": 27, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=333124841", "StoreName": "solemettere"}, "Country": "JP", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "14 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 304.99, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 5, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}