{"BestOfferEnabled": true, "Description": "Bought this from local music store November 2018. These originally come with gig bags that is not included. I also bought a Charvel hardshell case that is included. This guitar retails for $899.99 new and the case goes for $219.99. This is a smoking deal on a basically new guitar but is preowned. These are used but in excellent condition. Must sale for medical reasons. I really don't want to. This has never left my music room which is non-smoking climate controlled. Expertly set up with 9s on it. Look at my feedback as a seller and buy with confidence. If you don't see a bid, send me an offer. Charvel Pro Mod San Dimas SD1 HH FR Southern California is a hotbed of guitar innovation, from new musical styles and sounds to hot-rodded high-performance guitar designs. The Charvel Pro-Mod San Dimas Style 1 2H FR, the ideal instrument for dazzling high speed playing, was born and raised in this sunny environment. With scorching sound, stunning quilt-top style and grin-inducing playing feel and performance, this guitar was meant to be onstage.A top-notch performer that's tweaked with the features modern players need, this axe sports a pair of hot-rodded high-output Seymour Duncan JB humbucking pickups directly mounted to the body crank out high octane rock 'n' roll tone with plenty of sweet overtones. The volume control conceals a push/pull coil split to have even more tonal variations on tap while the No-Load tone control operates like a standard tone control from positions one through nine, removing itself from the circuit at position ten for transparent sound, letting the full natural voice of the guitar shine through. Dive to rumbling depths or add a well-placed rising harmonic without sacrificing your tuning with the Floyd Rose FRT-O1000 double-locking recessed tremolo and FRT-O1000 locking nut--simultaneously grooving on the laser-accurate intonation. The two-piece maple neck hosts 22 jumbo frets along with a pair of graphite reinforcement rods to resist bending and warping under environmental stresses. The speed neck profile is designed for lightning fast playing and completely unhindered position shifts while the comfortably rolled fingerboard edges provide the broken-in feel of an instrument with plenty of playing miles on it, and plenty more to go. Charvels are designed with style in mind--after all, they call it show business--and the stunning solid top with a transparent finish and curves in all the right places is sure to dazzle the audience's eyes. A Charvel neck plate, branded die-cast tuning machines and standard strap buttons complete the package, topped off with a spotlight-ready finish that shrugs off the rigors of the road. Ready to spawn waves of sonic bliss, and able to keep up with the most demanding playing, the Pro-Mod San Dimas Style 1 2H FR is a guitar that will stand the tests of time and stage. Body Material: Alder (Quilt Veneer on Trans Colors)- Body Finish: Gloss Polyurethane- Neck: 2-Piece Maple with Graphite Reinforcement, Speed Neck with Rolled Fingerboard Edges- Neck Finish: Hand-Rubbed Urethane- Fingerboard: Maple, 12\" to 16\" Compound Radius (304.8 mm to 406.4 mm)- Frets: 22, Jumbo- Position Inlays: Black Dot- Nut (Material/Width): Floyd Rose R3, 1.6875\" (43 mm)- Tuning Machines: Charvel Branded Die-Cast- Scale Length: 25.5\" (64.8 cm)- Bridge: Floyd Rose FRT-O2000 Double-Locking Tremolo (Recessed)- Pickups: Direct Mount Seymour Duncan JB TB4 Humbucking (Bridge), Direct Mount Seymour Duncan SH1N '59 Humbucking (Neck)- Pickup Switching: 3-Position Blade: Position 1: Bridge Pickup, Position 2: Both Inner Coils, Position 3:Neck Pickup, (Split Engaged) Position 1: Bridge Outer Coil, Position 2: Both Outer Coils, Position 3: Neck Outer Coil- Controls: Volume with Push/Pull Coil Split, No-Load Tone Control- Control Knobs: Knurled Flat-Top- Hardware Finish: Black Nickel, Chrome, Black- Strings: NPS, .009-.042 Gauges Weight, Dimensions, and Manufacturer Part NumbersNeon PinkShipping Weight: 11 lbsShipping Dimensions: 42 x 15 x 5 inManufacturer Part Number (MPN): 2966002519 Transparent PurpleShipping Weight: 12 lbsShipping Dimensions: 42 x 15 x 5 inManufacturer Part Number (MPN): 2966002592 Black BurstShipping Weight: 12 lbsShipping Dimensions: 42 x 15 x 5 inManufacturer Part Number (MPN): 2966002510 Snow WhiteShipping Weight: 12 lbsShipping Dimensions: 42 x 15 x 5 inManufacturer Part Number (MPN): 2966002576 Blemished, Neon PinkShipping Weight: 11 lbsShipping Dimensions: 42 x 15 x 5 inManufacturer Part Number (MPN): 2966002519", "ItemID": "283357997894", "EndTime": "2019-01-29T21:50:08.000Z", "StartTime": "2019-01-29T20:37:36.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Charvel-Pro-Mod-San-Dimas-SD1-HH-FR-Electric-Guitar-Black-Burst-/283357997894", "ListingType": "FixedPriceItem", "Location": "Spring, Texas", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2833579978948080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTU1MVg2OTA=/z/9mwAAOSws2RcSiBc/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzY2WDUyNQ==/z/ymUAAOSwtpJcSiCs/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTU1N1g5Njg=/z/wbcAAOSwH4dcSiCL/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTEyNVg2MjI=/z/4sEAAOSw6~pcSiB5/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/0LUAAOSwBPRcSiBK/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/2eQAAOSw-V1cSiBI/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/IyMAAOSwCgtcSiBJ/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/zDoAAOSwEHhcSiDS/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/O2UAAOSwP85cSiBE/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/YD0AAOSw7aNcSiDf/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg2OTc=/z/RjUAAOSws0pcSiDz/$_12.JPG?set_id=880000500F"], "PostalCode": "77381", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "davidwbickle", "FeedbackRatingStar": "Purple", "FeedbackScore": 531, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 600.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 600.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "i***t", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1071}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Charvel Pro Mod San Dimas SD1 HH FR Electric Guitar, Black Burst", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Charvel"]}, {"Name": "MPN", "Value": ["2965131599"]}]}, "HitCount": 39, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}