{"BestOfferEnabled": false, "Description": "Fantastic guitar with little use. The Lollar pickups sound incredible with this guitar. Vintage cream knobs and pointers, Lollar P-90's pickups, CTS 500k pots, Orange Drop caps, treble bleed circuit, Gotoh locking tuners added. PRS gig bag included. Also included, Paul Reed Smith hard shell case. Everything is in better than excellent condition. Strung with D'Addario 10's. Gibson wiring configuration.Superb PRS Singlecut with SoapbarsThe PRS SE 245 Soapbar solidbody electric guitar packs sleek looks, exceptional playability, and amazing tone into a comfortably familiar form factor. If you grew up playing single-cutaways, the SE 245 Soapbar's 24.5\" scale will instantly feel like home. The SE 245 Soapbar sports two single-coil pickups that'll go from refined to raunchy with a twist of your volume knob. Wrap your hand around the wide-fat profile neck, and let your fingers fly on the rosewood fingerboard with its classic bird inlays. The PRS SE 245 Soapbar will add single-coil spank to your single-cut tones.PRS SE 245 Soapbar Solidbody Electric Guitar at a Glance:Short scale, single cut, and ready to rockA great looking guitarTwo Lollar P-90 Soapbars provide tonal flexibility Short scale, single cut, and ready to rockThe Paul Reed Smith SE 245 Soapbar takes the popular platform of a PRS Singlecut and gives it a vintage-style shorter scale. The 24.5\" scale length will feel immediately familiar in the hands of any fans of older carved-top single-cutaway electric guitars. The scale also offers a slinkier string feel across the fretboard for easier string bending and lighter string tension when chording. This looser string feel also gives you a warmer tone with a fat, singing quality.A great looking guitarThe SE 245 Soapbar is sleek and beautiful. The beveled top of the guitar is not only comfortable to play, but it adds a high-class visual statement to the instrument. Maple binding surrounds the body of the SE 245 Soapbar, offsetting the finish with an organic-looking outline. And the trademark Paul Reed Smith bird inlays are on full display across the length of the 22-fret fingerboard. Sweetwater players agree that these guitars look and play like much more expensive instruments.Two Lollar P-90 Soapbars provide tonal flexibilityP-90 pickups are one of the most versatile single coil pickups made. Jason designed ours not only to sound great but has always built them with materials designed to not deteriorate or become brittle over time. We cut and build our bobbins here in the shop along with all of our other single coil pickups.All of our P-90s are vintage inspired. They're also one of our most popular pickups — and for good reason; we focus on sound, consistency, and reliability. Also, you're not limited by your guitar since you can get our distinct P-90 sound in a soapbar, dog ear, humbucker, or Jazzmaster route. See our entire line of P-90 pickups below.PRS SE 245 Soapbar Solidbody Electric Guitar Features:A shorter-scale Singlecut with soapbar pickups Single-cut mahogany body24.5\" scale for a slinkier feelWide-fat profile mahogany neck with rosewood fingerboardClassic PRS bird inlaysPRS-designed stoptail bridge and tunersGive the SE 245 Soapbar a spin for a vintage-style singlecut with spank.BODYTop Wood Beveled Maple Top and Flame Maple Veneer (no veneer on opaque finishes)Back Wood Thick MahoganyNECKNumber of Frets 22Scale Length 24.5\"Neck Wood MahoganyNeck Shape Wide FatFretboard Wood RosewoodFretboard Inlay BirdsHARDWAREBridge PRS Designed StoptailHardware Type NickelELECTRONICSTreble Pickup Lollar P-90 SoapbarBass Pickup Lollar P-90 SoapbarControls Volume and Tone Controls for Each Pickup with 3-Way Toggle Pickup Selector on Upper Bout", "ItemID": "264082846146", "EndTime": "2018-12-20T22:36:53.000Z", "StartTime": "2018-12-10T22:36:53.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/PRS-SE-245-Soapbar-W-Upgraded-Electronics-/264082846146", "ListingType": "Chinese", "Location": "Wenatchee, Washington", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2640828461468080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/-U8AAOSwyPFb6eyX/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/OjQAAOSwqmhb6eya/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/BWUAAOSwNe9b6eyc/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/YQwAAOSw1iVb6eyg/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/pekAAOSwCK1b6eyi/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/9S0AAOSwa~Fb6eyl/$_57.JPG?set_id=8800005007"], "PostalCode": "98801", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "wenatchee1911", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 330, "PositiveFeedbackPercent": 100.0}, "BidCount": 3, "ConvertedCurrentPrice": {"Value": 600.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 600.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "m***e", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 1}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "PRS SE 245 Soapbar W/Upgraded Electronics", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["PRS"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Model", "Value": ["SE 245 Soapbar"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Body Color", "Value": ["Vintage Sunburst"]}]}, "HitCount": 100, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 610.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 5, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Mint Condition", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}