{"BestOfferEnabled": false, "Description": "G&L S500Guitar has been recently set up; frets 1-4 have been re-fretted by our in-house luthier. The tremolo has been blocked and is currently non-functional. It can be turned functional if desired. Plastic cap on pick up switch is not original. Tremolo bar not included. The Muzic Store Inc.Dobbs Ferry, New York914-693-3200Buy with Confidence! Check out my feedback! Please read this entirely before you purchase!!! If you have questions, please ask and receive a satisfactory answer before you purchase!! By purchasing an item, you are agreeing to the terms below! This item is available to ship from our store!! Please allow 1-3 business days for processing before shipment. Our Products · If the auction states BRAND NEW IN BOX, it means it is BRAND NEW and any applicable warranty will apply.· If the auction states DEMO, it means the item is an IN STORE demo and additional information will be posted the listing.· If the auction states USED, that means the item was PREVIOUSLY OWNEDand warranty will not apply. A description as to any damage, blemishes or integrity of the item will be posted in the listing. Shipping · This item is being shipped VIA UPS Ground!!!· UPS DOES NOT DELIVER TO PO OR APO BOXES. If you need an item shipped to a PO or APO box, please check with us first.· Please note shipping costs listed in our descriptions are for buyers in the Continental USA. If the listing says FREE SHIPPING, then it is FREE SHIPPING!· Free Shipping does NOT apply to Canada, Puerto Rico, Alaska, Hawaii or anywhere else outside of the Continental 48 States!!! If you are in one of these areas, PLEASE check with us first to see if we can fulfill your needs!· Your shipping information will be available on your ORDER DETAILS page as soon as it ships AND will be emailed to your address associated with eBay· If there is any issue shipping your item, you will be notified immediately!!! VERY IMPORTANT – Your store receipt will be included with your packing slip. When you receive your shipment, you should make sure to locate it and keep it for your records. The receipt is also used to register your item should a warranty apply! Payment · We accept payment through PayPal.· On items $150.00 USD or more, PayPal users MUST have a CONFIRMED address.· ALL buyers in New York State will be charged a 7.38% Sales Tax· We do not email payment confirmations. Confirmation is available on your order details page! International Orders (Where Applicable) · The buyer is responsible for paying all customs, duties, and taxes if your country charges them. These duties, taxes, and charges are not included in the item price or shipping price. We do not know how much they will amount to so please contact your country’s customs office for further information prior to purchasing. These charges are normally collected by the delivery/shipping company or when you pick the item up. This should not be confused with additional shipping charges. Returns/Exchanges · We accept returns for defective items only. We offer a replacement of the same item. We must be notified within 7 days of delivery.· We are not responsible for typographical errors and reserve the right to refund.· Please contact us first if there are any issues with your product. Ebay messaging is preferred **All exchanges and issues will be dealt with as expeditiously as possible, but please allow time for us to fulfill your needs! We normally answer within a few hours, however in times of high volume, and Sunday, please allow up to 24 hours.**Regarding Feedback Please leave feedback to show that you are satisfied with your purchase. We always return feedback, but please do not be discouraged if it does not happen immediately. Please allow at least a week for us to return feedback. Please refrain from leaving negative feedback. We are a very flexible company and are willing to resolve any problems you may have. Questions We are more than happy to answer your questions. After all, that’s what we are here for! Please allow at least 24 hours for a response. We answer each question as quickly as possible. Communication is different for each customer. With this in mind, if you have any special needs or concerns, please message us on Ebay and we will do our absolute best to assist you. The Muzic Store Inc.Dobbs Ferry, New York914-693-3200", "ItemID": "173705763188", "EndTime": "2019-01-07T06:51:30.000Z", "StartTime": "2018-12-24T02:49:34.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/G-L-S500-Used-case-/173705763188", "ListingType": "FixedPriceItem", "Location": "Smashing Dealzz New York", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1737057631888080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/UroAAOSwn9VaXjCJ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/2D4AAOSw61haXjCB/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/HGwAAOSwlv9aXjB4/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/IDsAAOSwqfZaXjBv/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/1pcAAOSwi4laXjBg/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/Fh4AAOSwU91aXjBY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/obsAAOSwdTJaXjBR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/STEAAOSwtBdaXjBK/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/aR0AAOSwLUpaXjBC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/SnYAAOSwYNxaXjAo/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/yYIAAOSwkvFaXjAy/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/PW0AAOSwFmxaXjA7/$_57.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "muzicexpress914", "FeedbackRatingStar": "Red", "FeedbackScore": 2416, "PositiveFeedbackPercent": 99.3}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 669.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 669.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "r***n", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 910}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "CA", "GB", "DK", "AU", "GR", "SE", "BE", "FR", "IE", "PL", "ES", "AT", "BS", "MX", "NZ", "CH", "UA", "CL", "CR", "JM", "BM", "IS", "KY"], "Site": "US", "TimeLeft": "PT0S", "Title": "G&L S500 (Used) with case", "ItemSpecifics": {"NameValueList": [{"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["S-500"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Brand", "Value": ["G&L"]}, {"Name": "Body Type", "Value": ["Solid"]}]}, "HitCount": 236, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=769846706", "StoreName": "SmashingDealzz"}, "Country": "US", "ReturnPolicy": {"Refund": "Money back or replacement (buyer's choice)", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalRefund": "MoneyBackOrReplacement", "InternationalReturnsWithin": "14 Days", "InternationalReturnsAccepted": "ReturnsAccepted", "InternationalShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Middle East", "Southeast Asia", "BO", "CO", "EC", "FK", "GF", "GY", "PY", "PE", "SR", "UY", "VE", "PM", "AS", "CK", "FJ", "PF", "GU", "KI", "MH", "FM", "NR", "NC", "NU", "PW", "PG", "SB", "TO", "TV", "VU", "WF", "WS", "AD", "BY", "BA", "BG", "HR", "CY", "CZ", "EE", "FI", "DE", "GI", "GG", "HU", "IT", "JE", "LV", "LI", "LT", "LU", "MK", "MT", "MD", "MC", "ME", "NL", "NO", "PT", "RO", "SM", "RS", "SK", "SI", "SJ", "AI", "AG", "BB", "BZ", "DM", "SV", "GD", "GP", "GT", "HT", "HN", "MQ", "MS", "AN", "NI", "PA", "KN", "LC", "VC", "TT", "TC", "RU"], "GlobalShipping": true, "ConditionDescription": "Guitar is in excellent condition. It has a few small dents and scratches. Guitar is missing a knob.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}