{"BestOfferEnabled": false, "Description": "LOCAL PICKUP ONLY - 90732 Zip Code * 1 Owner * Home use only, never used for gigs * Excellent condition, plays beautifully. From a pet and smoke free home * Epiphone hard case included * Item is for sale AS-IS. Like any used instrument, a professional set up is always recommended. Description- http://www.epiphone.com/News/Features/2015/Joe-Pass-Emperor-II-PRO.aspx The new Epiphone Joe Pass Emperor-II PRO honors the \"President of Bebop Guitar\" and one of the most prolific and groundbreaking electric guitarists in the history of jazz. The Joe Pass Emperor II PRO is a true archtop guitar and features Epiphone's critically acclaimed new ProBucker™ pickups with coil-splitting plus the new Graphtech® NuBone XL™ nut. During his long career, Joe Pass's advanced harmonic knowledge and seemingly endless well of melodic ideas made him the premier accompanist for the top singers and soloists in the world of jazz including Les McCaan, Ella Fitzgerald, Chet Baker, Oscar Peterson, Herb Ellis, Ray Brown, and Milt Jackson. The new Joe Pass Emperor II PRO is a fitting tribute to Joe, who was a great inspiration and friend to Epiphone and guitarists throughout the world. A True Archtop The Joe Pass Emperor-II PRO is a true archtop with a Select Spruce top and classic \"arch\" for optimum tone. The back and sides of the Emperor II are made from Laminated Flame Maple and the Emperor-II PRO is available in three beautiful finishes--Natural, Wine Red, and Joe's favorite, Vintage Sunburst. The top also has a bound \"tortoise\" style pickguard shaped to House of Stathopoulo's unique profile along with our signature metal \"E\". The Emperor-II PRO has a hand-set 3-piece laminated hard Maple neck with a Rosewood fingerboard that has beautiful pearloid block inlays, 20 medium jumbo frets, and is topped off with the Epiphone-vintage style \"tree of life\" design seen on the best Epi archtops since the late 1930s. The Emperor-II PRO features the new Graphtech® NuBone XL™ nut that is as hard as bone but will last a lifetime. Graphtech molds and engineers each NuBone XL™ nut for consistent tone and string balance as well as precise string spacing. The Emperor-II PRO has Grover™ Rotomatic™ 18:1 ratio machine heads for fast, intuitive, and worry-free tuning. The black and white truss rod cover has an elegantly lettered \"Joe Pass Emperor-II PRO\" in white. ProBucker Humbuckers The Joe Pass Emperor-II PRO gets its name from the new critically acclaimed ProBucker™ humbuckers. The first generation of humbuckers were made at the Epiphone/Gibson factory in Kalamazoo, Michigan in the late 50s and have acquired a mythical status among guitar players. Epiphone ProBucker pickups have that elusive tone because they are made with the same alloy as the originals--18% Nickel Silver unit bases and covers--along with Sand cast Alnico II magnets and high quality 4-conductor lead wire. Each ProBucker pickup is also vacuum wax potted to eliminate microphonics. The Emperor-II PRO has a ProBucker-2™ in the neck position and a slightly hotter ProBucker-3™ in the lead position. Both pickups also have coil-splitting via their individual volume controls. Coil-splitting allows a player to turn a humbucker pickup into a single coil pickup for endless tone combinations. The Joe Pass Emperor-II PRO also sounds great unplugged and at low volume for players who strive for those classic horn-like tones like Joe Pass played. Each ProBucker pickup's volume and tone are attenuated by Top Hat control knobs with metal inserts that are spaced slightly farther apart than a typical archtop along with a 3-way pickup selector with an ivory-colored toggle cap. Epiphone-tough Hardware The Emperor-II PRO has rock solid nickel hardware in elegant gold and a vintage style gold scroll tailpiece, a design inspired by vintage Kalamazoo-made archtops. The Emperor-II PRO is strung at the factory with Joe Pass-approved D'Addario® 10-46 gauge strings. And setting the intonation for the Emperor-II PRO is easy with a floating Rosewood bridge with thumbwheels for quick height adjustment.", "ItemID": "123471489765", "EndTime": "2019-01-06T03:07:36.000Z", "StartTime": "2018-11-05T22:46:41.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2015-Epiphone-Joe-Pass-Emperor-II-PRO-Archtop-Jazz-Guitar-/123471489765", "ListingType": "FixedPriceItem", "Location": "San Pedro, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1234714897658080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Kf0AAOSwZ1hb4MMf/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/oAMAAOSw2~Zb4MMh/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/bjkAAOSwPrtb4MMq/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTE1MlgxNjAw/z/~uUAAOSworhb4MMm/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Vu0AAOSwMjpb4MMk/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/t-0AAOSwkHFb4MMj/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/vRgAAOSwEOJb4MMo/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/Q4QAAOSweX5b4MMd/$_12.JPG?set_id=880000500F"], "PostalCode": "90732", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "njwhite39", "FeedbackRatingStar": "Purple", "FeedbackScore": 539, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 549.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 549.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "_***_", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 165}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["None"], "Site": "US", "TimeLeft": "PT0S", "Title": "2015 Epiphone Joe Pass Emperor II PRO Archtop Jazz Guitar", "ItemSpecifics": {"NameValueList": [{"Name": "Body Material", "Value": ["Maple"]}, {"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "Model Year", "Value": ["2015"]}, {"Name": "Non-Domestic Product", "Value": ["Yes"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Soundboard Style", "Value": ["Archtop"]}, {"Name": "Country/Region of Manufacture", "Value": ["Indonesia"]}, {"Name": "Body Type", "Value": ["Jazz"]}, {"Name": "Body Color", "Value": ["Wine Red"]}, {"Name": "Features", "Value": ["Volume Knob", "With Pickup"]}, {"Name": "Size", "Value": ["Full Size"]}]}, "HitCount": 936, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Excellent Condition", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}