{"BestOfferEnabled": true, "Description": "-This guitar, for all intents and purposes is a virtually new guitar with only a few hours of playing time on it!- Hello everyone! Today, you are in for a beautiful treat! If you are looking at this post, you already know what it is. It is the chambered (about 9lbs) and most highly regarded 2014 Gibson Les Paul Standard PLUS Limited Edition 120th Anniversary AAA Top in the most beautiful and VERY RARE Brilliant Red finish. The top is beautiful and the pictures don’t do it justice. It is equipped with the original Burstbucker I and II, which, in my opinion are some of the better Gibson pickups our there. The burst is MUCH more prominent and pronounced in person. Even though it is chambered, it still weighs about 9lbs. As you can see, the top is gorgeous and the guitar is in MINT condition with only a few hours of playing time on it. The original frets have 100% life left, and show no wear, just like the rest of the guitar that shows no real wear at all, but I’ll let the pictures do the talking. Like mentioned before, the top is beautiful and the guitar has no buckle rash whatsoever; the back looks like a mirror and just like it came from the factory. It comes with the OHSC that is new as well, the COA/Gibson Checklist is included as well and everything else that came with the purchase. It has push pull controls and comfort and playability is off the charts. Everyone knows that these chambered models are killer guitars and very underrated especially these 2014 120th anniversary Limited Edition AAA models. Usually, when they appear for sale, they sell pretty much right away, but I’m pretty sure you are aware of that. New, this guitar cost a fortune and from me now, you can get it for much, much cheaper. This guitar was purchased about 5/6 years ago, set up, played for a few hours and then put away til now, without ever leaving the house and the case. It was cleaned very regularly and shows no tarnishing or any other type of wear that usually shows up from age; this thing is immaculate and was stored perfectly in a climate controlled space. The neck is the 60’s slim neck that is not as slim as these new slim taper necks, but definitely slimmer than the 50’s. The tone and sustain is simply ridiculous, but I’ll let you be the judge. Unplugged, the strings ring out loudly and endlessly and well above average and this is the way I determine the quality of my Gibsons. If it sounds good unplugged, it’s a keeper, and this one goes beyond that. Plugged in to my Marshall SL5 it is a match made in heaven and the tone and sustain is second to none. It has been set up, the frets are polished and it is ready to rock. Honestly, here is that rare opportunity to purchase a beautiful, great condition Gibson Les Paul Standard with a killer top at a really, really good price compared to what other people are selling these for when they do appear and in much, much worse condition. Don’t let this one slip away as I know it will not last and I speak from experience. This model did not come with the pickguard installed, so there are no ugly holes or damage from pickguard installation. Due to the very attractive price and the immaculate condition of this guitar, as well as parts included in the sale, I know that I will be contacted a lot and with that said, I won’t be able to hold the guitar for anyone; it’ll be first come first serve. Furthermore, I reserve the right to end this sale at any time should my guitar sell locally or on other websites listed. I’ve described this guitar to the best of my ability. Please ask any questions you may have and I’ll try to answer in a timely manner. Flat rate shipping of $85 anywhere in the CONUS.", "ItemID": "273666886626", "EndTime": "2019-01-21T13:02:06.000Z", "StartTime": "2019-01-21T12:24:51.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2014-Gibson-Les-Paul-Standard-LE-120th-Anniversary-AAA-Top-Mint-OHSC-60s-Neck-/273666886626", "ListingType": "FixedPriceItem", "Location": "San Diego, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2736668866268080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/Yf4AAOSwtYZcMwmH/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/DpgAAOSw5UFcMwmX/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/yQ4AAOSwZnpcMwmL/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/eGQAAOSwJ~xcMwmZ/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/b1cAAOSwiJZcMwmM/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/z1EAAOSwh7tcMwmO/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/9n4AAOSwd7FcMwmQ/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/IfQAAOSw3-9cMwmR/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/z1kAAOSwh7tcMwmT/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/5uMAAOSwxHlcMwmV/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/G-EAAOSwkAxcMwmJ/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMTk4/z/QI8AAOSwG49cMwmW/$_12.JPG?set_id=880000500F"], "PostalCode": "92122", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "us.vejzo", "FeedbackRatingStar": "Blue", "FeedbackScore": 65, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 2090.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2090.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "r***r", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 135}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2014 Gibson Les Paul Standard LE 120th Anniversary AAA Top Mint OHSC 60s Neck", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Product Line", "Value": ["Gibson Les Paul"]}, {"Name": "Model Year", "Value": ["2014"]}, {"Name": "Model", "Value": ["Les Paul Standard"]}]}, "HitCount": 13, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}