{"BestOfferEnabled": false, "Description": "Price drop to $1550 plus shipping. That's as low as it's going to get. This one pains me to even think of getting rid of and if it doesn't sell, I'm going to be honest.. I won't be that disappointed. I pretty only play at home and have other \"beater\" guitars that I keep out on stands within easy reach, so this one stays in the case most of the time. I'm liquidating some equipment to free up some cash (but not desperate to sell) and this guitar just doesn't get played that much so I'm throwing it out there to see if someone wants it more than I do. Which reminds me, see my other auction for a really nice Marshall JVM410H that I have up as well. Up for your consideration is a really fine example of PRS quality and workmanship! This is a 2000 PRS Custom 22 with 10 Top and birds... Absolutely stunning flame maple top on this guitar, just check out the pictures! Very resonant and light guitar, coming in at only 7.7 lbs on a digital bathroom scale. Guitar is in overall excellent condition, with a minor amount of tarnishing on the hardware. There are some light pick scratches and polishing/swirl marks, but no major dents/dings or damage. Neck is the wide/fat carve and frets are in great condition, with some VERY minor wear in the open positions. Neck is straight and true, and it plays wonderfully up and down the neck. PRS locking tuners, with ebony tuner buttons. If you want that Les Paul type tone, but don't want the back breaking weight.. This is the guitar for you! I bought this guitar from the original owner, that had it for 17 years. He told me the color was a Trans Merlot that was a limited edition color that year, but it kind of reminds me of the PRS color Angry Larry (without the black bursting around the edges). Guitar comes with the original case in good condition, may have a few scuffs on it here or there but no rips or tears. Also includes all the case candy, tools, case keys and the original PRS sticker that shipped with the guitar! Here are the specs: 2000 PRS Custom 22 with 10 Top and birdsWide/Fat neck carveDragon II pickups in both the bridge and neckFive way rotary pickup selectorBuild date of 03/17/2000 This really is a very nice guitar, in excellent condition. If you're looking for a super clean example of this particular model, this is it! You'd be hard pressed to find one in nicer condition that this one. Please see the attached pics, as they are part of the description. Check my feedback, I have sold and shipped many high dollar guitars and will pack this one with care and fully insure it. As such, shipping will be a flat fee of $75 dollars due to the cost of packing materials, the overall size of the finished package and insurance. Thanks for looking, and if you have any questions or need more pics please feel free to reach out to me. I will be happy to assist. Sorry, U.S. only on this auction due to the size/weight of the item. No international bidders. Please, if you have less than 5 feedback or a history of negative feedback you must contact me prior to bidding or your bid will be removed without warning. Shipping costs will be a flat rate of $75 for insured shipping to anywhere in the Contiguous United States (lower 48 states, shipping to Alaska and Hawaii will be higher and quoted after the sale). As always, local pickup is fine. The item will remain unboxed until after the auction is over, so that any requests for additional pictures can be accommodated. As such, there will be a three business day handling time after the action closes to allow me to properly pack the item for shipment. Please see any and all pictures, as they are part of the description. You will have a 24 hour inspection period from proof of delivery (unless picked up in person), after that the item is yours with no returns. If you pick up the item in person, it's yours once you take possession of it with no returns. While I strive to provide the most accurate description of my items, and include as many detailed pictures as Ebay will allow, all items are sold \"as is\" with no warranty expressed or implied. I reserve the right to end this auction without explanation at any time, for any reason. Thank you for looking, and good luck!!", "ItemID": "153323085041", "EndTime": "2019-01-06T06:51:17.000Z", "StartTime": "2018-12-31T03:30:28.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2000-PRS-Paul-Reed-Smith-Custom-22-10-Top-and-Birds-Amazing-Top-Must-See-/153323085041", "ListingType": "FixedPriceItem", "Location": "Harrison, Arkansas", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1533230850418080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/CSoAAOSwMQ1cKXu1/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/eCsAAOSw76lcKXvL/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/D0wAAOSwhY9cKXva/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/WLwAAOSwVMJcKXvi/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/L60AAOSw55FcKXvp/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/~zYAAOSwe9FcKXwW/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/MREAAOSw~xtcKYGR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/eHEAAOSwNe9cKYGB/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/6oMAAOSwIbtcKYGH/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/GesAAOSwG25cKXwu/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/x-AAAOSwnLtcKXw3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/I6gAAOSwZddcKXxD/$_57.JPG?set_id=8800005007"], "PostalCode": "72601", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "4sfedmr2", "FeedbackRatingStar": "Purple", "FeedbackScore": 569, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1550.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1550.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "1***t", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1684}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2000 PRS Paul Reed Smith Custom 22 with 10 Top and Birds! Amazing Top! Must See ", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["PRS"]}, {"Name": "Model", "Value": ["Custom 22"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Material", "Value": ["Mahogany/Maple"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Features", "Value": ["Hard Tail"]}, {"Name": "Body Color", "Value": ["Trans Merlot/Angry Larry"]}, {"Name": "Model Year", "Value": ["2000"]}, {"Name": "Size", "Value": ["Full Size"]}, {"Name": "Product Line", "Value": ["Paul Reed Smith Custom 22"]}]}, "HitCount": 325, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "ConditionDescription": "Excellent Condition!  Minor amount of tarnish on the hardware, but the guitar is nearly 19 years old so it's to be expected. Comes with Factory Case, and all case candy right down to the original PRS sticker!", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}