{"BestOfferEnabled": true, "Description": "Silvertone Reissue Model 1449 Electric Solid Body Guitar Have Questions? Send us a message and we will be glad to help you! Amped-up One of the most clever and well-known concepts in the early ’60s guitar boom was the Silvertone Amp-in-case line. For well under $100, you could get a guitar that came in a case featuring a 5-watt (later, 6-watt) tube amp built right in. Just open the case halfway, stand it up, switch it on, and wail. The original guitar in the 1962 kit (1448) was a single pickup, short-neck model. A year later, the 2-pickup 1449 was introduced and the Amp-in-case really took off. The 1449 is the rarest of the breed, being replaced by the almost identical red-burst 1457 in 1964. This guitar screams This reissue is the real deal Model 1478 Features: · Construction: Solid · Material: Mahogany · Top Material: Maple · Back Material: Maple · Neck Material: Mahogany · Neck Shape: 'C' · Inlays: Pearl Block · Neck Attachment: Bolt-on · Truss Rod: Dual Action · Binding: White · # Of Frets: 21 · Fret Material: Nickel Silver · Fingerboard: Rosewood · Nut Material: PPS · Pickups: Silvertone Lipstick Single Coil · Controls: Volume (2), Tone (2) · Switch3-Way Toggle · Output Jack: 1/4\" Mono · Pickguard: Single ply white · Tuners: Sealed · Finish: Chrome · Bridge: Thru-Body Adjustable · Scale Length: 24-3/4 · Nut Width: 1-11/16\" · 12th Fret Width: 1-7/8\" · Fb Radius: 12 ½” · Does Not include a case or a gigbag Condition: When this model came into the refurbishing center they could not find anything wrong. It is in Excellent original clean condition and has had no modifications made to the instrument. May show minor signs of playing/handling from inspection, cleaning, testing, and setup. There are no other flaws, dings, scratches, repairs, or imperfections noted. It is set up to standard specifications. o *If electronics are included and in the specifications section they will be working as they should*. o *The instrument is stamped used on the back of the headstock and assigned a new serial number by the Refurbishing center and replaces the original serial number as required by the manufacturer. o *Used, Re-Manufactured and/or Refurbished guitars do NOT include a factory warranty. An Amazing deal on a great sounding and playing instrument, as with any auction/sale please look at all the pictures, descriptions, etc. and ask question before bidding, making offers, or purchasing. Each guitar and stringed instrument we sell has been hand-picked, fully inspected, and cleared by a certified luthier from MIRC, the largest Refurbishment distribution/reclamation center in the USA that obtain guitars direct from the factory. Our Guitars Look and Play Great! Many of the guitars we sell are Discontinued Models, Old Stock, surplus, etc., (and are in excellent clean original condition with the exception of testing, inspection, cleaning, etc.) Per the manufacturer we are required to list Epiphone and Taylor guitars as seller refurbished. All our instruments are checked and double checked by both our store and the manufacturer refurbishing center in the USA. Any instruments with blemishes, visible flaws, or any repairs are detailed and outlined in the description and include pictures of the specific flaw. Free Shipping is for the lower USA 48 All other States, provinces, APO/FPO addresses, and/or international buyers please contact us prior to purchasing for a shipping quote/Price to your Location Shipping: Shipping guitars comes down to more than just the price shipping companies charge to ship your instrument. Due to cost variances by location of customer, we sell each instrument at the best price we can to provide you, the customer, a great value. By doing this we do not include any extras in the sale price for shipping 1. We carefully package and take the extra expense and time to package your item so it arrives safely 2. Each guitar that does not get shipped with a case is double boxed and securely wrapped in the first box to protect your investment, (guitars with cases are securely packaged in the case the same as if placed in the first containment box) 3. The instrument is detuned and the body, neck, and headstock are secured to prevent movement using packing paper or other materials 4. We then securely place the box into a heavy duty guitar box and carefully package for shipment using packing paper and other materials a. These boxes and packing materials cost extra and thus raise the cost to ship your guitar which is not reflected in the purchase price of each instrument but in the shipping cost; as destinations, insurance , etc. change the cost of each shipment 5. We strive to provide you with the best experience possible by a. Packaging and shipping within a 24 hour period once payment is received b. We offer economy and standard shipping selections c. Once shipped please let us know if there are delayed delivery times and/or delays so we may help by contacting d. All instruments require a signature for delivery. This is a best practice and provides for a safe and secure transaction for both the seller and buyer All International buyers are Responsible for any and all Duties, Taxes, and/or Import Fees All International Sales are Final International Buyers Must contact me for shipping fees prior to purchasing if not listed in the shipping section of the listing Pictures are of actual guitar for sale!! Due to the High Gloss Finish The Reflections you see are due to lighting They are not imperfections in or of the guitar", "ItemID": "401685769263", "EndTime": "2019-01-15T19:54:21.000Z", "StartTime": "2019-01-13T19:56:28.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Silvertone-Reissue-Model-1449-Electric-Solid-Body-Guitar-/401685769263", "ListingType": "FixedPriceItem", "Location": "Palmyra, Virginia", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/4016857692638080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTE1MlgxNjAw/z/6iAAAOSwTflcO5fI/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/Nzc1WDE2MDA=/z/OWcAAOSwNTNcO5er/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MzE4WDE2MDA=/z/-GgAAOSw~2VcO5ep/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTUyN1gxNjAw/z/IfUAAOSwGq5cO5ea/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODUxWDE2MDA=/z/GmIAAOSwK0tcO5ew/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/Mzk2WDE2MDA=/z/NNkAAOSwG49cO5et/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/Nzg2WDE2MDA=/z/nfMAAOSw-QBcO5ei/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNDg2/z/jtkAAOSwEGBcO5ee/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAyOFgxNjAw/z/Co8AAOSwKqpcO5en/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTM2WDE2MDA=/z/tzoAAOSwaPNcO5ey/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDgwWDE2MDA=/z/nsoAAOSwhrpcO5fC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjY2WDE2MDA=/z/Q6cAAOSw09NcO5ek/$_57.JPG?set_id=8800005007"], "PostalCode": "22963", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "cogswheel_music", "FeedbackRatingStar": "Red", "FeedbackScore": 3246, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 324.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 324.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "e***n", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 611}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Silvertone Reissue Model 1449 Electric Solid Body Guitar", "ItemSpecifics": {"NameValueList": [{"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["1449"]}, {"Name": "Country/Region of Manufacture", "Value": ["Indonesia"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Brand", "Value": ["Silvertone"]}, {"Name": "Body Type", "Value": ["Solid"]}]}, "HitCount": 28, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=49435803", "StoreName": "Cogswheel Music and Guitar Co"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Middle East", "Oceania", "Southeast Asia", "South America", "GL", "MX", "PM", "RU", "AL", "AD", "BY", "BE", "BA", "BG", "HR", "CY", "CZ", "EE", "GI", "GR", "GG", "HU", "IT", "JE", "LV", "LI", "LT", "LU", "MK", "MT", "MD", "MC", "ME", "RO", "SM", "RS", "SK", "SI", "SJ", "UA", "VA"], "GlobalShipping": false, "ConditionDescription": "When this model came into the refurbishing center they could not find anything wrong. It is in Excellent original clean condition and has had no modifications made to the instrument. May show minor signs of playing/handling from inspection, cleaning, testing, and setup. There are no flaws, dings, scratches, repairs, or imperfections noted. It is set up to standard specifications.The instrument is stamped used on the back of the headstock and assigned a new serial number by the Refurbishing center and replaces the original serial number as required by the manufacturer  *Used and Re-Manufactured/Refurbished guitars do NOT include a factory warranty.An Amazing deal on a great sounding and playing instrument, as with any auction/sale please look at all the pictures, descriptions, etc. and ask question before bidding, making offers, or purchasing.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}