{"BestOfferEnabled": true, "Description": "EVH Wolfgang Special - Vintage White Solidbody Electric Guitar with Basswood Body, Maple Neck, Maple Fingerboard, 2 Humbucking Pickups, and EVH style Tremolo Vintage White in Very Good condition, no marks or scratches. No case is included. This guitar came from an Estate Sale. It was stored in a Taylor gig-bag. I will ship it in the high-quality Taylor Gig-Bag. thanks foe bidding! Built to Eddie Van Halen's specifications, this EVH Wolfgang Special solidbody electric guitar is a well-designed, ferocious shred-machine. This Wolfgang Special's basswood body generates insane tonal resonance and sustain, which will lend a fluid, glasslike quality to your legato phrases. Humbucker pickups will make your amp explode with crunchy tone. You'll be delighted by the hand-rubbed oil finish on this guitar's fast-playing neck as your hand slides effortlessly down its smooth maple fingerboard. EVH Wolfgang Special Solidbody Electric Guitar at a Glance: A complete and total shred machine Quartersawn neck for stability and playability From its basswood body to its maple neck and fingerboard, this EVH Wolfgang Special just screams quality - and that's just the tonewoods! This gorgeous guitar is made for serious playing, with a compound-radius fingerboard, an EVH Floyd Rose style bridge and locking nut, and direct-mounted EVH humbuckers. The controls are top-notch, too: you get a handy 3-way pickup selector switch and low-friction volume and tone pots for total control over your tone and volume. All the components come together to make a guitar that looks absolutely stunning and plays even better. Quartersawn neck for stability and playability The neck is one of the most important aspects of any instrument, which is why this EVH Wolfgang Special features a quartersawn maple neck. Besides looking good, the straight grain of quartersawn necks is significantly more stable than plain-sawn necks and less likely to warp, twist, or shrink. You'll also love the playability and feel of the compound-radius fretboard on this Wolfgang Special. The fretboard radius goes from 12\" at the nut to a comfortable and flat 16\" radius on the upper frets. First gaining popularity in the 1980s, the Floyd Rose style tremolo's locking design keeps your guitar in tune, even if you like to perform extreme pitch pyrotechnics. You can force the whammy bar all the way down to the guitar's body for psychotic dive-bombing. Best of all, no matter how hard you're shredding, you'll maintain your tuning stability. EVH Wolfgang Special Solidbody Electric Guitar Features: Designed by rock legend Eddie Van Halen for ultimate shredability Basswood body delivers resonant tone, sustain, and crunch Compound-radius allows for exceptional speed and comfort Floyd Rose style tremolo allows for twisting, bending, and dive-bombing Belly cut allows the guitar to fit comfortably against your torso The EVH Wolfgang Special solidbody electric guitar puts the tonal tool of a legendary guitarist in your hands! SpecificationDetail Body TypeSolidbody Body ShapeWolfgang Special Left-/Right-handedRight-handed Number of Strings6 Body MaterialBasswood Top Material Maple Body FinishGloss Polyurethane ColorVintage White Neck MaterialMaple Fingerboard MaterialMaple Fingerboard InlayBlack Dots Number of Frets22 Scale Length25.5\" Nut Width1.625\" Bridge Floyd Rose style Locking Tremolo TunersChrome Neck Pickup Zebra-Humbucker Bridge Pickup Zebra-Humbucker Controls1 x volume, 1 x tone, 3-way pickup selector", "ItemID": "253966899998", "EndTime": "2018-11-07T14:25:57.000Z", "StartTime": "2018-11-05T18:45:39.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/EVH-WOLFGANG-SPECIAL-Electric-Guitar-Vintage-White-/253966899998", "ListingType": "Chinese", "Location": "Henderson, Nevada", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2539668999988080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg2NTQ=/z/tskAAOSwElhb4Iu5/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/euoAAOSwyWxb4IvI/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/IZgAAOSw4xpb4IvL/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5NTY=/z/hWcAAOSwi7Vb4Iu7/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/A7MAAOSwn7Rb4Iu-/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/iSAAAOSwujJb4IvB/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/Yi8AAOSwSxRb4IvE/$_12.JPG?set_id=880000500F"], "PostalCode": "89014", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "duanebroder", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 337, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 299.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 299.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***u", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1187}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "CA", "GB", "DK", "RO", "SK", "BG", "CZ", "FI", "HU", "LV", "LT", "MT", "EE", "AU", "GR", "PT", "CY", "SI", "JP", "CN", "SE", "KR", "ID", "TW", "TH", "BE", "FR", "HK", "IE", "NL", "PL", "ES", "IT", "DE", "AT", "IL", "MX", "NZ", "SG", "CH", "NO", "SA", "UA", "AE", "QA", "KW", "BH", "HR", "MY", "CL", "CO", "CR", "PA", "TT", "GT", "HN", "JM", "AG", "AW", "BZ", "DM", "GD", "KN", "LC", "MS", "TC", "BB", "BD", "BM", "BN", "BO", "EG", "GF", "GG", "GI", "GP", "IS", "JE", "JO", "KH", "KY", "LI", "LK", "LU", "MC", "MO", "MQ", "MV", "NI", "OM", "PK", "PY", "RE"], "Site": "US", "TimeLeft": "PT0S", "Title": "EVH WOLFGANG SPECIAL Electric Guitar Vintage White", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["EVH"]}, {"Name": "Model", "Value": ["EVH WOLFGANG SPECIAL"]}, {"Name": "Body Color", "Value": ["White"]}]}, "HitCount": 0, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 304.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": true, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}