{"BestOfferEnabled": false, "Description": "Up for sale, a 2008 Fender Telecaster Custom '62 American Vintage Reissue with a double bound body and nitro lacquer Surf Green finish. A rare example available only for a few short years, this discontinued model features an alder body, maple neck, and slab rosewood fretboard. This Tele has a big, ringing acoustic voice which translates well through the original pair of black bobbin single coil pickups. While the bridge pickup is all sparkle and twang, the neck pickup has a richness and bell-like chime. With both pickups engaged, it's a \"best of both worlds\" scenario that's equal parts cut and warmth, ideal for rhythm work. The guitar weighs in at 8lbs 8oz. Professionally setup here at Mike & Mike's Guitar Bar and freshly restrung with 10-46 strings, this guitar is dialed in for optimal intonation and action.The maple neck has a round C shaped profile with a bit of chunk, good shoulder, and slightly more heft as you move up the fretboard. On the thick slab rosewood fretboard, the frets retain their full factory height, with zero wear and perfectly rounded crowns. The guitar plays well in all registers with no buzzing or dead spots, and the neck is arrow straight with ideal relief. The nut measures a full 1 11/16\" in width. On the headstock, the original Kluson-style tuners and Fender \"Telecaster Custom\" decal are intact and clean.All of the electronics work as they should and are untouched since the guitar left the Fender factory. The chrome hardware is clean as can be and provides a great contrast to the gloss nitro lacquer Surf Green finish. Cosmetically, the guitar shows one spot of finish touchup adjacent to the forward strap button and a couple smaller touched up nicks where the forearm crosses the top. There are a few finish scratches on the back and a couple nicks around the slab body edges as well as one darker spot of discoloration near the rear strap button on the back from the instrument sitting on a strap for an extended period of time. This Telecaster Custom is a rare, discontinued model with a host of desirable Pre-CBS golden era Fender features and a custom color finish on the double bound body! The original brown tolex Fender G&G hardshell case is included. The case has working latches and original handle, and while the tolex on the exterior exhibits some wear, the case is functional and sturdy. Check out our shop \"Mike & Mike's Guitar Bar,\" and please let us know if we can answer any questions!Shipping in the continental USA will be $65, fully insured and shipped via FedEx Ground. Expedited shipping available for an additional fee at buyer's request. We will happily ship WORLDWIDE, but please contact us for an accurate international shipping quote before bidding or buying, as cost varies by buyer location. International orders will be declared as “merchandise,” and the value of merchandise will be declared as the amount paid. We cannot declare anything as a gift or for a lesser value. No exceptions! The customer is responsible for all taxes and duty, which may be collected upon delivery, as well as any additional charges involved with import. We have all necessary CITES paperwork in-hand to ship rosewood worldwide.We do our best to describe all items with honesty and accuracy, but to be sure, please contact us with any questions or concerns prior to bidding or buying. We require payment within 48 hours of auction end. In the unlikely event of a return, buyer pays all shipping costs. Your positive feedback and five star ratings are very important to us, and we appreciate your communication in resolving any issues!", "ItemID": "163294835891", "EndTime": "2019-01-19T05:52:36.000Z", "StartTime": "2018-10-04T07:18:17.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2008-Fender-Telecaster-Custom-62-American-Vintage-Reissue-Guitar-Surf-Green-/163294835891", "ListingType": "FixedPriceItem", "Location": "Seattle, Washington", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1632948358918080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/JeoAAOSwW4dbtbie/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/MVEAAOSwDP1btbis/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/ScAAAOSwnN9btbiv/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/NZYAAOSwz3Rbtbiy/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/d6wAAOSwgYdbtbi1/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/yvwAAOSwVEBbtbin/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE0M1gxNjAw/z/NxIAAOSwCgNbtbip/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE2NlgxNjAw/z/~hAAAOSwFzZbtbih/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/2rkAAOSwl1pbtbik/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/~9UAAOSwDOpbtbi6/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/JegAAOSwnFpbtbi9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA3MFgxNjAw/z/-cEAAOSws29btbi3/$_57.JPG?set_id=8800005007"], "PostalCode": "98117", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mmguitarbar", "FeedbackRatingStar": "Red", "FeedbackScore": 2591, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1999.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1999.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "4***m", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 304}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "2008 Fender Telecaster Custom '62 American Vintage Reissue Guitar Surf Green", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "Model", "Value": ["American Vintage '62 Telecaster Custom"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Surf Green"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Material", "Value": ["Alder"]}, {"Name": "Model Year", "Value": ["2008"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}]}, "HitCount": 1737, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=269063702", "StoreName": "Mike and Mikes Guitar Bar"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}