{"BestOfferEnabled": false, "Description": "CAREFULLY READ ITEM DESCRIPTION AND OUR TERMS OF SALE. Thanks— ITEM DESCRIPTION:When it comes to great top-shelf dual-channel parametric EQ's, the Avalon AD-2055 ranks with the best of `em. If you require exacting dual channel Class A equalization (and who doesn't), then this clean AD-2055 is for you. This particular unit is in excellent preowned condition and shows nothing but light signs of previous handling and use. The unit is fully functional and ships with the external B2 power supply and din connecting cable. Anyway, this is a great unit at a reasonable price and is as pictured. Unit will be carefully boxed up for bulletproof protection while in transit.Contact with questions. ROCK ON!PAYMENTPayment by verified Paypal, Paypal credit, echeck, or credit card accounts.SHIPPINGWE SHIP WORLDWIDE ALL BUYERS MUST BE EBAY VERIFIED AND HAVE CONFIRMED PAYPAL ACCOUNTS/ADDRESSESWe typically ship within 24 business hours of payment. All items ship with tracking and insurance. Shipments to Hawaii, Alaska, and Porto Rico require additional expense; contact us for a quote. International shipments are via USPS EMS International Signature Express.All shipments MUST be delivered to the buyer's confirmed Ebay/Paypal physical address and ship with insurance and signature conformation of delivery.NOTE: We cannot release shipments to any alternative address. Any attempt to reroute a shipment will trigger the item's interception and return, with a 20% restocking fee. To insure both our safety and your peace of mind, there is no exception to these buying/shipping terms.RETURN POLICY: Returns are authorized in the rare event that an item is damaged and arrives other than it is pictured and described. Returns are not accepted simply because one changes their mind or is unfamiliar with how to operate an item. Refunds are made for sale price minus original shipping cost. Customer is responsible for return shipping and insurance. *NO REFUNDS or exchanges on merchandise shipped outside the United States.RETURNS: ALL International Shipments are nonreturnable; PERIOD!Return shipping is the obligation of buyer, not seller. Thanks—ROCK HARD, ROCK STEADY, ROCK FRIGGIN' ON!", "ItemID": "303037276888", "EndTime": "2019-01-29T10:13:58.000Z", "StartTime": "2019-01-22T03:19:37.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Avalon-Design-AD2055-Dual-Channel-Pure-Class-Parametric-Equalizer-AD-2055-/303037276888", "ListingType": "FixedPriceItem", "Location": "Fullerton, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/3030372768888080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NzM3WDE2MDA=/z/MPYAAOSwmFxcOVef/$_57.JPG?set_id=8800005007"], "PostalCode": "92835", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "metaunstable", "FeedbackRatingStar": "Red", "FeedbackScore": 2454, "PositiveFeedbackPercent": 98.1}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 2414.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2414.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "u***9", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 1}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "Avalon Design AD2055 Dual-Channel  Pure Class A Parametric Equalizer AD 2055", "ItemSpecifics": {"NameValueList": [{"Name": "Model", "Value": ["AD2055"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Brand", "Value": ["Avalon Design"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}]}, "HitCount": 95, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Great preowned condition, ships with power supply and cable.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}