{"BestOfferEnabled": false, "Description": "I purchased this Charvel new in early 2011, it has been kept in prime condition and played occasionally. The Floyd Rose tremolo is excellent, stays in tune like a champ, and is non-recessed which is great. Came with Dunlop strap locks installed, hardware is included. Also includes premium SKB hardshell Charvel case with keys. The guitar is very clean overall, no marks on the body, and the neck & fretboard are nice too. There are some minor signs of usage/play on fretboard since it is 8 years old. The edges of the fretboard are very smooth, I believe they're rolled edges. Here's the original 2011 guitar listing info from Guitar Center's Website: Part of Charvel's Pro-Mod Series, the So-Cal Style 1 HH is jammed-pack with high-performance specs and mods. The 25-1/2\" scale alder body is crafted into the ultra-comfortable So-Cal shape and is mated to a 1-piece quartersawn maple neck. The compound radius (12\"-16\") fretboard is fleet and sweet for chording on the low end and extreme bending in the upper range of its 22 jumbo frets. The So-Cal is powered by a DiMarzio Evolution humbucker in the neck position and a DiMarzio Tone Zone in the bridge. Just as Eddie established in the '80s, all you need is a volume knob to control this beast. Grover Mini Rotomatics tuners and Floyd Rose FRTO2000 double-locking tremolo maintain rock solid tuning even after the most vigorous whammy-workout. The molded, rectangular SKB hardshell case with TSA-approved latches is ready to handle the rigors of the road (or the air). DiMarzio Evolution humbuckerDesigned for maximum impact and power to get a tight, aggressive, loud sound. It incorporates a patented dual-resonance coil configuration that senses more harmonic overtones than ordinary humbuckers. Works in almost all solidbodies and most semi-hollowbodies as well. The Evolution makes the lowest notes jump out of the amp, and feedback occurs easily with a wide range of harmonic overtones. DiMarzio Tone Zone humbuckerThe vowel-like open wah-wah feel of the PAF Pro and FRED is combined with tremendous midrange and bass for a sound that really kicks hard. Because the lows, mids, and highs are all boosted, using a Tone Zone feels like cranking up an extra set of tone controls. It adds further dimension to the sound of your amp - that elusive edge that can make a good-sounding rig into a great-sounding one. Notes seem to get bigger after they're picked, and burn hard as they sustain. It's the right stuff to wake up your amp. Ballsy, aggressive tone has plenty of drive in all the right frequencies, abundant gain to push preamps and power amps, and sensitivity to pick attack that gets the most out of any style from metal to blues. Hot enough to qualify as a high-output pickup but with a wider dynamic range. Hard picking will produce a lot of power and softer picking will be much cleaner and quieter. FEATURES Pro Mod series Alder body So-Cal body shape Color: Snow White 1-piece quartersawn maple neck 12\"-16\" compound radius 22 jumbo frets 25-1/2\" scale 1-11/16\" nut width Black hardware Grover Mini Rotomatic tuners Floyd Rose FRT-O2000 double-locking tremoloDiMarzio Tone Zone bridge humbucker DiMarzio Evolution neck humbucker 3-position pickup selector toggle switch Master volume control Surface/flush-mounted output jack 1-ply flat black pickguard Molded rectangular SKB case", "ItemID": "254064007044", "EndTime": "2019-01-18T02:51:55.000Z", "StartTime": "2019-01-11T02:51:55.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2010-Charvel-Pro-Mod-So-Cal-HH-Guitar-Non-recessed-Floyd-Rose-SKB-case-w-keys-/254064007044", "ListingType": "Chinese", "Location": "Las Vegas, Nevada", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2540640070448080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/20wAAOSwfepcNyZb/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/d9MAAOSw3BJcNyZf/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/0IwAAOSwq6VcNyc6/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/GTUAAOSwjoFcNydH/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/c1QAAOSw2~NcNyde/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/C3oAAOSwp3dcNydm/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/i~YAAOSw5tNcNyep/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/YaYAAOSwPrdcNye2/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/4f4AAOSwl1FcNyfK/$_32.JPG?set_id=880000500F"], "PostalCode": "89115", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "schltchr00", "FeedbackRatingStar": "Yellow", "FeedbackScore": 35, "PositiveFeedbackPercent": 100.0}, "BidCount": 2, "ConvertedCurrentPrice": {"Value": 729.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 729.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "1***b", "FeedbackPrivate": true, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 224}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2010 Charvel Pro Mod So-Cal HH Guitar Non-recessed Floyd Rose SKB case w/keys", "ItemSpecifics": {"NameValueList": [{"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Brand", "Value": ["Charvel"]}, {"Name": "MPN", "Value": ["2967001549"]}]}, "HitCount": 391, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 739.0, "CurrencyID": "USD"}, "ProductID": {"Value": "219544550", "Type": "Reference"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}