{"BestOfferEnabled": true, "Description": "UNCLE DAN'S #8 - OUTLET EPIPHONE Electric Guitar LES PAUL SPECIAL II Description: ELECTRIC GUITAR: EPIPHONE MODEL LES PAUL SPECIAL II, 6 STRING, NOT SPECIFIED Details Additional Details for eCommerceIN GREAT CONDITION, 100% EXCELLENT WORKING CONDITION Musical Instrument Condition Rating90% - Very Good - In Great Condition and Primary Features Functional Instrument Appearance95% - Excellent Condition : Very Clean, might have some minor wear, dings, scratches, or finish cracks, but otherwise very close to new condition. Knobs - Tuners - Electronics - Input Jack90% - Guitar shows some wear - All orginal - Input jacks ares shows some scratches- Volume and Tone controls are in good working condition. Musical Instrument CaseNot Included Number of Strings6 STRING Country of ManufactureMade in China Body StyleSOLID DexterityNot Specified Notes: Epiphone Les Paul Special II Electric Guitar, What's so special about the Epiphone Les Paul Special II Electric Guitar? The super-low price for starters and that's not all. It gives you all the essential elements of a Les Paul. Made with a mahogany body, bolt-on mahogany neck, smooth 22-fret rosewood fingerboard, this baby is every bit as handsome as its uptown cousins. Features 700T/650R open-coil humbucking pickups that deliver long, singing sustain and true Les Paul tones. The LockTone Tune-O-Matic bridge and stopbar tailpiece add more sustain and make string changing easier. Payment PayPal is the ONLY online payment method we accept at this time. Your PayPal account must be a Verified U.S. PayPal Account. We also recommend that you use a Confirmed Ship To Address. Shipping Your item will be shipped within 1-3 business day(s). After shipping your items will be delivered within 1-10 business days. Terms of Sale Tax applies in: TX About Us Since our Dallas debut in 2015, Uncle Dan's Outlet has quickly become the go-to discount store for savvy shoppers. Conveniently located off I-30 and E. Grand Avenue in Dallas, TX, Uncle Dan's Outlet is easily accessible to Dallas and all of our neighboring communities. The owners, Kim and Dan Foster, of Uncle Dan’s Pawn Shops, Inc., (one of the largest independent pawnbrokers in North Texas) began planning and renovating their 8,500 sq. Ft. building that was once home to the famous merchandising giant, Woolworth’s. In keeping with the spirit and history of this iconic retailer, Uncle Dan’s Outlet proudly carries a wide variety of name brand products at discounted and clearance prices. We specialize in buying closeout, excess, overstock, liquidation, discontinued, and seasonal merchandise. Then, we pass the savings on to you! At Uncle Dan’s Outlet, you’ll find first quality, name brands at up to 75% off retail prices! Frequent shoppers get the best deals so be sure to stop in often. Trucks arrive regularly with great new inventory!Although the quantity of merchandise shifts with each new shipment, at Uncle Dan’s Outlet you can expect to find GIA certified diamonds, gold jewelry, and watches; baby gear and gifts; kitchenware, cookware, cutlery, and appliances; laptops, notebooks, and flat-screen TVs; comforters and bedding; lamps, rugs, vacuums, and decorative accessories; hand tools, power tools, lawn and garden tools; plus, seasonal décor and so much more. Just about everything you need for your home! Please note: All sales are final; however, your satisfaction is very important to us. If one of our products fails to function as advertised, please contact us. Returns and exchanges will be handled on a case by case basis. With over 450 Five-star Google reviews, you can shop with confidence at our store! Things I Buy: PLAYSTATION 4 Bravo Store Systems Point-of-Sale Operating System Bravo Omni-Commerce solutions offers Brick & Mortar stores the only fully integrated eBay API that seamlessly & effortlessly combines the in-store Point-of-Sale to all eBay commerce selling activities. Click here & find out why eBay stated \"Bravo has best solved Brick & Mortars can sell on eBay\"", "ItemID": "253976235538", "EndTime": "2018-12-18T16:56:23.000Z", "StartTime": "2018-11-11T20:51:12.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/EPIPHONE-Electric-Guitar-LES-PAUL-SPECIAL-II-I-20182-/253976235538", "ListingType": "FixedPriceItem", "Location": "Dallas, Texas", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2539762355388080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NDUwWDgwMA==/z/7iUAAOSwFZZb6JY-/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/NDUwWDgwMA==/z/IpMAAOSwMpFb6JY~/$_1.JPG?set_id=2"], "PostalCode": "75223", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "uncledansoutlet", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 161, "PositiveFeedbackPercent": 94.2}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 199.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 199.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "c***t", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1838}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "EPIPHONE Electric Guitar LES PAUL SPECIAL II (I-20182)", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "Model", "Value": ["Les Paul Special II"]}]}, "HitCount": 408, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "14 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}