{"BestOfferEnabled": true, "Description": "Here is a fair condition players grade 1983 Ibanez AM205 Artist semi hollow guitar made by the proud craftsmen of Ibanez in Japan. It is a \"players\" guitar due to its significant cosmetic binding rot especially on binding edges of the top and neck joint with no structural damage as far as I can tell, also finish cracks and age wear which does not affect playability or sound, including near the input jack, and the bottom and sides as pictured. The top still shows burl mahogany beauty despite the finish flaws and the neck is very smooth; overall it is a beautifully aged genuinely \"worn\" musical instrument, and is a lightweight Ibanez Artist model easy on your back, with great sound too. It sounds great for rock, blues, cleans and jazz, and it can sing and wail how you want it to. Bends are easy like melted butter. The guitar has a slim neck that is very fast with its genuinely smooth ebony fretboard that is smooth and super with plenty of fret life, and has Sperzel quality locking tuners for superior tuning stability always. The pickups are top quality Benedetto PAF humbuckers in a matched set, as found in many top of the line American made Guild jazz guitars. This beauty has coil splitting capability with push pull knobs for great tonal versatility, and wonderful clarity for cleans and fabulous grit for blues, jazz, funk, and multiple distortion applications too. Its thin neck and ebony fretboard feel as smooth as can be, with plenty of life in the frets about 80 - 90% I believe. It is set up well to play with low action and a set of Elixir 9's. The back of the guitar features a sweet burl mahogany nice burl look too despite the finish wear and aged cracks and binding rot as previously described with its vintage worn look. This great guitar has a wonderful vintage sound resembling a 335 semi hollow resistant to feedback too, yet with a super tone of its own. The Ibanez Artist AM205 is an innovative original design which predates the 3/4 size Gibson style semi hollow guitars such as Gibson 356, 359, 336 and 339, and it plays and sounds really, really fine. For a classic Ibanez Artist AM205 approximately 7 pounds that plays great, with \"worn\" binding rot and wear as noted; it is a true players guitar that sounds fantastic and is a joy to play. This is one great value for someone to enjoy for a lifetime. And, it's a genuine Ibanez Japan with its serial number visible clearly on the back of the headstock. This Ibanez AM205 has a practically new genuine Ibanez hard case fit for it included. For a truly wonderful sounding and playing guitar at an excellent price too, don't miss this. The bottom line: this is an incredible classic guitar and a terrific value especially at this very low price point for this top of the line 1982 Japanese Ibanez made quality instrument; in short, you cannot go wrong with this \"players\" Ibanez 1983 Artist AM205 musical gem. Ships to continental USA only thanks. This is a fine quality musical instrument despite its numerous cosmetic flaws described that is a joy to hear, feel, and play. PayPal preferred.On Nov-29-18 at 09:18:43 PST, seller added the following information: Item is a 1983 Ibanez Artist made in Japan, and is described to the best of my ability, an excellent guitar sold as is with no returns accepted. This is a quality instrument. Shipping to continental USA, Pay Pal preferred.", "ItemID": "123514816233", "EndTime": "2018-12-07T04:12:46.000Z", "StartTime": "2018-11-27T22:00:27.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Ibanez-Artist-AM205-1983-Japanese-semi-hollow-Artist-model-/123514816233", "ListingType": "Chinese", "Location": "Gallatin, Tennessee", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1235148162338080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMDYy/z/cuEAAOSwQZVb~bdY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDYy/z/A1IAAOSwxO9b~beM/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDYy/z/7QIAAOSw5qdb~bfO/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDYy/z/giUAAOSwEppb~bfy/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDYy/z/SFEAAOSwSn1b~bhc/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/R6QAAOSwikJb~bix/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/RPwAAOSwl5Jb~bjN/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDYy/z/a9QAAOSwXMxb~bkq/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDYy/z/hosAAOSwjwZb~bkL/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/e5QAAOSw9m5b~bmC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDYy/z/GyoAAOSwwTFb~bva/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/n9IAAOSwi1lb~bwE/$_57.JPG?set_id=8800005007"], "PostalCode": "37066", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "smtierney2254", "FeedbackRatingStar": "Blue", "FeedbackScore": 54, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 599.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 599.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "r***y", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 234}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Ibanez Artist AM205 1983 Japanese semi hollow Artist model ", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Ibanez"]}, {"Name": "Model Year", "Value": ["1983"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Artist AM205"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Body Type", "Value": ["Semi-Hollow"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Body Color", "Value": ["Burl Mahogany"]}]}, "HitCount": 356, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 609.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Central America and Caribbean", "Europe", "North America", "Oceania", "Southeast Asia", "South America", "RU", "AF", "AM", "AZ", "BD", "BT", "CN", "GE", "IN", "JP", "KZ", "KR", "KG", "MV", "MN", "NP", "PK", "LK", "TJ", "TM", "UZ"], "GlobalShipping": false, "ConditionDescription": "Players guitar with significant binding rot especially on binding edges, also finish cracks and age wear which does not affect playability or sound. The top still shows burl beauty despite the finish flaws and the neck is very smooth overall it is a beautifully aged \"worn\" musical instrument, and is a lightweight Ibanez Artist model easy on your back, and great sound too.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}