{"BestOfferEnabled": true, "Description": "Eastman T186MX-BD Thinline Semi-Hollow Electric Guitar NaturalThis is the Eastman T186MX-BD Thinline model in a beautiful Blonde finish over a figured maple top and solid mahogany rims. The T186MX-BD is built with two Seymour Duncan Seth Lover humbuckers, and has a rock-solid Gotoh tune-o-matic bridge and stopbar tailpiece for a spot-on intonation.6 lbs, 12 oz.16″ X 1-3/4″ Body DimensionsBlonde FinishFlame Maple Top, Solid Mahogany Back and SidesMahogany NeckEbony Fingerboard22 Jescar FW47101-P Frets1-3/4\" Nut Width.830\" Neck Profile at 1st Fret.900” Neck Profile at 12th FretEbony Head Cap VeneerSingle-Acting Truss RodFlame Maple BindingSeymour Duncan Seth Lover Humbucker PickupsBone Nut Gotoh TunersGotoh Tune-o-Matic Bridge Stopbar Tailpiece Eastman T186MX-BD Thinline Semi-Hollow Electric Guitar NaturalBack in 1992, Eastman Strings began selling violin-family instruments that were built by hand with minimal assistance of power tools. So it was only natural—given the design, structural, and construction attributes archtops share with violins—that Eastman would enter the archtop market a decade later.While archtops remain the cornerstone of the Eastman line, the company has grown to offer a range of fine flattop guitars from parlors to jumbos. More recently, Eastman unveiled a family of thinline electrics. That’s a pretty logical evolution for a company that’s made a name in affordable, high-quality archtops. But when we checked out the186, an all-solid-wood 15\" thinline that channels the rich sound of a full-bodied archtop, we were tempted to wonder why they didn’t make the move sooner.Fancy and FamiliarAt a glance—with its double cutaways, dual-humbucker electronics package, Tune-o-matic-style bridge, and stop tailpiece—the T185MX resembles the mother of all thinlines, the Gibson ES-335. But the T185MX deviates from the classic Gibson’s build formula in many respects. Rather than laminate maple and poplar for the body construction, the 15\" T185MX has a two-piece back carved from solid mahogany (with beautiful figuring), mahogany sides, and a carved maple soundboard. The T185MX is also fully hollow, with a small block underneath the bridge and tailpiece, more like an ES-330 or Epiphone Casino.There’s no shortage of cosmetic niceties on the T185MX. In place of plastic binding, the body is wrapped in figured maple binding with a pair of black pinstripes—an elegant flourish that’s repeated, albeit with a single black line, around the f-holes, fretboard, and headstock face. Clean pearl-micro-dot position markers stud the ebony fretboard, the same wood used for the truss-rod cover. And an Eastman logo inlaid in maple graces the headstock, which has the sort of bold, dramatic flair of an old D’Angelico.", "ItemID": "264078289577", "EndTime": "2018-12-15T00:45:57.000Z", "StartTime": "2018-12-08T00:45:57.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Eastman-T-186MX-BD-Thinline-Semi-Hollow-Electric-Guitar-Natural-/264078289577", "ListingType": "Chinese", "Location": "Marietta, Georgia", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/2640782895778080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/FMQAAOSwkXFb-J3x/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/ShMAAOSwMPpb-J33/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/~IQAAOSwCTpb-J36/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/HucAAOSwN3Nb-J37/$_32.JPG?set_id=880000500F"], "PostalCode": "30062", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "guitarchitect335", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 231, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 1200.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1200.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "c***l", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 583}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Eastman T 186MX-BD Thinline Semi Hollow Electric Guitar Natural", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Eastman"]}, {"Name": "Body Type", "Value": ["Semi-Hollow"]}]}, "HitCount": 68, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "14 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 1225.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}