{"BestOfferEnabled": false, "Description": "Fender Stratocaster Surf Green 69 Styled Relic My guitars are beautifully unique Art pieces and music makers. Each one is designed and built to represent an Icon from the past. They are built with the best parts; commensurate with the price you pay. As a Wounded Warrior, I place integrity, know how, lots of time and love into each of them, as this is also a form of therapy for me. See my feedback, I've been at this hobby for a while. Included with your purchase is a ChromaCast Padded Gig Bag ($50.00) and Fender Custom Shop custom care packet, Owners manual, registration card, hang tags, appropriate tremolo bar, allen wrenches and tremolo back plate - (if needed)! Thanks for looking & check out my other STRATS and Fender parts for sale! For your consideration is this Custom hand restored Stratocaster. I've Styled this after a 1969 Stratocaster with the F plate, Maple neck, Large Headstock and 57/62 pickups. BODY: The Surf Green body has been finished with all the road worn imperfections that would normally come with a fifty-year-old well-played guitar. It has a hand aged CREAM pick guard contrasted with aged cream and white pick up covers and switch tip. The knobs are real natural old Fender. ELECTRONICS: The Heart has upgraded pickups and electronics. The pick up’s are True Custom Shop 57/62 copper wound Alinco II's fiber bottoms and the wiring is done to vintage 60's specifications. They are staggered, beveled-edge Alnico magnets with formvar wire designed to deliver the original vintage Strat sound, feel, and vibe. It has upgraded new Seymour Duncan Bourns Smooth Taper 250K Split Shaft Speed Pots on the volume and tone, and the capacitor is NOS vintage Fender Bright Orange Dime .022 uF. All 5-tone switch positions are distinct and clear; the 2 tone pots work correctly with their corresponding pick-ups. NECK: It's built in the late sixties (CBS) tribute style with a Fender one piece MAPLE neck with a Large CBS headstock, a soft \"C\" profile, with a single string tree and decal from the 69-71 era. The neck is 22 Frets, 10\" radius and straight and is matched to a vintage fender tremolo big block with the wider USA spacing of 2 3/16. The tuners are also vintage Kluson style. Neck has many natural finger burn/sweat areas, showing that this neck was well played and loved. I always setup the neck (truss rod), frets and strings to minimize the string height and fret buzz while keeping the neck as straight as allowed. The neck plays low and easy, with a complete new setup to an average string height of 1/16 at the 12th fret. I've added new Ernie Ball super slinky .09 strings, and then completed a bridge adjustment for perfect string height and playability. Like Eric Clapton said during his interview on his guitar \"Brownie\": What I would always look for on a Strat, was a maple neck that had been wore out. You know it was like a restaurant, if there’s lots of people in there, you know there’s got to be good food, so I know I just thought that if it all those kind of worn out patches, it meant that it had been, you know, well favored.” - and this ones been \"Favored\" like a rock and roll work horse and looks the part at a fraction of the cost. Weighing in at 7.75 lbs. I’m a Wounded Warrior and have been rescuing and rebuilding guitars for the last ten years, as a form of therapy. One too many several explosions left me wrapped too tight, (majoranthonyjones.com.) Now, I exercise my brain by playing and rebuilding guitars. I’m wrapped pretty tight so I’m OCD about getting my guitars as perfect as I can, within reason, so you’re definitely getting your moneys worth! RETURNS are NOT ACCEPTED - BUT if you contact me immediately, (7 days) and have not opened or modified the guitar, I will accept return & Buyer pays shipping. Below, I’ve best described the spec’s on my guitar’s, allowing you to make an informed decision. BODY: MODEL: Stratocaster, contour body – classic style - aftermarket. WOOD: Best guess would be ALDER / it's heavier.FINISH: SURF GREEN / MINT - look at photos carefully - “Shoulder Light Relic’d”PAINT: Sanded and buffed. WIEGHT: 4.2 lbs PLUG JACK: New Switchcraft JACK PLATE: New Fender “Relic’d” BRIDGE: Fender Vintage style “Relic’d” = 2” 3/16 American standard wide spacing BRIDGE SCREWS: 6 New steel – “Relic’d”TREMELO BLOCK: Synchronized Big Block “Relic’d”.TREMOLO CLAW: New wider Fender “Relic’d” TREMOLO SPRINGS: Fender “Relic’d” 5 springs TREMELO ARM: New Fender “Relic’d” BRIDGE SADDLES: Fender stamped STRAP BUTTONS: New Fender “Relic’d” with pads SCREWS: 11 + 2 “Relic’d PICK GUARD: TYPE: Fender Hand “Relic’d” 11 hole. PICK GUARD SCREWS: New relic'd 11 hole. COLOR: MINT GREEN - YELLOWED hand relic FINISH: Hand “Relic’d” SHIELDING: Aluminum / CopperPICK UP COVERS: Cream Fender agedKNOBS: Original OLD FenderSWITCH TIP: Fender “Relic’d” POTS: Upgraded new Seymour Duncan Bourns Smooth Taper 250K Split Shaft Speed Pots X 3 CAPACITOR: NOS vintage Fender Bright Orange Dime .022 uFSWITCH: 5 way Oaks Grigsby WIRING: Vintage 60's standard setup PICKUPS: True Custom Shop beveled ALINCO II over wound vintage fiber bottoms NECK: 6.86 ohms MIDDLE: 6.72 ohms BRIDGE: 7.62 ohms NECK: TYPE: Fender Large Headstock - Hendrix, late 60's early seventies styled. MIM PROFILE: CSCALE LENGTH: 25.5 / 4 bolt WOOD: Flatcut sawn MapleFINGERBOARD: MapleFINISH: Tinted - FINGERBOARD RADIUS: 10\"FRETS: 22FRET SIZE: Medium / Jumbo / Fresh level.TRUSS ROD: Working at headstock.STRING NUT: cream originalHEADSTOCK: Vintage / Large TUNERS: Vintage “Kluson” style “Relic’d” FERRELS: Vintage “Kluson” style “Relic’d”STRING TREE: Single VintagePOSITION INLAYS: Micarta Black PLATE: “Relic’d” SERIAL NUMBER: Late 60’s vintage style early CBS F plate #182111 Assembled TOTAL weight: 7.75 lbs Thanks for looking. FEEDBACK: Great delivery timing but (hard) case arrived damaged (Saudi Arabia) guitar is fine & plays well. FENDER STRATOCASTER 60s STYLED TRIBUTE NATURAL RELIC. Great to deal with! Sweet strat, Quick shipping - FENDER STRATOCASTER CUSTOM 68 STYLED GOLD FLAKE RELIC. Thank you. Great guitar! CLAPTON “BLACKIE\" TRIBUTE STRATOCASTER RELIC Thanks for the great work and service! Great seller. FENDER 50'S CREAM STRATOCASTER LIGHT RELIC. Very pleased - plays and sounds as described. FENDER HEAVY RELIC BLACK STRATOCASTER. Great neck - natural relic. Plays like I hoped! FENDER LEAD II NECK. Shipped fast arrived in great shape - thanks. FENDER TOM DELONGE STRATOCASTER. Great communication and shipping. Love the guitar. GIBSON SG. Smooth sale and shipping. Plays and sounds sweet - FENDER SUNBURST STRATOCASTER. Steal of a deal! 5 star looks, tone, play, shipping. Look here before buying Strat = FENDER STRATOCASTER – 1995 - USA 40th ANNIVERSARY. Nice guitar. Most of all thank you for your service to our country. God bless u = FENDER TELECASTER - Custom Double Contour. Good communication, fast shipment. Great guitar! FENDER STRATOCASTER, FOTO FLAME. Fast shipping, packed great, arrived ready to play and looked awesome. As described and also a great guitar – Thanks! FENDER BIEGE STRATOCASTER. Wow, what a great deal. Real relic strat that plays like a dream. FENDER JAPAN NATUAL STRATOCASTER. Worth every penny. Strat landed here with no issues and shipped fast. Plays great too. FENDER SUNBURST STRATOACSTER. Great guitar, forgot trem bar and shipped another out asap. Plays low and fast – thanks! FENDER CLASSIC PLAYER. PLEASE EXAMINE THE PHOTOS VERY CAREFULLY AS THEY ARE THE TRUE DETAILS OF THIS ITEM. Seller's payment instructions: Shipping to continental USA ONLY. No international shipping. PayPal ONLY. We ship to PayPal comfirmed address only. All auction payments must be received within 24 hours of auction close. My feedback is outstanding and will do everything possible to ensure a pleasant transaction.", "ItemID": "163458544225", "EndTime": "2019-01-12T00:37:05.000Z", "StartTime": "2019-01-11T09:00:31.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/FENDER-STRATOCASTER-CUSTOM-69-STYLED-SURF-GREEN-ROAD-WORN-SHOP-RELIC-/163458544225", "ListingType": "FixedPriceItem", "Location": "Las Vegas, Nevada", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1634585442258080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/qhIAAOSwHEZcKJRJ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/afYAAOSw8VtcKJRL/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/j8YAAOSw76JcKJRO/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/mDUAAOSwVH9cKJRQ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/QbwAAOSwpJ5cKJRT/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/hdQAAOSw851cKJRW/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/MdYAAOSwEwhcKJRY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/T00AAOSwIr5cKJRa/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/XIMAAOSwUlFcKJRd/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/0RAAAOSwALlcKJRf/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/b04AAOSwtFxcKJRh/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTcyWDEyOTY=/z/3U4AAOSwfB9b1Mpc/$_57.JPG?set_id=8800005007"], "PostalCode": "89110", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "cor5221", "FeedbackRatingStar": "Red", "FeedbackScore": 2138, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 649.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 649.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "l***a", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 152}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "FENDER STRATOCASTER CUSTOM 69 STYLED SURF GREEN ROAD WORN SHOP RELIC", "ItemSpecifics": {"NameValueList": [{"Name": "Size", "Value": ["Full Size"]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Stratocaster"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Style", "Value": ["Stratocaster"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Brand", "Value": ["Fender"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}]}, "HitCount": 48, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "APO/FPO", "Africa", "Central America and Caribbean", "Europe", "North America", "Oceania", "Southeast Asia", "South America", "RU", "AF", "AM", "AZ", "BD", "BT", "CN", "GE", "IN", "JP", "KZ", "KR", "KG", "MV", "MN", "NP", "PK", "LK", "TJ", "TM", "UZ", "PO Box"], "GlobalShipping": false, "ConditionDescription": "This is NOT a Fender “Custom Shop” guitar, but it has been carefully built to standards of most Custom Shop relics and Road Worn guitars, with the best parts (i.e. partscaster) and knowledge.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}