{"BestOfferEnabled": true, "Description": "item up for your consideration Baldwin / Gibson Education Signature Series right handed electric guitar2 humbucker pickups 2 vol.2 tone controls22 fret rosewood fretboard with dot inlaysmaple neck, sealed tunersfixed bridge this is a bolt on Les Paul , similar to a Epiphone Special in constructionbut has the LP style \"look\" with inlay and sunburst finish the case is almost new, Road Runner molded , and clean inside ScoreBid is owned and operated by Siegel's Jewelry & Loan of Cedar Rapids, Iowa & Paso Robles, California FEEDBACK: We appreciate Positive Feedback and will leave positive feedback for all buyers who pay in a reasonable timeframe or arrange for payment at a later date. PLEASE NOTE: Our system is designed to automatically give you positive feedback as soon as you give us positive feedback. GUARANTEE:We strive to make sure you are happy with your purchase. Items are guaranteed to arrive in the condition described. If we have overlooked something or something doesn't work correctly when it arrives please call or email us to initiate a refund or RMA. We typically would like a call within 3 days after receiving the item. This item is guaranteed to work as described in this auction listing. If you are just not happy with the item after receiving it because of a change of mind you will be responsible for shipping it back to us at your expense and we will refund the ebay purchase price less 10% once we receive the merchandise back. Bid with confidence! We take good care of our customers, and our high feedback rating reflects that! We look forward to serving you! SHIPPING: No international shipping is available unless otherwise stated. We will attempt to ship your item within 24-72 hours after payment has been received. This item is subject to a FIXED SHIPPING price. This means that the shipping fee will be the displayed amount for all ship-to destinations shown. U.S. Fixed rate shipping prices are based on Continental US.- Alaska & Hawaii residents might be required to pay more and shipping can take as long as 3 weeks for delivery depending on what service is used to ship the item(s). If you prefer you may select a service of your choice however, additional shipping charges may apply. This item is eligible for pickup unless otherwise stated. We do not ship to any destinations that are not specified here. Many countries impose their own customs, duties, tariffs, taxes, etc. on items being shipped from a foreign country. We do/do not cover this cost for all of our US customers. OTHER INFO:If you have any problems with your transaction, contact us prior to leaving any neutral or negative feedback so that we can have the chance resolve any problems. We prefer to handle all communication via email to ensure documentation. Thank you very much for your business! Scorebid ABOUT US:ScoreBid is the e- commerce and eBay consignment company for Siegel’s Jewelry & Loan a family owned and operated business since 1940 located in Cedar Rapids, IA. J.D.Siegel started the company in 1940 with his son Oscar Siegel coming into the business shortly after the war. At present, Oscar’s son Ken operates the day to day business and oversees the operation. Oscar’s other son Jary runs the wholesale jewelry side of the business. ScoreBid is operated by Ken Siegel . Please call us if you have any questions or comments about our products and/or listings. TRUST AND SAFETY:We have a 99%+ Positive Feedback. This is a track record that spans over 9 years of active listing with eBay. We are members of SquareTrade and Siegel’s is a member of the Better Business Bureau, Jewelers of America, and Iowa Jewelers Association. We stand behind everything we sell. You can feel fully confident and safe in any purchase with us. Our business is all about keeping our customers satisfied and happy with their purchases and service. Good luck and Happy Bidding!!!", "ItemID": "264149917441", "EndTime": "2019-01-28T18:45:41.000Z", "StartTime": "2019-01-19T16:22:23.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-Baldwin-Signature-Series-Education-Les-Paul-Electric-Guitar-/264149917441", "ListingType": "FixedPriceItem", "Location": "Cedar Rapids, Iowa", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/2641499174418080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNTk5/z/togAAOSwnv9cGBL3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNTk5/z/SWQAAOSwK1RcGBL7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNTk5/z/7FMAAOSwQ9lcGBL~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNTk5/z/vUcAAOSwztVcGBMD/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNTk5/z/3zUAAOSwMQ1cGBMG/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNTk5/z/uo0AAOSwpppcGBMJ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNTk5/z/G9IAAOSwL-xcGBMN/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNTk5/z/VfcAAOSw2zRcGBMR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNTk5/z/QasAAOSwQqZcGBMW/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNTk5/z/J9cAAOSw1qhcGBMZ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNTk5/z/ndQAAOSwwfFcGBMd/$_57.JPG?set_id=8800005007"], "PostalCode": "52402", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "scorebid", "FeedbackRatingStar": "Green", "FeedbackScore": 8251, "PositiveFeedbackPercent": 99.6, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 349.95, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 349.95, "CurrencyID": "USD"}, "HighBidder": {"UserID": "f***o", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 492}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson Baldwin Signature Series Education Les Paul Electric Guitar", "ItemSpecifics": {"NameValueList": [{"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Brand", "Value": ["Baldwin by Gibson"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Orange-Red Sunburst"]}, {"Name": "Model", "Value": ["Signature Series"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Size", "Value": ["Full Size"]}, {"Name": "Product Line", "Value": ["Gibson Les Paul"]}]}, "HitCount": 607, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=7457647", "StoreName": "Siegels Diamond and Gold Outlet"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "TopRatedListing": true, "GlobalShipping": false, "ConditionDescription": "pre-owned instrument, in great playable condition; has a few dings on body; fret-board and neck are great", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}