{"BestOfferEnabled": false, "Description": "*note - some of the pictures show lighter than the actual color - it's a darker walnut but the lighting made it look lighter. I am selling my Epiphone Les Paul Custom Lee Malia Signature, with HSC It's in WONDERFUL condition, and is an excellent player with very low action, very smooth playing and sounding guitar. everything is original. The pictures I included show there are zero cracks - zero cracks at the neck, zero cracks at the heel, etc - nothing. There is a little play wear on the hardware and some general pick scratches and swirls but that is it. The case is a case I had for another less paul, that I started using for this guitar, and it is a fine hard case although there are stickers on it. I decided not to take them off, but you can. This has been babied, but also gigged, over the past year or so. It's used, but is in excellent condition. Selling my les pauls (look for my other auctions soon) as I have a pinched nerve and cant do an LP for a 4-5 hour gig anymore - switching to semi-hollow guitars. Sadly... I love my pauls. This one is based on the 70's artisan model, with the floral inlays all around, walnut finish, gold hardware, etc. This has real USA Gibson Pickups - they sound really really good! Below is the description from the website: Lee Malia Signature Les Paul Looking for a Les Paul that will stand out in your collection? Then you need the Epiphone Lee Malia Les Paul Custom solidbody electric guitar. Bring Me the Horizon's guitarist, Lee Malia, worked with Epiphone to create this decidedly different Les Paul. Loaded with a Gibson P-94 single-coil and an 84T-LM humbucker, this limited-edition axe delivers a massive range of tones for any style of music. The retro-inspired walnut finish and Artisan floral inlay motif offer a unique cosmetic look. If you are into guitars that stand out from the crowd, then you need the Epiphone Lee Malia Les Paul Custom. Epiphone Lee Malia Les Paul Custom Solidbody Electric Guitar at a Glance: A custom Les Paul designed with Lee Malia from Bring Me the Horizon Real Gibson pickups deliver rock-solid tone Beefy '59 neck feels great and sustains beautifully A custom Les Paul designed with Lee Malia from Bring Me the Horizon Far from your typical Les Paul, the Epiphone Lee Malia Les Paul Custom stands out from the usual crowd. Its '70s-style Artisan floral motif, gold hardware, and walnut finish offer a unique look that is sure to turn heads. Lee spec'd both the '59 C-profile neck shape and the unique combination of pickups to get the tones and feel he needed and wanted from a guitar. Needless to say, the Epiphone Lee Malia Les Paul Custom is one of the most customized and unique Les Pauls that we've seen in a long time. Real Gibson pickups deliver rock-solid tone The Lee Malia Les Paul Custom is loaded with a unique set of genuine Gibson pickups. It starts out with a hot Gibson 84T-LM humbucker, designed in cooperation with Lee, that breaks up easily for crunchy rhythm and lead tones. It is wired with a coil tap, so you can get clean single-coil tones. The neck pickup is a P-94 single-coil pickup that delivers raw vintage P-90 tones. Beefy '59 neck feels great and sustains beautifully If you like 'em chunky, then this Epiphone Lee Malia Les Paul Custom is the axe for you. Far from the wafer-thin necks many modern shredders tout, this Les Paul sports an authentic 1959-style C-profile neck, affectionately known as the baseball bat neck carve. That said, this neck is fantastically comfortable to play, letting you really dig into each note and each chord. What's more, Sweetwater guitarists will attest that this neck shape gives you truly epic sustain - something we're sure you'll dig whenever you take the lead. Epiphone Lee Malia Les Paul Custom Solidbody Electric Guitar Features: Signature guitar for Bring Me the Horizon's guitarist, Lee Malia Gibson USA P-94 and 84T-LM pickups deliver a massive range of sound Classic mahogany body with a carved hard maple top delivers fundamental Les Paul sound Beefy '59 C-profile neck feels amazing and sustains like a dream '70s-era Artisan cosmetics set this guitar apart from other guitars LockTone Tune-o-matic bridge and 14:1 tuning machines offer epic tuning stability Plug in and rock out with the Epiphone Lee Malia Les Paul Custom! This guitar always gets me comments and stares from the audience - it's a beautiful guitar. *no returns unless I grossly misrepresented this guitar. The pictures have been taken at the time of the listing, and it is going back into the case ready for shipment. If you simply do not like the guitar, feel free to sell it on ebay, you will get more than what I am asking, I am just looking to sell quicker.", "ItemID": "323638295057", "EndTime": "2019-01-07T03:01:44.000Z", "StartTime": "2019-01-06T23:19:32.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Epiphone-Lee-Malia-Les-Paul-Custom-Walnut-Gibson-pickups-case-great-used-/323638295057", "ListingType": "FixedPriceItem", "Location": "Winchester, Virginia", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/3236382950578080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/magAAOSwHrlcEXc2/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/vhcAAOSwO-hcEXc4/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/LIoAAOSwb8BcEXc4/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/KLEAAOSwE~ZcEXc0/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/iMUAAOSwN5hcEXc1/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/tXcAAOSwfMlcEXcz/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/w7EAAOSw~llcEXc1/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/HWgAAOSwl5JcEXc1/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/kRoAAOSwcDdcEXc3/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/788AAOSwgbdcEXc4/$_32.JPG?set_id=880000500F"], "PostalCode": "22602", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "historiosophy", "FeedbackRatingStar": "Purple", "FeedbackScore": 803, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 549.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 549.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "l***l", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 190}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Epiphone Lee Malia Les Paul Custom - Walnut; Gibson pickups, case, great used!", "ItemSpecifics": {"NameValueList": [{"Name": "Product Line", "Value": ["Gibson Les Paul"]}, {"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "Model", "Value": ["Custom"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Material", "Value": ["Walnut"]}]}, "HitCount": 46, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}