{"BestOfferEnabled": false, "Description": "Beautiful, phenomenal playing and sounding 1984 Fullerton AVRI ‘62 Reissue Stratocaster, serial number V011942. Factory original three-color sunburst finish, a definite \"near mint\" or \"9.5 out of 10\" which has had next to zero play wear, although its thin C-shape neck is fast! Please note a minor pen-tip-size ding in the finish on the back a few inches from the guitar's back plate. This instrument weighs 7 pounds, 4 ounces with the vibrato bar. It also has a super-RARE two-piece body! Lots of resonance and Fender \"bell tone\" here. The penciled neck date is 7-11-84. The neck's thick rosewood slab fretboard is dark and beautiful. This guitar tunes up well and stays in tune exceptionally well. Included also is the factory-original \"duck foot\" case which is clean and works fine (and also includes the factory-original 5-way \"replacement\" selector switch, original manual, case keys and Allen wrench). As always, I try to deal in only the best items possible, and this instrument is no exception. All solder joints are untouched and the original 3-way pickup selector switch remains intact. Potentiometers are coded R1378427 (CTS, 27th week of 1984). All parts are 100% original. The black-bottom pickups with waxed cloth wire sound great and produce chime, bell tone, and fluid, Hendrixy sustain for days through my Marshall \"plexi\" amps. Please look carefully at the photos which help to describe the guitar's beautiful condition. Especially important is the distinct lack of paint imperfections surrounding the neck plate and neck pocket areas. It appears I may have been the first person to disassemble the neck; unfortunately I forgot to take a photo of the neck date although I wrote it down. Please do not ask me to remove the neck a second time; I do not want to risk damaging the finish in these areas. Rest assured the neck date is as I have indicated. Please also note in picture number 5, that photo catches the reflection of our Christmas tree--those bright dots are NOT finish imperfections, they are Christmas tree bulbs! Folks, if you like genuine Fullerton Reissue Stratocasters, this one is a true beauty--no excuses. I am only selling this instrument to pay off Federal (and State) tax bills. No reserve auction. Please trust my feedback and bid with confidence. In over 1,667 eBay auctions, I recently received a single negative feedback from a disgruntled eBayer who disputed fees for international shipping. As a result, please be advised I CANNOT SHIP INTERNATIONALLY. Shipping to USA and Canada only. Shipping to Continental USA will be $149.95. Guitar and case included as described. Other items shown in background photos are not included in this auction. Thanks for looking and please see my other auctions for more excellent gear! Again, thank you to everyone who views this auction!On Dec-01-18 at 21:53:41 PST, seller added the following information: NEW INFORMATION: I HAVE RECEIVED REQUESTS TO TAKE THE NECK OFF TO SHOW THE NECK DATE. IF ANYONE DOES NOT BELIEVE THE AUCTION DESCRIPTION, AND IS TRULY SERIOUS ABOUT BIDDING ON THIS INSTRUMENT, I WILL REMOVE THE NECK A SECOND TIME--USING THE UTMOST CARE--AND PHOTOGRAPH THE NECK DATE. eBay WILL NOT LET ME ADD TO, DELETE, OR EDIT THE PHOTOS I HAVE ALREADY PROVIDED, SO I WOULD HAVE TO SEND A PHOTO OR TWO TO WHOEVER IS TRULY INTERESTED. PLEASE LET ME KNOW. FOR THOSE WHO HAVE ALREADY BID ON THIS ITEM, PLEASE LET ME KNOW IF YOU'D RATHER NOT HAVE ME PHOTOGRAPH THE NECK DATE. FOR ALL CONCERNED, I ASSURE YOU THIS AUCTION IS ACCURATE IN ALL DETAILS DESCRIBED (INCLUDING THE NECK DATE).", "ItemID": "113392978068", "EndTime": "2018-12-03T03:00:01.000Z", "StartTime": "2018-11-23T03:00:01.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1984-Fender-Fullerton-62-Reissue-Stratocaster-No-V011942-Rare-2-Piece-Body-NM-/113392978068", "ListingType": "Chinese", "Location": "Redding, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1133929780688080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/4-sAAOSwUxlb9zjY/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/~w4AAOSws~pb9zj4/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/yVMAAOSwNqRb9zlZ/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/a7UAAOSw8R9b9zl0/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/s64AAOSwg05b9zmo/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/fp8AAOSwJtJb9znX/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/4h0AAOSwihVb9zno/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/rEIAAOSw87lb9zs2/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/~1sAAOSwYd5b9ztb/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/jnEAAOSwC85b9zuO/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/DjIAAOSwLgpb9zus/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/J~8AAOSwVCpb914a/$_32.JPG?set_id=880000500F"], "PostalCode": "96001", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "hiroshimamonamour", "FeedbackRatingStar": "Red", "FeedbackScore": 1685, "PositiveFeedbackPercent": 98.2}, "BidCount": 22, "ConvertedCurrentPrice": {"Value": 2025.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2025.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "i***b", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 720}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "1984 Fender Fullerton ‘62 Reissue Stratocaster, No. V011942 Rare 2-Piece Body NM", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}, {"Name": "Model Year", "Value": ["1982"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Model", "Value": ["Stratocaster 57 Reissue"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["White"]}]}, "HitCount": 696, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 2050.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}