{"BestOfferEnabled": false, "Description": "This is a Alder wood body Telecaster style guitar with a Mighty Might Fender licensed neck. The tuners are Gotoh, and the pickups are Lindy Fralin standard Telecaster. The Bridge is all Fender including the saddles. The guitar is wired with a 3 way selector switch one volume one tone. The condition is solid and the giutar plays and sounds good. The Nitro cellulose lacquer finish could use some sanding and polishing There are many coats of finish and white nitro lacquer Primer on this guitar (Midnight Wine from ReRanch). Their are some sanding spots and a bad scratch on the back of the guitar, Please see the photos for more finish condition issues. PayPal only. Will ship to the U.S. only. Here is some info about the Pickups From The Fralin website: Stock Tele Pickups: our second best selling Tele set. If you’re looking for the cleanest and clearest tone, look no further. This set features a bright, clean tone that allows your Tele to sparkle. Wound by hand to 50’s specs with 42-gauge Plain Enamel wire. Hand-built bobbins feature AlNiCo V magnets. These pickups offer 50’s tone. Expect clear and clean tone with a chime and bell-like quality. Our manufacturing process allows us to achieve unparalleled quality control. These Telecaster pickups consist of local fiberboard and USA-Made Alnico 5 Magnets. We wind each pickup by hand, one at a time. Each pickup is wound using our proprietary “Sectioning” technique. This gives the pickup a sweet, clear tone. Finally, we wax-pot the pickup to preserve the pickup, and prevent microphonics. ￼FEATURES: • Original Fender specifications, with modern output\u2028 • Clean and clear, lots of Fender sparkle and twang\u2028 • USA-made Alnico 5 Magnets for optimal tonal balance and output\u2028 • Compensated Bridge for even volume across all pickups\u2028 • Two magnet staggers available for different fingerboard radiuses\u2028 • Hand-wound with our “Sectioning” technique for unique, dynamic tone\u2028 • Hand-built fiberboard Bobbins for unrivaled quality control\u2028 • 10-Year Warranty on manufacturing defects\u2028 ￼SOUND: The Stock Tele set sparkles and sounds very open and clear without sounding harsh or tinny. These pickups sound big and wide, with an even balance of bass, middle, and treble. Expect a clear low-end and sharp attack with distortion, and excellent dynamics. The break-up is smooth and late, ideal for cleaner players. These vintage-voiced pickups offer wonderful clarity and all-around definition. Finally, Stock Tele Pickups are for those who need the most traditional Vintage Telecaster tone. If your current pickups are too dark, you might love these. These tend to be cleaner-sounding, and not aggressive. You’ll wonder why you didn’t make the switch earlier.   ￼ ￼FAQ’s: 1. What’s the difference between the Stock Tele and the Blues Special Tele? The Stock Tele is more true to Vintage Specs, and thus will sound brighter, clearer, and more open. The Blues Special Tele will sound thicker, darker, and more powerful. Stock Tele is for those who want the most twang out of their guitar. 2. What Stagger do I choose? Ideally, we always recommend a Hybrid Neck (raised D). Choose Stock Bridge Stagger if you have a guitar with a round to medium fingerboard radius: 7.25″ – 10″. Choose Hybrid if you have a flatter or compound radius (11+”). 3. How far away from the strings does the pickup need to be? Push your Low E String down at the highest fret. Measure from the top of the pole piece to the bottom of the string. Ideal starting location should be 1/8? on the bass string, and 1/16? on the treble string, when the High E string is pushed down at highest fret. 4. Wiring Diagrams? Here!   ￼TECHNICAL INFORMATION: Materials Stock Telecaster Sets are wound with 42-Gauge Plain Enamel Wire in the Bridge and 43 Gauge Plain Enamel Wire in the Neck. They use USA-Made Alnico V Magnets. 250K Pots Recommended.Â  Ohm Readings Stock Tele’s will read approximately 7.4K in the Neck and 6.9K in the Bridge. The Neck reads higher because we use 43 Gauge wire, which has more resistance. The outputs are compensated and this set has matched volume. Sizing Information ￼ ￼ Polarity Information Our Stock Tele Bridge is Clockwise Coil Direction, South to Strings. The Neck is RW/RP, Counter Clockwise, North to Strings.", "ItemID": "113338684046", "EndTime": "2018-11-03T22:00:06.000Z", "StartTime": "2018-10-29T22:00:06.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Partscaster-Telecaster-guitar-Lindy-Fralin-pickups-/113338684046", "ListingType": "Chinese", "Location": "Saint Paul, Minnesota", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1133386840468080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/yWAAAOSw-FNb14Do/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/tkEAAOSwhgtb14D7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/kFIAAOSwVBRb14Ci/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/W4gAAOSwKO5b14FF/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/-R8AAOSw7fxb14Co/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/KNsAAOSwczdb14Cq/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/mn4AAOSw5Xpb14Ct/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/SpMAAOSw4WVb14Cw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/XuIAAOSwDDRb14Cy/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/VhUAAOSwwj5b14C0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/Ow4AAOSwUalb14C2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/L8QAAOSwcnxb14C5/$_57.JPG?set_id=8800005007"], "PostalCode": "55103", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "happyvd", "FeedbackRatingStar": "Red", "FeedbackScore": 2184, "PositiveFeedbackPercent": 100.0}, "BidCount": 27, "ConvertedCurrentPrice": {"Value": 189.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 189.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "t***u", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 286}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Partscaster Telecaster guitar, Lindy Fralin pickups", "ItemSpecifics": {"NameValueList": [{"Name": "Body Material", "Value": ["Alder"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Midnight Wine, a Fender color"]}, {"Name": "Features", "Value": ["Single Cut"]}]}, "HitCount": 608, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 191.5, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Used and not abused, seldom played", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}