{"BestOfferEnabled": false, "Description": "NO RESERVE AUCTION!!! FOR INSANELY TOP NOTCH AND SPECCED OUT USA LES PAUL! 2008 GIBSON LES PAUL LIMITED EDITION EBONY GLOSS WITH GOLD HARDWARE Just in Time for Christmas and will be delivered in time to give as a gift!!! This guitar is ready to play straight out of the case, amazing guitar that feels fantastic under the fingers. Guitar has circular very shallow buffing scratches from cleaning the guitar over time, I took a picture to illustrate. They would all disappear if you got some buffer and applied a coat properly and wiped it off. Would be back to 100%. Small tiny dongs here and there, no major scratches or major dents, no cracking, no warping, nothing. Pro Serviced 2 weeks ago, plays absolutely fantastic and sounds VERY very good. These pickups are so good I considered removing them before selling it. I can't find any other pickups with this particular sound that I want, they are fantastic. PRO SERVICED 2 WEEKS AGO ▪ Fret Ends sanded ▪ Frets Polished (have since been played on but still nice and smooth with no catching) ▪ Fretboard Smoothed and Conditioned with TOP quality conditioner ▪ ALL hardware inspected and tighted/adjusted to top specifications. ▪ Action adjusted to my personal playing preferance for a less paul, which is perfectly in between a slammed (low as possible) action and a slightly higher action. Les Pauls are all about the TONE! So a slightly higher action (not high lol just not slammed) gives you a MUCH MUCH MUCH better tone, especially for recording. This allows the strings to freely vibrate longer and harder and allows you to really DIG IN with your pick to get those increidble tones and not have to worry about buzzing. ▪ Individual string height adjusted at the bridge/saddle to accomadate my preferance as well. (Perfect for true aggressive playing or filthy dirty blues where you really dig in ▪ solder ends checked and approved ▪ Etc, Etc, Etc. ■ 2008 USA MADE Gibson Les Paul Studio ■ ● Comes with Custom USA MADE Gibson Les Paul Ultra-Form Fitted and Super Padded Case. Rated for shipping and travel/touring. (CASE ALONE COST $299) EXTREMELY NICE CASE! ● Black with All Gold Hardware (So classy) All USA HARDWARE ● Gibson Deluxe Tuners USA TUNERS ● Gibson Custom shop Alnico Pickups (the bridge pickup absolutely screams and the neck has that David Gilmour-esque kind of water droplet sound when you dig in with the pick. Its just amazing) (You can play anything with this guitar, I have not found a single style this guitar doesn't compliment!) ● USA CUSTOM SHOP PICKUPS ●Tune-O-Matic Bridge with adjustable string height posts to allow for very easy and instant string height adjustments ● All bridge hardware is TOP QUALITY USA Gibson custom shop materials! Super heavy duty solid stuff with fantastic sustain. Truly excellent materials for producing top of the line sustain, really heavy thick hardwaee. ●When you play this guitar without an amp it almost has an acoustic like quality. The sustain is THAT good! ●USA BRIDGE, POSTS, SADDLE, ETC. ● Solid Boutique sourced wood, Set-neck body, It ISN'T a Les Paul Guitar unless it has a Set-Neck Design. REAL original Les paul guitars are SET-NECK, it is essential to the Les Paul Design and sound! This one is a true USA CRAFTSMAN CUSTOM SHOP QUALITY SET-NECK. ● Guitar Body is made of ● Guitar Neck is made of ● Guitar FretBoard is made of ● Will come with a set of D'adarrio NYXL 9's on the guitar. They are about 2 weeks old (so not brand new but certainly good to go and they will be slightly down tuned to prevent any stress during shipping) Guitar WILL BE PROFESSIONALLY SHIPPED!!! I will take it to a local shop that ships instrument professionally and have it professionally boxed and shipped. Honestly though, it won't be a problem because the USA MADE ORIGINAL Gibson Les Paul Hard case that it comes with is incredibly form fitted to this guitar. I mean....it tightlllllly fits the guitar inside with no room for movement of any kind and it has locks on BOTH sides of the case. This guitar will have absolutely no issues during shipment. Bid quickly and pay within 24 hours or it goes to the next bidder MUST Pay immediately 24 hour maximum!!! This is not an auction for amateurs, serious buyers ONLY! Thank you so much for you time and good luck!", "ItemID": "273604892982", "EndTime": "2018-12-18T05:23:37.000Z", "StartTime": "2018-12-11T05:23:37.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2008-USA-Gibson-Les-Paul-Studio-Ebony-and-Gold-LIMITED-EDITION-PRO-SERVICED-/273604892982", "ListingType": "Chinese", "Location": "Clovis, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2736048929828080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/OTc1WDE2MDA=/z/J88AAOSwF8FcD0TU/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMTk1/z/oygAAOSwtYZcD0E5/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/jLoAAOSwqLRcD0Mn/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/rWsAAOSwtgZcD0NA/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA4MFgxNDQw/z/tJ0AAOSwEp5cD0NS/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODAyWDE1OTk=/z/k~YAAOSwIkNcD0Nu/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA4MVgxNDQw/z/cvAAAOSwdwVcD0Ob/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA4MFgxNjAw/z/BZoAAOSwcapcD0Ov/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/NpwAAOSwNUlcD0PW/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTQ0MFgxMDgw/z/6LkAAOSwBVdcD0QY/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTQ0MFgxMDgw/z/tZoAAOSw7eFcD0R7/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA4MFgxNjAw/z/CFYAAOSwqnVcD0Sj/$_12.JPG?set_id=880000500F"], "PostalCode": "93611", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "leonardmajere", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 106, "PositiveFeedbackPercent": 97.6}, "BidCount": 31, "ConvertedCurrentPrice": {"Value": 511.13, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 511.13, "CurrencyID": "USD"}, "HighBidder": {"UserID": "s***l", "FeedbackPrivate": true, "FeedbackRatingStar": "Purple", "FeedbackScore": 583}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2008 USA Gibson Les Paul Studio Ebony and Gold, LIMITED EDITION - PRO SERVICED!", "ItemSpecifics": {"NameValueList": [{"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Color", "Value": ["Ebony Gloss -Gold Hardware"]}, {"Name": "Model", "Value": ["Les Paul Studio"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["2008"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Custom Bundle", "Value": ["Yes"]}, {"Name": "Bundle Description", "Value": ["Guitar and Custom USA Hard Case"]}, {"Name": "Soundboard Style", "Value": ["Archtop"]}, {"Name": "Size", "Value": ["Full Size"]}, {"Name": "Product Line", "Value": ["Gibson Les Paul"]}, {"Name": "Features", "Value": ["Single Cut", "Volume Knob", "With Pickup"]}]}, "HitCount": 745, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 521.13, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "read product description for proper information.<br><br>Used, Pro Serviced 2 weeks ago, plays absolutely fantastic and sounds VERY very good. <br><br>These pickups are so good I considered removing them before selling it. I can't find any other pickups with this particular sound that I want, they are fantastic.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}