{"BestOfferEnabled": false, "Description": "Excellent condition. Only very light signs of use. Plays perfect. Clean setup with excellent action and tone. Includes used soft case. Save this seller Sign up for Shop newsletter Home About Us Contact Us Feedback Delivery RETURNS POLICY Epiphone Faded G-400 SG Faded Worn Cherry ___________________________________________ ZAWDIO \"Always The Best In New And Vintage Gear!\" ____________________________________________ Here is today's deal! Up for auction an excellent condition Epiphone Faded G-400 SG Electric Guitar, Faded Worn Cherry. This guitar is in perfect playing condition. Clean setup with excellent action and tone. Cosmetically excellent. Only very light signs of use. Please click above in the gallery images for close-ups. Includes used softcase. Thanks for looking! (10470) CHECK OUT our other great deals by clicking here Why Us Payment Shipping Our Terms ZAWDIO \"Suppliers of the greatest tools for art!\" ____________________________________________ Fueled by coffee, soul music and a compulsive need to find the coolest gear to play with, we seek out the finest and funnest vintage and new gear. In between touring live original disco/soul music and practicing our craft, we work with many musicians, studios and stores nationwide, to bring you the best tools of art we can find. Please take some time to look around our inventory. See if you can find something cool to strum, honk, squeek, shoot, whirl or distort. We hold fast to a belief that in our ever chaotic world that the best of who we all are is held to the light and beautiful in the art we make. Find your voice, find your instrument, play hard, sing loud! We'll listen. We accept payment via Paypal or by sending an adorable trained dog to our shop with cash in one of those Saint Bernard brandy casks. (note dog is non returnable) Ridiculous floppy ears optional. Note: Please double check your address with each payment. We will only ship to the address that is included with your PayPal payment. Our flat rate shipping price is only for the Lower 48 states. For HI, AK, PR or Guam please ask for a shipping estimate, as there may be additional shipping costs to get your item to you. If bidding from outside the US you must contact us to receive a shipping quote and our International shipping policies. We ship UPS ground over 5 lbs and USPS Priority under 5. Insurance is always included in our shipping price. Our Expedited shipping is USPS Priority and Standard is UPS ground. We ship within 1 business day with a cutoff time at about 1pm daily. We ship according to size as stated above If you provide us a P.O. box with a Large item purchase (guitar ect), it will likely be shipped there via UPS Ground, which could cause a delay in receiving your item . Please double check the address you enter for your ship to address. Please ask if you have questions. We use new packing materials and years of experience to protect your purchase all the way to your door. We will always make sure your item arrives safe! Guaranteed. Please make your payment or contact us within 24 hours of auction close. We try very hard to list accurately and communicate well throughout the sale of our items. We value your feedback and will work hard to do right by our deals. If you have any problem or concern please don't hesitate to contact us before leaving feedback. We'll always do our best to make it right. No need to worry about returns. If the item is not right just let us know. We offer a 30 day return policy. Ship it back to us for a full refund. No questions, No hassle :) \"Fantastic to deal with, quick shipment, great DEAL! GREAT ITEM!\" KORG CX3 61 Combo Organ \"WOW, shipping was very fast, great product. Thank you so much!!\" Protec Padded Sax \"Just got the keyboard plays and sounds great!!! NICE thank you\" Yamaha DX21 Synthesizer \"+++AAAA! Great deal. XLNT eBayer! Lightening shipping. Great communications\" La Patrie Classical Concert \"The guitar is simply AWESOME, thank you very much, I love it\" Gibson Les Paul Studio Vintage ...and many many more! © Copyright ZAWDIO | All rights reserved eBay design: MH Design Lab", "ItemID": "283312563639", "EndTime": "2018-12-26T16:04:15.000Z", "StartTime": "2018-12-21T21:24:45.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Epiphone-Faded-G-400-SG-Electric-Guitar-Faded-Worn-Cherry-/283312563639", "ListingType": "FixedPriceItem", "Location": "Bellingham, Washington", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2833125636398080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/OTYwWDEyODA=/z/yioAAOSw7R9cFAnt/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDEyODA=/z/4AUAAOSw1d9cFAnu/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDEyODA=/z/4EEAAOSwFs1cFAnu/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDEyODA=/z/VwkAAOSwZNtcFAnt/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDEyODA=/z/kBAAAOSwxZxcFAnu/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDEyODA=/z/f8sAAOSwnKFcFAnu/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDEyODA=/z/TSUAAOSwF5VcFAnu/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDEyODA=/z/nl8AAOSwip5cFAnt/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDEyODA=/z/w0EAAOSwHEZcFAnt/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDEyODA=/z/5DYAAOSwmaJcFAnu/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDEyODA=/z/suwAAOSwtutcFAnt/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDEyODA=/z/pngAAOSwFlJcFAnt/$_1.JPG?set_id=880000500F"], "PostalCode": "98225", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "conwayair", "FeedbackRatingStar": "Green", "FeedbackScore": 5911, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 275.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 275.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "r***g", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 675}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Epiphone Faded G-400 SG Electric Guitar, Faded Worn Cherry", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "Model", "Value": ["G-400  SG"]}, {"Name": "Body Color", "Value": ["Worn Cherry"]}]}, "HitCount": 102, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=187384248", "StoreName": "Zawdio"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "Excellent condition. Only very light signs of use. Plays perfect. Clean setup with excellent action and tone. Includes used soft case.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}