{"BestOfferEnabled": false, "Description": "ESP LTD EC-1000 (LEC1000STBC) Electric Guitar See-Thru Black Cherry w/ Hard Case Functional Condition: Used, in good playing condition. Nut has been replaced! Whats Included: Will come as seen in pictures with guitar and hard case only. Stand is for pictures only and is NOT included! Hard case is missing key. Cosmetic Condition: Guitar has a few scratches and small dings, but nothing major. Hard case shows some wear. See pictures. - Payment and Shipping - - Return Policy - Payment: We accept cash, credit card (for local pickup), and PayPal. After the auction ends, you will be sent an invoice through eBay. Please respond to this invoice with your intentions and payment method. After 2 days if we do not hear from you, a non-paying bidder alert will be filed on eBay. Shipping: Shipping with UPS: Shipping is determined by buyer’s ZIP code. Please enter your Zip code in the box above where it says \"Calculate Shipping\" and press the \"Calculate\" button to determine your shipping cost.We do NOT ship to AK, HI, and PR. We do NOT ship to P.O. Box!All orders of $250 or more will require in-person signature delivery confirmation.Shipping with USPS: Shipping is determined by buyer’s ZIP code. Please enter your Zip code in the box above where it says \"Calculate Shipping\" and press the \"Calculate button\" to determine your shipping cost. SPECIAL NOTE FOR INTERNATIONAL CUSTOMERS: SHIPPING VIA UPS & USPS WILL RESULT IN CUSTOM & BROKERAGE FEES WHICH YOU WILL BE RESPONSIBLE FOR. WE CAN NOT LABEL ANY PACKAGES AS \"GIFT\" NOR FALSIFY THE ACTUAL COST OF THE PRODUCTLocal Pickups: Shipping charges are waived for in-store pickups.Your purchase of the above item comes with a 30-day warranty from date of purchase. If the item you purchase arrives DOA, stops functioning properly within the warranty period, or is significantly different than the one described, you can contact us with your intention to return it within 30 days of receiving it. After we receive the item we will refund your purchase amount.If you wish to return your item for any reason other than the ones stated above (DOA, broken, not as described), a restocking fee (see your listing for details) will be deducted from the refund to cover processing fees and re-stocking costs. Shipping is not refunded.After 30 days, all sales are final.Any return MUST be sent back in the packaging it was received in, and include ALL accessories, cables, Remotes, Software, etc. the item(s) came with. We record all serial numbers, on items that have them, and these must match upon return. - About Us - Thank you for visiting LADA AB LLC eBay Store located in Columbus OH. We are celebrating 10 years of selling on eBay this year!! LADA AB LLC is committed to offering good-quality and low-cost items. Our primary mission is your satisfaction with our products and service. We try our best to ensure utmost customer satisfaction. Feel free to contact us 24/7 Thru eBay contact seller button above! - Feedback - - Customer Service - We do not believe in negative feedback, so please contact us before leaving any if unsatisfied with the transaction, and we will do our best to resolve the problem in way in which each party will be satisfied. If you are satisfied with your purchase, please leave positive feedback. PLEASE use eBay messages for communication, do not send emails. eBay messages are checked frequently and a response will be given ASAP.", "ItemID": "283304193307", "EndTime": "2019-01-29T03:49:46.000Z", "StartTime": "2018-12-14T19:54:41.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/ESP-LTD-EC-1000-LEC1000STBC-Electric-Guitar-See-Thru-Black-Cherry-w-Hard-Case-/283304193307", "ListingType": "FixedPriceItem", "Location": "Columbus, Ohio", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2833041933078080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMVgxNjAw/z/8mUAAOSw8L5cFAQ5/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNTk5/z/UxAAAOSwzd9cFAQ9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2M1gxNjAw/z/2nMAAOSwvERcFARA/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2M1gxNjAw/z/wIUAAOSwNXpcFARD/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2M1gxNjAw/z/SbkAAOSwnhlcFARF/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2M1gxNjAw/z/7VAAAOSw5wFcFARI/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2M1gxNjAw/z/2RYAAOSwkvtcFARX/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2M1gxNjAw/z/piIAAOSw4vpcFARK/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/5ckAAOSwmfhcFARO/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2M1gxNjAw/z/J58AAOSwH61cFARR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2M1gxNjAw/z/FV4AAOSwN5hcFART/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2M1gxNjAw/z/J6YAAOSwV3dcFARV/$_57.JPG?set_id=8800005007"], "PostalCode": "43209", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "look-here-buy-here", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 23901, "PositiveFeedbackPercent": 99.9, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 479.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 479.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "r***o", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 203}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "ESP LTD EC-1000 (LEC1000STBC) Electric Guitar See-Thru Black Cherry w/ Hard Case", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["ESP"]}, {"Name": "MPN", "Value": ["LEC1000STBC"]}, {"Name": "Model", "Value": ["EC-1000"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["See-Thru Black Cherry"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Material", "Value": ["Mahogany"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}]}, "HitCount": 346, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=596066758", "StoreName": "LADA SELL FOR LESS"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Used, in good playing condition. Nut has been replaced! Will come as seen in pictures with guitar and hard case only. Stand is for pictures only and is NOT included! Guitar has a few scratches and small dings, but nothing major. Hard case shows some wear and is missing key. See pictures.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}