{"BestOfferEnabled": false, "Description": "At top 40 guitarsour customers satisfaction is our first concern.All of out items have a 14 day return policy.If after 14 days you are not completely satisfiedwith your purchase, please return it for a full refund....Peace be with you... *all returned items must be in the same condition theywere at the time of sale. All original packing must be included. #5904 Up for Sale is a 2017 Gibson Les Paul Koa Limited Edition! Only 150 Made Worldwide! RARE! This is Really Cool. You are looking at a 2017 Gibson Les Paul Koa Limited Edition, with a natural finish on a figured Koa top and gold hardware. Gibson only produced 150 of these worldwide, so you won’t see to many of them out there. Aside from her gorgeous looks, she’s got a fast, low action and fantastic tone! She's 100% original and ready to rock your world! From The Web: With only 150 units available worldwide, this rare and beautiful Les Paul Flamed Koa is a guitar collector's dream. Its exquisite flamed Koa top is enhanced by a natural, full gloss nitrocellulose finish. It is adorned with elegant appointments including gold plated hardware and 7-ply white binding. The one piece rosewood fingerboard is bound with white binding and inlayed with genuine Mother of Pearl trapezoids. The mahogany neck, with its rounded profile, is rolled for unparalleled comfort and playability. Packing legendary tones, with a Burstbucker 1 and Burstbucker 3, and classic Gibson controls, it is also handwired with orange drop capacitors in a pure Gibson tradition. Delivered in a classic Gibson hardshell case with a Gibson premium leather strap, Gibson multi-tool and a polishing cloth. FEATURES Body Body shape: Single cutaway Body type: Solid body Body material: Solid wood Top wood: Koa Body wood: Mahogany Body finish: Gloss Orientation: Right handed Neck Neck shape: Rounded Neck wood: Mahogany Joint: Set-in Scale length: 24.75 in. Truss rod: Standard Neck finish: Gloss Fretboard Material: Rosewood Radius: 12 in. Fret size: Medium Number of frets: 22 Inlays: Trapezoid Nut width: 1.69 in. (43 mm) Pickups Configuration: HH Neck: BurstBucker 1 Middle: Not applicable Bridge: BurstBucker 3 Brand: Gibson Active or passive pickups: Passive Series or parallel: Series Piezo: Yes Active EQ: No Special electronics: None Controls Control layout: Volume 1, volume 2, tone 1, tone 2 Pickup switch: 3-way Coil tap or split: No Kill switch: No Hardware Bridge type: Fixed Bridge design: Tune-o-matic Tailpiece: Stopbar Tuning machines: Grover Color: Gold Other Number of strings: 6-string Special features: Limited edition, Top wood, Body and neck binding Case: Hardshell case Accessories: Truss-rod tool Country of origin: United States Our luthier did a complete setup. Brand new strings were installed. Gig ready on Arrival! She was born on June 16th, 2017. Number 131 of 150. Also included is the Gibson hard shell case, manual, Gibson leather strap, pickguard which has not been installed, and all case candy. Whoever brings this baby home is gonna be STOKED!! Serial Number: #170092595 Nut Width: 1.69\" Weight: 9.25 lbs. Complete Package with Gibson Hard Shell Case and all Case \"Candy\" Included! Due to CITES Treaty for Endangered Wood (Mahogany, Rosewood) We no longer ship out of the USA. Cosmetics: Excellent Condition. Pristine. No issues. I cannot find any flaws anywhere. If you are the personality type that picks apart everything, keep looking. Just buy something new. For everyone else; you'll love this guitar. As close to perfection as you can get. Dripping with \"Mojo\". It is used. Not perfect. Overall, a really nice guitar. Look at the pictures closely. They will tell the story. Top 40 guitars is a Veteran owned business.", "ItemID": "143093385485", "EndTime": "2019-01-28T02:05:35.000Z", "StartTime": "2019-01-18T02:05:35.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2017-Gibson-Les-Paul-Koa-Limited-Edition-w-Case-Gorgeous-Koa-Top-NO-RESERVE-/143093385485", "ListingType": "Chinese", "Location": "Santee, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1430933854858080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTQ4MVgxMDk0/z/orwAAOSw93xcP9eK/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTUwN1g5ODQ=/z/-rkAAOSwH1pcP9gP/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTUwN1g5MDk=/z/4dkAAOSwa3lcP9jh/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI0OFg5NDA=/z/fEcAAOSwRZlcP9hv/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI2NVg4NDM=/z/QDIAAOSw-QxcP9lf/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTMwOVg5OTM=/z/scAAAOSwW~FcP9kq/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAzN1gxNTQz/z/Nd8AAOSwt~1cP9wL/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTQ0WDE1MTk=/z/i6QAAOSw651cP9vJ/$_57.JPG?set_id=8800005007"], "PostalCode": "92071", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "top40powertrio", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 13196, "PositiveFeedbackPercent": 99.7}, "BidCount": 22, "ConvertedCurrentPrice": {"Value": 2649.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2649.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "u***u", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 33}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2017 Gibson Les Paul Koa Limited Edition w / Case! Gorgeous Koa Top! NO RESERVE!", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Les Paul Koa Limited Edition"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Model Year", "Value": ["2017"]}, {"Name": "Body Color", "Value": ["Natural Koa Finish"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}]}, "HitCount": 536, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=47416021", "StoreName": "Top 40 Guitars"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 2699.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "2017 Gibson Les Paul Koa Limited Edition, Excellent Condition, See ad below for Full Description", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}