{"BestOfferEnabled": true, "Description": "PLEASE VIEW ALL PHOTOS AND DESCRIPTION CAREFULLY \"The Aurora Borealis\" WHY HAVE A GUITAR THAT LOOKS LIKE EVERYONE ELSE'S?........WHEN YOU CAN WHEN YOU CAN BE UNIQUE! Each guitar painted here by us is unique and One-of-a-Kind This is one of the coolest looking Ibanez Gio's you will ever see. This Ibanez has been completely gone through and there are no known issues. It has all new electronics, with New NDGV Black Predator Humbucker pickups, with Push/Pull Coil Splitting pot (For Both Pickups). This guitar has been custom swirl painted with a black base and Mint and Burgundy on top (To give it that trans-color look) It also has a new 3ply black pickguard, new chrome barrel knobs, and new tremolo bar. This guitar has been setup (With new Ernie Ball Super Slinky 9s) and is ready to ROCK! Please View Full Item Description for more photos. Custom Swirl Painted and Upgraded Ibanez RG Gio Electric Guitar Click images to enlarge Description PLEASE VIEW ALL PHOTOS AND DESCRIPTION CAREFULLY  \"The Aurora Borealis\" WHY HAVE A GUITAR THAT LOOKS LIKE EVERYONE ELSE'S?........WHEN YOU CAN WHEN YOU CAN BE UNIQUE!  Each guitar painted here by us is unique and One-of-a-Kind This is one of the coolest looking Ibanez Gio's you will ever see.  This Ibanez has been completely gone through and there are no known issues. It has all new electronics, with New NDGV Black Predator Humbucker pickups, with Push/Pull Coil Splitting pot (For Both Pickups). This guitar has been custom swirl painted with a black base and Mint and Burgundy on top (To give it that trans-color look) It also has a new 3ply black pickguard, new chrome barrel knobs, and new tremolo bar. This guitar has been setup (With new Ernie Ball Super Slinky 9s) and is ready to ROCK!  UPGRADES: New Custom Swirl Painted With Gloss Lacquer Clear Coat (Black, Trans Mint, and Trans Burgundy)  New NDGV Black Predator Humbucker Pickups (With Push/Pull Coil Spitting Pot for Both Pickups) New 500K Pots New 3 Way Blade Switch  New Ernie Ball Super Slinky Strings New Chrome Barrel Knobs New Black 3 Ply Pickguard New Chrome Tremolo Bar New 1/4 Jack This guitar is a SCREAMER!  DISCLAIMER:  This is not a factory finish, all custom finishes are done here at Naked Dave's. Guitar has been wet sanded to remove 99% of the orange peel. It has been hand buffed to a Gloss (Lacquer) finish. We try to do our best in taking photos, however color in photos may not be exact. Also guitar is be shipped from a warm/Dry state (AZ), if it is being shipped to a cold/wet area the neck may need to be adjusted when it arrives. Check out our eBay Store for other really cool guitars. Payment Payment: Payment is due immediately. We accept payment by Pay-Pal & can only ship to a Pay-Pal verified address. If your address is not verified we will hold off on shipping until it is or cancel the sale of this item. Shipping International Buyers Please Note: Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer's responsibility. Please check with your country's customs office to determine what these additional costs will be prior to bidding/buying. These charges are normally collected by the delivering freight (shipping) company or when you pick the item up, do not confuse them for additional shipping charges. We do not mark merchandise values below value or mark items as \"gifts\" - US and International government regulations prohibit such behavior. Some item's we can only ship in the Continental United States because of weight & size of package. Shipping: Winning bidder to pay all shipping costs unless stated differently in the auction. Please inquire as to exact costs. Free shipping: When offered is only good for the Continental United States. Resident's of Hawaii and Alaska must write us for a shipping quote. We do not ship to PO boxes or third party addresses. Combined Shipping: We will combine shipping when items will not be damaged by doing so. Combined shipping is good only for products purchased and paid for on the same day. If you have any question's about shipping please write in advance and include your zip code so we are able to answer you correctly. Terms of Sale FEEDBACK Feedback is automated, once you leave us a positive feedback the automated system will leave you positive feedback in return. We reserve the right to cancel any and all bids from bidders: If you have bid & won from us before and not paid. If shipping and/or packing cost greatly exceed quoted price. If you live in a country we do not ship to. If you pay with PayPal and your ship to address has NOT been confirmed by PayPal. If your registered address with E-bay doesn't match your address on file with PayPal. Warranty: We sell new and gently used merchandise. Used Items: If your item is used we are unable to offer any warranty although we do have our tech's check out all used equipment to make sure it's in good working order before we list here on E-bay. New Items: When offered new products come with a manufactures warranty. Keep your packing slip as your receipt for proof of purchase. ITEMS DAMAGED IN SHIPPING: If your item is damaged in shipping please contact us so we can start the claim process. Contact Us E-Mail: If you have any questions please e-mail us through Ebay. Pictures sell! Auctiva offers Free Image Hosting and Editing.250+ Listing Templates! Auctiva gets you noticed! Attention Sellers - Get Templates Image Hosting, Scheduling at Auctiva.com.", "ItemID": "254042491526", "EndTime": "2019-01-01T02:36:24.000Z", "StartTime": "2018-12-28T04:02:30.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Custom-Swirl-Painted-and-Upgraded-Ibanez-RG-Gio-Electric-Guitar-/254042491526", "ListingType": "FixedPriceItem", "Location": "Mesa, Arizona", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2540424915268080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTAyNFg3MjA=/z/O1kAAOSw-rxb~ges/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/Nzg3WDEyODA=/z/hCUAAOSwEKpb~ges/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODUzWDEyODA=/z/i54AAOSwxFVb~ges/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/Nzg0WDEyODA=/z/1V4AAOSwCvFb~ges/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODUzWDEyODA=/z/tmoAAOSwnfRb~ges/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzUzWDEyODA=/z/1P0AAOSwwFNb~ges/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODUzWDEyODA=/z/9WMAAOSwfMlb~ges/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzEwWDEyODA=/z/siMAAOSwKtlb~get/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/Nzk1WDEyODA=/z/~U0AAOSwF7lb~get/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg2OTc=/z/6iIAAOSwrmRb~get/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODUzWDEyODA=/z/XRsAAOSwADxb~geu/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODc5WDEyODA=/z/y7sAAOSwXMxb~get/$_1.JPG?set_id=880000500F"], "PostalCode": "85202", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "nakeddavesgearvault", "FeedbackRatingStar": "Purple", "FeedbackScore": 740, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 369.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 369.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "g***i", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 35}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Americas", "Europe", "Asia", "AU"], "Site": "US", "TimeLeft": "PT0S", "Title": "Custom Swirl Painted and Upgraded Ibanez RG Gio Electric Guitar", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Custom Swirl Painted"]}, {"Name": "Brand", "Value": ["Ibanez"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Size", "Value": ["Full Size"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["RG GIO"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Country/Region of Manufacture", "Value": ["China"]}, {"Name": "MPN", "Value": ["Does not apply"]}, {"Name": "Model Year", "Value": ["2011"]}, {"Name": "Modification Description", "Value": ["Custom Painted and Upgraded"]}, {"Name": "Modified Item", "Value": ["Yes"]}]}, "HitCount": 25, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=41774047", "StoreName": "nakeddavesgearvault"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "14 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Middle East", "South America", "AL", "AD", "BY", "BA", "BG", "HR", "CY", "EE", "GI", "LV", "LI", "LT", "MK", "MT", "MD", "MC", "ME", "PT", "SM", "RS", "SK", "SI", "ES", "SJ", "DM", "DO", "SV", "GD", "GP", "GT", "HT", "HN", "NI", "BN", "KH", "HK", "ID", "LA", "MO", "MY", "PH", "SG", "TW", "VN", "BM", "GL", "MX", "PM", "AF", "AM", "AZ", "BD", "BT", "CN", "GE", "IN", "KZ", "KG", "MV", "MN", "NP", "PK", "LK", "TJ", "TM", "UZ", "PO Box"], "GlobalShipping": false, "ConditionDescription": "“This guitar is in \"Very Good\" Condition”", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}