{"BestOfferEnabled": false, "Description": "Westone Electra Dynasty 1984 V Style Electric Guitar Matsumoku Japan Working Condition - ✔ ✔ ✔ ✔ 4 out of 4 checks! This item was tested by one of our techs & found to be in excellent functioning condition.  When you get the item, it will have all features and functions fully operational. For more information on how we tested this item, read the full listing. Cosmetic Condition - ✪✪✪   3 out of 5 stars. This item is in good cosmetic condition with average wear for this type of item. It will likely have minor to average wear for an item of this type. Be sure to check out the photos for more details. If any flaws stood out to us, we'll make note of it here: Non-original clear back electronics cover. Various wear on the back plate plastic, neck plate. Various etc dings on the points/ some rubberized material on the body points (possibly plasti-dipped?). A couple of the screws are stripped. Missing strap button. There is some light stress fracturing around neck as shown. AccessoriesGuitar only Details & Specs This information is to be used for reference only. Accessories or warranties mentioned may not apply to this listing. Please check the accessories section and photos to see everything that comes with this item. Tekglide trem bridgeBlack hardware3-way switch for humbuckersPush pull knob for single coilCoil split for both humbuckersPhase adjust for bridge pickupMaple body22 fret maple neck Musical Instruments We spend a lot of time trying to bring you the best quality goods possible for the best prices on eBay! Our musical instrument guy knows his stuff.. he knows how to play hot cross buns (and a few hundred other songs) on nearly any instrument known to man in almost any time signature and style on the planet. He also knows how to take a apart and repair almost any common repair on the most popular instruments. Bragging aside, when he checks out an instrument, he does a multi point inspection of the following: Brass Pad condition Corking condition Check for dings, dents, scratches, and corrosion Tone hole wear and condition Condition of lacquering or corrosion Amount of play on key rods & pivots Neck condition Accessories included  Woodwind Pad condition Corking condition Check for cracks, chips, etc.  Accessories included Condition of metal pieces Check for non-original pieces Note the mouthpiece type (if applicable) String Inspect sound post & bridge Inspect or any non-original accessories Check for cracks, chips or finish issues Tuner condition & ability to hold tune Check condition of the fingerboard Check of included accessories Condition of bow tightener & hair Accordions, Keyboards, & Pianos Functionality of all keys Sustain, pitch, etc functionality Sound output Display/ light functionality (if applicable) Condition of bellows (if applicable) Drums & Percussion Measure size and diameter  Note condition of tensioners, bolts, & strainer if applicable Note any accessories included Check condition of bottom & top head Look for corrosion on any of the metal parts Shipping All items will be well packaged and shipped within 1 business day of the day of purchase, excluding holidays. Also, please be aware of any natural disasters that may affect your items transit time.  Due to eBay and Paypal regulations, we can only ship to Paypal confirmed addresses so please make sure the address you intend to have your items shipped to is confirmed through Paypal before bidding or buying. Import duties, taxes, and charges are not included in the item price or shipping cost and these charges are the buyer's responsibility. Please check with your country's customs office to determine what these additional costs will be prior to bidding or buying. Please make sure you are able to accept delivery of an item before purchasing from us, and we cannot be held liable if you are unable to accept delivery. Currently, we are not able to offer local pickup. Unfortunately, we no longer offer shipping to Puerto Rico, Guam, Virgin Islands, APO, FPO, Hawaii & Alaska. Any item that cannot fit into a USPS Standard Flat Rate Envelope, will be shipped via Fedex Ground or Fedex SmartPost at our discretion. Fedex will not deliver to P.O., APO or FPO Boxes so we will need a physical street address before shipping. If the item has been shipped and returned because a PO Box, APO or FPO was listed as the address, we will require additional shipping fees to be paid before resending and we will not responsible for the corrective shipping fees. We try our best to catch these address discrepancies before shipping and we may contact you for a correction but sometimes they are missed. Please note that any oversize or bulky items may be partially or totally disassembled in order to offer a reasonable shipping rate. Some examples of these items include: bicycles, bicycle racks, vending/restaurant equipment, large musical instruments, large lawn equipment, etc.  Terms Product Information It is important to us that you fully understand the condition, specifications, and proper application of the items you’re intending to purchase.  Please feel free to ask any and all questions before buying/bidding, as we will not be held liable once a bid/purchase has been made. If an item or accessory is not pictured or listed in the included accessories category, it is not included. Payment Payment must be made within 24 hours after auction ends unless you contact us to make payment arrangements that we are willing to agree to(normally we are willing to work something out within reason). If payment is not made within 24 hours after an Auction/Buy it Now listing ends, we reserve the right to re-list or offer the item to a runner up bidder at our discretion(by winning an auction and not paying for it in full within 24 hours you agree to not leave negative feedback if the item is re-listed or sold to another party).  Bidding If you have zero or negative feedback  within the last 30 days, you must contact us before bidding so that we can verify your intent to purchase and be sure you understand all terms and conditions. Returns Your satisfaction is VERY important to us and we would like a chance to make sure you have an excellent experience when dealing with us so please message us via eBay with any concerns or questions. Thank you! We offer a 30-day return policy on any item that may arrive DOA or are defective (does not apply to items sold “AS-IS” or items sold for “Parts”). Buyer must contact us for approval before returning any merchandise, and is responsible for any return shipping charges. Any returned item must include all of the original accessories included in the original sale and must be in the same condition as pictured and described in the sale.  Defective or DOA Items will undergo an inspection and testing once they are received. Pending results after testing, any refund will be issued within 5 business days. Contact If you ever need to reach us, you can always contact us through eBay and we’ll do our best to get back to you within 24 hours. We normally respond between the hours of 9AM & 5PM Monday-Friday central time. Please note that we aren’t open most national (US) holidays. _gsrx_vers_841 (GS 7.0.16 (841))", "ItemID": "401646784376", "EndTime": "2019-01-14T03:37:48.000Z", "StartTime": "2018-11-29T00:10:42.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Westone-Electra-Dynasty-1984-V-Style-Electric-Guitar-Matsumoku-Japan-/401646784376", "ListingType": "FixedPriceItem", "Location": "Minneapolis, Minnesota", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/4016467843768080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTU5OVgxMTk5/z/7PUAAOSwDX5b~y50/$_3.JPG", "https://i.ebayimg.com/00/s/MTU5OVgxMTk5/z/zu8AAOSw2-pb~y52/$_3.JPG", "https://i.ebayimg.com/00/s/MTU5OVgxMTk5/z/zh8AAOSwVP5b~y52/$_3.JPG", "https://i.ebayimg.com/00/s/MTU5OVgxMTk5/z/dacAAOSw1qhb~y54/$_3.JPG", "https://i.ebayimg.com/00/s/MTU5OVgxMTk5/z/rvgAAOSwbbJb~y55/$_3.JPG", "https://i.ebayimg.com/00/s/MTU5OVgxMTk5/z/RkMAAOSwi3xb~y55/$_3.JPG", "https://i.ebayimg.com/00/s/MTU5OVgxMTk5/z/eyYAAOSwip5b~y56/$_3.JPG", "https://i.ebayimg.com/00/s/MTU5OVgxMTk5/z/Fm8AAOSwoEFb~y58/$_3.JPG", "https://i.ebayimg.com/00/s/MTU5OVgxMTk5/z/4-IAAOSw5qdb~y58/$_3.JPG", "https://i.ebayimg.com/00/s/MTU5OVgxMTk5/z/R6gAAOSwWI5b~y5-/$_3.JPG", "https://i.ebayimg.com/00/s/MTU5OVgxMTk5/z/uVMAAOSwYUZb~y5-/$_3.JPG", "https://i.ebayimg.com/00/s/MTE5OVgxNTk5/z/9MwAAOSwa1hb~y5~/$_3.JPG"], "PostalCode": "55405", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "remergegoods", "FeedbackRatingStar": "Green", "FeedbackScore": 7925, "PositiveFeedbackPercent": 98.8}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 271.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 271.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "e***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 633}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "CA", "GB", "DK", "RO", "SK", "BG", "CZ", "FI", "HU", "LV", "LT", "MT", "EE", "AU", "GR", "PT", "CY", "SI", "JP", "CN", "SE", "KR", "ID", "TW", "TH", "BE", "FR", "HK", "IE", "NL", "PL", "ES", "IT", "DE", "AT", "BS", "IL", "MX", "NZ", "PH", "SG", "CH", "NO", "SA", "UA", "AE", "QA", "KW", "BH", "HR", "MY", "CL", "CO", "CR", "PA", "TT", "GT", "HN", "JM", "AG", "AW", "BZ", "DM", "GD", "KN", "LC", "MS", "TC", "BB", "BD", "BM", "BN", "BO", "EG", "GF", "GG", "GI", "GP", "IS", "JE", "JO", "KH", "KY", "LI", "LK", "LU", "MC", "MO", "MQ", "MV", "NI", "OM", "PK", "PY", "RE"], "Site": "US", "TimeLeft": "PT0S", "Title": "Westone Electra Dynasty 1984 V Style Electric Guitar Matsumoku Japan", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Westone"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Body Color", "Value": ["Green"]}]}, "HitCount": 703, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=704397444", "StoreName": "ReMerge Goods"}, "Country": "US", "ReturnPolicy": {"Refund": "Money back or replacement (buyer's choice)", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "APO/FPO", "US Protectorates", "PO Box", "WS", "TV", "KI", "VU", "WF", "PF", "CK", "NC", "PG", "NU", "MH", "SB", "GU", "FJ", "TO", "AS", "FM", "NR", "PW", "RU", "ME", "AL", "SJ", "RS", "BY", "BA", "SM", "MK", "MD", "AD", "VA", "SV", "AI", "VG", "PR", "VC", "HT", "AN", "VI", "DO", "VN", "LA", "BR", "FK", "PE", "EC", "GY", "AR", "UY", "SR", "VE", "CI", "YT", "SH", "GW", "BJ", "KM", "MA", "CV", "EH", "MU", "RW", "GN", "ER", "DJ", "CM", "MR", "SN", "CG", "MW", "GH", "LY", "GQ", "BW", "MG", "NG", "LR", "TG", "ZW", "TN", "BI", "NE", "KE", "LS", "TD", "ZM", "SL", "AO", "SZ", "GM", "BF", "ZA", "NA", "TZ", "CF", "UG", "SC", "ML", "GA", "DZ", "ET", "CD", "SO", "MZ", "IQ", "LB", "TR", "YE", "NP", "AM", "GE", "AF", "BT", "KG", "KZ", "TM", "MN", "AZ", "UZ", "TJ", "IN"], "GlobalShipping": true, "ConditionDescription": "Please read the full description below for information on condition, functionality, and details.", "QuantitySoldByPickupInStore": 0, "SKU": "E15765WESTONE", "NewBestOffer": false}