{"BestOfferEnabled": true, "Description": "Up for auction is a Fernandes FST-55 TheFunction Strat produced in the late 80’s or early 90’s in excellent condition. Note that the headstock on this particular model is a copy of the Fender Stratocaster guitars known as the “pre-lawsuit” models (Fernandes started to change the headstock on these guitars in the 80’s due to a threat of a lawsuit by Fender and Gibson for their Burny line of Les Paul guitars and Strat models).This particular model (FST-55) is part of a series called “The Function” (there were numerous variations produced under these series) this particular one has the HSS pick up configuration and locking nut and 2-point pivot tremolo(non-locking) with fine tuners on top of the block – note that the arm as well as the locking pieces at the nut are missing. The pickups are passive and they all have a plastic cover giving a high end look. The tone pot has a push-pull function that allows the humbucking pick up in the bridge position to be split to a single coil giving additional 2 different tonal variations in position 1 and 2 of the selector switch. Serial# L156XXX. This guitar sold new for over $500 back in the 80’s –this is equivalent to $1,100.00 today so it was not an “entry” level type guitar.The wood and materials used were high quality since there were abundance of great woods back then, unfortunately not the case today.The body (Alder) color is a very nice black with the matching headstock and black hardware. The tuning gears are made by Gotoh and the paint still shines like a new guitar! There are a few dings and nicks that I tried to show in the photos but nothing that sticks out too much.I imported this guitar from Japan a while back, never played it much and never took it outside the house. It stayed in a soft case for the most part so it could use new strings and some set-up but it is very playable \"as is\". I like it a lot but I’m trying to “downsize” my guitar collection. The neck shape is a “U” shape – more on the thinner side. The width at the nut is about 1 5/8” (40.5 mm). There is no visible wear on the frets and none in the back of the neck which shows a really nice grain pattern. It is has a rare 24.75\" scale (Les Paul scale).The radius on the fretboard is a modern 14”. All the electronics are original as well as the pickups and everything works. This guitar has long have been out of production and it is a very rare model especially in this condition! The fit and finish of these guitars are excellent (I own a few other Fernandes guitars from the 80’s and they are all great guitars) rivaling other more famous brands that costs much more. Since I'm starting the bid low and without reserve, it will be sold \"as is\". But bid with confidence - this is a great sounding guitar in good condition for a very low price! I have this guitar listed locally as well as in other auction sites so I reserve the right to end the listing early if I sell it through one of these other outlets. Payment method preferred is Paypal and it is expected within 48 hours after the end of the auction. Note that the actual shipping charges shown do not include insurance – if you would like to add insurance or signature confirmation please contact me so I can re-calculate and add these services to the shipping charges. If you use buy it now I will pay for shipping to anywhere in the continental US. Sorry but no international bidders for this one! If you don’t have at least 10 positive feedback or if you have negative feedback, please do not bid. I’m tired of getting “burned” with non-paying bidders - note I have the right to cancel your bid if I find it to be a suspicious one! Good luck and happy bidding! Please check my other auctions.", "ItemID": "132901047912", "EndTime": "2019-01-03T17:19:30.000Z", "StartTime": "2018-12-27T17:19:30.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fernandes-Fender-Stratocaster-Strat-FST-55-Black-Ros-Function-Rare-NR-/132901047912", "ListingType": "Chinese", "Location": "Sumter, South Carolina", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1329010479128080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NzM0WDE1NjA=/z/aj4AAOSwrpJcJQXd/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzMyWDE1OTM=/z/JnkAAOSwFu1cJQXs/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTczWDE1NzQ=/z/BTYAAOSwzFhcJQX4/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODE0WDE2MDA=/z/yOsAAOSwW9NcJQYE/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjIwWDE1OTI=/z/pisAAOSwVcZcJQYN/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjM5WDE0ODE=/z/WsgAAOSwq2xcJQYT/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjY2WDE1NDM=/z/YusAAOSwqRlcJQYa/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODUxWDE2MDA=/z/q~QAAOSwqiJcJQdR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAyM1gxMzcz/z/EbgAAOSwFlJcJQYh/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjAwWDE1NTY=/z/HHAAAOSwuNNcJQYy/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODE0WDE2MDA=/z/X7YAAOSwws5cJQY8/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTM4WDE1ODA=/z/5qEAAOSw6n9cJQdf/$_57.JPG?set_id=8800005007"], "PostalCode": "29150", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "starstruck2014", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 232, "PositiveFeedbackPercent": 100.0}, "BidCount": 2, "ConvertedCurrentPrice": {"Value": 249.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 249.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "3***0", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 81}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Fernandes Fender Stratocaster / Strat FST-55 Black Ros The Function Rare NR ", "ItemSpecifics": {"NameValueList": [{"Name": "Body Material", "Value": ["Alder"]}, {"Name": "Brand", "Value": ["Fernandes"]}, {"Name": "Model", "Value": ["Stratocaster"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Body Color", "Value": ["Blue"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}]}, "HitCount": 141, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 252.49, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["CN"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}