{"BestOfferEnabled": false, "Description": "Fibenare Eagle Erotic Fireburst Six String Right Handed Electric Guitar Product Description 131606-FORF131606-c700-GTA9-DK 131606-FORF131606-c700-GTA9-DK This handcrafted one-off masterpiece speaks for itself.  It is an amazing guitar for any serious collector or a player who wants to make a statement of patriotism/just being a bad muthaf*cker. It has only been played a few times and is in mint condition.  Handmade in Hungary.   Brand: Fibenare Instrument Name:  Instrument Type: Electric Guitar Number of Strings: 6 String Make location: Hungary Dexterity: Right Handed Specs: Alder Body, 5A poplar burl Top flame maple and padouk neck Padouk Fingerboard Wraparound Bridge Hand carved Eagle on upper bout Y-65 neck pickup, Y-54 middle, Y-T bridge comes with original hardshell case   NOTE: If it’s not in the photos it’s not included. If you see an item that is in box, please note that we are not selling an empty box.     FREQUENTLY ASKED QUESTIONS & SALE AGREEMENT by bidding on or purchasing one of our items you agree to the terms below.   When will my item ship?   All items ship within three (3) business days which are Monday - Friday. We try to beat that but it is not always possible.   When will my question be answered?   We are available to answer questions Monday - Friday between 10am and 5pm.    Item Description:   We do our absolute best here to accurately describe every time but sometimes we miss something, if you see something wrong in a listing please send us a message and let us know and we will address the situation accordingly.   Partial Refunds:   Due to an extremely high rate of fraud, partial refunds are against our company policy, We offer a 100% Money Back guarantee if you are not happy with your item.    If you are unhappy with your purchase, please file a return request and we will provide a prepaid return shipping label. We are not responsible for the printing of the label, or the pick up/drop off of the returned item.    As stated above, we try our best to accurately describe items, but errors happen and when dealing with used products sometimes we miss something. We strive for 5 Star Ratings and 100% Positive feedback. If you do not feel it was a 5 star transaction contact me ASAP and we will do whatever we can to make it right.    About This Product:   If you are looking for further details, you might want to check the manufacturer or publisher website. Their sites frequently contain details about an item’s specification such as physical dimensions, size, weight, included accessories, format, edition, version, color, etc. Additionally, we are not able provide technical, warranty support or confirm if an item is compatible.   Payment:   Buyers located within the state of New Jersey, please take note: New Jersey Sales Tax will be applied to each transaction, as per New Jersey state law.    Shipping:   We offer both FedEx and USPS domestic shipping options, but please be aware that FedEx will not deliver to a PO Box. If you choose FedEx for shipping and you have a PO Box, your order will be canceled.   We do not ship to APOs and will NOT lie on customs forms. This is illegal and please bid accordingly based on the import taxes/duties relative to your country.   We can not alter shipping addresses after payment and checkout has been made.    We reserve the right to alter shipping methods and carriers at our sole discretion without warning. *We do our absolute best to accurately describe every item. Sometimes we miss something. Please notify us if you see something listed inaccurately and we will address the situation right away. Additional Details Entreprenartist Entreprenartist is committed to honesty and transparency. We are a company that cares about our customers; making sure that customers find exactly what they want is our number one priority. Feedback We take our clients' feedback very seriously and strive to address the needs of every customer. However, sometimes a product fails to live up to expectations. As a marketplace platform, we will address any issues as soon as possible and are always ready to hear from you. Shipping Your item will enter our patented distribution process immediately upon purchase. We guarantee that all items ship within three (3) business days (Monday - Friday) but you'll find that we often get it out to you much faster than that. We offer both FedEx and USPS domestic shipping options, but please be aware that FedEx will not deliver to a PO Box. If you choose FedEx for shipping and you have a PO Box, your order will be canceled. All international orders will be fulfilled by either UPS or USPS. We do not ship to APOs and will NOT make changes on customs forms. Please bid accordingly based on the import taxes/duties relative to your country. We can not alter shipping addresses after payment and checkout have concluded. We reserve the right to alter shipping methods and carriers at our sole discretion without warning. We reserve the right to use whichever delivery method we deem best. All orders will be shipped within 3 business days and customers will be notified of tracking via email. If it's not in the photos it's not included. If you see a boxed item, please rest assured that we are not selling an empty box. Returns We offer hassle-free 30 day returns. If you are unhappy with your purchase, please file a return request and we will provide a prepaid return shipping label. We are not responsible for printing the label, nor mailing the returned item. Depending on the nature of the return, we reserve the right to charge return shipping. In instances where it is our fault (received wrong item, received broken item, etc.) return shipping will not be charged. All returns are subject to a restocking fee. For items shipped as new, the restocking fee is 15% - once the item has been either opened or the exterior packaging altered in any way. Partial refunds are not available. However, we offer a 100% Money Back guarantee if you are not happy with your item. If you do not feel that a transaction was ideal, contact us and we will do whatever we can to make it right. By bidding on or purchasing one of our items you agree to the terms above. Entreprenartist", "ItemID": "202524182292", "EndTime": "2018-12-10T22:50:15.000Z", "StartTime": "2018-12-03T22:50:15.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fibenare-Eagle-Erotic-Fireburst-Six-String-Right-Handed-Electric-Guitar-/202524182292", "ListingType": "Chinese", "Location": "Wayne, New Jersey", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2025241822928080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/QFMAAOSwvENcBbMu/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/0LUAAOSwjMtcBbMr/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/IiYAAOSwxG9cBbMs/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/E1IAAOSwTSlcBbMt/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/1wwAAOSw0~pcBbMt/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/9OEAAOSwKphcBbMu/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/fLYAAOSw~xtcBbMs/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/7lYAAOSwIddcBbMs/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/sGUAAOSwMg5cBbMr/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/jxkAAOSwikJcBbMr/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/MlIAAOSwcDdcBbMu/$_1.JPG?set_id=880000500F"], "PostalCode": "07470", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "entreprenartist", "FeedbackRatingStar": "TurquoiseShooting", "FeedbackScore": 32586, "PositiveFeedbackPercent": 96.5}, "BidCount": 25, "ConvertedCurrentPrice": {"Value": 1025.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1025.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "s***o", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1459}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Fibenare Eagle Erotic Fireburst Six String Right Handed Electric Guitar", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fibenare"]}, {"Name": "MPN", "Value": ["N/A"]}, {"Name": "Model", "Value": ["Eagle Erotic"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Dexterity", "Value": ["Right Handed"]}, {"Name": "Bundle Listing", "Value": ["No"]}]}, "HitCount": 322, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1077122905", "StoreName": "entreprenartist"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 1050.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "SKU": "131606-FORF131606-c700-GTA9-DK", "NewBestOffer": false}