{"BestOfferEnabled": false, "Description": "Charvel DST3 FR Star Floyd Rose Jackson TSA Flight Hard Case DTS-3 Click images to enlarge Description CHARVEL DST-3 FR STAR ELECTRIC GUITAR. COLOR IS WHITE WITH BLACK NICKEL HARDWARE (DISCOLORED). COMES WITH A FITTED TSA JACKSON FLIGHT CASE WITH KEYS AND DUNLOP STRAP LOCKS. YOU MAY NEED TO SET IT UP TO YOUR PLAYING STYLE. TESTED AND WORKS AS IT SHOULD. IT HAS A SMALL INDENT IN THE UPPER CENTER BACK OF THE GUITAR AS SEEN, SOME PAINT NICKS ON THE ENDS AS SEEN, SOME FINE SCRATCHES ON THE BACK THAT DOESN'T SHOW UP IN THE PICS BUT MAY BE ABLE TO BUFF THEM OUT, AND THE BACKSIDE OF THE HEADSTOCK WOOD IS CHIPPED OFF AS SEEN IN THE PICS BUT YOU CAN NOT SEE IT FROM THE FRONT OF THE HEADSTOCK. THIS IS A GREAT SOLID PLAYING GUITAR. COMES WITH A JACKSON TSA FLIGHT HARD CASE. YOU DON'T SEE THIS MODEL TO OFTEN.  The Desolation Star DST-3 FR 1H hails the return of Charvel’s classic Star body profile, with features including a bolt-on maple neck with angled heel, 12”-radius rosewood fingerboard with 24 jumbo frets and dot inlays, single humbucking pickup with black bezel, single domed metal volume control knob, Floyd Rose Special® locking tremolo, sealed die-cast tuners and black nickel hardware. With a variety of features and finishes, the Desolation Star DST delivers the devastating tone, killer looks and high-performance playability that separate the Desolation series from others.       ONLY SHIP TO THE LOWER 48 USA STATES.    PLEASE CHECK OUT ALL THE PICTURES IN SUPERSIZE AND ASK ANY QUESTIONS BEFORE PURCHASE. SOLD AS IS. NO RETURNS. PAYMENT DUE WITHIN 48 HOURS OF PURCHASE. ONLY ACCEPT PAYPAL AT THIS TIME. PLEASE CHECK OUT OUR STORE J'S MUSIC AND MORE FOR MORE GREAT DEALS AND RARE ITEMS!! Get images that make Supersized seem small.Tailor your auctions with Auctiva's Listing Templates! THE simple solution for eBay sellers. Track Page Views WithAuctiva's FREE Counter", "ItemID": "292893931434", "EndTime": "2018-12-30T08:44:49.000Z", "StartTime": "2018-12-29T00:18:37.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Charvel-DST3-FR-Star-Floyd-Rose-Jackson-TSA-Flight-Hard-Case-DTS-3-/292893931434", "ListingType": "FixedPriceItem", "Location": "Lumberton, North Carolina", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2928939314348080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/OTYwWDEyODA=/z/9DYAAOSwzgtcDtYv/$_1.JPG?set_id=880000500F"], "PostalCode": "28359", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "diceman_28358", "FeedbackRatingStar": "Red", "FeedbackScore": 3579, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 379.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 379.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 35}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Charvel DST3 FR Star Floyd Rose Jackson TSA Flight Hard Case DTS-3", "HitCount": 85, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=40224839", "StoreName": "J&#39;s Music and More"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Good Pre-Owned Condition", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}