{"BestOfferEnabled": false, "Description": "MIJ, made in japan, Gibson, Lespaul, White, SG, Höfner, Duesenberg, Ibanez, ATELIER Z, ARIA, ESP, Caparison, Killer, COMBAT GUITARS, GUYATONE, Greco, Sugi Guitars, TEISCO, DEVISERA, Nil, Bacchus, VANZANDT, Fernandes, Fender Japan, Fujigen, MOON GUITARS, momose, Yairi Guitar, YAMAHA, TOKAI, Zemaitis, VOX, B, C, Rich, Epiphone, Gibson, Gretsch, Suhr, Schecter, Charvel, Jackson, Dean, Tom Anderson, Fender, Paul Reed Smith, Melancon, Mosrite, Rickenbacker, Robert Benedetto, Washburn, Ibanez, kramer, EDWARDS, Burny, Grassroots, 2009 EDWARDS by ESP E-SG-90LT2 _ Heavy Metal ~ Upgraded to EMG ~Very Good+ Condition !!Made in Japan Down from here. Photo is dent and scratches, etc.. About scratches that are hard to see. To make it easy to understand the condition of the scratches, I lighted the light strongly. 2009 EDWARDS by ESP E-SG-90LT2 _ Heavy Metal ~ Upgraded to EMG ~Very Good+ Condition !!Made in Japan Body Mahogany. Neck Mahogany. Frets 22 Frets. Scale 24.75inch (628mm) Gibson Medium Scale. Nut Width About 1.65 inch (42mm). Pickup Neck : EMG-85. Bridge : EMG-81. Control 2Volume. 2Tone is dammy ( fake ) Bridge GOTOH Japan. Tune O Machic. Stop Tailpiece. Machine heads Lock type. Weight About 6.15 Pound ( 2.79 Kg ). This is Used Guitar. There is a shallow crack near the output jack. Its depth of crack is about 2.5 mm. The pickups has been changed to EMG. The machine heads has been changed to lock type. Control has been changed to 2 volume. It is for the Neck and for the Bridge. The 2 Tone knob is dammy ( fake ). There are scratches and dents. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. The Batterie not included, because export is prohibited. Please purchase and set up the batterie. It is great force. The reason is EMG and paint. The painting is very garish and unique. There are rumors about painting as lacquer. But ESP does not disclose the kind of paint, so I do not know the correct answer. Anyway, I saw this type of paint processing for the first time. Color is dark dark dark cherry. The surface of the EMG 81's cover is smooth. This EMG 81 has the possibility of the artist model, not the usual EMG 81. About the machine heads, I searched in internet. But I could not find the same the machine head. This machine head was very convenient, I was very impressed. I have a lock type Sperzel, but this machine head is not inferior to that. I set a new string, so you do not have to change strings for the long time. When the time to exchange strings comes, please look forward to it. This machine head is excellent. It automatically cuts extra strings. You may know this machine head, but I did not know. So, for me it was a surprise. Making is very polite. I feel policy of ESP. And you can feel a made in Japan. And, it is light weight. You will be able to move actively on the stage. This guitar will definitely stand out on the stage. Accuracy of the product is high. ESP EDWARDS Japan is Great !! About guitar play, Current state, the space between the strings and the frets is standard. The pickups is old EMG ! It gives very good distortion sound and clean sound. Accuracy of the product is high, Un pluged sound is be powerful. From the body, the vibration of the sound is transmitted well. I recommend Heavy Metal Music !! Let's enjoy the ESP EDWARDS Japan ! It is cleanliness. I polished with guitar exclusive polish, so it is in a very clean state. I after the finger board cleaning, painted beeswax. The aim is moisturizing and and protection. Current neck condition, very good ! roughly straight ! There is no problem with the Truss rod and it can be adjusted. Remaining the frets are 90% on average. You can play immediately after it is delivered to you. I was set new strings. Regular tuning. ( Inch : 009, 011, 016, 024, 032, 042 )Guitar playing, is comfortable. All is working well. It is in a very good condition. The Truss rod Wrench is not included. Look at the photos, please verify by yourself! It will be professionally pack. Double air packing. And ships inside a sturdy cardboard box. This electric guitar is USED. Please consider it when bidding. Thank you. Payment I accept PayPal only. Please pay within 3 days after the auction closed. Shipping Worldwide shipping from Japan! EMS / Shipping includes a tracking number. / / / Destination cost Delivery time / / / Asia : $1004 ~ 7daysUS Canada : $1205 ~ 8 daysEurope : $1406 ~ 10 daysOceania : $1205 ~ 8 daysSouth America : $2408 ~ 12 days This item is shipped within 3 business days after payment is confirmed. Terms of Sale International buyers - Please Note: Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer's responsibility. Please check with your country's customs office to determine what these additional costs will be prior to bidding/buying. These charges are normally collected by the delivering freight (shipping) company or when you pick the item up -do not confuse them for additional shipping charges. Please contact us first with 30 working days for any returns, Buyer pays shipping cost from buyer's country to Japan when being returned. In case of return, the shipping cost won't be refunded. We sell various kinds of Japanese products to international customers. Our goal is to provide the best quality products and service and your satisfaction is the most important to us. Happy bidding!! Thank you !!", "ItemID": "254059432206", "EndTime": "2019-01-16T05:00:46.000Z", "StartTime": "2019-01-09T05:00:46.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2009-EDWARDS-ESP-E-SG-90LT2-Heavy-Metal-EMG-pickups-Made-Japan-/254059432206", "ListingType": "Chinese", "Location": "Nagoya-shi,Kita-ku, Aichi", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2540594322068080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/VsgAAOSwZltb~fV5/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/J5AAAOSw-rxb~fV1/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI1NlgxNjAw/z/pGUAAOSwqnVb~fVq/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI4NFgxNjAw/z/ZFUAAOSwn01b~fVM/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/E6wAAOSwg05b~fVg/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/J6wAAOSw-rxb~fWG/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/IrwAAOSwwXRb~fWO/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/dU0AAOSwE9pb~fWQ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg1OTk=/z/XRsAAOSw3Mhb~fWN/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/b34AAOSwosdb~fWp/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/t54AAOSwoZJb~fWZ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI2MFgxNjAw/z/bkIAAOSwiSVb~fWX/$_57.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jguitar-shop", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 369, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 298.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 298.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "t***u", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 387}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Americas", "Europe", "Asia", "AU"], "Site": "US", "TimeLeft": "PT0S", "Title": "2009 EDWARDS by ESP. E-SG-90LT2. Heavy Metal. EMG pickups. Made in Japan.", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Edwards by ESP"]}, {"Name": "Model Year", "Value": ["2009"]}, {"Name": "Modified Item", "Value": ["Yes"]}, {"Name": "Model", "Value": ["E-SG-90LT2"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Modification Description", "Value": ["The pickups and the machine heads and control and wiring."]}, {"Name": "MPN", "Value": ["ED0912580"]}]}, "HitCount": 325, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "JP", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 303.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["APO/FPO", "Africa"], "GlobalShipping": false, "ConditionDescription": "Very Good+ Condition. This is Used Electric Guitar. The electric guitar when connect to the amplifier, sound output is normal. There are scratches and Dents. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. Please Read the descriptions for details.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}