{"BestOfferEnabled": false, "Description": "MIJ, made in japan, Gibson, Lespaul, White, SG, Höfner, Duesenberg, Ibanez, ATELIER Z, ARIA, ESP, Caparison, Killer, COMBAT GUITARS, GUYATONE, Greco, Sugi Guitars, TEISCO, DEVISERA, Nil, Bacchus, VANZANDT, Fernandes, Fender Japan, Fujigen, MOON GUITARS, momose, Yairi Guitar, YAMAHA, TOKAI, Zemaitis, VOX, B, C, Rich, Epiphone, Gibson, Gretsch, Suhr, Schecter, Charvel, Jackson, Dean, Tom Anderson, Fender, Paul Reed Smith, Melancon, Mosrite, Rickenbacker, Robert Benedetto, Washburn, Ibanez, kramer, EDWARDS, Burny, Grassroots, 2008 Tokai TJ70 Les Paul Jr Double Cutaway type ~ All Original ~Excellent ConditionMade in Japan Down from here. Photo is dent and scratches, etc.. About scratches that are hard to see. To make it easy to understand the condition of the scratches, I lighted the light strongly. 2008 Tokai TJ70 Les Paul Jr Double Cutaway type ~ All Original ~Excellent ConditionMade in Japan Body Mahogany. Neck Mahogany. Frets 22 Frets. Scale 24.75inch (628mm) Gibson Medium Scale. Nut Width About 1.69 inch ( 43mm ). Pickup Tokai Original. Control 1Volume, 1Tone. Bridge TJ-VT Tailpiece. Machine head Tokai original. Color Yellow. Weight About 7.94 Pound ( 3.6 Kg ). This is Used Guitar. The hard case is deteriorating. I was shooting a lot of photos. Please confirm with a photograph. It was manufactured in 2008. It was made about 11 years ago. Among the guitars I sell, it is a relatively new guitar. It is not brand new, However I think that the scratch is little. It keeps Excellent condition. If you get this guitar, you will understand that this guitar was used carefully. Tokai made guitars are highly valued around the world. Made in Japan is special. In japan used guitars market, there are many Tokai of made in china. I am wondering, Tokai of made in japan is not see much in used guitars market. The reason is the guitar owners will not let go. Used guitar of Tokai of made in japan, even japanese purchasing is difficult. Especially it is difficult to obtain Les Paul Jr DC type. It is because the production number is overwhelmingly smaller than the Les Paul type. I can say that this guitar is valuable. About guitar play, Current state, the space between the strings and the frets is very narrow. Thanks to that, I feel very easy to play the guitar. Un pluged sound is very loud. You can feel vibrations transmitted to the body. Pickups is Tokai original. I feel the good Clean and good Over drive sound. I recommend for Rock'n roll music !! Tokai of made in japan is Great ! It is cleanliness. I polished with guitar exclusive polish, so it is in a very clean state. I after the finger board cleaning, painted beeswax. The aim is moisturizing and and protection. Current neck condition, very good ! roughly straight ! There is no problem with the Truss rod and it can be adjusted. Remaining the frets are 90% on average. You can play immediately after it is delivered to you. I was set new strings. Regular tuning. ( Inch : 009, 011, 016, 024, 032, 042 ) Guitar playing, is comfortable. All is working well. It is in a very good condition. The Truss rod Wrench is not included. All Original.Note : The Whammy bar is not original. The Hard Case Included. Note : Key was lost. Look at the photos, please verify by yourself! It will be professionally pack. Double air packing. And ships inside a sturdy cardboard box. This electric guitar is USED. Please consider it when bidding. Thank you. Payment I accept PayPal only. Please pay within 3 days after the auction closed. Shipping Worldwide shipping from Japan! EMS / Shipping includes a tracking number. / / / Destination cost Delivery time / / / Asia : $1204 ~ 7daysUS Canada : $1405 ~ 8 daysEurope : $1606 ~ 10 daysOceania : $1405 ~ 8 daysSouth America : $2608 ~ 12 days This item is shipped within 3 business days after payment is confirmed. Terms of Sale International buyers - Please Note: Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer's responsibility. Please check with your country's customs office to determine what these additional costs will be prior to bidding/buying. These charges are normally collected by the delivering freight (shipping) company or when you pick the item up -do not confuse them for additional shipping charges. Please contact us first with 30 working days for any returns, Buyer pays shipping cost from buyer's country to Japan when being returned. In case of return, the shipping cost won't be refunded. We sell various kinds of Japanese products to international customers. Our goal is to provide the best quality products and service and your satisfaction is the most important to us. Happy bidding!! Thank you !!", "ItemID": "254070545814", "EndTime": "2019-01-21T05:00:25.000Z", "StartTime": "2019-01-14T05:00:25.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2008-Tokai-TJ70-Les-Paul-Jr-Double-Cutaway-type-All-Original-Excellent-MIJ-/254070545814", "ListingType": "Chinese", "Location": "Nagoya-shi,Kita-ku, Aichi", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2540705458148080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTExMVgxNjAw/z/xRAAAOSwmE9cO~GZ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/b6cAAOSwmfhcO~Gg/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/D64AAOSwhu9cO~Gr/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/VN8AAOSwLgpcO~Hc/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU5OVgxNjAw/z/3KwAAOSw5i5cO~H3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/Y1EAAOSwg1JcO~H8/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/pY4AAOSw87JcO~IK/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/ZuEAAOSwvfpcO~IO/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/vTIAAOSwe~lcO~Ic/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI4N1gxNjAw/z/hiAAAOSwMkdcO~Ik/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg2NjQ=/z/b0AAAOSwxLFcO~I4/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/K6sAAOSw4QtcO~Ix/$_57.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jguitar-shop", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 369, "PositiveFeedbackPercent": 100.0}, "BidCount": 16, "ConvertedCurrentPrice": {"Value": 700.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 700.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***l", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 7}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Americas", "Europe", "Asia", "AU"], "Site": "US", "TimeLeft": "PT0S", "Title": "2008 Tokai TJ70. Les Paul Jr Double Cutaway type. All Original. Excellent. MIJ.", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Tokai"]}, {"Name": "Model Year", "Value": ["2008"]}, {"Name": "Model", "Value": ["TJ70"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Bundle Description", "Value": ["Hard Case"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Body Color", "Value": ["Yellow"]}, {"Name": "Custom Bundle", "Value": ["Yes"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Series", "Value": ["Original"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["0818512"]}]}, "HitCount": 958, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "JP", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 710.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["APO/FPO", "Africa"], "GlobalShipping": false, "ConditionDescription": "Excellent Condition. This is Used Electric Guitar. The electric guitar when connect to the amplifier, sound output is normal. There are scratches and Dent. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. Please Read the descriptions for details.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}