{"BestOfferEnabled": true, "Description": "B.B. King Signature 2005 Gibson LUCILLE BLACK Electric Guitar w/ hard case used >> --> >> --> Description AWESOME 2015【USA】Gibson SG Standard Translucent Used w/Hara Case From Japan F/S There are fine scratches, but it is in very good condition.Please check photos that show the main damages and flaws on the item [Spec] Gibson / SG Standard Translucent Black 2015 [Made in USA]Color: Brown System Condition: A: Beauty Item Year of manufacture: 2015 Pickup: Passive pickup configuration: HH Fret number: 22 Fret neck scale: Medium weight: 316.00 kg Body material: Mahogany tremolo: None fingerboard material: Rosewood neck joint: Set neck neck material: mahogany accessories: hard case, warranty card Product description2015 model SG standard arrived! While featuring zero fret nuts and wide neck / finger boards,The pickup has 57 classic,It outputs the traditional vintage sound unique to Gibson SG. The thin feeling of rubbing scratches is thin,Some scratches such as scratches on the body back can be seen.The remaining amount of frets is adequate, and the height of the nut is also there.The truss rod also turns left and right, and adjustment of the neck is possible.Because the former owner wore Bigsby in Vibramate3 points on the body top, with marks of cushion attached.Because it is vibramate, drilling etc. are not done. It is medieval of recommendation that you can use with a sense close to new. ■ Specifications● Body: Mahogany● Neck: Mahogany, Slim '60s Profile● Fingerboard: Rosewood / Pearl Trapezoid● Tuner: G Force● Bridge: Tune-o-matic Chrome● Tailpiece: Stop Bar Chrome● Pickup: '57 Classic (Alnico # 2) x 2● Control: 2 Push / Pull Coil Split Vol. 2 Tone.● Knob: Black Top Hat with Silver Insert● Case: Hard Shell Case Original hard case · With second warrantyRead Before Shopping・We won't undervalue merchandise or mark the item as a gift on customs forms. Doing that is against U.S. and international laws.・We only ship to PayPal registered address.・Please contact us if you reside in countries in which we do not specify shipping service and cost.・Please ask us any questions you may have before bidding.・Also, please see the pictures as they are part of the description.If there is any condition that don't mention, ask us before bid please, we don't accept any reason (for example condition don't mention in photos or description) to return or refund after bid.・We are happy to answer all questions.・This product is also available at Japanese EC sites.We will update as soon as possible, but if this product is sold on another EC site before this is sold on eBay, we are very sorry, but we will cancel the transaction on this site. Please kindly cancel the order if this happens. Please feel free to contact me if you have any questions. ※Please contact us before you leave a negative or neutral feedback after your purchase.※If you have any problems, please let us know as soon as possible. We are ready to solve your problems immediately. Please read [International Buyers -Please Note] on the bottom. PaymentWe only accept PayPal payments. Please pay within 5 days after auction is finished. shipping Shipping DurationShipping MethodAsia, Middle EastAmerica,Canada Australia,MexicoEurope RussiaOtherEMS3 - 6 days4 - 6 days3 - 5 days4 - 6 days We will ship to world wide by EMS (Insured, Trackable, Including handling cost.) EMS (takes 4~7 days, includes with insurance & a tracking number). EMS (Express Mail Service) is international mailing service by Japan Post Office. We will ship your item within 3-5 business days, after your payment. We can ship ONLY to your Paypal address. Term of SaleWe can accept return within 30 days after you receive it. Please make sure to contact us first if you want to return it. It is buyer's responsibility for the return shipping cost when sending back the item to us. The item has to be returned in the original condition from the time you received. No returns on products that show any evidences of use.About UsA specialty shop offering a wide variety of carefully selected Japanese brand items. Unless marked \"used\" all of our inventory is brand new, so you can feel confident about your purchase. Even if you think to yourself, \"But the item I want is only available in Japan.\", make sure to consult with us before giving up hope. We will look for and suggest the best products on your behalf.International Buyers - Please Note:Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer''s responsibility. Please check with your country''s customs office to determine what these additional costs will be prior to bidding/buying. These charges are normally collected by the delivering freight (shipping) company or when you pick the item up - do not confuse them for additional shipping charges.STK-S4m　(Rear) Seymour Duncan TB-5PARTS COLOR: ChromeCONTROLS: Master Volume, Master Tone, 5Way Lever PU SelectorOVATION1281 Preacher '78 CHItem code: 585753Non original original case included", "ItemID": "223304847890", "EndTime": "2019-01-03T16:55:46.000Z", "StartTime": "2018-12-30T23:09:17.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/AWESOME-2015-USA-Gibson-SG-Standard-Translucent-Used-w-Hara-Case-Japan-F-S-/223304847890", "ListingType": "FixedPriceItem", "Location": "Saga City", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2233048478908080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/ODU0WDEyODA=/z/eDkAAOSwrfRcKU5t/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODU0WDEyODA=/z/m4QAAOSwWAhcKU5m/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODU0WDEyODA=/z/634AAOSwwkRcKU5j/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI4MFg4NTQ=/z/rEwAAOSwhspcKU5o/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODU0WDEyODA=/z/2OMAAOSwZupcKU5q/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI4MFg4NTQ=/z/YSUAAOSwZbVcKU5v/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI4MFg4NTQ=/z/BKkAAOSwlelcKU5x/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODU0WDEyODA=/z/3r4AAOSwSn1cKU5z/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODU0WDEyODA=/z/o6wAAOSwEqVcKU51/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODU0WDEyODA=/z/BKwAAOSwlelcKU52/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODU0WDEyODA=/z/ASYAAOSwzDFcKU54/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODU0WDEyODA=/z/Rt0AAOSwVoNcKU56/$_57.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "japanplaza-toshiaki", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 152, "PositiveFeedbackPercent": 98.4}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1100.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1100.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "n***n", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 41}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "AWESOME 2015【USA】Gibson SG Standard Translucent Used w/Hara Case From Japan F/S", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Black"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model", "Value": ["SG Standard Translucent"]}]}, "HitCount": 28, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "JP", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "60 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 5, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["APO/FPO", "Africa", "JP"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}