{"BestOfferEnabled": true, "Description": "DescriptionCheck out my other items! Be sure to add me to your favo rites list! PLEASE READ THE WHOLE DESCRIPTION IT WILL ANSWER MOST QUESTIONS. ALSO ANY DEFECTS NOT MENTIONED BUT VISIBLE IN THE PICTURES WILL BE CONSIDERED AS DESCRIBED. For sale now we have an Ibanez Quilted Maple Top Guitar. This guitar consists of Abalone Inlay trim around the body of the guitar as well as the head of the guitar. It also consists of mother of pearl inlay Flames all the way through the neck on the fretboard as pictured. It also comes with Ducan/Ibanez pickups for premium sound. The guitar plays and sounds great. The neck is straight with no issues. This guitar is all one solid piece as pictured. There are no nicks or chips in the paint. Minimal to no fret wear. The guitar looks like it has only been played a few times. This is a beautiful premium guitar at a low cost. Buy it now while you still have the chance. Thanks for reading our description! Payment· Buyer has 3 days from close of auction to make arrangements for payment.· California Residents Pay 7.75% sales tax, No exceptions.IF BUYER DOES NOT PAY AFTER WINNING ITEM, WE WILL OPEN AN UNPAID BUYER CASE AGAINST YOU!!!Shipping· International shipping: Expedited shipping only, Please provide a phone number for shipments, Large items will not be shipped internationally. Ex. Anything with over 8inches x8inches x8inches dimensions will not be shipped; Domestic anywhere in the 50 statesFlat Rate Shipping is only for the lower 48 of the United States. Please message for details on how much it will cost to ship to any of the other States or Territories. Any Fees or duties for shipping outside the US must be paid by the customer! · Local pick up always available (no pickup charge of course)· Most items shipped within 24 hours through UPS ground but please give us a maximum of 72 hours.· Smaller items shipped via USPS priority. Insurance is always included in every shipment!Terms of Sale· We sell in both auction and buy it now formats. If the item is in an auction format please do not ask us for a buy it now price.· Only what you see pictured is what you get· If it is not listed in the auction it is not included, that means manuals, software, cables and anything that may attach to the product being sold for auction.· All Sales are FINAL no returns accepted. Items can only be returned if the item is not as described or if the item arrives broken due to the shipping process, we do not offer a partial refund for items only full refund if the item is not as described.· Zero feedback? Please email beforehand at ask seller question.· All items are used conditions range from Fare to Mint· As-Is items means no returns no exceptions.· Not Satisfied with your purchase, Contact us before leaving negative feedback; we will resolve any problems.· Positive Feedback is left after Positive feedback is received.About UsInland580 is just a small division of our main company Inland Jewelry and Loan; we are a pawn shop that has been in business since 1992 we have 7 locations in southern California primarily in the Inland Empire. Since we are a pawnshop we offer second hand merchandise, though for eBay we try to offer only our best merchandise. From time to time we do offer brand new and broken items different rules apply to those auctions. We strive for excellence so if you are not satisfied with your transaction please contact us before leaving negative feedback; we try our best to work with our customers so that the transactions come out fair for both parties. Thank you and happy bidding. Contact Us· Questions? Please send them to ask seller a question.· No questions will be answered through hotmail.", "ItemID": "113516190472", "EndTime": "2019-01-18T12:29:34.000Z", "StartTime": "2019-01-02T20:11:52.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Ibanez-Quilted-Maple-Top-Electric-Guitar-Abalone-Inlay-Mother-Pearl-Inlay-/113516190472", "ListingType": "FixedPriceItem", "Location": "Upland, California", "PaymentMethods": ["PayPal", "CashOnPickup"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1135161904728080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/gBYAAOSwS2lcLRkF/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/RAwAAOSwiOZcLRka/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/ws4AAOSwq6VcLRkn/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/MXgAAOSw5EpcLRk2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/W6YAAOSwI01cLRnk/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/QSQAAOSw8kRcLRnu/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/lLoAAOSwsZhcLRrP/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/WksAAOSwVcVcLRj3/$_57.JPG?set_id=8800005007"], "PostalCode": "91786", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "inland580", "FeedbackRatingStar": "Green", "FeedbackScore": 5814, "PositiveFeedbackPercent": 99.5, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 399.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 399.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "o***o", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 98}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Ibanez Quilted Maple Top Electric Guitar Abalone Inlay Mother of Pearl Inlay ", "ItemSpecifics": {"NameValueList": [{"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Brand", "Value": ["Ibanez"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}]}, "HitCount": 81, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=86864600", "StoreName": "inland580"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["US Protectorates", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "TopRatedListing": true, "GlobalShipping": false, "ConditionDescription": "This item is in excellent condition with no nicks or chips. Item may contain some very minor scratches that are not noticeable without close examination. Overall Great shape. Comes as pictured. See photos!", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}