{"BestOfferEnabled": true, "Description": "2013 Gibson Les Paul Standard in Desert Burst Finish. Guitar comes with original case and papers. Guitar is in great condition and sounds amazing. There are 3 little paint scuffs on the bottom rear of the guitar but is clean everywhere else. More about the 2013 Gibson Les Paul Standard below With the Gibson Les Paul Standard 2013 solidbody electric guitar, you'll have the iconic tones that have made guitar amplifiers sing for decades, plus a wide range of new sounds thanks to powerful electronics. You get the classic Les Paul recipe: mahogany body (with modern weight relief) topped with AA figured maple, a mahogany neck that enhances your sustain, and a pair of BurstBucker humbucking pickups for raw, rockin' tone. For tonal versatility, you've got push/pull coil taps and phase control, giving you access to virtually every classic guitar tone you've ever heard in the Gibson Les Paul Standard 2013 solidbody electric guitar. Gibson Les Paul Standard 2013 Solidbody Electric Guitar at a Glance: Rich tone and sustain from the mahogany body with AA figured maple top '60s neck profile with compound radius fingerboard plays fast and smooth BurstBucker pickups deliver that timeless PAF humbucker tone Rich tone and sustain from the mahogany body with AA figured maple top Gibson's Les Paul Standard 2013 gives you the robust sustain you need for hot liquid solos and massive power chords. What's Gibson's secret? A major part of the Les Paul's tonewood recipe is the fusion of a AA figured maple top on a mahogany body. This combination is largely responsible for the legendary Les Paul sound, as well the LP's reputation for being rather heavy. But fear not! Modern weight relief has been scientifically applied to the Les Paul Standard 2013, giving you all the sustain, without the shoulder pain. '60s neck profile with compound radius fingerboard Many guitarists consider Gibson's Slim Taper neck the most playable Les Paul neck ever made. On the Les Paul Standard 2013, it's joined by a compound radius rosewood fretboard for ultimate playability. The fingerboard is rounder near the nut for easy chord-grabbing and rhythm playing. As your playing heats up and moves up the fretboard, the radius flattens out for easier runs and big, big string bends. BurstBucker pickups deliver that timeless PAF humbucker tone When it comes to capturing that classic Les Paul tone, nothing beats the sound of the Les Paul Standard 2013's BurstBucker pickups. You'll love how your guitar amplifier responds to the tight low end, complex midrange, and sweet highs you'll get out of these pickups - it's everything you expect when you pick up a Les Paul! That's because Gibson designed their BurstBucker pickups to re-create the sound of the original PAF humbuckers to perfection. Gibson Les Paul Standard 2013 Solidbody Electric Guitar Features: Classic Les Paul design with modern weight-relieved body and powerful tone-shaping electronics Asymmetrical '60s SlimTaper neck profile with compound radius fretboard plays fast and smooth Mahogany body with AA figured maple top has rich lows, powerful midrange, and snappy highs BurstBucker humbucking pickups are voiced to sound like original PAF humbuckers Push/pull coil taps let you get both humbucking and single-coil tones Phase control lets you get classic out-of-phase tones Hard case included", "ItemID": "332978843378", "EndTime": "2018-12-30T22:13:11.000Z", "StartTime": "2018-12-26T22:08:14.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2013-Gibson-Les-Paul-Standard-Desert-Burst-Original-Case-/332978843378", "ListingType": "Chinese", "Location": "Louisville, Kentucky", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/3329788433788080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/xO0AAOSwo1lcDY-6/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/lqwAAOSwLuBcDY~B/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/lq0AAOSwLuBcDY~E/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDQy/z/mk4AAOSwcZ1cDY~I/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/PUQAAOSwcs1cDY~H/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMTk4/z/aqAAAOSwPrtcDY~N/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/-OEAAOSwkFZcDY~L/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/~LIAAOSwDlRcDY~R/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/V5YAAOSwMOtcDY~P/$_12.JPG?set_id=880000500F"], "PostalCode": "40272", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "kapparaider", "FeedbackRatingStar": "Purple", "FeedbackScore": 786, "PositiveFeedbackPercent": 96.8}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 1649.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1649.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "r***2", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 89}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2013 Gibson Les Paul Standard -Desert Burst-Original Case", "ItemSpecifics": {"NameValueList": [{"Name": "Product Line", "Value": ["Gibson Les Paul"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model Year", "Value": ["2013"]}, {"Name": "Model", "Value": ["Les Paul Standard"]}, {"Name": "Body Type", "Value": ["Classical"]}]}, "HitCount": 258, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "14 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 1674.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}