{"BestOfferEnabled": false, "Description": "This item lot is USED, as-is, as shown in the pics VINTAGE ITEM You set the value...bid accordingly. Whatever this item needs to work to your satisfaction, or meet your expectations.....you get to do. If it cannot.....or .....If you dislike any, or all of this...you still own it, and may do what you want with it...decor, donate, refurb, restore, re sell, repurpose, bedazzle, smash, part out, actually use...the possibilities are endless...totally up to you..........please bid accordingly. All measurements are APPROXIMATE ALL INFO FROM PIC 1, all other asst views MANY PICS SO YOU CAN SEE...they are the best representation here...........there is a pic of each view of this.........bid as you see this. The text is only a partial overview. Moving...ALL must go....low price, I want it out Vintage TELE-STAR kawai guitar japan. Ca 196824 1/2\" scale7 lbHeadstock plate strongPickguard is NOT crackedNo paint cracks by neck to body jointEverything is original, working, hardware matchesNo neck binding issues, all adheredPaint is excellent, only light crazing, scratches etc PICS Pickup loud and clear, looks to be mitsuya, 3.9KSuper clear, loud, scrappy sound, nails the stratotone, single coil retro sound, and vibe, as it is an actual retro item, plus the blue color looks very coolTruss rod. working......nominal relief...............as it sits, is how it is and...……….Bar bridge makes perfect intonation impossible....if you know anything about these types of instruments.....you are already experienced in the fine art of compromise Set up to play ok as you see it...…...your mileage will vary, Tuning, \"action\" frets, 'feel\" etc up to you.... YOU set it up to play to your liking......if it cannot, see paragraph 1PICS best representation here PICS for the overall ok conditionAsst and sundry tarnish, light scratches, handling smudges , no real play wear, light rust etc....and general malaise PICSI'm leaving any fussy attention for the new owner, no real issues to address Ive heard that some people pay EXTRA for a look like this Clean clean clean, good solid shape...............if you're in the market for a nice vintage guitar...at a great price....you cant do much better It includes only what's in the pics....NO OTHER PARTS ANY PROJECT, WALL HANGER, RESTORATION, PARTS items can NEVER be \"defective, \"not working correctly\", \"I didnt think it would be like that\", or \"not as described\", or any other cockamamie excuse...if complaining back to ebay, or to me. If it cant be used, see first paragraph about you owning it That's that There is glare in every pic, there are no white spots on item There have been no repairs to this..... including parts changes, set up., heavy cleaning, etc,........... if this item needs more or anything else, thats up to you, the buyer to address it. There is no guarantee that it will ever play again. Used instruments are fussy, complicated items. They WILL fail, and when they do, you get to fix them. Adjustments, repairs, tuning, maintenance are ALL up to YOU, the buyer. Please do not complain back to me when you have to do them. None of these are \"item not as described\", \" defective\" or \" I didnt think it would be like that\", or \"item not working correctly\"...if complaining to ebay or to me. This item is used, sold as-is.....as shown in the pics, which are part of the description. YOU set the value, so there are no returns, refunds, or price adjustments Shipping $ 29 continental USA street address, signature required. NO international shipping, no PO FPO boxes, no \"pick-ups\". NO 3rd party shipping foolishness. NO buyer supplied labels...even if you have your own shipper. I will pack, label, and ship it. USPS or FED EX. Ships ONLY to the person and street address on the ebay ship info page. NO other person or place, for ANY reason. I will NOT change any ship info, make sure this info is correct...BEFORE bidding. No changes to any part of the ship address after you bid, and win. You will be VERY disappointed when I wont change it. The paypal payer , and the ship address must be the same. It's checked before shipping.....if something isnt kosher you will be informed, and it will delay shipping until its rectified. This is a typical ebay scam, having differing info, and also the seller loses \"seller protection\", whatever that is... if info is changed. If you want something shipped to someone else/another place.......I will ship it to you.......you get the item......and.YOU ship it to another person...This is how it is............ think twice about bidding if this bothers you. You will have to directly sign for this item, you may have to go to the ship office to pick it up. USPS or FED EX.................again think twice if this bothers you. The shipper is the ones ebay uses.......usps or fed ex.....no other shipper......NOT ups...NOT dhl...NOT pony express........even if thats \"the one Ive used\"...\" i have my own shipper\", or\"other sellers have done it before\" Paypal only, payment within 24 hr of auction end", "ItemID": "123481654419", "EndTime": "2018-11-14T18:44:14.000Z", "StartTime": "2018-11-10T15:15:08.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/VINTAGE-TELE-STAR-TEISCO-KAWAI-electric-GUITAR-/123481654419", "ListingType": "Chinese", "Location": "USA", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1234816544198080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/s9kAAOSw6Pxb4CWg/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/O8MAAOSwfhlb4CWp/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/2swAAOSwbetb4CWy/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/QVgAAOSw3BJb4CW6/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/me4AAOSwuJRb4CXC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/7CsAAOSwB19b4CXK/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/gsUAAOSwC8pb4CXQ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/OvQAAOSwIBpb4CXY/$_57.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "bigcleanout", "FeedbackRatingStar": "Purple", "FeedbackScore": 941, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 99.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 99.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "s***s", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1208}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "VINTAGE TELE-STAR TEISCO KAWAI  electric GUITAR ", "HitCount": 86, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 100.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 5, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "ConditionDescription": "Nice item, great shape", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}