{"BestOfferEnabled": true, "Description": "(Please read my selling policy before bidding)(Check out my other items) Here is my almost new Hellraiser Hybrid C-8. This is the latest Hybrid model with the more sought after EGM 66/57 pickups. I am the original owner, and I purchased this guitar new just recently. I soon realized I'm no 8 string guitar player, and decided to stick with my old school 6 string guitars. This guitar is almost flawless with very light use, with absolutely no issues. Comes with everything that comes with a new one. Will be shipped double boxed and protected, in it's original shipping boxes,and will be shipped via UPS Ground with tracking number. ----------------------------------------------------------------------Factory data:The Schecter Hellraiser Hybrid Series represents the ultimate marriage of features, combining the most popular features of the renowned Hellraiser and SLS models into one killer axe. An 8-string model that delivers on all fronts, the Hellraiser Hybrid C-8 pairs that beefy low end tone of the low B and F# strings with metal-approved tone, shred-ready playability, top-shelf aesthetics & features, and Schecter-quality craftsmanship... all at a price that won't break the bank. The Hellraiser Hybrid C-8 starts out with the familiar double-cutaway mahogany body and the Hellraiser's signature highly figured quilted maple top—all beneath a sleek Transparent BlackBurst finish. Catering to both aesthetics and performance, the top boasts a more sculpted top contour while the mahogany body sports an ultra access neck joint and an increased upper access cutaway to offer uninhibited reach to those higher frets on the 'board. The 28\"-scale 3-piece set maple neck takes form in Schecter's speedy, ultra thin 'C' profile while the ebony fretboard comes loaded with 24 X-Jumbo frets make string bending a breeze. Adding the the pure metal vibe, the fingerboard features offset mother of pearl dot inlays with a Gothic Cross at the 12th fret. Whether you're playing complex low-end power chords or shredding up in the lead range, the Schecter Hellraiser Hybrid C-8 is sure to deliver thanks to a pair of active EMG 57-8H and 66-8H bridge/neck humbuckers. The simplistic, yet responsive control panel consists of a volume control for each pickup, a master tone control and a 3-way pickup selector. Rounding out the hardware is a set of Schecter Locking tuners for smooth and precise tuning. At the other end, the Hellraiser Hybrid C-8 is outfitted with a Hipshot Hardtail bridge that will keep you in tune and withstand anything you can dish out. Case not included. MY SELLING POLICY: (PLEASE READ BEFORE BIDDING)I accept PayPal payment only.I will only ship to the confirmed street address that is listed on your PayPal account. Your Paypal account must be a verified US account only. No international accounts.I will only ship to the Continental United States.I will not ship to a P.O. box.Please remember to give feedback. I then will return feedback.I reserve the right to cancel bids or winning bids from people with zero or negative feedback, or people that do not meet my PayPal criteria as noted above. Buyer to pay at auction close. (If you need more time contact me to discuss!)I do not accept returns unless the item arrives dead on arrival (I am not a store) (I do not pay for return shipping) (I do not have a store’s overhead to absorb losses, my E-bay and Paypal fees hit hard enough) . Buyers remorse or change of mind returns not allowed. But don’t worry, I describe my items very accurately, and to prove it I have 100% perfect seller feedback since 2003. Bid with confidence. Check my feedback! I am account verified, address confirmed, I.D. verified, and have a proven 100% positive feedback track record you can trust since 2003.", "ItemID": "223302325735", "EndTime": "2019-01-14T22:55:48.000Z", "StartTime": "2018-12-28T22:38:50.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Schecter-Hellraiser-Hybrid-C-8-Trans-Black-Burst-/223302325735", "ListingType": "FixedPriceItem", "Location": "Wichita, Kansas", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2233023257358080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/cVcAAOSwwDJcJqTN/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/UdYAAOSw~KNcJqS1/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/CCMAAOSwseFcJqTm/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/KDwAAOSwo1lcJqT2/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/aA0AAOSwpaVcJqUN/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/tnEAAOSw87JcJqUh/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/3xsAAOSwrfRcJqUy/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/tEEAAOSw5tNcJqVE/$_32.JPG?set_id=880000500F"], "PostalCode": "67218", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "ts14064", "FeedbackRatingStar": "Purple", "FeedbackScore": 595, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 549.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 549.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "s***s", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 186}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Schecter Hellraiser Hybrid C-8 Trans Black Burst", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Schecter"]}, {"Name": "Body Color", "Value": ["Black"]}]}, "HitCount": 101, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}