{"BestOfferEnabled": true, "Description": "Jackson DK2 Pile O Skulls Graphic SN 9734983 MADE IN JAPAN. This finish on this guitar is very shiny but it does have some surface dings etc. It plays great. The frets show some wear but have plenty of life left. Neck is good and shows minor wear on back but nothing ugly or deep. It's mostly just light wear marks from use. The headstock is in very nice condition. The tip is not chipped. The hardware has only minor signs of use but is otherwise clean. I upgraded the tremolo to the Black Jackson JT580 (same as stock tremolo but Black instead of Chrome) and have replaced the trem. pivot screws so no worries there. The neck pocket has the typical finish cracks but these are cosmetic only and do not effect how the guitar functions/plays in any way. Most of the dings can be seen in the pics but not every little one would show up; the worst ones are pictured but you may find a few other ones that simply didn't show up in the pics, again the worst ones are clearly visible. It has Ernie Ball 9s on it. I have included High res. pics. Please use the pics, the description, and all stated terms to determine if this guitar is up to your standards and purchase accordingly. Thanks for looking. See specs below: SPECS: Alder bodyMade in JapanRock maple bolt-on neckBound rosewood compound-radius fingerboardDuncan Designed humbuckerDuncan Design (mid and neck) pickups24 Jumbo fretsSharkfin inlaysIvoroid bindingBlack and Chrome hardwareSealed die-cast tunersFloyd Rose Licensed Jackson Low Profile JT580 LP double-locking 2-Point Tremolo Scale length: 25.5 in. Width at nut: 1-11/16 in. If you have any questions please make sure they are answered before you bid, buy, or make an offer. Immediate payment is required for buy it now. Item is sold as is. All sales are final. No returns. Item will be insured for at least the purchase price. As this is a used guitar and I am not the original owner, I cannot guarantee that all parts are factory stock. This item is offered to those buyers/bidders in the contiguous US Only. Sorry no APO/FPO/DPO. Signature will be required upon delivery. Will ship to confirmed Paypal addresses only. I usually ship via FedEx but reserve the right to use an alternate shipper solely at my discretion. If FedEx cannot deliver to your confirmed paypal address, you are not allowed to bid, make an offer, or use the buy it now option. It is your responsibility to determine if FedEx can or cannot deliver to your confirmed paypal address BEFORE bidding, making an offer, or using the Buy it Now option. If you are outside the contiguous U.S. and/or attempt to use any means (shipping hubs, forwarding services, etc.) to circumvent my stated sales terms and conditions, I will terminate the transaction and report the violation to eBay. By bidding, making an offer, or using the Buy it Now option, you agree to abide by the terms stated herein. Normal 0 MicrosoftInternetExplorer4", "ItemID": "183599361868", "EndTime": "2018-12-24T19:51:54.000Z", "StartTime": "2018-12-22T14:59:56.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Jackson-Dinky-DK2-Pile-O-Skulls-Electric-Guitar-/183599361868", "ListingType": "FixedPriceItem", "Location": "Sunny Southern California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1835993618688080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/OTQ3WDE2MDA=/z/P9wAAOSwiJZcDV7J/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTg2WDE2MDA=/z/zXsAAOSwbX1cDFdl/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/BIQAAOSwkjJcDFdn/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTIwWDE2MDA=/z/mGAAAOSwO8pcDFdp/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/Njk4WDE2MDA=/z/fHoAAOSwi7VcDFdq/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU2M1gxNjAw/z/oN0AAOSwMhVcDFdt/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/PvYAAOSwEp5cDFdv/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTEyMVgxNjAw/z/FdgAAOSwwS5cDFdw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/Pg8AAOSwzXJcDFdy/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5NzI=/z/9AwAAOSwD1pcDFd0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/gycAAOSwcOZcDFd2/$_57.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "sellnem", "FeedbackRatingStar": "Purple", "FeedbackScore": 724, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 375.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 375.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "k***q", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 40}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Jackson Dinky DK2 Pile O Skulls Electric Guitar", "HitCount": 171, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 5, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}