{"BestOfferEnabled": false, "Description": "This is a very cool and rare Hohner Revelation RTS electric guitar. This model was made with top quality parts in the Czech Republic and has a number of very unique features. The craftsmanship is excellent and this is probably the highest quality guitar Hohner has ever offered. Features include: A Wilkinson VS100 tremolo. This is the rare USA made model. It features screws and metal wedges that can be threaded into the screw holes in the tremolo block to hold the strings without ball ends. This essentially turns the tremolo into a locking trem. The wedges and screws are included (they are often missing from used models) but the tremolo can be used without them. Two of the tiny intonation screws that thread into the back of the saddles are missing. The saddles are still very securely held with the primary screws. There is some light surface rust on parts of the tremolo (see photos). The tremolo is very smooth and stays in tune as good as any Floyd rose I've ever used. The tremolo arm is included. This has three Entwistle White pickups. These were designed by pickup guru Alan Entwistle and made in the UK. The guitar features Entwistle's revolutionary ATN passive tone circuit. This guitar is capable of an exceptional variety of tones and sounds fantastic. The electronics work perfectly. I will include an email I received from Mr. Entwistle explaining how the controls operate.Schaller tuners. These are stamped \"Made in W Germany\". These are very smooth, superior quality tuners. 24 Fret neck with a Wilkinson roller nut. The neck is a bit chunkier than you would expect. It looks like it would be an Ibanez Wizard style neck, but this is a bit thicker and more rounded. It's very comfortable to play. The roller nut does an excellent job of keeping the guitar in tune with tremolo use. The frets are in excellent condition, with only the slightest wear. The truss rod functions properly. This guitar was recently setup with Dean Markley 9-42 strings and plays extremely well. There is a small crack in the pickguard near the neck (see photo). It's not really noticeable and doesn't effect the structural integrity in any way. The pickguard has several scratches here and there from normal use. There are a few small chips around the tremolo cavity which you can see in the photos. Again, these aren't a structural issue. There are also some lights scratches on the back of the body which you really can't see due to the unique \"bowling ball\" style finish. A Hamer USA hardshell case is included. Although this isn't the original case, it fits really well. Buyer pays $60.00 shipping in the US. Please feel free to contact me with any questions. On Nov-19-18 at 10:39:22 PST, seller added the following information: PLEASE NOTE: This guitar was made in the Czech Republic, as were all production Hohner Revelations. The \"USA\" in the item title refers to the Wilkinson bridge. Most Wilkinson products are now made in Japan, China, or Korea.", "ItemID": "123494254580", "EndTime": "2018-11-23T18:47:07.000Z", "StartTime": "2018-11-16T18:47:07.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Hohner-Revelation-RTS-guitar-1993-USA-Wilkinson-Tremolo-ATN-RARE-/123494254580", "ListingType": "Chinese", "Location": "Salisbury, Massachusetts", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1234942545808080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/QHwAAOSwuNNb7woP/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/74oAAOSwyUFb7woj/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/EAkAAOSwo1lb7woT/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/GzIAAOSwMjtb7won/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/LrQAAOSw8Ehb7wor/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/DM8AAOSwNmxb7woX/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/2yUAAOSwiwZb7woa/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/TF8AAOSwHStb7wpV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/-n0AAOSwhX5b7wou/$_57.JPG?set_id=8800005007"], "PostalCode": "01952", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "baron-von-klaus", "FeedbackRatingStar": "Red", "FeedbackScore": 1799, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 249.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 249.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "h***h", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 214}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Hohner Revelation RTS guitar - 1993 USA Wilkinson Tremolo ATN - RARE ", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Hohner"]}, {"Name": "Model", "Value": ["Revelation RTS"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}]}, "HitCount": 139, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 252.49, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "This is in very good condition overall, and plays and functions perfectly. There are a couple of small scratches and dings, and a small crack on the pickguard. The tremolo has a bit of rust, and a few of the small intonation screws are missing (It still stays in tune and works great). Please see description and photos for additional details.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}