{"BestOfferEnabled": false, "Description": "Untested All items sold as is,Few hours home playing time on this (for real, original crap strings), 25 more guitars to be posted for sale: no reserve, most are like this- pretty much new, all have some minor flaw/ding or other- I will describe flaws. these are tough to photograph- glare, reflections, dust, fingerprints...but they will polish nice. Photo shows condition- took few angles to reduce glare questions. Needs good cleaning and strings/setup/3erd fret tiny buzz- needs file. Look at my pics, you can see the dust. there is no wear on the frets. Beautiful guitar, fabulous sound. Can you tell I like these? They play well out of their price bracket. If I told you what I used to pay just for a set of those EMG pickups alone....yikes. Fabulous craftsmanship: Rosewood/mahogany/maple all in the right spot. Grover tuners? Here is a little known guitar builder secret: it's cheaper to buy a guitar like this and cannibalize the premium components than buy separately. Whammy bars are fun, but the sustain on these goes for miles. The Damien Elite Avenger electric guitar sets itself apart from the crowd with an eye-catching, sweeping Avenger double-cutaway while the tried-and true tonewood combination of mahogany body, maple neck, and rosewood fingerboard provide a balanced tonal resonance mix for the hot, active EMG humbuckers. Grover tuners and a Tune-o-matic-style bridge with thru-body design keep your intonation tight and true. Rosewood fingerboard The most commonly fretboard wood, rosewood is naturally oily, and works well for any surface that sees frequent human contact. The sound is richer in fundamental than Maple because the stray overtones are absorbed into the oily pores. EMG Active 81/85 humbuckers One of the most popular EMG' the 81 is the one that started a revolution. Utilizing powerful ceramic magnets and close aperture coils, the tone was designed with detailed intensity, incredible amounts of high end cut and fluid sustain. Traditionally used in the bridge position, this pickup will make your leads slice right through even the densest mix. When used in both neck and bridge positions the sound can only be described as blistering. Although the EMG-85 Humbucker has more measurable output than the 81, its frequency response and string interface are different. The 85 uses 2 Alnico magnet-loaded coils with a wide aperture to maintain a beefy low end and a fatter top end. Because of a more natural tone, it works great as a rhythm and blues pickup because it has loads of output but isn't muddy. It's a perfect choice as a rhythm pickup in combination with an 81 in the bridge. Grover tuners Grover Rotomatics with 18:1 gear ratio. The original Rotomatic® with an improved higher ratio gearing. The 18:1 ratio provides for finer tuning and greater stability. The finer gears provide smoother tuning and a higher degree of backlash elimination. Case sold separately.FeaturesMahogany bodyMaple neckRosewood fretboard25-1/2\" scale24 extra jumbo fretsAbalone gothic cross inlays with stained cross at 12th fretMulti-ply bindingEMG 81/85 active humbuckersMaster volume and tone controls3-way pickup switchBlack chrome hardwareTune-o-matic-style bridge with thru-body tailGrover tunersCase sold separately Buy it, play it, spark some new creativity, take care of it, get bored with it, sell it for what you paid. Keep the boxes. Whatever gets you to play ! Amplifiers coming: Randall Mesa Boogie Weller Guitar Research Many, many more quality musical instruments: violins, yamaha sax, keyboards, digital drums, recording gear. studio rack gear. Gotta go, am moving into trailer. Deals galore, prices are fair for fairly mint gear. 20 years on ebay this Summer. add me to your favorites We do not accept P.O. BOXES - PLEASE PROVIDE A PHYSICAL ADDRESS. Am human, make errors. I fix. Beep Bop. I am NOT Amazon, more like garage sale.", "ItemID": "283266229518", "EndTime": "2018-11-25T16:24:24.000Z", "StartTime": "2018-11-18T16:24:24.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Schecter-Damien-Elite-6-Electric-Guitar-EMG-Active-Pickups-Clear-Black-inlay-/283266229518", "ListingType": "Chinese", "Location": "Manhattan, Illinois", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2832662295188080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/LAAAAOSwjt1b8Y-L/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDI0/z/pc0AAOSwwPdb8Y-O/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg2ODQ=/z/bsgAAOSwVcZb8Y-P/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxMjAw/z/cYIAAOSwQZVb8Y-Q/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/S0oAAOSw~llb8Y-T/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg1Mzg=/z/pNsAAOSwaPpb8Y-U/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIyNVgxMjAw/z/XPwAAOSwP8db8Y-V/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTEwN1gxMjAw/z/m8wAAOSwqS5b8Y-X/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg4MDU=/z/~RYAAOSwBfhb8Y-Z/$_57.JPG?set_id=8800005007"], "PostalCode": "60442", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "diesel.army", "FeedbackRatingStar": "Red", "FeedbackScore": 1067, "PositiveFeedbackPercent": 99.5}, "BidCount": 5, "ConvertedCurrentPrice": {"Value": 205.5, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 205.5, "CurrencyID": "USD"}, "HighBidder": {"UserID": "p***i", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 769}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Schecter Damien Elite-6 Electric Guitar EMG Active Pickups Clear Black inlay", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Schecter"]}, {"Name": "Model", "Value": ["Damien Elite-6"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Size", "Value": ["Full Size"]}, {"Name": "California Prop 65 Warning", "Value": ["Loud"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}]}, "HitCount": 383, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 208.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Beautiful condition, Needs new stings/battery and 3rd fret is tiny high/buzz to keep action low, so needs file when strings get changed.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}