{"BestOfferEnabled": true, "Description": "Guild Newark St. Collection S-200 T-Bird Includes a Guild Padded Gigbag Have Questions? Send us a message and we will be glad to help you! An exact replica of the original version The S-200 TBird is one of Guild's most iconic, uniquely recognizable guitars. This reissue is an exact replica of the original versions produced between 1964 and 1968, featuring an asymmetrical all mahogany body sure to catch the eye of the guitarist looking to blaze his or her own trail. However, this guitar’s appeal isn’t just about its looks – its unique controls create the widest array of tones offered on any Guild instrument, drawing on its dual Guild LB-1 Little Bucker pickups to achieve almost every conceivable color on the palette. The LB-1s are replicas of Guild’s original humbuckers, offering an array of tones from sparkly clean single coil-esque spank to thick and warm humbucker sounds that fatten and sing when driven. Switching capabilities include rhythm or lead modes, pickup on/off, and standard volume and tone controls. When engaged, an optional tone capacitor creates single-coil tones while maintaining the hum-free reliability of the LB-1s. The TBird also features the Hagstrom Vintage Tremar, a reissue of the vibrato system that is considered the crown jewel of many Guild solid body electric models from the 1960s. Along with the authenticity of the Hagstrom Vintage Tremar as a historic Guild feature, this reissue includes mechanical refinements such as fully adjustable spring tension for a user-customizable feel and pitch range, and a locking trem arm for optimal security. The TBird features a vintage C shape set mahogany neck and bound rosewood fingerboard with pearloid block inlays. Other period-correct details include open gear vintage tuning machines, and famed asymmetrical headstock adorned with Guild’s logo and mother-of-pearl Thunderbird icon. The S-200 TBird Includes Guild’s deluxe padded gig bag. S-200 T-Bird Specifications Body shape: Double cutaway Body type: Solid body Body material: Solid wood Top wood: Not applicable Body wood: Mahogany Body finish: Gloss Polyurethane Orientation: Right handed Neck shape: C standard Neck wood: 1-piece Mahogany Joint: Set-in Scale length: 24.75 in. Truss rod: Standard Neck finish: Gloss Polyurethane Fretboard Material: Rosewood Radius: 12 in. Fret size: Medium jumbo Number of frets: 22 Inlays: Block Nut width: 1.69 in. (43 mm) Pickup Configuration: HH Neck: LB-1 Bridge: LB-1 Brand: Guild Active or passive pickups: Passive Series or parallel: Series Piezo: No Active EQ: No Special electronics: Dual mode pickup selection Control layout: Separate volume, tone Pickup switch: Slide switches for pickup activation Bridge type: Tremolo/Vibrato Bridge design: Tune-o-matic Tailpiece: Vintage Tremar Tuning machines: Grover open gear Color: Nickel Includes a Guild Gig bag Condition: When this model came into the refurbishing center they could not find anything wrong. It is in Excellent original clean condition and has had no modifications made to the instrument. May show minor signs of playing/handling from inspection, cleaning, testing, and setup. There are no flaws, dings, scratches, repairs, or imperfections noted. It is set up to standard specifications. o *If electronics are included on the guitar and in the specifications section they will be working as they should*.o *The instrument is Not stamped used on the back of the headstock and has the original factory serial number. o *Used, Re-Manufactured, or Refurbished guitars do NOT include a factory warranty. An Amazing deal on a great sounding and playing instrument, as with any auction/sale please look at all the pictures, descriptions, etc. and ask question before bidding, making offers, or purchasing. Each guitar and stringed instrument we sell has been hand-picked, fully inspected, and cleared by a certified luthier from MIRC, the largest Refurbishment distribution/reclamation center in the USA that obtain guitars direct from the factory. Our Guitars Look and Play Great! Many of the guitars we sell are Discontinued Models, Old Stock, surplus, etc., (and are in excellent clean original condition with the exception of testing, inspection, cleaning, etc.) All our instruments are checked and double checked by both our store and the manufacturer refurbishing center in the USA. Any instruments with blemishes, visible flaws, or any repairs are detailed and outlined in the description and include pictures of the specific flaw. Free Shipping is for the lower USA 48 All other States, provinces, APO/FPO addresses, and/or international buyers please contact us prior to purchasing for a shipping quote/Price to your Location Shipping: Shipping guitars comes down to more than just the price shipping companies charge to ship your instrument. Due to cost variances by location of customer, we sell each instrument at the best price we can to provide you, the customer, a great value. By doing this we do not include any extras in the sale price for shipping 1. We carefully package and take the extra expense and time to package your item so it arrives safely 2. Each guitar that does not get shipped with a case is double boxed and securely wrapped in the first box to protect your investment, (guitars with cases are securely packaged in the case the same as if placed in the first containment box) 3. The instrument is detuned and the body, neck, and headstock are secured to prevent movement using packing paper or other materials 4. We then securely place the box into a heavy duty guitar box and carefully package for shipment using packing paper and other materials a. These boxes and packing materials cost extra and thus raise the cost to ship your guitar which is not reflected in the purchase price of each instrument but in the shipping cost; as destinations, insurance , etc. change the cost of each shipment 5. We strive to provide you with the best experience possible by a. Packaging and shipping within a 24 hour period once payment is received b. We offer economy and standard shipping selections c. Once shipped please let us know if there are delayed delivery times and/or delays so we may help by contacting d. All instruments require a signature for delivery. This is a best practice and provides for a safe and secure transaction for both the seller and buyer All International buyers are Responsible for any and all Duties, Taxes, and/or Import Fees All International Sales are Final International Buyers Must contact me for shipping fees prior to purchasing if not listed in the shipping section of the listing Pictures are of actual guitar for sale!! Due to the High Gloss Finish The Reflections you see are due to lighting They are not imperfections in or of the guitar", "ItemID": "183576906222", "EndTime": "2018-12-22T16:31:20.000Z", "StartTime": "2018-12-10T00:00:20.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Guild-Newark-St-Collection-S-200-T-Bird-Includes-Guild-Padded-Gig-bag-/183576906222", "ListingType": "FixedPriceItem", "Location": "Palmyra, Virginia", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1835769062228080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTAzMlgxNjAw/z/uTsAAOSw9z1cDawq/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjU1WDE2MDA=/z/jxQAAOSwfvtcDawr/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDAyWDE2MDA=/z/IIsAAOSw~HFcDaws/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNTgw/z/NOoAAOSwBPRcDaw7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTExWDE2MDA=/z/II4AAOSw~HFcDawy/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MzU3WDE2MDA=/z/KY0AAOSwvwRcDaww/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTI4WDE2MDA=/z/jNUAAOSwm-FcDaw1/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMzk0/z/9g0AAOSwcapcDaw5/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzQ1WDE2MDA=/z/bVkAAOSwmfhcDaw3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MzA4WDE2MDA=/z/x0wAAOSwEJ1cDawt/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzI4WDE2MDA=/z/090AAOSwwXRcDawv/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTc0WDE2MDA=/z/f~AAAOSwGVFcDawz/$_57.JPG?set_id=8800005007"], "PostalCode": "22963", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "cogswheel_music", "FeedbackRatingStar": "Red", "FeedbackScore": 3246, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 536.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 536.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "k***h", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 3}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Guild Newark St. Collection  S-200 T-Bird,  Includes a Guild Padded Gig-bag", "ItemSpecifics": {"NameValueList": [{"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["S-200 T-Byrd"]}, {"Name": "Country/Region of Manufacture", "Value": ["Korea, Republic of"]}, {"Name": "Model Year", "Value": ["2017"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Brand", "Value": ["Guild"]}, {"Name": "Body Type", "Value": ["Solid"]}]}, "HitCount": 39, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=49435803", "StoreName": "Cogswheel Music and Guitar Co"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Middle East", "Oceania", "Southeast Asia", "South America", "GL", "MX", "PM", "RU", "AL", "AD", "BY", "BE", "BA", "BG", "HR", "CY", "CZ", "EE", "GI", "GR", "GG", "HU", "IT", "JE", "LV", "LI", "LT", "LU", "MK", "MT", "MD", "MC", "ME", "RO", "SM", "RS", "SK", "SI", "SJ", "UA", "VA"], "GlobalShipping": false, "ConditionDescription": "When this model came into the refurbishing center they could not find anything wrong. It is in Excellent original clean condition and has had no modifications made to the instrument. May show minor signs of playing/handling from inspection, cleaning, testing, and setup. There are no flaws, dings, scratches, repairs, or imperfections noted. It is set up to standard specifications. If electronics are included and in the specifications section they will be working as they should. The instrument is NOT stamped used on the back of the headstock and has the original serial number. Used, Re-Manufactured, or Refurbished guitars do NOT include a factory warranty. An Amazing deal on a great sounding and playing instrument, as with any auction/sale please look at all the pictures, descriptions, etc. and ask question before bidding, making offers, or purchasing", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}