{"BestOfferEnabled": false, "Description": "Our ListingsAdd to FavoritesFeedbackAbout UsContact Us Store Categories Store HomeAudio EquipmentBLU-RAY PLAYERCamerasComputer PartsDesktopsWorkstation DesktopDVD PLAYERMisc PeripheralsMonitorTV'sNetworking EquipmentPC / Server ComponentsPrintersProjectorsRamSpeakersStorageHard DrivesSmart PhonesToysVHSVideo EquipmentExpansion CardsVideo Cards (GPU)CD/DVD ROMFor Parts Or Repair OnlyKeyboards and MicePower Supply Line 6 James Tyler PCB - 35-00-0322 Product Description Up For Sale today is this Line 6 James Tyler PCB - 35-00-0322 G11 Bridge Trem Rev B 00A Pulled from a working environment ITEMS COME AS PICTURED Bid with confidence, buy from a TRUSTED seller! CONDITION: The Item that has been used previously. The item has some signs of cosmetic wear, but is fully operational and functions as intended. Pictures are of the actual item, please use the pictures as reference No additional accessories are included with this item unless it is stated in this description even if you see it in the pictures such as: power cables, external power supplies, remote controls, back up CD, manuals, licensing. etc. If you have any questions regarding this, Please contact us before purchasing! As-is item, no returns or exchanges Notice To All Buyers: Buyers are expected to do their own research in regard to the compatibility and hardware/software requirements for any item they are considering purchasing, as well as any necessary configurations needed for correct operation and system functionality. Only pictured items are included - cables and other accessories are not included unless explicitly stated/shown in pictures. Please read the description carefully. Please contact us if you have any questions about this item before purchasing the item. WARRANTY: Guaranteed not to be DOA, item has been tested.ShippingWARRANTY/RETURNSPaymentFeedback- U.S. FREE SHIPPING APPLIES ONLY TO THE CONTIGUOUS 48 STATES- BE SURE TO SELECT THE CORRECT SHIPPING ADDRESS BEFORE COMPLETING YOUR PAYPAL PURCHASE. WE CANNOT CHANGE THE SHIPPING ADDRESS AFTER YOUR PURCHASE HAS BEEN COMPLETED. WE DO NOT SHIP TO PO BOX ADDRESSES AK, HI, or the US territories. - Shipping and insurance if breakable (which is only our costs) is included in the shipping price within the continental US. I try to ship the same or next day after payment is received except for Saturday payments. Once the Post Office has it, I have no control over their quickness of delivery. Check out our other auctions this week. We combine shipping whenever possible. Thanks for looking and good luck bidding. INTERNATIONAL BUYERS:- Please consider the cost of customs fees as an additional expense. - All customs fees, duties, or expenses are the sole responsibility of the buyer; these are not extra shipping costs, but are duties/taxes paid to the buyer's government. Import duties, taxes, and charges are not included in the item price or shipping cost. You will be charged upon receipt of your package based on your countries import/duty rates.- We will not mark any item as a “GIFT”. - We understand that customs fees are an added expense for our overseas customers. However, we are not legally allowed to mark that your purchase is a gift; doing so violates U.S. and international law. - All of our products are inspected before shipment. If items are not as described or defective, we will exchange for the correct item or refund your money, unless the item was drop shipped to a third party. Items purchased with free shipping will be refunded less the price of our outbound shipping cost. Items returned to us due to buyer error will be charged a 15% restocking fee, as well as appropriate shipping charges. - WE DO NOT REFUND SHIPPING COSTS. BUYER IS RESPONSIBLE FOR RETURN SHIPPING COST. - The last thing I want is an unhappy customer so I would never intentionally ship a questionable item without listing it as such. But there will be rare occasions when my best efforts are not enough and the item you have received has problems. In that case please notify me, through eBay, within 14 days of receiving the item. - If you have questions please ask them before purchasing the item. I will do my best to answer promptly PayPal payments only. - Payments should show in my PayPal account no later than 7 days after your commitment to purchase this item. If there is a problem making your payment to PayPal let me know. I am easy to work with. Please do not leave negative feedback before contacting us. Customers satisfaction is important to us, money back guaranteed! Please check out my other items for sale! Shop by Categories Desktops Servers Audio Equipment Video Equipment Thank you for shopping!", "ItemID": "303032995890", "EndTime": "2019-02-16T19:27:22.000Z", "StartTime": "2019-01-17T19:27:22.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Line-6-James-Tyler-PCB-35-00-0322-G11-Bridge-Trem-Rev-B-00A-Free-Ship-/303032995890", "ListingType": "FixedPriceItem", "Location": "Upland, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/3030329958908080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA2M1gxMTg2/z/rDYAAOSw9ptcQNZn/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAyMVgxNTQ3/z/5B8AAOSwPXFcQNZO/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU4MlgxMTY0/z/BwMAAOSwkjJcQNZ5/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU1MVgxMTg2/z/UKQAAOSwE~ZcQNaJ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTM4NFgxMTg2/z/MC0AAOSw7OdcQNag/$_57.JPG?set_id=8800005007"], "PostalCode": "91786", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "honeydirect1219", "FeedbackRatingStar": "Purple", "FeedbackScore": 574, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 114.98, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 114.98, "CurrencyID": "USD"}, "ListingStatus": "Active", "QuantitySold": 0, "ShipToLocations": ["US", "CA", "GB", "DK", "RO", "SK", "BG", "CZ", "FI", "HU", "LV", "LT", "MT", "EE", "AU", "GR", "PT", "CY", "SI", "JP", "CN", "SE", "KR", "ID", "TW", "TH", "BE", "FR", "HK", "IE", "NL", "PL", "ES", "IT", "DE", "AT", "BS", "IL", "MX", "NZ", "PH", "SG", "CH", "NO", "SA", "UA", "AE", "QA", "KW", "BH", "HR", "MY", "CL", "CO", "CR", "DO", "PA", "TT", "GT", "SV", "HN", "JM", "AG", "AW", "BZ", "DM", "GD", "KN", "LC", "MS", "TC", "BB", "BD", "BM", "BN", "BO", "GF", "GG", "GI", "GP", "IS", "JE", "JO", "KH", "KY", "LI", "LK", "LU", "MC", "MO", "MQ", "MV", "NI", "OM", "PK", "PY", "UY"], "Site": "US", "TimeLeft": "P11DT22H56M44S", "Title": "Line 6 James Tyler PCB - 35-00-0322 G11 Bridge Trem Rev B 00A Free Ship ", "ItemSpecifics": {"NameValueList": [{"Name": "Product Line", "Value": ["Variax"]}, {"Name": "Brand", "Value": ["Line 6"]}]}, "HitCount": 58, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1158087565", "StoreName": "Kali.J Design"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa"], "GlobalShipping": true, "ConditionDescription": "Pulled from a working environment", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}