{"BestOfferEnabled": false, "Description": "Jackson JS34Q Dinky DKA-M Transparent Red 190839576804 Open Box J16854005002033 Gear returned in great condition, with only minor signs of use, such as slight scuffs or pick marks. It looks and plays like new and may be considered an equivalent to display units found in retail stores. Full Manufacturer warranty not applicable on all used products. Jackson JS Series guitars make it easier than ever to get classic Jackson tone, looks, and playability without breaking the bank. Upgraded features such as arched tops, new high-output ceramic-magnet pickups, graphite-reinforced maple necks, bound fingerboards and headstocks, and black hardware deliver more for less.The JS34Q Dinky has a poplar body with a beautiful quilt maple arched top, bolt-on maple speed neck with graphite reinforcement, compound-radius (12\u009d-16\u009d) bound maple fingerboard with 24 jumbo frets and black sharkfin inlays, and a bound headstock.Other features include dual high-output Jackson humbucking pickups with ceramic magnets and three-way blade switching, Jackson-branded Floyd Rose® double-lockin gtremolo bridge, black hardware and die-cast tuners.Available in Transparent Blue and Red finishes. Orders are generally shipped the following business day after payment is received. For example, if your order is placed AND paid for at 1 p.m. Eastern Time on Friday, Music123 will ship it on Monday. We are only shipping eBay orders via standard ground shipping at this time (3-7 business days for delivery once the item leaves our warehouse)** International Buyers – Please Note: Import duties, taxes, and charges are not included in the item price or shipping cost. These charges are the buyer's responsibility. Please check with your country's customs office to determine what these additional costs will be prior to bidding or buying. Music123 only accepts payments for eBay orders through Paypal. We are required to collect sales tax on all orders shipped to Alabama, California, Colorado, Connecticut, District of Columbia, Hawaii, Illinois, Indiana, Iowa, Kentucky, Maine, Maryland, Massachusetts, Michigan, Minnesota, Mississippi, Missouri, Nebraska, Nevada, New Jersey, New York, North Carolina, North Dakota, Oklahoma, South Carolina, South Dakota, Utah, Vermont, Washington, West Virginia, Wisconsin and Wyoming. You will be charged the state and local sales tax rate for any orders shipped to these states.Georgia, Louisiana, Rhode Island and Pennsylvania Residents: Music123 is not obligated to, and does not, collect sales tax in your state. Your purchase is subject to sales/use tax in these states unless it is specifically exempt from taxation. The purchase is not exempt merely because it is made over the Internet or by other remote means. These states require that you file a sales/use tax return at the end of the year reporting all of the purchases that were not taxed on those purchases. Retailers that do not collect sales tax in these states are obligated to provide purchasers an end-of-year summary of purchases in order to assist them in filing their tax report. Retailers that do not collect sales tax in these states may be required by law to provide the Department of Revenue with an annual report of the total amount of all of your purchases above certain thresholds. Details on how to file this return may be found at your applicable Department of Revenue website.Alabama residents: Seller has collected the simplified sellers use tax on this transaction(s) delivered into Alabama and the tax will be remitted on the customer’s behalf to the Alabama Department of Revenue. Seller’s program account number is SSU-R010185934. Check-Out Now! Click the Pay Now button at the top of this listing to immediately proceed with our checkout and payment process. Please note that the Pay Now button is ONLY available after winning an auction or completing a Buy It Now purchase. Paypal is the only payment method we allow. Your Paypal account must be a verified US account only. No international accounts. Upon checkout, you will receive confirmation from Paypal that your payment has been accepted. Returns 45 Day Satisfaction Guarantee Our goal is your total satisfaction. New Gear: If you’re not satisfied, neither are we. If for any reason you’re not completely satisfied with your purchase of a new item, simply return it in its original condition within 45 days of purchase (see exceptions below) and we’ll give you a full refund. It’s that simple. Returned items must be in original, brand-new condition, showing no signs of wear or use such as belt-buckle or pick scratches, scuffs, dings or scrapes on the instrument or collateral materials. Items must also include all original packaging, manuals, warrantees and accessories or your return may be subject to a return handling charge. Please contact us for detailed return handling charges. Your refund will be promptly processed upon successful evaluation of your returned item from our trained category professionals. Refunds are made for product value only, excluding shipping and handling charges. If you received Free Shipping on your order, the value of the uncharged shipping cost will be deducted from your refund. Used Gear: If for any reason you’re not completely satisfied with your purchase of a used item, simply return it in its original condition within 30 days of shipment and we’ll give you a full refund. Items not returned in original condition are subject to a return handling charge. Select used item are not returnable. International Shipments: Our return policies for new and used gear also apply to international shipments. Please see any additional policies and information shipped with your package for more details. Exceptions: There are no returns on clearance, discontinued, vintage, demo and select used items. Additionally, the following items are returnable only if defective OR unopened - strings, reeds, computers, tubes, earbuds, earplugs, recorders, tin whistles, flutophones, \"world\" wind instruments, harmonicas, raw-frame speakers, drumheads, drumsticks, turntable cartridges, fog fluid, clothing/footwear, body jewelry, sheet music, cleaners, polishes and polishing cloths. Software/soundware, books, CDs, DVDs, and videos may be returned for credit only if they are in their original, sealed packaging. If defective, these items will only be exchanged for the same product. All returned woodwind and brass instruments incur a $10.00 sanitization fee. Returned bows are assessed a $4.00 restocking fee. Returned mouthpieces priced over $300 incur an $8.00 sanitization fee; the fee for mouthpieces under $300 is $4.00. Due to its return policies, you must contact Apple directly to repair, replace or return Apple products. Apple products may not be returned to us under any circumstance. Stringed instruments priced at $1999.00 or more, must be returned within 10 days of shipment. Requesting a Return: Contact our experts via eBay messages. Additional information on returns can be found on the paperwork shipped with your package. Send your returns to: Music123 (Your RA #) 4005 N Norfleet Kansas City, MO 64161-9231", "ItemID": "362543867317", "EndTime": "2019-02-28T01:11:12.000Z", "StartTime": "2019-01-29T01:11:12.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Jackson-JS34Q-Dinky-DKA-M-Transparent-Red-190839576804-Open-Box-/362543867317", "ListingType": "FixedPriceItem", "Location": "Direct from Music123", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/3625438673178080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTAwMFgxMDAw/z/2q0AAOSwEGBcT6g1/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAwMFgxMDAw/z/UQ0AAOSwNShcT6g1/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAwMFgxMDAw/z/SJAAAOSwkHxcT6g1/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAwMFgxMDAw/z/bYsAAOSwk-1cT6g1/$_1.JPG?set_id=880000500F"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "music123", "FeedbackRatingStar": "RedShooting", "FeedbackScore": 465244, "PositiveFeedbackPercent": 99.2}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 279.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 279.99, "CurrencyID": "USD"}, "ListingStatus": "Active", "QuantitySold": 0, "ShipToLocations": ["US", "CA"], "Site": "US", "TimeLeft": "P23DT4H2M1S", "Title": "Jackson JS34Q Dinky DKA-M Transparent Red 190839576804 Open Box", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Jackson"]}, {"Name": "MPN", "Value": ["USED005033 2910137590"]}, {"Name": "Size", "Value": ["190839576804"]}]}, "HitCount": 41, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=4598174", "StoreName": "Music123"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalRefund": "MoneyBack", "InternationalReturnsWithin": "30 Days", "InternationalReturnsAccepted": "ReturnsAccepted", "InternationalShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "APO/FPO", "US Protectorates"], "GlobalShipping": false, "ConditionDescription": "Gear returned in great condition, with only minor signs of use, such as slight scuffs or pick marks. It looks and plays like new and may be considered an equivalent to display units found in retail stores.", "QuantitySoldByPickupInStore": 0, "SKU": "J16854005002033", "NewBestOffer": false}