{"BestOfferEnabled": false, "Description": "ESP LTD M-252 Electric Guitar Metallic Gold An excellent ESP/LTD electric guitar!!! It has a beautiful Metallic Silvery Goldish finish that I have not seen before, a 24 fret fully bound Rosewood fretboard that is unusually dark almost like Ebony, gorgeous Pearl reverse Arrowhead inlays, Reverse headstock, black hardware, and a Gold recessed Floyd Rose lic. locking tremolo(including the whammy bar and this one is a great candidate for tricking it out with all Gold hardware, I have Gold rings, Gold knobs, Gold switch screws, Gold FR nut and string retainer, and Gold strap buttons but don't have the tuners otherwise I would do it all myself and make this one stunning with all Gold hardware.) It has 3 Seymour Duncan Designed pickups that sound great! HSH It is 25.5 scale, the neck width at the nut is 1 & 5/8\", and it weighs about 8.4 pounds. The condition is excellent(a 9.6 out of 10) with only light signs of use and shows just slight fret wear, the guitar is excellent all around with no problems except for a few light playing scratches and dings, and missing the tremolo cover backplate(See pics). This one plays incredibly well! I am very impressed with the playability of this axe! Serial#W021629*, made in Korea in 2002 I think, includes the Fender gig bag case. USA Shipping, handling, and insurance charge will be $50 in USPS's deliverable USA 48 states. International shipment and handling is $150 for most other countries via USPS's deliverable Priority Mail International delivery plus you may have to pay import taxes/duties to import and it may take 45 days or longer to receive(Only the smaller less populated countries will take that long, not the mainstream well populated countries). The shipping and handling charge will be $100 for Canada delivery. I reserve all rights. I always declare and insure for the full purchase price, no exceptions. Check out my other auctions as I usually have guitars and parts for sale. I buy and sell quality musical instruments and have over 7000 positive Ebay feedbacks so bid with confidence that you will receive quality merchandise as described, shipped promptly and securely. I also have been playing lead guitar since 1979. I try to describe the condition of the guitars I sell the best I can using the Bluebook of Electric Guitars photo grading system and the shipping rates stated above are a flat fixed rate and covers the shipping, handling, and insurance. Colorado sales must add 4.6% sales tax. No trades. Please... Only bid if you have all the money NOW, and will send me the payment if you are the winning bidder. I sometimes miss a day checking my email so please be patient and I will try to respond to all questions ASAP. Thanks, and good luck bidding.", "ItemID": "123628950485", "EndTime": "2019-03-06T16:44:30.000Z", "StartTime": "2019-02-04T16:44:30.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/ESP-LTD-M-252-Electric-Guitar-Metallic-Gold-Sparkle-/123628950485", "ListingType": "FixedPriceItem", "Location": "Golden, Colorado", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1236289504858080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NjU5WDE1ODc=/z/uwsAAOSwDAdb8Ncr/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/9o8AAOSwZddb8NdE/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/aOYAAOSw7R9b8NdL/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTc4WDE1ODc=/z/aU4AAOSwtYZb8Ndu/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/AroAAOSwgGZb8NeC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/sYIAAOSw21Rb8NeX/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/sYkAAOSw21Rb8Neg/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/ATMAAOSwz05b8Ne1/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/iAsAAOSwjNdb8NfK/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTU4WDE1ODc=/z/hUwAAOSw3-9b8Nfq/$_57.JPG?set_id=8800005007"], "PostalCode": "80401", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "carrguitar", "FeedbackRatingStar": "Green", "FeedbackScore": 7421, "PositiveFeedbackPercent": 99.7, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 249.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 249.0, "CurrencyID": "USD"}, "ListingStatus": "Active", "QuantitySold": 0, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "P29DT20H14M8S", "Title": " ESP LTD M-252 Electric Guitar Metallic Gold Sparkle ", "ItemSpecifics": {"NameValueList": [{"Name": "MPN", "Value": ["Does Not Apply"]}]}, "HitCount": 4, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=5569370", "StoreName": "carrguitar"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}