{"BestOfferEnabled": false, "Description": "---> MY WORLD | OUR EBAY STORE | CONTACT US | FAVORITE US | NEWSLETTER Search Our Ebay Store INFO LINE: 1-800-863-4347 Epiphone Les Paul Special II Electric Guitar Yellow - Excellent! PRE-OWNED --> Description: EXCELLENT CONDITION THIS GUITAR LOOKS, PLAYS AND SOUNDS BEAUTIFUL SUPER FAST SAME DAY SHIPPING   This is a limited edition version of Epiphone's number one selling model available with a choice of \"worn\" finishes. The Epiphone Ltd Ed Special-I is a great way for beginners to get started on guitar with real Les Paul tone and feel. But seasoned pros love the Special-I also because it's a great-sounding, workhorse guitar that lets them leave their more expensive axes at home. The authentic LP power starts with an basswood, trademarked Les Paul body with a bolted-on \"1960's\" SlimTaper„¢ mahogany neck featuring a 21-fret rosewood fingerboard with dot inlays. The Special-I is voiced by a pair of hot open-coil Epiphone 700T and 650R humbucker pickups, giving it massive, unmistakable Les Paul tone. Like all of Epiphone's electric guitars, it comes standard-equipped with 500K potentiometers for the master volume and master tone controls, plus Epiphone's heavy-duty 3-way pickup selector toggle switch and exclusive non-rotating heavy-duty output jack. This value-champ also now features nickel hardware including an intonated, one-piece wraparound bridge-stopbar.   FEATURES Basswood body Bolt-on mahogany neck Rosewood fretboard 21 frets D-shaped profile Epiphone 700T bridge humbucker Epiphone 650R neck humbucker Master volume, master volume controls 3-way pickup toggle switch Nickel hardware Intonated, one-piece wraparound bridge-stopbar Coverered, 14:1 diecast tuners Polyurethane finish Condition: Price: $119.95 --> POLICIES: No international bidders for this item, USA and Canadian bidders only. Free shipping are for 48 lower states only. If you are in Canada, Alaska, Hawaii or Puerto Rico please contact us for a shipping quote. If you are paying by credit card, we will ship only to your billing address or another address that is authorized by your credit card company. If you are using PayPal, your shipping address and PayPal account must be confirmed/verified. If you have recent negative feedback you must email us before you bid. NYS Residents only please add 8.75% Sales Tax. Item must be returned within 30 Days from delivery date. All shipping costs are non-refundable, including our actual original shipping costs included in free shipping offers. Buyer must contact us by phone or email for return authorization. All returns must be in original, undamaged, new condition and include all warranty cards, literature, packaging, etc. All returned items are subject to a 10% restocking fee. --> SHIPPING TIMES: Items ship via FedEx Ground to continental US unless otherwise noted. Some items may ship via USPS. PAYMENT: I accept the following forms of payment: PayPal Direct Offline Credit Card Payment: Visa/Master Card, American Express, Discover Welcome to The Guitar Factory Since 1989 we have had one simple mission: the biggest names at the best prices with service before and after the sale. Check our feedback and see why thousands of eBay customers shop with us! We have many name brand and used instruments that will accommodate most any budget and we guarantee the lowest possible prices available anywhere on the internet! Add Me to Your Favorite Sellers Check out my other eBay auctions! TOLL FREE INFO LINE! CALL 1-800-863-4347", "ItemID": "123612692644", "EndTime": "2019-02-24T22:35:08.000Z", "StartTime": "2019-01-25T22:35:08.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Epiphone-Les-Paul-Special-II-Electric-Guitar-Yellow-Excellent-/123612692644", "ListingType": "FixedPriceItem", "Location": "Buffalo, New York", "PaymentMethods": ["PayPal", "VisaMC", "Discover", "AmEx"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1236126926448080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFg3ODk=/z/Ba4AAOSwuNNcS48O/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/MTIwMFg4MzI=/z/54UAAOSwB0lcS48P/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/PsIAAOSwsZhcS48S/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/MTIwMFg4MTY=/z/RukAAOSwUXFcS48T/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/FKkAAOSw~D5cS48W/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/qewAAOSwXyBcS48Y/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/VgsAAOSw3fZcS48b/$_1.JPG?set_id=2"], "PostalCode": "14224", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "theguitarfactorywebsite", "FeedbackRatingStar": "TurquoiseShooting", "FeedbackScore": 26129, "PositiveFeedbackPercent": 99.8, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 119.95, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 119.95, "CurrencyID": "USD"}, "ListingStatus": "Active", "QuantitySold": 0, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "P20DT1H27M16S", "Title": "Epiphone Les Paul Special II Electric Guitar Yellow - Excellent!", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "Custom Label", "Value": ["EPI-SPECIALII-3559-U"]}, {"Name": "MPN", "Value": ["SPECIALII-3559-U"]}]}, "HitCount": 180, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=6978134", "StoreName": "The Guitar Factory"}, "Country": "US", "ReturnPolicy": {"Refund": "Money back or replacement (buyer's choice)", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": true, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "SKU": "EPI-SPECIALII-3559-U", "NewBestOffer": false}