{"BestOfferEnabled": false, "Description": "Please read the entire ad including the business stuff below, review all of the pictures and feel free to ask questions and be sure of your purchase before bidding. We want you to be completely satisfied with your purchase and look to serve you as the best ebayer ever! Thanks for looking. :) For your consideration, a 1960's vintage Decca Stratocaster Electric Guitar. This student size guitar is used and has a few nicks & scratches but is great shape. The body has a beautiful Sunburst finish. It has a smooth and straight neck with rosewood fretboard. Vintage single coil pickup, volume and tone controls. It will be VERY carefully wrapped and packaged and shipped with insurance, as usual, just in case. The stand shown in the pictures is not included. Local pick-up available as well. Please review all of the pictures and ask questions BEFORE purchase. Thanks for looking. The following is the usual business stuff:The pictures are of the exact item you will receive and are part of the description too. Please use the zoom feature to verify the items condition. Only the item described and in the pictures is for sale. Payment must be made immediately and within 24 hours of purchase or auction's end to avoid cancellation and relisting. I only accept PayPal for payment and only ship to verified accounts in the continental U.S. ( lower 48 ). If you have less than 10 feedback responses you must contact me before purchase to authorize and verify the sale. I also reserve the right to cancel any sale based on negative feedback. The unpaid item assistant is automatic. Scammers and unscrupulous business practices will be reported to all agencies.Local pick up available. Contact me before paying for shipping to arrange a time at my designated meeting place here in the Richmond Va. area. Pick up must be within 2 days of completed sale. Sale must be completed before pickup.Other items in the pictures not described are not included in this auction, only the item listed in the title.I reserve the right to end this auction early or cancel the sale as I often advertise and sell locally. You are always welcome to arrange local pickup, otherwise shipping will be as stated in the listing. The buyer is responsible for all shipping & handling fees, including all additional shipping & handling fees required. All items are thoughtfully and carefully packaged and I take great effort insuring that you will receive your item. You may request any additional shipping & handling services, such as insurance, rush delivery, etc.. at your additional expense and with an additional fee for the service. Changes must be requested at auctions close and before payment as I am a faster shipper and generally package and ship by the next day after auctions end. Shipping fees include the standard shipper fees. Handling fees include the time, care, and packaging/shipping supplies and fees necessary for shipping. Should there be any delivery delay, I will notify you via email. If you provided an address that the carrier deems undeliverable and your item is returned, you will need to pay for shipping again once a proper address is provided to me. Returns are ONLY accepted if it does not match the description as per ebay's buyer protection policies. No returns for buyer remorse, accidental purchase, or cancelled orders after the buyer has paid. Photo/video of this item, it's functioning condition and packing are made and insurance is included to cover the items value. Eventhough I am a small sales enthusiast, all items are fully inspected by more than one person and verified by local professional stores/professionals for authenticity and function. Items are listed with all full known disclosure to the best of my ability and sold as used with such assumed condition. No returns. No exceptions. All items are USED and sold AS IS, NO returns. I encourage you to ask questions before you buy. All sales are final. Buyer will pay all costs including packaging and insurance for shipping returns. Please refer to the return policy with questions and contact if you should ever have need. I am hear to help an want you to be completely satisfied with your purchase. You will receive positive feedback upon receiving the item as I hope you will likewise leave me a feedback. I work hard for our positive feedback and should there be any problems, please email me before submitting any neutral or negative feedback for timely resolution!Please email me with any questions. Thank You.", "ItemID": "183649766485", "EndTime": "2019-02-22T08:27:25.000Z", "StartTime": "2019-01-23T08:27:25.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1960s-Decca-Electric-Guitar-Original-Beatles-Era-/183649766485", "ListingType": "FixedPriceItem", "Location": "Henrico, Virginia", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1836497664858080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/w1UAAOSwCVtb-LGI/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/Xv0AAOSwZupb-LGU/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/CEoAAOSw7Odb-LGk/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/aJwAAOSwNphb-LHD/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/-EoAAOSw8OFb-LHi/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/F3YAAOSwwTFb-LHr/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/FdAAAOSwtcRb-LH1/$_57.JPG?set_id=8800005007"], "PostalCode": "23228", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "rvamusicman1", "FeedbackRatingStar": "Blue", "FeedbackScore": 83, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 65.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 65.0, "CurrencyID": "USD"}, "ListingStatus": "Active", "QuantitySold": 0, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "P17DT13H45M31S", "Title": "1960's Decca Electric Guitar - Original Beatles Era!", "ItemSpecifics": {"NameValueList": [{"Name": "Size", "Value": ["Short Scale"]}, {"Name": "Body Color", "Value": ["Sunburst"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Brand", "Value": ["Decca"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Series", "Value": ["Custom"]}, {"Name": "Modification Description", "Value": ["Logo removed from headstock."]}, {"Name": "Model", "Value": ["Vintage"]}]}, "HitCount": 246, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "For your consideration, a 1960's vintage Decca Stratocaster Electric Guitar.  This student size guitar is used and has a few nicks & scratches but is great shape.  The body has a beautiful Sunburst finish.  It has a smooth and straight neck with rosewood fretboard. Vintage single coil pickup, volume and tone controls.  It will be VERY carefully wrapped and packaged and shipped with insurance, as usual, just in case.  The stand shown in the pictures is not included.  Local pick-up available as well.  Please review all of the pictures and ask questions BEFORE purchase.  Thanks for looking.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}