{"BestOfferEnabled": false, "Description": "Kona K394D Acoustic Guitar with Road Runner Gigbag Kona K394D Acoustic Guitar with Road Runner Gigbag This guitar is pre-owned in good condition. There may be minor wear on it from previous use. There are no major scratches or scuffs on it. *Please see photos for details* *Please visit our store for more great deals!* ***please consider that all items sold through our Ebay store were donated to us and should be considered secondhand.*** Communication Please feel free to contact us with any questions or concerns you may have regarding our active or completed listings. We will do our best to provide you the information you are looking for.Employees of The Salvation Army manage this eBay account Monday through Friday, 8:00am to 4:00pm EST. During these hours we are available to to answer questions and address customer concerns.Please send all communication via the eBay messaging system. About Us The Salvation Army Adult Rehabilitation Center provides spiritual, social and emotional assistance for men who have lost the ability to cope with their problems and provide for themselves. The program is offered free of charge to participants and focuses on rehabilitating the mind, body, and spirit. The center provides for the physical necessities of the men, as well as their emotional and spiritual needs. While in the program each man participants in a variety of therapies including individual, group, family and work; all in a clean, wholesome environment. The physical and spiritual care the program participants receive, prepares them to re-enter society and return to gainful employment. Many of those who have completed the program, are reunited with their families and resume a normal life. The center is funded solely by the sale of donated goods. The items we receive are sold in our Family Stores and through our eBay selling program. Each time you make a purchase from us, either here or in one of our Family Stores, you are helping to restore broken lives. Customer service is our top priority. If you make a purchase from us and an issue arises; please give us a chance to make things right by contacting us before leaving negative feedback or opening a case. We promise to resolve problems quickly and professionally. PAYMENT TERMS: PayPal is the only method of payment we acceptIn the event payment has not been received 5 business days after the auction has ended, we may relist the item and open an unpaid item caseWe do not end auctions early for \"Buy-it-Now\" offers SHIPPING TERMS: We are happy to offer combined shipping for listings ending on the same day. Please contact us after the auctions end to make arrangementsPayment must clear PayPal before an item will be shippedAll items are available for local pick-up, but payment must first be cleared via PayPalLocal pick-up is available 8am to 4pm Monday through Friday; please contact us to make arrangementsAll shipments come with delivery confirmationItems listed for \"Local Pick-up Only\" must be retrieved no later than 10 business days after payment is received, if any item is not retrieved in this time frame, the payment will be refunded and the buyer blocked from future auctionsWe will only ship to the address the buyer has registered with eBayCurrently, we DO NOT ship internationally as well as to any APO's FPO's or DPO's Listing and template services provided by inkFrog", "ItemID": "333053140149", "EndTime": "2019-02-10T23:00:39.000Z", "StartTime": "2019-02-03T23:00:39.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Kona-K394D-Acoustic-Guitar-Road-Runner-Gigbag-/333053140149", "ListingType": "Chinese", "Location": "Hyattsville, Maryland", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/3330531401498080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NjQ0WDE2MDA=/z/bdAAAOSwgrZcV3KR/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMTY2/z/8dcAAOSwxrJcV3KS/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMzQw/z/naIAAOSwV0NcV3KT/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg2Nzc=/z/9X4AAOSwWAhcV3KT/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/Njk1WDE2MDA=/z/g7UAAOSw6jpcV3KU/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/Nzc4WDE2MDA=/z/~8cAAOSwLeFcV3KU/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzUxWDE2MDA=/z/gnsAAOSw~flcV3KU/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NTY5WDE2MDA=/z/VYEAAOSwukZcV3KU/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg3ODk=/z/jX0AAOSw3~5cV3KW/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjYwWDE2MDA=/z/WnkAAOSwm5xcV3KV/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMTAy/z/pGsAAOSwdiFcV3KW/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg3MDY=/z/WCwAAOSwQSlcV3KV/$_12.JPG?set_id=880000500F"], "PostalCode": "20781", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "salvationarmywashingtonarc", "FeedbackRatingStar": "Green", "FeedbackScore": 7245, "PositiveFeedbackPercent": 99.7, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 29.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 29.99, "CurrencyID": "USD"}, "ListingStatus": "Active", "QuantitySold": 0, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "P6DT2H29M14S", "Title": "Kona K394D Acoustic Guitar with Road Runner Gigbag", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Kona"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}]}, "HitCount": 10, "PrimaryCategoryIDPath": "619:3858:33034", "Charity": {"CharityID": "143709", "CharityName": "The Salvation Army Washington Adult Rehabilitation Center", "CharityNumber": 180213, "DonationPercent": 100.0, "Mission": "When you purchase goods from The Salvation Army eBay store in Washington DC, the proceeds are used to fund our Adult Rehabilitation Centers, where those struggling with drugs and alcohol find help, hope, and a second chance at life. Learn more at SATRUCK.ORG", "LogoURL": "https://i.ebayimg.com/00/s/NTQ4WDE2MDA=/z/hQ4AAOSwGDZbUaTQ/$_1.PNG?set_id=8800005007", "Status": "Valid"}, "Storefront": {"StoreURL": "https://stores.ebay.com/id=1098269617", "StoreName": "SalvationArmyWashington"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 29.99, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "This guitar is pre-owned in good condition. There may be minor wear on it from previous use. There are no major scratches or scuffs on it.", "QuantitySoldByPickupInStore": 0, "SKU": "020319t27", "NewBestOffer": false}