{"BestOfferEnabled": false, "Description": "--> Kramer Pacer Classic Electric Guitar (Black) Used This item is slightly used and has been thoroughly checked out by our experts to make sure it is in perfect working condition. We then re-sealed it in its original packaging with all factory included accessories. This item is guaranteed to be in \"as new\" condition and has virtually no cosmetic imperfections. This item is covered with a one year warranty from Sam Ash. During the shred boom of the mid- 1980s, Kramer was the #1 selling electric guitar brand in the world, and its fast, powerful designs set the pace for countless other makers to follow. Endorsements from no less than Vivian Campbell, Edward Van Halen, Jeff Golub, Brad Gillis, Neil Schon, and Richie Sambora proved that the company was hitting the mark for top-flight professionals. And at the center of it all, the Kramer Pacer was the cornerstone model. Now, the Kramer Pacer Classic embodies the original model from 1983 in a new, contemporary shred machine for the hardest rocking, fastest riffing players out there in the 21st century.The current Kramer Pacer Classic features a Mahogany body and a Maple neck with Maple fretboard; a volume control for each pickup; master tone control; three-way mini toggle pickup selector switch; 25.5\" scale length; and black hardware. Case not included.Features:Slim, Wide Profile2 Volume, 1 Tone Control knob with Miniature Three-way TogglePair of Alinco V HumbuckersFloyd Rose Tremolo Bridge with Locking Nut25.5\" scale22 fretsMahogany BodyMaple neck and fingerboardPremium Die-cast TunersCase not includedOrder your Kramer Pacer Classic Electric Guitar from Sam Ash Direct today with the security of our 45/60 day return/price protection policy, and be sure to take advantage of our fast, free shipping. Shipping Information Your gear will ship out within 2 days of order confirmation. At this time we can not ship PO Boxes, APO and FPO locations. Industry Leading 45-Day Return Policy We stand by the products we sell, and we'll certainly stand by you as well! We truly appreciate your business, and we want you to be 100% happy with your purchase. However, we know that one of the drawbacks of internet shopping is that you can't try something before you buy it. That's where our money-back guarantee comes in. If you are not completely satisfied with an item, for any reason, you can return it within 45 days of the shipping date for a complete refund of the merchandise price.* Have a question about your order? A Sam Ash Customer Service specialist is available to help! Call 800-472-6274, Monday - Saturday, from 10:00AM - 6:00PM EST. Due to the complexity of international shipping, we are unable to accept any returns on international orders. Before making a purchase outside of the United States, please know that products sold by Sam Ash use the standard 120V/60Hz voltage standard. Sam Ash is not responsible for any damage caused by not adhering to the voltage requirements. *All returns must be within 45 days of the date the item was shipped. Please do not accept any shipment if the packaging appears damaged in any way. We strongly suggest that you check your order after receiving it to be sure that it is in proper working order. Returned items must be in resalable condition. Resalable Condition means that the product(s) is exactly in the same condition as you received it. All exchanges must be pre-paid, returned in original packing, complete with blank warranty cards, owner's manual and show no sign of wear or abuse. In the event that the product is not in the same condition as you received it you may be subject to a minimum 15% restocking fee, repair charge or disqualification. Shipping and handling charges are non-refundable. Please call our Customer Service department if you have any questions about returning an item. CDs, DVDs, video tapes, sheet music, books, strings, computer hardware/software, drum heads, harmonicas, mouthpieces, sound cards, microphones, raw speakers, studio furniture, blank CDs/Tapes or Special Orders are not covered by this return policy.", "ItemID": "173776114467", "EndTime": "2019-02-06T15:57:45.000Z", "StartTime": "2019-02-03T15:57:45.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Kramer-Pacer-Classic-Electric-Guitar-Black-Used-/173776114467", "ListingType": "FixedPriceItem", "Location": "Tampa, FL", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1737761144678080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MzMzWDUwMA==/z/qzoAAOSwJXNcVw97/$_1.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "samashdirect", "FeedbackRatingStar": "PurpleShooting", "FeedbackScore": 58829, "PositiveFeedbackPercent": 99.2, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 305.88, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 305.88, "CurrencyID": "USD"}, "ListingStatus": "Active", "QuantitySold": 0, "ShipToLocations": ["US", "CA", "GB", "SK", "AU", "KR", "ID", "TH", "IL", "MX", "NZ"], "Site": "US", "TimeLeft": "P1DT18H50M4S", "Title": "Kramer Pacer Classic Electric Guitar (Black) Used", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Kramer"]}, {"Name": "MPN", "Value": ["KPC-BKBF1"]}]}, "HitCount": 54, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1111655870", "StoreName": "Sam_Ash_Music_Direct"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalRefund": "MoneyBack", "InternationalReturnsWithin": "30 Days", "InternationalReturnsAccepted": "ReturnsAccepted", "InternationalShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "DiscountPriceInfo": {"OriginalRetailPrice": {"Value": 650.0, "CurrencyID": "USD"}, "PricingTreatment": "STP", "SoldOneBay": false, "SoldOffeBay": false}, "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Central America and Caribbean", "South America", "AF", "AM", "AZ", "BD", "BT", "CN", "GE", "IN", "JP", "KZ", "KG", "MV", "MN", "NP", "PK", "LK", "TJ", "TM", "UZ", "AS", "CK", "FJ", "PF", "GU", "KI", "MH", "FM", "NR", "NC", "NU", "PW", "PG", "SB", "TO", "TV", "VU", "WF", "WS", "AL", "AD", "AT", "BY", "BE", "BA", "BG", "HR", "CY", "CZ", "DK", "EE", "FI", "FR", "DE", "GI", "GR", "GG", "HU", "IS", "IE", "IT", "JE", "LV", "LI", "LT", "LU", "MK", "MT", "MD", "MC", "ME", "NL", "NO", "PL", "PT", "RO", "SM", "RS", "SI", "ES", "SJ", "SE", "CH", "UA", "VA", "BN", "KH", "HK", "LA", "MO", "MY", "PH", "SG", "TW", "VN", "BM", "GL", "PM", "DZ", "AO", "BJ", "BW", "BF", "BI", "CM", "CV", "CF", "TD", "KM", "CD", "CG", "CI", "DJ", "EG", "GQ", "ER", "ET", "GA", "GM", "GH", "GN", "GW", "KE", "LS", "LR", "LY", "MG", "MW", "ML", "MR", "MU", "YT", "MA", "MZ", "NA", "NE", "NG", "RE", "RW", "SH", "SN", "SC", "SL", "SO", "SZ", "TZ", "TG", "TN", "UG", "EH", "ZM", "ZW", "BH", "IQ", "JO", "KW", "LB", "OM", "QA", "SA", "TR", "AE", "YE", "PO Box"], "GlobalShipping": true, "ConditionDescription": "Like New", "QuantitySoldByPickupInStore": 0, "SKU": "KPCBKBF1X", "NewBestOffer": false}