{"BestOfferEnabled": false, "Description": "PLEASE READ LISTING ENTIRELY AS THIS CONTAINS IMPORTANT INFORMATION OF THE ITEM From my personal collection and batchUp for grabs is a very hard to find and considered a piece of Washburn's history mystery.The guitar itself is somewhat elusive because there is very little information available, Very few people even know that they existed.This is an early Washburn Billy T guitar model made before the BT Maverick's (1996-2002).I would estimate that this guitar was made between 1994-1996 since the serial number starts with a \"4\", alsoanother hint is that the first Billy T's were made before 1996.This is a quite beautiful guitar, sounds super nice and the playability is GREAT!I have researched this same guitar model although some look to be the same model but this one sets apart to the ones I have seen. and so far I was unable to find another like it, Washburn Billy T Model were made in Korea. CONDITION: USED but in good condition for its age.Guitar was polished, wood oiled, adjusted, freshly strung and this BEAUTY Looks great!It has some scratches and dings which is considered normal for an used piece.Guitar has one scratch noticeable upper top,and not limited to dings and others. Guitar will ship in Lyon by Washburn a gig bag in used condition and will get packed withextra care for safe arrival. DISCLAIMER: All item for sale are meticulously inspected, tested, and documented prior to listingand also before shipping,this refer to things such condition ( dings, scratches, etc..), and to make sure everything is fully functional again before shipping, I ALSO document all the shipping process and package items right and insured. 1.-Bass/Guitar is fully described and I strive to do so. I ALWAYS explain it as accurate as I possibly CAN!2.-Photos are part of the item description3.-In the event that your playing style requires you to have a new setup done to it, Not because the instrument doesn't work,or that it's defective, I sell fully operational and complete working gear and equipment. But bare in mind that sometimes it often might need some minor adjustments for your own technique,playing, touch, or in most occasions it just takes some time to adjust to the feel. PLEASE READ THE FOLLOWING: NOTE: Buyer assumes all responsibility for all the costs for the personal set up preference expenses. All the basses and guitars that I sell comes fully disclosed if a setup or any procedure was done or not. The way I do it, is in a general and universal way but ONLY for my personal likes or choices. Will It might work for a majority of players? maybe yes! but it could not work for you maybe. If you prefer that having a new setup is needed to suit your style and playability then that cost or In the event of any cost that will be at your expense. DESCRIPTION OF THE ITEM: ITEMS varies condition wise, I fully disclose everything THE BEST I CAN please take your time to READ the listing completely and ask any question you may have prior to purchase. * I DON\"T OFFER PARTIAL REFUND OF ANY KIND AND ALL SALES ARE FINAL, PLEASE BE AWARE AND UNDERSTAND AS PER EBAY POLICY WHEN AN ITEM IS NOT AS DESCRIBED,THIS MEANS THAT THE ITEM MUST BE SUBSTANTIALLY DIFFERENT TO THE DESCRIPTION ON THE LISTING OR BROKEN. * I won't be responsible or liable for any realistic or unrealistic repair that you or any 3rd party might say needed in order to play like any other bass/guitar you have had or was used for comparison. Every instrument is different in their own ways. Nor for any upgrades could be suggested. Thanks for reading. I SHIP VIA USPS OR FEDEX AND USUALLY TAKES 3 TO 9 BUSINESS DAYS TO DELIVER, BE PATIENCE ON THE ESTIMATED TIME ALLOWING THE CARRIER DO THEIR JOB.Please keep in mind that once the package is in transit I can't track the exact locationor know anything until package arrives at the final destination,also please be awarethat certain weather conditions and unforeseen events may delay it too in which I don't have control over it. Thanks for your patience once again. NO RETURNS ACCEPTED AND ALL SALES ARE FINAL Please don't forget to check out my other items for sale, Thanks!", "ItemID": "283339486932", "EndTime": "2019-02-14T02:25:37.000Z", "StartTime": "2019-01-15T02:25:37.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1994-1996-NICE-Early-Washburn-Billy-T-guitar-RARE-GOLD-HUMBUCKER-PICKUPS-Gig-Bag-/283339486932", "ListingType": "FixedPriceItem", "Location": "Santa Ana, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2833394869328080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/YLgAAOSw-ghb8b5F/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Lk0AAOSwjJtaqxq9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/BSMAAOSwysRaqxrC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/lIkAAOSw3fpaqxrF/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/5W0AAOSw94laqxrJ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/J5UAAOSwyHRaqxrM/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/vRoAAOSwPoZaqxrP/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/oc4AAOSwM2xaqxrS/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Ln8AAOSwjJtaqxrZ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/gQMAAOSwtc1aqxrc/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Y4sAAOSwsTVaqyAx/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/lN8AAOSwx2haqzCb/$_57.JPG?set_id=8800005007"], "PostalCode": "92704", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "highendbass", "FeedbackRatingStar": "Purple", "FeedbackScore": 612, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 294.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 294.99, "CurrencyID": "USD"}, "ListingStatus": "Active", "QuantitySold": 0, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "P9DT5H55M24S", "Title": "1994-1996 NICE Early Washburn Billy T guitar RARE GOLD HUMBUCKER PICKUPS Gig Bag", "ItemSpecifics": {"NameValueList": [{"Name": "Size", "Value": ["3/4"]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Billy T"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Country/Region of Manufacture", "Value": ["Korea, Republic of"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Model Year", "Value": ["1994"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Brand", "Value": ["Washburn"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}, {"Name": "Body Type", "Value": ["Bolt on"]}]}, "HitCount": 136, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "ConditionDescription": "Guitar has some scratches and dings due to normal use.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}