{"BestOfferEnabled": true, "Description": "Feel free to make an offer. I have this listed on the internet on other sites as well so first come first served. Correct body shape and dimensions, BLEM SALE...please the entire description... First the BAD, and it's cosmetic ONLY! Price has been discounted for the following. 1. In one of the pics you can see it. I over scraped and sanded the binding in one spot in the curved area in the lower bout Now it looks vintage aged lime spot. LoL Doesn't effect playability and not noticed easily But none the less I discounted the guitar. 2. After carving down the maple from 1\" thickness, some slit shaped voids began to be revealed. This happens a lot to quilted maple. Little unseen natural open pockets of voids inside the wood. There are several and the only thing I could was fill them. They're not bad but that's the nature of wood. Overall the top looks great. The scraping off of the excess lacquer on the binding is ok. Not my best. And remember that this is an unfinished guitar...Please note that it will need final sanding on back and sides. There maybe a nick or small dent from being handled but nothing that can't be sanded out. Now, on with the description. Professionally made body and neck, ready for you to finish. I buy my wood from choice sources and this has a very Quilted maple example. Also the fret board is Rosewood. I shot a cherry Burst finish lacquer on the top. Final polishing and buffing and cleanup will need to be done. Or if you want your own color you could take it off with lacquer thinner and sanding. Also, if you wanted to use one of those Gibson headstock overlays it should fit fine. Assuming the make used a 59 template as I do. This will be an exceptional guitar when done( assuming you finish it well). No returns. Exchange only due to the instrument being unfinished and unsealed. See below for more details. Honduran Mahogany body -one piece AAAA grade quilted maple capCream bindingrose wood Fret Board - two way truss rodNeck profile is like a 59, thick (you can contour it down to suit). Jumbo nickel fretsI use a wood epoxy for the cap to body and regular yellow wood glue for the neck joint. I know a lot of people say hide glue is the best but many say regular wood glue is best. I have been using regular wood glue for my builds for 40 years and I have yet to have one fall apart. NOTE. FOR AN EXTRA FEE OF 245.00 I WILL DO THE FOLLOWING. DRILL BRIDGE AND TAILPIECE HOLESDRILL AND INSTALL GROUND WIREDRILL TUNER MOUNTING HOLES, CUT NUT, SET FOR PROPER STRUNG HEIGHT ACTION. THIS IS BASED ON CUSTOMER SUPPLYING HIS HARDWARE and a set of cheap strings TO ME. If the buy it now is used I will pay for shipping(to the lower continental states only...otherwise it's 55.00) Alaska and Hawaii will be 50.00 charge if buy it now is used...otherwise it's 85.00) International sales will be considered. Message me. Due to the nature of this item being unfinished and the wood being in an unsealed state when shipped all sales are final, no refunds or returns. However, I will EXCHANGE the guitar for another I have but no one top is the same as another and I will do my best to allow the buyer to pick from a few tops I may have or will build to exchange.", "ItemID": "143115864550", "EndTime": "2019-02-10T20:22:52.000Z", "StartTime": "2019-02-03T20:22:52.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/BLEM-SALE-Christopher-Scott-Carved-Quilt-top-LP-guitar-project-body-neck-/143115864550", "ListingType": "Chinese", "Location": "Ventura, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1431158645508080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMTAw/z/7XUAAOSwEvZcORaP/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODQwWDEyMDA=/z/MQMAAOSwgdtcORa8/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTQ2WDEyMDA=/z/ifIAAOSwNphcORbt/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTUxMlgxMjAw/z/5fwAAOSwpzRcORbw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQwNlgxMjAw/z/xxYAAOSwHSdcORcK/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTc0WDEyMDA=/z/Um0AAOSwxrJcORb-/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODAwWDEyMDA=/z/~KkAAOSw5YlcORb7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzkwWDEyMDA=/z/MlkAAOSwviBcORcA/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjY2WDU5OQ==/z/Z9AAAOSwe9VcV0Xb/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTMzWDgwMA==/z/Ur8AAOSwEKxcV0Xf/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMTUw/z/KqoAAOSwnk5cV0YF/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMTY2/z/l84AAOSwkRdcV0Y5/$_57.JPG?set_id=8800005007"], "PostalCode": "93001", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "venturasailing", "FeedbackRatingStar": "Red", "FeedbackScore": 1124, "PositiveFeedbackPercent": 100.0}, "BidCount": 8, "ConvertedCurrentPrice": {"Value": 20.5, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 20.5, "CurrencyID": "USD"}, "HighBidder": {"UserID": "g***o", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 712}, "ListingStatus": "Active", "QuantitySold": 0, "ReserveMet": false, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "P6DT1H13M18S", "Title": "BLEM SALE !!! Christopher Scott ,Carved Quilt top, LP guitar,project  body/neck", "ItemSpecifics": {"NameValueList": [{"Name": "Body Type", "Value": ["Solid"]}]}, "HitCount": 164, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 21.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 10, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}