{"BestOfferEnabled": true, "Description": "PreownedEpiphone Les Paul Standard w/ Hard CaseBlack - 2006 est. Online General Description below:This plain top Epiphone Les Paul Standard is an electric guitar that delivers all the signature sound of a Gibson Les Paul at a fraction of the cost. The mahogany body provides superb resonance while the Alnico Classic humbucker pickups deliver loads of warmth. The set mahogany neck with slim-tapered profile and rosewood fretboard give you the familiar feel and fast action that Les Paul players love so dearly. Neck and body binding and trapezoid inlays produce the classic look seen on stages around the world for decades. The LockTone Tune-O-Matic bridge and stopbar tailpiece provide more sustain and string changing easier. Okay... I'd like to let you know upfront I wish I could tell you more specifics about this guitar however, I am not a guitar guy, guitar jockey-reseller, or musician! In addition, I am not the original owner of the guitar so I don't know the history of this guitar other than its been in my office for a couple years. I take 12 detailed photos so you can make the fairest evaluation of the item's physical condition using your own skilled observation; independent of ours yet subjective, opinion. Make sure to zoom in due to some reflections can be misleading.This item has been tested and working but we suggest a set-up by a professional upon receiving, such as a tuned up, tightened, cleaned, and or adjusted to your liking. We take many detailed photos so you can make the fairest evaluation of the item's physical condition using your own skilled observation; independent of ours yet subjective, opinion. Make sure to zoom in due to some reflections can be misleading. Not sure what scale I should give it since its13 years old.There may be various surface imperfections, scratches, small nicks you may find. Nothing major that i can see... Ebay only allows 12 photos so we attempted to take the correct angles. There may be additional blemishes, dings and scratches but nothing major.If you are unsure about the condition of any item, or need clarification, you are more than welcome to contact us to request more data or specific photos to satisfy any questions you might have. Our information is at the bottom of the listing. You will receive item exactly as shown in the pictures. Please understand, this listing only contains what is described. Don’t assume it comes with something if not stated in the listing description. If you aren’t certain, send us a note thru eBay messaging system. Stand in photo not included.If an identifying mark, inclusion or defect is visible in the images it is considered disclosed to the buyer.Pay attention to the details, Ebay’s defaulted detail catalog is not always correct. Many times Ebay product catalog does not have the correct photo of the item we have for sale may look different. In addition, I have found many of Ebay defaulted catalogues have certain models, MPN, and other specs wrong from previous listers. Double check to see if it is accurate. Most times the buyer knows more than we do. Please ask if there is something specific you need to know. Purchase of the item represent agreement on the terms and conditions of this ebay listing. This listing is offered and sold as is. Uptown Pawn dba. UptownSalesUSA, a brick and mortar pawnshop located in the heart of the Twin Cities metro area. We are licensed and bonded by the city of Minneapolis and registered with Minnesota Secretary of State since 2002. Check out our feedback and buy with confidence.You can find contact information at the bottom of our Ebay Payment Policy tab in listing. If you have any questions or need to discuss more descriptions, special shipping arrangements, additional photos, or local pick up. 61.2 82three, 300.1Uptown Pawn dba. UptownSalesUSA makes no express or implied warranties or representations regarding the condition or suitability of the goods and to the extent allowed by law, specifically disclaims any express or implied warranties, including but not limited to any warranty of merchantability or fitness for purpose.We do not offer a warranty on any merchandise: Ebay has a Square Trade program may work. We are not a distributor for any brand. Warranties on the items that I sell may or may not be valid on a non-retail purchase. Indemnity: Buyer shall, at no expense to the Seller, indemnify, defend and hold the Seller harmless against any and all losses, damages and expense (including punitive damages, multiple damages, attorney fees and other costs of defending any action) Seller may incur as a result of any claim made against the seller by any person, including without limitation, Buyer, it's successors, assigns, representatives, agents, employees, insurers, and customers, actually or allegedly arising out of the regarding the transportation, installation or use of the equipment sold hereunder by Seller or out of any products manufactured or sold by Buyer, including, without limitation, any claim which in whole or in part actually or allegedly arises out of (a) Seller's negligent or other wrongful act or omission, (b) danger or default in any equipment sold by Seller to Buyer, (c) infringement by Seller of any patent, copyright, or trade secret relating to any equipment sold by Seller to Buyer.", "ItemID": "192813057438", "EndTime": "2019-03-04T22:41:09.000Z", "StartTime": "2019-02-02T22:41:09.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Epiphone-Les-Paul-Standard-Electric-Guitar-Ebony-w-Hard-Case-/192813057438", "ListingType": "FixedPriceItem", "Location": "Minneapolis, Minnesota", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1928130574388080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/IgsAAOSw2TVcVhcU/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/450AAOSwI9FcVheE/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/E9cAAOSw~M5cVhcq/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/fLUAAOSwQGFcVhhi/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ1MFgxMTcz/z/oTIAAOSwsDZcVhgB/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ1MFgxMTg2/z/sbQAAOSwZV1cVhfS/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ0MVgxMTg2/z/RlkAAOSw0YVcVhdG/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTMyN1gxMTAz/z/XKsAAOSw-iZcVhfq/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/uo8AAOSwqLlcVhdg/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI1N1g5NzU=/z/PRQAAOSweI1cVhe2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/S54AAOSwb15cVhif/$_57.JPG?set_id=8800005007"], "PostalCode": "55408", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "uptownsalesusa", "FeedbackRatingStar": "Red", "FeedbackScore": 3020, "PositiveFeedbackPercent": 99.5}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 275.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 275.0, "CurrencyID": "USD"}, "ListingStatus": "Active", "QuantitySold": 0, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "P28DT2H10M46S", "Title": "Epiphone Les Paul Standard Electric Guitar Ebony w/ Hard Case ", "ItemSpecifics": {"NameValueList": [{"Name": "Model", "Value": ["Les Paul Standard"]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Model Year", "Value": ["2006"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Soundboard Style", "Value": ["Flat Top"]}, {"Name": "Features", "Value": ["Volume Knob", "With Pickup", "Pickup Switch 3-Way"]}, {"Name": "Product Line", "Value": ["Epiphone Les Paul Standard"]}, {"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "Body Material", "Value": ["Maple", "Mahogany"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["940-ENLPCS", "ENSPHBCH1"]}, {"Name": "MPN", "Value": ["940ENLPCS"]}]}, "HitCount": 284, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1105760823", "StoreName": "Uptown Pawnstars"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "ProductID": {"Value": "72455198", "Type": "Reference"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "Very Good Condition, We take many detailed photos so you can make the fairest evaluation of the item's physical condition using your own skilled observation; independent of ours yet subjective, opinion. Make sure to zoom in due to some reflections can be misleading.", "QuantitySoldByPickupInStore": 0, "SKU": "75965-1 MAS AXX", "NewBestOffer": false}