{"BestOfferEnabled": false, "Description": "Orders placed by 12:30 PM CST ship the same business day! This used Fender Squier Affinity Stratocaster Electric Guitar comes in a Surf Green finish. Condition: This instrument is in good condition with minor wear including professionally repaired cracks near the neck joint. Please see pictures for details on item condition. This guitar has been carefully inspected, tested, and professionally setup. You're getting a quality instrument at a great price. This guitar has been refurbished by the best refurbishing facility in the nation. Most of the instruments they refurbish come direct from the manufacturer with minor cosmetic imperfections, which are repaired as needed. If anything major was done to the guitar, it will be noted in the listing and shown in the pictures above. As part of their process, the guitar is issued a new serial number and has a small \"used\" stamp on the back of the head stock to prevent the guitar from being sold as new. Product Details: The best value available today in electric guitar design, Squier Affinity Series guitars deliver solid sound with slick style. The Affinity Series Stratocaster combines the classic features that made the Stratocaster a rock 'n' roll favorite: sonic flexibility, authentic Fender sound, vintage style and eye-catching finishes. These are pictures of the actual product you will receive. The Affinity Series Stratocaster combines the classic features that made the Stratocaster a rock 'n' roll favorite: sonic flexibility, authentic Fender sound, vintage style and eye-catching finishes. Shipping FAST and FREE shipping! Orders placed by 12:30 PM CST ship the same day Monday through Saturday! FREE Shipping to lower 48 states Expedited shipping is available - please email for a quote In Stock Guaranteed We have the lowest order cancellation rate in the industry. We never intentionally list something on eBay that we do not have in stock at our warehouse, and as a result we cancel less than .001% of our orders per year due to being out of stock, far better than the competition. We ship orders via UPS and USPS. With our free shipping we will choose the fastest most cost efficient way to transport the package to you. If costs are close, we will ship the fastest way possible, even if it's a little more expensive for us to do so. Some orders to larger cities, or high value orders will have a signature delivery required. Service At Pixel Pro Audio, we are musicians, engineers, and artists that are passionate about the professional audio and recording industry. Based out of Appleton, Wisconsin, we specialize in gear for the musician and music professional. We know the gear we sell, and we want to use that knowledge to help you make the best choice for your needs. When you need help with your order, we have the fastest customer service times in the industry, and no wait phone support. Simply email us any time (we even answer emails on the weekend), or call us Monday - Saturday 9:30AM to 5:30PM Central Time. Free technical support from professionally trained audio engineers. More than 15 years in business Amazing customer service Industry best feedback rating. No matter where you look, you'll find high ratings for our business Fantastic bundle deals. Our bundles truly do save you cash! No joke, we give great value with our bundles. Looking at a used item? We take real photos of the used gear and guitars that we sell and provide accurate high resolution pictures, so you can see the condition of the item you're buying from us. It's a lot of work - but we want you to have the best buying experience possible. Have questions?Contact us for expert help and advice! Item SKU: U111816", "ItemID": "264133742047", "EndTime": "2019-02-11T18:47:27.000Z", "StartTime": "2019-01-12T18:47:27.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fender-Squier-Affinity-Stratocaster-Electric-Guitar-Surf-Green-U111816-/264133742047", "ListingType": "FixedPriceItem", "Location": "Appleton, Wisconsin", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2641337420478080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/4vMAAOSwn01cOjZD/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/4FIAAOSwIbtcOjZC/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/d~kAAOSwIkNcOjZD/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/6A4AAOSw0~pcOjZC/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/vRMAAOSwyBRcOjZC/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/LGIAAOSwnjZcOjZC/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/Qu4AAOSwGWJcOjZC/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/43YAAOSwr7ZcOjZC/$_1.JPG?set_id=880000500F"], "PostalCode": "54911", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "pixelproaudio", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 18219, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 174.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 174.99, "CurrencyID": "USD"}, "ListingStatus": "Active", "QuantitySold": 0, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "P6DT22H16M41S", "Title": "Fender Squier Affinity Stratocaster Electric Guitar Surf Green U111816", "ItemSpecifics": {"NameValueList": [{"Name": "MPN", "Value": ["311745096"]}, {"Name": "Brand", "Value": ["Fender"]}, {"Name": "Dexterity", "Value": ["Right-handed"]}]}, "HitCount": 336, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=12198577", "StoreName": "Pixel Pro Audio"}, "Country": "US", "ReturnPolicy": {"Refund": "Money back or replacement (buyer's choice)", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 0, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "APO/FPO", "US Protectorates", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "This instrument is in good condition with minor wear including professionally repaired cracks near the neck joint. Please see pictures for details on item condition. This guitar has been carefully inspected, tested, and professionally setup. You're getting a quality instrument at a great price. U111816", "QuantitySoldByPickupInStore": 0, "SKU": "U111816", "NewBestOffer": false}