{"BestOfferEnabled": true, "Description": "PALACE JEWELRY & LOAN Fender Squier Stratocaster 6 String Electric Guitar Red Right Hand Description: FENDER SQUIER STRATOCASTER 6-STRING ELECTRIC GUITAR RED RIGHT HANDED, HAS SOME FADING AND SCRATCHING Details Additional Condition Details for eCommerceN/A Musical Instrument Condition Rating85% - Good - Item in Good Working Order, but Has Some Visual Imperfections Instrument Appearance80% - Noticeable cosmetic scuffs, scratches, nicks that may reduce the items value. May have identifiable markings. Knobs - Tuners - Electronics - Input Jack100% - Guitar is Mint | Perfect - All original Knobs - Tuners - Electronics - Input Jack - Tremelo Arm Musical Instrument CaseNot Included Number of Strings6 STRING Country of ManufactureMade in China Body StyleNOT SPECIFED DexterityRight Handed Payment PayPal is the ONLY online payment method we accept at this time. Your PayPal account must be a Verified U.S. PayPal Account. We also recommend that you use a Confirmed Ship To Address. Shipping Your item will be shipped within 1 business day(s). After shipping your items will be delivered within 1-10 business days. Terms of Sale Tax applies in: NV About Us Family owned and operated since 1958, our company is not just bricks and mortar, computers and signs. It’s people working together to serve the customers and each other. That is our philosophy. While our company today hardly resembles our first small store on Commercial Row, our early values remain.In March of 1958, Dennis and Joan Mack started on the road to business success by purchasing a tiny gift shop with a pawn license, on East Commercial Row in Reno, Nevada, by the name of Palace Jewelry & Loan company.Soon thereafter, a merger with Royal and Madeline Goodsell, Joan’s parents, took place, forming a most compatible and enduring partnership.After over 50 years, two moves and three expansions, “The Palace” stands apart and above in individuality and vision. The location may have changed, but the philosophy remains the same. “Even with a store full of treasures, none are so valued as our customers and employees.” Things I Buy: Jewelry, Firearms, Diamonds, AUDIO EQUIPMENT, GAMES AND CONSOLES Bravo Store Systems Point-of-Sale Operating System Bravo Omni-Commerce solutions offers Brick & Mortar stores the only fully integrated eBay API that seamlessly & effortlessly combines the in-store Point-of-Sale to all eBay commerce selling activities. Click here & find out why eBay stated \"Bravo has best solved Brick & Mortars can sell on eBay\"", "ItemID": "153332226056", "EndTime": "2019-02-06T23:55:52.000Z", "StartTime": "2019-01-07T23:55:52.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fender-Squier-Stratocaster-6-String-Electric-Guitar-Red-Right-Hand-AP1055547-/153332226056", "ListingType": "FixedPriceItem", "Location": "Reno, Nevada", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1533322260568080_3.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/ODAwWDQ1MA==/z/mbkAAOSw5i5cNiaY/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/NDUwWDgwMA==/z/89sAAOSwgzBcNiaY/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDQ1MA==/z/k20AAOSwo1lcNiaY/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDQ1MA==/z/TsoAAOSw8L5cNiaZ/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDQ1MA==/z/YF8AAOSwK9ZcNiaZ/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDQ1MA==/z/RtMAAOSwaaNcNiaZ/$_1.JPG?set_id=2"], "PostalCode": "89501", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "palacejewelryandloan", "FeedbackRatingStar": "Purple", "FeedbackScore": 710, "PositiveFeedbackPercent": 97.8}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 119.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 119.0, "CurrencyID": "USD"}, "ListingStatus": "Active", "QuantitySold": 0, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "P1DT21H35M20S", "Title": "Fender Squier Stratocaster 6 String Electric Guitar Red Right Hand (AP1055547)", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "Model", "Value": ["SQUIER BULLET STRATOCASTER"]}]}, "HitCount": 109, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1387090487", "StoreName": "Palace Jewelry and Loan"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}