{"BestOfferEnabled": false, "Description": "This LTD Paramount PS-1 X-tone is in excellent condition with hardly any signs of use. All electronics work flawlessly no static, hum or noise. Neck is straight and tuners are solid! No case included Manufacturers Description: A great guitar has only one job: to inspire you to play your best, and to help you reach for new sounds that you wouldn't have achieved otherwise. With the LTD Xtone PS-1, you may approach your style of music in an entirely new direction. It's a semi-hollow guitar that can take you from a formal setting to a dingy club and still look cool the whole time. Whether you play metal, alternative rock, indie folk, or progressive fusion, everyone will be blown away by the great look, sound, and -- if you let them play it -- feel of the PS-1. Available in Black as well as Sea Foam Green and Sonic Blue finishes, the PS-1 will set you in a class by yourself with its chambered mahogany body, maple neck, and rosewood fingerboard with 22 extra-jumbo frets. It even features full binding on the body, neck, and headstock. The PS-1 includes a set of ESP Designed LH-150 pickups that sound great, and are controlled by individual volume and tone knobs so it's easy to play with versatile styles even during the same song. Specifications Specifications: CONSTRUCTION Bolt-On SCALE 24.75\" BODY Mahogany NECK Maple FINGERBOARD Rosewood FINGERBOARD RADIUS 350mm FINISH Sea Foam Green NUT WIDTH 42mm NUT TYPE Molded NECK CONTOUR Thin U FRETS/TYPE 22 XJ HARDWARE COLOR Chrome STRAP BUTTON Standard TUNERS LTD BRIDGE TOM & Tailpiece NECK PU ESP Designed LH-150N BRIDGE PU ESP Designed LH-150B ELECTRONICS Passive ELECTRONICS LAYOUT Vol/Vol/Tone/Tone/Toggle Switch CASE NOT INCLUDED Shipping Policy Available for local pickup from Green Bay, WI Ships from Green Bay, WI to: Continental U.S. $35.00 Alaska and Hawaii $50.00 SORRY, no international shipping Usually we charge a flat rate that is lower than actual shipping costs, in the event you live in a far away place shipping may be more. We'll play fair with shipping if you do too! Return Policy Due to the nature of used instruments as a general rule returns are not accepted on eBay sales. However, we at 920 Rocks/Guitar Basement, do understand sometimes a player does not mesh with their new guitar or that issues may arise that would require a return for a satisfied experience. So, we take returns on a item by item basis and chose not to be bound to the sites return policies. As the seller, we have the right to relay conditions of the sale, not a listing website. The buyer will always pay return shipping, and will not be refunded the initial shipping charges. Items that are agreed on to be returned must be returned in original, as-shipped condition with all original packaging and no signs of use. Again, buyer assumes responsibility for all return shipping costs We may ship via USPS, UPS or Fedex. We prefer to not send to PO Boxes however we understand some situations a PO Box is the only option, we will ship to PO Boxes with required signature. We will not deliver to un-manned PO Boxes", "ItemID": "273678718480", "EndTime": "2019-03-01T16:20:35.000Z", "StartTime": "2019-01-30T16:20:35.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Esp-LTD-PS-1-Xtone-Semi-Hollow-Seafoam-Green-/273678718480", "ListingType": "FixedPriceItem", "Location": "De Pere, Wisconsin", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2736787184808080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/1VsAAOSwhH1cUc45/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/mxwAAOSwH2RcUc48/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/qugAAOSwZ6VcUc4~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/7eEAAOSwjYVcUc5B/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/AJIAAOSwbKVcUc5E/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/1yYAAOSwZ2FcUc5G/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/r3gAAOSw55FcUc5J/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/bVUAAOSwf29cUc5L/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/-P0AAOSwmYxcUc5O/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/m6YAAOSw6JhcUc5R/$_57.JPG?set_id=8800005007"], "PostalCode": "54115", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "guitarbasement", "FeedbackRatingStar": "Purple", "FeedbackScore": 812, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 300.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 300.0, "CurrencyID": "USD"}, "ListingStatus": "Active", "QuantitySold": 0, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "P24DT19H12M38S", "Title": "Esp LTD PS-1 Xtone Semi-Hollow Seafoam Green", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Snow White"]}, {"Name": "Brand", "Value": ["ESP LTD"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Paramount PS-1 X-Tone"]}, {"Name": "Size", "Value": ["Full Size"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Bundle Description", "Value": ["With Dano Softbag"]}, {"Name": "Country/Region of Manufacture", "Value": ["Indonesia"]}]}, "HitCount": 13, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=242976388", "StoreName": "Guitar Basement"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Excellent Condition with hardly any signs of use", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}