{"BestOfferEnabled": false, "Description": "At top 40 guitarsour customers satisfaction is our first concern.All of out items have a 14 day return policy.If after 14 days you are not completely satisfiedwith your purchase, please return it for a full refund.... Peace be with you ... *all returned items must be in the same condition theywere at the time of sale. All original packing must be included. # Up for Sale is a 2018 Gretsch G5230T Electromatic Jet Flat Top! FT Single-Cut with Bigsby Electric Guitar! This is really cool. You are looking at a 2018 Gretsch G5230T Electromatic Jet Flat Top. This is a Single Cut Away guitar with a Bigsby Tremolo. Beautiful Firebird Red Finish. From The Web:Power, Tone, and Playability — with Classic Looks to Match! Plug the Gretsch G5230T Electromatic Jet FT into your favorite amp, crank it up — its chambered mahogany body supplies warmth, sustain, and all the full-bodied resonance you can handle. A set of Black Top Filter'Tron pickups deliver classic Gretsch humbucker tone, along with a healthy dose of single-coil-like bite. Individual pickup volume controls, along with a master tone knob and three-position pickup toggle, provide you with complete sonic control. As for playability, the G5230T's black walnut-capped mahogany neck feels great in your hand. Play just one lick and you'll get it. Complete with a Bigsby vibrato for added expressive textures, the G5230T Electromatic Jet FT is destined to become one of your favorite guitars. In its 65 year existence the Gretsch Jet has been the hallmark sound for iconic players. The all-new G5230T Electromatic® Jet™ FT Single-Cut with Bigsby® captures that essential Jet power and fidelity at an incredible price. Chambered Mahogany Bodies — Loud and Clear Classic Jet tone begins with a chambered mahogany body with maple top that produces full lows and mids with an exceptionally smooth and present high end. The result is a deep acoustic foundation that is robust, yet balanced. Black TopFilter'Tron™ Pickups – Quintessential Power and Clarity Black TopFilter'Tron pickups amplify and accentuate the Electromatic Jet FT's chambered body to produce a wide, balanced and transparent tone. Loud and punchy, this Jet sounds out with remarkable definition at any level of gain. Together, the body and pickups thunder with full, responsive lows and mids with a high end that sparkles without spikes. Total Tonal Control The Electromatic Jet FT is equipped with essential features that give you complete tonal control. The combination of individual pickup volume controls, master tone and master volume with treble bleed circuit provides intuitive global control over your pickup and tone settings.Tech Specs Body Type: Solidbody Body Shape: Jet Left-/Right-handed: Right-handed Number of Strings: 6 Body Material: Mahogany Body Finish: Gloss Color: Firebird Red Neck Material: Mahogany Neck Shape: Thin U Radius: 12\" Fingerboard Material: Black Walnut Fingerboard Inlay: Pearloid Neo-Classic Thumbnail Number of Frets: 22 Scale Length: 24.6\" Nut Width: 1.6875\" Nut Material: Synthetic Bone Bridge/Tailpiece: Anchored Adjusto-Matic with Bigsby Tremolo Tuners: Diecast Neck Pickup: Blacktop Filter'Tron Humbucker Bridge Pickup: Blacktop Filter'Tron Humbucker Controls: 2 x volume, 1 x tone, 3-way toggle pickup switch Nut Width: 1.68\" Weight: 7.50 lbs. Case is NOT Included Due to CITES Treaty for Endangered Wood (Mahogany, Rosewood) We no longer ship out of the USA. Cosmetics: Excellent Condition. Pristine. Dripping with \"Mojo\". It is used. Not perfect. Overall, a really nice guitar. Look at the pictures closely. They will tell the story. Top 40 guitars is a Veteran owned business.", "ItemID": "132938193929", "EndTime": "2019-02-11T02:05:33.000Z", "StartTime": "2019-02-04T02:05:33.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2018-Gretsch-G5230T-Electromatic-Jet-Flat-Top-Firebird-Red-Finish-NO-RESERVE-/132938193929", "ListingType": "Chinese", "Location": "Santee, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1329381939298080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NTg0WDQ3OQ==/z/QQ0AAOSwjrFb1K~G/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQwNlg5NjI=/z/d4cAAOSwu3db1LA~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU1Nlg4NzQ=/z/eFUAAOSwu3db1LDF/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ5MFg5ODA=/z/3-MAAOSwGmZb1LFR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjU5WDUxNA==/z/Uf8AAOSwH2Vb1LED/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTUxNlg4ODc=/z/KZoAAOSwctJb1LGn/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTM5M1g4Nzk=/z/JvoAAOSwpw5b1LI6/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ0MVgxMTA3/z/LC8AAOSwUVhb1LH6/$_57.JPG?set_id=8800005007"], "PostalCode": "92071", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "top40powertrio", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 13208, "PositiveFeedbackPercent": 99.7}, "BidCount": 3, "ConvertedCurrentPrice": {"Value": 51.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 51.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "s***s", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 255}, "ListingStatus": "Active", "QuantitySold": 0, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "P6DT5H36M36S", "Title": "2018 Gretsch G5230T Electromatic Jet Flat Top! Firebird Red Finish! NO RESERVE!!", "ItemSpecifics": {"NameValueList": [{"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Brand", "Value": ["Gretsch"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Color", "Value": ["Firebird Red"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["2018"]}, {"Name": "Series", "Value": ["Flat Top"]}, {"Name": "Country/Region of Manufacture", "Value": ["China"]}, {"Name": "Model", "Value": ["G5230T Electromatic Jet FT"]}]}, "HitCount": 48, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=47416021", "StoreName": "Top 40 Guitars"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 52.99, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "2018 Gretsch G5230T Electromatic Jet Flat Top Electric Guitar, Excellent Condition, See ad below for Full Description", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}