{"BestOfferEnabled": false, "Description": "Even though we've listed this item as \"used,\" it is simply an open-box unit that has been used temporarily for demonstration purposes or returned from another customer.This is an open-box deal. Please read this for product condition notes:The guitar has scratches on the front, back, and sides of the body. There is an impact mark on the tip of the headstock. It does not come with wrenches or other accessories, and does not come in its original factory box. Sweetwater is an Authorized Ibanez Dealer Sweetwater's 2-year warranty Fast, Free Shipping! Nearly every order received by 3PM Eastern ships the SAME DAY! FREE shipping to lower 48 states. Our central location reaches most states in 1-4 business days 99.95% warehouse accuracy Expedited shipping available We are proud to provide some of the fastest turnaround times on eBay. We use FedEx or UPS for most items, and USPS for smaller items. Residents of Hawaii, Alaska, and Puerto Rico should contact us for a shipping quote. Buy with confidence! Sweetwater's been selling on eBay since 2001, with 99.9% positive feedback! More than 30 years in business World-class customer service Fast, FREE shipping Free 2-year warranty on nearly every product Free tech support from audio experts Solidbody Electric Guitar with Basswood Body, Maple Neck, Pine Fingerboard, 2 Humbucking Pickups, and 1 Single-coil Pickup - Transparent Red BurstThe Ibanez GRX70 electric guitar is a shining example of value! Don't let the price fool you - this guitar is a flexible tone machine. The basswood body with quilted art grain top is gorgeous, and a trio of pickups gives you tons of tones. A standard tremolo handles divebombing and other whammy acrobatics. This axe is perfect for burgeoning rockers who want a versatile guitar for all occasions. All in all, the Ibanez GRX70 gives you a whole lotta guitar for the money!Ibanez GRX70 Electric Guitar at a Glance:Powerful pickupsSmooth-playing neckDive-bomb and wagglePowerful pickupsThree Powersound pickups grace the Ibanex GRX70 electric guitar with versatile tones. Two powerful ceramic-magnet humbucking pickups give you high output without muddiness. The middle single-coil pickup uses Alnico magnets to produce a super-clear vintage tone. The GRX70 is ready for any style you need from clean, warm ballads to in-your-face rock and beyond.Smooth-playing neckA guitar is only as playable as its neck. It's a good thing the Ibanez GRX70 has a smooth and fast-playing maple neck. This comfortable neck gives you medium-sized frets that make playing chords and notes effortless.Dive-bomb and waggleFrom huge dive-bombs to subtle waggling to strutter-like warbling, the Ibanez GRX70's FAT 6 tremolo is ready for anything you throw at it. When not in use the tremolo is solid and in tune; when in use it does your bidding to the microtone. Whether you need the trem for cool '50s-era dips or massive metal dives, the Ibanez GRX70 is ready.Ibanez GRX70 Electric Guitar Features:Basswood bodyMaple neckPine fretboard3 Powersound pickupsFAT 6 tremolo bridgePick a great-playing, affordable guitar with the Ibanez GRX70! RETURN INFORMATION We want you to be completely happy with your purchase from Sweetwater. If you are not satisfied with your product, you may return it for a refund of the purchase price within 30 days. If your purchase was eligible for Free Shipping, the shipping cost will be deducted from your credit or refund. Returns must be in the complete and original packaging with all accessories and complete documentation (Owner's Manual, warranty card, quick start guides, etc.), show no signs of wear or use, and include a Return Authorization number or be subject to a restocking fee. Some products are not returnable, including: Special orders Software Oversized or overweight items Discontinued products, closeouts, and used products Cymbals Tubes Speakers Drumsticks Guitar strings Personal items (earphones, harmonicas, mouthpieces, etc.)", "ItemID": "264168514896", "EndTime": "2019-02-27T22:44:22.000Z", "StartTime": "2019-01-28T22:44:22.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Ibanez-GIO-Series-GRX70QA-Transparent-Red-Burst-Open-Box-/264168514896", "ListingType": "FixedPriceItem", "Location": "Fort Wayne, Indiana", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2641685148968080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg5NzE=/z/Hw8AAOSwWtFcT4Ro/$_1.JPG?set_id=2"], "PostalCode": "46818", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "sweetwatersound", "FeedbackRatingStar": "RedShooting", "FeedbackScore": 275938, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 169.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 169.99, "CurrencyID": "USD"}, "ListingStatus": "Active", "QuantitySold": 0, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "P23DT1H37M10S", "Title": "Ibanez GIO Series GRX70QA - Transparent Red Burst (Open Box)", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Ibanez"]}, {"Name": "MPN", "Value": ["GRX70QATRB"]}]}, "HitCount": 78, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=36121123", "StoreName": "Sweetwater Sound"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 0, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["US Protectorates", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "Oceania", "Southeast Asia", "South America", "BM", "GL", "MX", "PM"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "SKU": "GRX70QATRBd2", "NewBestOffer": false}