{"BestOfferEnabled": true, "Description": "Ibanez AS53 Artcore Semi-HollowbodyFlat Transparent Black Ray Mullin MusicLike us on FACEBOOKThis will give you access to our daily specials.WE OPEN, Inspect, and Test All Guitars, Effects, Amplifiers, EtcOur Instruments are Tuned, Cleaned, and Cared for DailyAll Instruments are in stored in a Humidity and Temperature Controlled Room IF YOU HIT THE BUY IT NOW BUTTON, PAY FOR IT NOW. 24HR TO PAY FOR THIS TYPE OF AUCTION OR WE WILL RE-LIST THE ITEM.We have been in business for over 95 YEARS!!! BUY WITH CONFIDENCE! We will set up this guitar for you at no extra charge with the strings of your choice that we carry!Not something you can get from a big box store!Product year is based on Manufacture ship date not year of production! Ibanez AS53 Artcore Semi-HollowbodyFlat Transparent Black USED ITEM DESCRIPTIONThis guitar was recently taken in trade by a customer who owned if for approximately a month, but decided he would rather have an acoustic guitar. This guitar is essentially in new condition and relatively free of blemishes. Small scratch on the “belly” of the guitar. No fret wear. Low action, plays great. Come set up with 10’s but can bet set up with another gauge upon request. PRODUCT DESCRIPTIONGet awesome Ibanez playability for a unbelievable price with the AS53. Crafted from sapele and mahogany, this semi-hollow beauty sounds great even unplugged!Gorgeous Semi-Hollowbody Tone for an Unbelievable Price! The Ibanez AS53 Artcore semi-hollowbody electric guitar boasts a classic design in a thinline shape that's an absolute pleasure to play. The Artcore AS53's sapele body provides warm, resonant tone, with a sturdy mahogany set neck spanning 22 frets over a smooth rosewood fingerboard. A pair of ACH-ST humbuckers captures each string for a tone that'll leave your ears hungry for more. Take advantage of your volume and tone controls to shape the texture of your output. This Ibanez Artcore axe proves that you can get serious playability, attractive looks, and warm semi-hollowbody tone -- on a budget.Attractive Sapele Body The sapele top on your AS53 Artcore is easy on the eyes. Its charming linear grain pattern contrasts nicely against the dark color of each humbucker as well as the light-colored binding. Sonically, sapele yields a resonance similar to mahogany -- a nice push on the lows and mids, yet sapele brings in a little more brightness. That extra treble zing can come in handy for when you want your output to cut through the mix a little more. And with this set-neck semi-hollow tone machine, you'll never be short on sustain.Sturdy Mahogany Neck Take your fingers for a spin down this guitar's sturdy and resonant mahogany neck. The Artcore neck shape is a comfortable fit, and each of this appendage's 22 frets harnesses a comfortable action for each finger to enjoy. A smooth and buttery rosewood fingerboard welcomes each fingertip for a melodic ride that feels just as great as it sounds. If you've never shouldered a semi-hollowbody guitar before, then the slim Ibanez AS53 Artcore is a great place to start.Set of ACH-ST Humbuckers Nestled in this axe's sapele body are a set of Infinity R (H) pick ups. Each pickup is designed to capture all of the warmth, depth, and resonance of each note without any buzz, hums, or other unwanted noise. The sapele body and mahogany neck tend to yield a darker tone, so tweak your tone control to brighten things up if you're looking for a sound with more high end. The Ibanez AS53 is long on versatility -- and for the price, you really can't go wrong!Features - Artcore AS Mahogany Set-In Neck - Sapele Wood Body - Fingerboard: Bound Laurel fretboard w/White dot inlay - Medium frets - Bridge: ART-ST bridge - ART-ST Tailpiece - Neck Pickup: Infinity R (H) neck pickup (Passive/Ceramic) - Bridge Pickup: Infinity R (H) bridge pickup (Passive/Ceramic) - Strings: .010/.013/.017/.026/.036/.046 - Chrome HardwareNeck Dimensions - Scale: 628mm/24.7\" - Width at Nut 43mm - Width at Last Fret 57mm - Thickness at 1st 21mm - Thickness at 12th 24mm (at 9F) - Radius: 305mm Our in-house guitar tech has inspect, test, set up, and cleaned all of our instruments on site prior to shipping. All of our instruments are guaranteed to be fully functional upon arrival. Photos Show ARE OF THE INSTRUMENT YOU WILL RECEIVE!Shipping PolicyWE ACCEPT PAYPAL.*For an additional charge, overnight or upgraded shipping may be available to buyers in the USA. Message us for more info. Ray Mullin Music will only ship to the address provided by PayPal, and must be a PayPal confirmed address.Any item(s) purchased From Ray Mullin Music will ship with “declared value” Shipping insurance and will require a recipient signature upon delivery.We Accept PayPalWe Accept ALL MAJOR CREDIT CARDS!!***MARTIN WRENCHES SHIP WITH NO TRACKING NUMBER***", "ItemID": "223347877928", "EndTime": "2019-02-26T20:51:18.000Z", "StartTime": "2019-01-27T20:51:18.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Ibanez-as53-/223347877928", "ListingType": "FixedPriceItem", "Location": "Swansea, Massachusetts", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2233478779288080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA2M1gxNjAw/z/mi0AAOSwF7lcThL0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDYz/z/XtIAAOSwIS9cThUY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDYz/z/MaMAAOSwgrZcThir/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2M1gxNjAw/z/DwcAAOSwOmBcThLP/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2M1gxNjAw/z/vQcAAOSwjmRcThLY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2M1gxNjAw/z/0mkAAOSw93xcThLe/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2M1gxNjAw/z/BuMAAOSwi6dcThLp/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2M1gxNjAw/z/tKQAAOSwpl5cThLv/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2M1gxNjAw/z/GawAAOSwIndcThL5/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2M1gxNjAw/z/xmUAAOSw3JdcThL-/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDYz/z/1X8AAOSwZV1cThic/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDYz/z/LOsAAOSwohVcThRi/$_57.JPG?set_id=8800005007"], "PostalCode": "02777", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "raymullinmusic", "FeedbackRatingStar": "Red", "FeedbackScore": 1390, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 279.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 279.0, "CurrencyID": "USD"}, "ListingStatus": "Active", "QuantitySold": 0, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "P21DT23H43M58S", "Title": "Ibanez as53", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Ibanez"]}, {"Name": "Model", "Value": ["AS-53"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Model Year", "Value": ["2018"]}, {"Name": "Country/Region of Manufacture", "Value": ["Indonesia"]}]}, "HitCount": 24, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=6418497", "StoreName": "RAY MULLIN MUSIC"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "USED ITEM DESCRIPTIONThis guitar was recently taken in trade by a customer who owned if for approximately a month, but decided he would rather have an acoustic guitar. This guitar is essentially in new condition and relatively free of blemishes. Small scratch on the “belly” of the guitar. No fret wear. Low action, plays great. Come set up with 10’s but can bet set up with another gauge upon request.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}