{"BestOfferEnabled": false, "Description": "HAPPY NEW YEAR! Buy From The Ones You Can Trust! UP FOR AUCTION IS.... DESCRIPTION Beautiful guitar that has been well taken care of and comes in a nice gig bag! Six string Jackson with black body and neck strap. Condition is shown best in photos. There are minor scuffs on one side. Auction is strictly for items in photo and details. If you do win the item, and upon receipt, find that there is a problem, we strongly encourage you to contact us prior to letting us know through feedback. We are in a solid business, and back our products. We stand behind our items, and do process full returns and refunds if needed!! If high bidder does not comply, item will be relisted at this time. Payment must come through Paypal from a 'confirmed address'. Auction is for strictly what is pictured. If you have questions about any of our items, please do not wait until the last hours of the auction! In order to be sure to get a response from us, please give us fair chance to answer! Click on the underlined link to Check out my other items! Due to eBay's Accepted Payments Policy, Paypal is the only payment option for this listing. Payment needs to be Paypal with a CONFIRMED ADDRESS, or if pickup is agreed upon, we will discuss payment options. If high bidder does not comply by bidding terms, the item will be relisted. Payment must come within 3 days of auction end! At the point of 4 days from auction end, if contact has not been made and payment has not been received, the transaction will be cancelled and the item will be relisted. BUYER'S GUIDE INFO PAYMENT: We accept PayPal only, and MUST come from CONFIRMED address. We do offer pickup if arranged, but payment must be done prior to pickup. Shipping charges would not apply, but in state tax would apply. ALL PAYMENTS MUST COME WITHIN 3 DAYS OF AUCTION END. FEES: Illinois residents must pay sales tax. We are affiliated with a store within the city limits of Chicago, so the 10.25% sales tax applies to in state sale. Shipping costs are stated in the listing. SHIPPING: We only ship within the US. Items insured over $250 will need to be signed for. If unavailable at the time of deliver, the PO will hold the item for 7 days. If item is returned to seller, the buyer is responsible for additional cost to ship again. POLICY: All of our items are authentic. REFUNDS/RETURNS: In auction style listings, buyer sets the price, so buyer is expected to read all info about the item in the listing. CONDITIONS OF ITEMS: Condition is stated in the listing. Photos capture best we can. The auction includes only what is stated in the listing and in photo. SHIPPING Item is shipped with insurance and delivery confirmation included!! WE ONLY SHIP WITHIN THE U.S. We MUST ship to the address listed with the Paypal payment.", "ItemID": "362545339762", "EndTime": "2019-02-05T03:00:06.000Z", "StartTime": "2019-01-31T03:00:06.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2014-Jackson-RRXMG-Rhoads-X-Series-Electric-Guitar-Bundle-Gig-Bag-6-String-Black-/362545339762", "ListingType": "Chinese", "Location": "Chicago, Illinois", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/3625453397628080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NjQwWDQ4MA==/z/Oo0AAOSwrAFcMQ6q/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDgwWDY0MA==/z/2r4AAOSwlx9cMQ6W/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjQwWDQ4MA==/z/zNEAAOSw-9NcMQ8K/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDgwWDY0MA==/z/Y4oAAOSwPVFcMQ6Y/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDgwWDY0MA==/z/iM8AAOSwb15cMQ6Z/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDgwWDY0MA==/z/m4gAAOSwG6tcMQ6Z/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDgwWDY0MA==/z/qSoAAOSwPmVcMQ6a/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDgwWDY0MA==/z/CMoAAOSwfsdcMQ6b/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjQwWDQ4MA==/z/TNYAAOSwOHpcMQ8D/$_57.JPG?set_id=8800005007"], "PostalCode": "60615", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "babybotyler", "FeedbackRatingStar": "Green", "FeedbackScore": 6817, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 249.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 249.99, "CurrencyID": "USD"}, "ListingStatus": "Active", "QuantitySold": 0, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT6H31M6S", "Title": "2014 Jackson RRXMG Rhoads X Series Electric Guitar Bundle Gig Bag 6 String Black", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Black"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Brand", "Value": ["Jackson"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Model Year", "Value": ["2014"]}]}, "HitCount": 200, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=52091990", "StoreName": "THE ONES YOU CAN TRUST"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 249.99, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "TopRatedListing": true, "GlobalShipping": false, "ConditionDescription": "Beautiful guitar that has been well taken care of and comes in a nice gig bag!   Six string Jackson with black body and neck strap.  Condition is shown best in photos.  There are minor scuffs on one side.   Auction is strictly for items in photo and details.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}