{"BestOfferEnabled": false, "Description": "ITEM FOR SALE This auction is for a used Red Epiphone Bass Guitar with a hard-black RoadRunner case. In beautiful cosmetic condition! I took about an hour and a half polishing the guitar. There are some light scratches to the body. To the metal there is slight oxidation as seen in the pictures however it does not take away from the intended use. You may need to tune the guitar. It is in perfect working condition! The case does have small amounts of wear to it, however it is in very good condition with no smell or major tears. Authorized by Gibson, with the EB-0 Electric Bass, Epiphone has brought back a classic bass guitar of the early '60s. Based on the SG, this guitar-sized (30-1/2\" scale) electric bass is a great axe for anyone not quite large enough for a full-size bass. Though small and light, the Epiphone EB-0 Bass has huge sound, and full-size people can play it too. DOES NOT COME WITH ORIGINAL PACKAGING, WARRANTY, OR ANY OTHER ACCESSORIES. PAYMENT METHODS Payment must be made with Paypal and items purchased will only be shipped to the verified address on the Paypal account. If you require the item shipped to an alternate address you must add this account to your Paypal account prior to completing checkout. SHIPPING Domestic shipping and insurance for this item will be by UPS or USPS. If you need specific add-ons for your package, please message us prior to purchase (You will be responsible for additional charges). We DO NOT ship internationally. We are sorry for the inconvenience. TERMS OF SALE All items are sold as presented with no warranties implied or granted. Please read all information in the shipping portion of our policies found in both our ad listings and our store policy pages. Please ask questions. Do not assume anything. We respond to all questions as quickly as possible and to the best of our ability and knowledge. RETURNS We do the research during the listing process to ensure that what we are selling is described to the best of our ability and that the item was tested. Because of this policy, if items are returned, we will not be responsible for the shipping charges! If you bid on an item, you will be responsible for all eBay fees for the interruption of the auction process and shipping costs! CUSTOMER SERVICE You can reach us via email, however we are only available to respond Monday through Saturday, 9:00 A.M. to 6:00 P.M. EST. AUCTION DISCLAIMER WE DO NOT SHIP INTERNATIONALLY OR OUTSIDE OF THE LOWER 48 STATES. Please take this into consideration before bidding on the item for sale.", "ItemID": "143055493960", "EndTime": "2019-02-15T17:05:21.000Z", "StartTime": "2018-12-17T17:05:21.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Epiphone-EB-0-Electric-Bass-4-String-Cherry-Guitar-RoadRunner-Case-/143055493960", "ListingType": "FixedPriceItem", "Location": "Fayetteville, North Carolina", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1430554939608080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/bqYAAOSwip5cFXho/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/huEAAOSwsn9cFXhs/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/MVAAAOSw3BJcFXhw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/eocAAOSwkQhcFXhz/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Cd8AAOSwIAJcFXh2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/NnsAAOSw6IdcFXh5/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/LMwAAOSwEHhcFXh7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/3MoAAOSwjQVcFXh-/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/E5cAAOSw9~RcFXiA/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/KGAAAOSw5EpcFXiE/$_57.JPG?set_id=8800005007"], "PostalCode": "28304", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "moneyquick01", "FeedbackRatingStar": "Purple", "FeedbackScore": 612, "PositiveFeedbackPercent": 99.4}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 199.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 199.99, "CurrencyID": "USD"}, "ListingStatus": "Active", "QuantitySold": 0, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "P10DT19H57M36S", "Title": "Epiphone EB-0 Electric Bass 4-String Cherry Guitar with RoadRunner Case", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Red"]}, {"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "String Configuration", "Value": ["4 String"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Body Material", "Value": ["Mahogany"]}]}, "HitCount": 322, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "In beautiful cosmetic condition! I took about an hour and a half polishing the guitar. There are some light scratches to the body. To the metal there is slight oxidation as seen in the pictures however it does not take away from the intended use. You may need to tune the guitar. It is in perfect working condition! The case does have small amounts of wear to it, however it is in very good condition with no smell or major tears.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}