{"BestOfferEnabled": false, "Description": "At top 40 guitarsour customers satisfaction is our first concern.All of out items have a 14 day return policy.If after 14 days you are not completely satisfiedwith your purchase, please return it for a full refund....Peace be with you... *all returned items must be in the same condition theywere at the time of sale. All original packing must be included. # Up for Sale is a2017 Fender Duo Sonic! Offset Short-Scale Electric Guitar! Made In Mexico! This is really cool. You are looking at a 2017 Fender Duo Sonic. This is a Offset Short-Scale Electric Guitar, based on the original models from the 1956. 24\" Scale with Single Coil Pickups. Popular with Alternative and Indie Players. Awesome Playing and Sounding Guitar in MINT CONDITION! From The Web: Beginning in 1956, the Fender Duo-Sonic solidbody electric guitar has been the choice of adventurous musicians that dig Fender style but want something a little different than a Tele or a Strat. The Duo-Sonic's unique voice is due to its 24\" scale length, which makes it playable and unique in tone. The Duo-Sonic also has that slinky feel — extended chords are easier to finger, and you can pull off multistep bends easily. A pair of single-coil pickups delivers sweet, glassy Fender tone, with sound shaping provided by a 3-way pickup selector and master volume and tone controls. And with the new pau ferro fingerboard used by Stevie Ray Vaughan during his career, you can experience that beautifully rich, thick tone and playability that this unique wood offers.Shorter scale good for new players and seasoned alike The Duo-Sonic has long been a favorite among beginners and players with smaller hands, thanks to its shorter 24\" scale length. Easier chording isn't all that the shorter scale has to offer — it lends a slinky feel to this guitar and makes it easier to pull off big string bends.This neck feels like home With a \"C\" profile and 9.5\" fretboard radius, the Fender Duo-Sonic will feel familiar to any Fender fan. One thing we really dig at Sweetwater is that the neck is finished in satin polyurethane, as opposed to the glossy polyurethane on the body. The satin finish feels fast and smooth in your hand, delivering a broken-in feel from day one.Tech Specs Body Type: Solidbody Body Shape: Duo-Sonic Left-/Right-handed: Right-handed Number of Strings: 6 Body Material: Alder Body Finish: Gloss Polyester Color: Surf Green Neck Material: Maple Neck Shape: C profile Radius: 9.5\" Fingerboard Material: Pau Ferro Fingerboard Inlay: White dots Number of Frets: 22, Medium Jumbo Scale Length: 24\" Nut Width: 1.650\" Nut Material: Synthetic Bone Bridge/Tailpiece: 6-Saddle string thru strat hardtail with bent steel saddles Tuners: Standard cast/sealed Neck Pickup: Duo-Sonic Single-coil Bridge Pickup: Duo-Sonic Single-coil Controls: 1 x master volume, 1 x master tone, 3-way toggle pickup switch Our luthier did a complete setup. Brand new strings were installed. Gig ready on Arrival! Nut Width: 1.65\" Weight: 7.15 lbs. Case is NOT Included Cosmetics: Excellent Condition. You have to look really hard to find any flaws. I cannot find any! I'm sure that if you break out a magnifying glass there is some small scratch I may have overlooked. If you are the personality type that picks everything apart, keep looking, just buy something brand new. Somehow you will not be satisfied. For everyone else, you'll love this guitar. Pristine. Neck, Fretboard and Headstock in great shape. Dripping with \"Mojo\" It is used. Not perfect. Look at the pictures closely. They will tell the story. We are here to help! Top 40 guitars is a Veteran owned business.", "ItemID": "143113199285", "EndTime": "2019-02-11T02:05:32.000Z", "StartTime": "2019-02-04T02:05:32.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2017-Fender-Duo-Sonic-Offset-Short-Scale-Surf-Green-Finish-WOW-NO-RESERVE-/143113199285", "ListingType": "Chinese", "Location": "Santee, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1431131992858080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTM4NFg5ODQ=/z/SuEAAOSwrXdasYEk/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/x~0AAOSwHF1cNlQH/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/9MwAAOSwpzVasX4t/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQzN1g3NTY=/z/ZwwAAOSwowBbYhga/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/-AYAAOSw2PtasYGN/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/d8IAAOSwQVpasXsn/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTUyMFg4NzQ=/z/HVIAAOSwrLRasX4C/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTMxOFg5MDE=/z/gjwAAOSwJCxbc0KT/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/RdEAAOSwbS1bc0Jh/$_57.JPG?set_id=8800005007"], "PostalCode": "92071", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "top40powertrio", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 13207, "PositiveFeedbackPercent": 99.7}, "BidCount": 4, "ConvertedCurrentPrice": {"Value": 124.5, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 124.5, "CurrencyID": "USD"}, "HighBidder": {"UserID": "2***1", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 28}, "ListingStatus": "Active", "QuantitySold": 0, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "P6DT7H18M25S", "Title": "2017 Fender Duo Sonic Offset Short-Scale! Surf Green Finish! WOW! NO RESERVE!!!!", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Surf Green"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Duo Sonic"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Country/Region of Manufacture", "Value": ["Mexico"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Model Year", "Value": ["2017"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Brand", "Value": ["Fender"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}, {"Name": "Body Type", "Value": ["Solid"]}]}, "HitCount": 38, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=47416021", "StoreName": "Top 40 Guitars"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 127.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "2017 Fender Duo Sonic Offset Short-Scale Electric Guitar, Excellent Condition, See ad below for Full Description", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}