{"BestOfferEnabled": false, "Description": "Home Guitars Percussion Accessories Jackson JS32 KE Electric Guitar Snow White Rsewood Fingerboard MC Snow White Rosewood Fingerboard item# J27927004001001 *MINT CONDITION* Swift, deadly and affordable, Jackson JS Series guitars take an epic leap forward, making it easier than ever to get classic Jackson tone, looks and playability without breaking the bank. Upgraded features such as striking aesthetics, new high-output ceramic-magnet pickups, graphite-reinforced maple necks, bound fingerboards and headstocks, and black hardware deliver more for less.The electrifying JS32 Kelly has a basswood body, bolt-on maple speed neck with graphite reinforcement, compound-radius (12-16) bound rosewood fingerboard with 24 jumbo frets and pearloid sharkfin inlays, and bound headstock. Other features include dual high-output Jackson humbucking pickups with ceramic magnets and three-way toggle switching, Jackson-branded double-locking tremolo bridge, black hardware and die-cast tuners. Mint Condition This instrument or product has been carefully played/used and returned to us in virtually new condition; however its packaging may not meet the standards set by the factory. Also, it no longer carries the manufacturer's warranty. If you're looking for a virtually new instrument in possibly less-than-perfect packaging, this is a great value. We feel so strongly that you'll like what you see, we're including our 30-Day Satisfaction Guarantee to this used product, making it a no-risk purchase. Shipping Orders are generally shipped the following business day after payment is received. For example, if your order is placed AND paid for at 1 p.m. Eastern Time on Friday, Musicians Friend will ship it on Monday. We are only shipping eBay orders via standard ground shipping at this time (3-7 business days for delivery once the item leaves our warehouse) Payment Musician's Friend only accepts payments for eBay orders through Paypal. Immediate payment is required upon selecting \"Buy It Now\". Sales Tax We are required to collect sales tax on all orders shipped to Alabama, California, Colorado, Connecticut, District of Columbia, Hawaii, Illinois, Indiana, Iowa, Kentucky, Maine, Maryland, Massachusetts, Michigan, Minnesota, Mississippi, Missouri, Nebraska, Nevada, New Jersey, New York, North Carolina, North Dakota, Oklahoma, South Carolina, South Dakota, Utah, Vermont, Washington, West Virginia, Wisconsin and Wyoming. You will be charged the state and local sales tax rate for any orders shipped to these states.Georgia, Louisiana, Rhode Island and Pennsylvania Residents: Musician’s Friend is not obligated to, and does not, collect sales tax in your state. Your purchase is subject to sales/use tax in these states unless it is specifically exempt from taxation. The purchase is not exempt merely because it is made over the Internet or by other remote means. These states require that you file a sales/use tax return at the end of the year reporting all of the purchases that were not taxed on those purchases. Retailers that do not collect sales tax in these states are obligated to provide purchasers an end-of-year summary of purchases in order to assist them in filing their tax report. Retailers that do not collect sales tax in these states may be required by law to provide the Department of Revenue with an annual report of the total amount of all of your purchases above certain thresholds. Details on how to file this return may be found at your applicable Department of Revenue website.Alabama residents: Seller has collected the simplified sellers use tax on this transaction(s) delivered into Alabama and the tax will be remitted on the customer’s behalf to the Alabama Department of Revenue. Seller’s program account number is SSU-R010136529. Store Policies If you’re not satisfied, neither are we. If for any reason you’re not completely satisfied with your purchase of a new item, simply return it in its original condition within 45 days of purchase (see exceptions below) and we’ll give you a full refund. It’s that simple. Returned items must be in original, brand-new condition, showing no signs of wear or use such as belt-buckle or pick scratches, scuffs, dings or scrapes on the instrument or collateral materials. Items must also include all original packaging, manuals, warrantees and accessories or your return may be subject to a return handling charge. Your refund will be promptly processed upon successful evaluation of your returned item from our trained category professionals in 2-3 business days. Refunds are made for product value only, excluding shipping and handling charges. If you received Free Shipping on your order, the value of the uncharged shipping cost will be deducted from your refund. Exceptions Additionally, the following items are returnable only if defective OR unopened - strings, reeds, computers, tubes, earbuds, earplugs, recorders, tin whistles, flutophones, \"world\" wind instruments, harmonicas, raw-frame speakers, drumheads, drumsticks, turntable cartridges, fog fluid, clothing/footwear, body jewelry, sheet music, cleaners, polishes and polishing cloths. Software/soundware, books, CDs, DVDs, and videos may be returned for credit only if they are in their original, sealed packaging. All returned woodwind and brass instruments incur a $10.00 sanitization fee. Returned bows are assessed a $4.00 restocking fee. Returned mouthpieces priced over $300 incur an $8.00 sanitization fee; the fee for mouthpieces under $300 is $4.00. Stringed instruments priced at $1999.00 or more, must be returned within 10 days of shipment. Should you decide to return your shipment, please follow the return steps printed on the back of your invoice and pack your return carefully to prevent damage in shipment. All returns must: 1. Include a Return Authorization Number; (Please contact us via eBay messages for an RA number) 2. Be in the original packaging complete with all collateral materials such as cases, straps, cables, care kits, certificates of authenticity, warranty cards, manuals, and any other materials that originally shipped with the instrument; 3. Be in brand-new condition, showing no signs of wear or use such as belt-buckle or pick scratches, scuffs, dings, or scrapes on the instrument or collateral materials.", "ItemID": "163420240949", "EndTime": "2019-02-06T03:21:43.000Z", "StartTime": "2018-12-08T03:21:43.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Jackson-JS32-KE-Electric-Guitar-Snow-White-Rsewood-Fingerboard-MC-/163420240949", "ListingType": "FixedPriceItem", "Location": "Kansas City, Missouri", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1634202409498080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTAwMFgxMDAw/z/digAAOSwPVFcCzjL/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAwMFgxMDAw/z/eJ0AAOSwIKNcCzjL/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAwMFgxMDAw/z/ivgAAOSwGD1cCzjL/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAwMFgxMDAw/z/tkIAAOSwAQVcCzjL/$_1.JPG?set_id=880000500F"], "PostalCode": "64161", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "musiciansfriend", "FeedbackRatingStar": "RedShooting", "FeedbackScore": 280639, "PositiveFeedbackPercent": 99.7, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 263.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 263.99, "CurrencyID": "USD"}, "ListingStatus": "Active", "QuantitySold": 0, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "P1DT1H2M", "Title": "Jackson JS32 KE Electric Guitar Snow White Rsewood Fingerboard MC", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Jackson"]}, {"Name": "MPN", "Value": ["USED004001 2910133576"]}, {"Name": "Size", "Value": ["Rosewood Fingerboard"]}]}, "HitCount": 97, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=991703219", "StoreName": "Musician&#39;s Friend"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalRefund": "MoneyBack", "InternationalReturnsWithin": "30 Days", "InternationalReturnsAccepted": "ReturnsAccepted", "InternationalShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "APO/FPO", "US Protectorates", "Central America and Caribbean", "South America", "BM", "GL", "PM", "DZ", "AO", "BJ", "BW", "BF", "BI", "CM", "CV", "CF", "TD", "KM", "CD", "CG", "CI", "DJ", "EG", "GQ", "ER", "ET", "GA", "GM", "GH", "GN", "GW", "KE", "LS", "LR", "LY", "MG", "MW", "ML", "MR", "MU", "YT", "MA", "MZ", "NA", "NE", "NG", "RE", "RW", "SH", "SN", "SC", "SL", "SO", "SZ", "TZ", "TG", "TN", "UG", "EH", "ZM", "ZW", "BH", "IQ", "JO", "KW", "LB", "OM", "QA", "SA", "TR", "AE", "YE", "AF", "AM", "AZ", "BD", "BT", "GE", "IN", "KZ", "KG", "MV", "MN", "NP", "PK", "LK", "TJ", "TM", "UZ", "AS", "CK", "FJ", "PF", "GU", "KI", "MH", "FM", "NR", "NC", "NU", "PW", "PG", "SB", "TO", "TV", "VU", "WF", "WS", "AL", "AD", "AT", "BY", "BE", "BA", "BG", "HR", "CY", "CZ", "DK", "EE", "FI", "FR", "DE", "GI", "GR", "GG", "HU", "IS", "IE", "IT", "JE", "LV", "LI", "LT", "LU", "MK", "MT", "MD", "MC", "ME", "NL", "NO", "PL", "PT", "RO", "SM", "RS", "SK", "SI", "ES", "SJ", "SE", "CH", "UA", "GB", "VA", "BN", "KH", "LA", "MO", "MY", "VN"], "GlobalShipping": false, "ConditionDescription": "Mint Condition - This instrument or product has been carefully played/used and returned to us in virtually new condition; however its packaging may not meet the standards set by the factory. Also, it no longer carries the manufacturer's warranty. If you're looking for a virtually new instrument in possibly less-than-perfect packaging, this is a great value. We feel so strongly that you'll like what you see, we're including our 30-Day Satisfaction Guarantee to this used product, making it a no-risk purchase.", "QuantitySoldByPickupInStore": 0, "SKU": "J27927004001001", "NewBestOffer": false}