{"BestOfferEnabled": false, "Description": "Orders placed by 12:30 PM CST ship the same business day! This used SAMICK CD2 CONCORD Double Cutaway Electric Guitar comes in a Metallic Black finish. Condition:This used instrument is in very good condition with minor wear. Please see pictures for details on item condition. Product Details:The CD2 CONCORD has a combination of a fixed bridge and arch top body, which provide an incredibly rigid platform for the string. This results in an exceptionally strong string attack and great sustain. The set neck makes for strong neck to body contact, which also improves the string’s performance. The compact headstock prevents string energy from being absorbed and compromising performance. The long top horn, which shifts the weight to the back of the guitar, combined with the lightweight headstock, make the Concord a really comfortable guitar on stage. The Duncan Designed pickups insure a wide range of professional tone and deliver all the inherent sting power offered in the Concord. The black multi-ply reverse binding gives it an edgy, unique look. The High Tech Quilt top guitars always have a black back. This little touch gives the guitar a much harder look. Double cutaway, sculpted body Bound, arched top Bound, mahogany set neck Rosewood fingerboard Grover tuners Stop tailpiece Adjustable bridge HH Duncan Design pickups These are pictures of the actual product you will receive. The CD2 CONCORD has a combination of a fixed bridge and arch top body, which provide an incredibly rigid platform for the string. Shipping FAST and FREE shipping! Orders placed by 12:30 PM CST ship the same day Monday through Saturday! FREE Shipping to lower 48 states Expedited shipping is available - please email for a quote In Stock Guaranteed We have the lowest order cancellation rate in the industry. We never intentionally list something on eBay that we do not have in stock at our warehouse, and as a result we cancel less than .001% of our orders per year due to being out of stock, far better than the competition. We ship orders via UPS and USPS. With our free shipping we will choose the fastest most cost efficient way to transport the package to you. If costs are close, we will ship the fastest way possible, even if it's a little more expensive for us to do so. Some orders to larger cities, or high value orders will have a signature delivery required. Service At Pixel Pro Audio, we are musicians, engineers, and artists that are passionate about the professional audio and recording industry. Based out of Appleton, Wisconsin, we specialize in gear for the musician and music professional. We know the gear we sell, and we want to use that knowledge to help you make the best choice for your needs. When you need help with your order, we have the fastest customer service times in the industry, and no wait phone support. Simply email us any time (we even answer emails on the weekend), or call us Monday - Saturday 9:30AM to 5:30PM Central Time. Free technical support from professionally trained audio engineers. More than 15 years in business Amazing customer service Industry best feedback rating. No matter where you look, you'll find high ratings for our business Fantastic bundle deals. Our bundles truly do save you cash! No joke, we give great value with our bundles. Looking at a used item? We take real photos of the used gear and guitars that we sell and provide accurate high resolution pictures, so you can see the condition of the item you're buying from us. It's a lot of work - but we want you to have the best buying experience possible. Have questions?Contact us for expert help and advice! Item SKU: U100251", "ItemID": "264115116462", "EndTime": "2019-03-03T16:41:59.000Z", "StartTime": "2019-01-02T16:41:59.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/SAMICK-CD2-CONCORD-Double-Cutaway-Electric-Guitar-Metallic-Black-U100251-/264115116462", "ListingType": "FixedPriceItem", "Location": "Appleton, Wisconsin", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2641151164628080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/PwcAAOSwpppcLOnc/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/S34AAOSwa55cLOna/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/gfoAAOSwnKFcLOnc/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/GP4AAOSw-sVcLOnc/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/vD8AAOSwfTlcLOnc/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/gJgAAOSwh7tcLOnc/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/I0kAAOSwoylcLOnc/$_1.JPG?set_id=880000500F"], "PostalCode": "54911", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "pixelproaudio", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 18219, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 195.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 195.0, "CurrencyID": "USD"}, "ListingStatus": "Active", "QuantitySold": 0, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "P26DT19H34M23S", "Title": "SAMICK CD2 CONCORD Double Cutaway Electric Guitar Metallic Black U100251", "ItemSpecifics": {"NameValueList": [{"Name": "MPN", "Value": ["CD2"]}, {"Name": "Brand", "Value": ["Samick"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}]}, "HitCount": 286, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=12198577", "StoreName": "Pixel Pro Audio"}, "Country": "US", "ReturnPolicy": {"Refund": "Money back or replacement (buyer's choice)", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 0, "ConditionID": 3000, "ConditionDisplayName": "Used", "DiscountPriceInfo": {"OriginalRetailPrice": {"Value": 299.99, "CurrencyID": "USD"}, "PricingTreatment": "STP", "SoldOneBay": true, "SoldOffeBay": false}, "ExcludeShipToLocation": ["Alaska/Hawaii", "APO/FPO", "US Protectorates", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "This guitar is in very good condition with minor wear, has been fully tested, and works great. Please see pictures for details on item condition. U100251", "QuantitySoldByPickupInStore": 0, "SKU": "U100251", "NewBestOffer": false}