{"BestOfferEnabled": false, "Description": "The Seymour Duncan Pearly Gates pickup shown in the pics has been removed. The guitar has only the neck pickup. Killer Ibanez model, very similar to the Ovation Ultra GP. In very good condition with a couple of finish dings on the front and the usual scuffs and swirls on the back, with some light oxidation on the bridge. There is some finish checking on the front, mainly just two long striations on either side. Heavy guitar, weighing in just under 10 lbs. Most of the other stuff you see in the pics, is German Shepard hair. It's everywhere! No bridge pickup, but the original wiring is still attached to the switch and pots, for easy connection of a replacement without worrying about all the push/pull connections. The DN is a solid rock n' roll powerhouse. It features a new design and sound unlike any other Ibanez guitar. The new Tight-Tune Bridge is sturdy and resonant, and the new tailpiece is equipped with the Ball-End Stopper. The new humbuckers have a quick response with rich harmonics, and the new single coils are fat and powerful when compared with traditional single coils. Features Tight-Tune Bridge/Tailpiece - Solid as a rock, the Tight-Tune bridge and tailpiece were designed to lock down securely and prevent any kind of wobble or movement. Each saddle is locked into the base plate, and the bridge is anchored by stud bolts into the body of the guitar. Furthermore, the studs are also locked onto the base plate so that the maximum vibration from the string is transferred to the body. New PP1 Pickups - The tube pole-piece construction of the new pickups designed for the Ibanez Darkstone offers quick response, sparkling clarity and added harmonics for a humbucker sound. Neck Joint & Body Material - The density of the body and set-in neck (both made of Sapele) gives a solid, rich and resonant heavy tone. Escutcheon - The original pickup mounting ring, specially designed for the Darkstone, keeps the pickup parallel to the strings at all times. Unlike the usual mounting rings, this one enables the pickups to catch equal vibrations from each string and avoid tone loss. Specifications Neck Type: DN Sapele set-in neck Body: Sapele body Fret: Medium frets Bridge: Tight-Tune bridge Tailpiece: Tight-Tune tailpiece Neck Pickup: PP1-N (H) neck pu Bridge Pickup: Seymour Duncan Pearly Gates Hardware Colour: Cosmo Black Neck Dimension: Scale: 628mm/24.75\" Width at Nut: 43mm Width at Last Fret: 57mm Thickness at 1st: 20mm Thickness at 12th: 22.5mm Radius: 305mmR It's setup decent now, but will likely need adjusted to your preference after shipping. Ask questions before bidding, I'm always happy to take more photos if there's anything specific you want to see. My photography skills really suck and my camera isn't much better, but I'll do what I can. This is a used guitar, and I am not a luthier. There may be issues with this instrument that I do not have the skill to identify or even be aware of. Each of my listings is described to the best of my ability, and if you have any questions that I did not address in the listing or photos, please ask before bidding. Thanks! All reasonable offers considered. I generally ship the next business day after receiving payment, but there will be exceptions. This is listed locally and in other places online, so this listing will be closed if it sells elsewhere. If you want to negotiate, I can remove pickups, tuners, electronics, w/e it takes to get it into your price range, just message me with your offer. Look carefully at all pics and ask questions before you bid.", "ItemID": "183554879086", "EndTime": "2019-02-24T04:32:03.000Z", "StartTime": "2018-11-26T04:32:03.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/IBANEZ-DN500K-BK-Electric-Guitar-/183554879086", "ListingType": "FixedPriceItem", "Location": "Xenia, Ohio", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1835548790868080_2.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNTk5/z/61oAAOSw55FcNL2Z/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNTk5/z/iQsAAOSwjolcNL2X/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNTk5/z/48YAAOSwEvZcNL2c/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNTk5/z/fHIAAOSw5bxcNL3F/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/2pQAAOSwO7dcNL3I/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/UVkAAOSw1jpb-3br/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNTk5/z/9AgAAOSwHOZb-3bR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNTk5/z/FysAAOSwkvtb-3bW/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNTk5/z/wsUAAOSwe~lb-3bY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/h9QAAOSwtFxb-3h1/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNTk5/z/b8cAAOSwDsZcNL2e/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNTk5/z/QzAAAOSw3BJcNL2g/$_57.JPG?set_id=8800005007"], "PostalCode": "45385", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "chazmack", "FeedbackRatingStar": "Purple", "FeedbackScore": 846, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 225.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 225.0, "CurrencyID": "USD"}, "ListingStatus": "Active", "QuantitySold": 0, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "P19DT8H2M18S", "Title": "IBANEZ DN500K BK Electric Guitar ", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["IBANEZ"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}]}, "HitCount": 301, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Very good condition, minor finish wear.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}