{"BestOfferEnabled": false, "Description": "Cville Thank you for visiting our ebay store. We are the newest store in our family. We have 22 Years Experience and Exceptional Feedback we will do EVERYTHING to make this a Great Experience Return Policy Fast Cash and Pawn offers a 7 day return policy from the time you receive your item. Before you send any item back, you must call/email to get an RMA number. NO REFUNDS will be made without an RMA number. Make sure your RMA number is CLEARLY visible on the outside of your package. A refund will be given minus shipping. All merchandise must be returned in original condition along with all papers and parts. NO refunds will be given if item has been altered. If you receive an item that has been damaged in the mail, please contact us AND the shipping provider immediately. No refunds will be accepted after 7 days period. ShippingWe ship in theCONTINENTAL UNITED STATES ONLY. THIS MEANS THE LOWER 48 STATES AND DOESN’T INCLUDE ALASKA,HAWAII OR PUERTO RICO. 843hls04124159gc NO INTERNATIONAL SHIPPING /US SHIPPING ONLYGreg Bennett Design Malibu Blue Electric Guitar Need a new guitar?Well we got the solutionGood conditionthere are scartches has wear from use, (Please see the pictures)has been tested and does work properlyPlease feel free to contact us with any Questions!!Thank You Fast Cash and Pawn CarpentersvilleCheckout: After the auction has ended please click the checkout button to proceed with your payment. Payments: Payments must be received within 5 days or we will file a non paying bidder report and the item will be relisted. Please note, if you enter the wrong billing address your card will be declined. Taxes: 8% Sales Tax to Illinois buyers. All Emails and Invoices will be sent to your registered eBay Email Address. If you are not receiving our emails please check your email spam filters.We Ship to the US ONLY! Contact us on ALASKA, HAWAII, APO/FPO Shipping. These will cost more. We Ship to confirmed Paypal and Billing addresses Only! Shipping Carriers: UPS & USPS 1-5 Day Local Pickups: We offer local pickups We offer a 7 Day Money Back Guarantee unless noted “As Is”Fast Cash and Pawn offers a 7 day return policy from the time you receive your item. Before you send any item back, you must call/email to get an RMA numberWe do our very best to accurately describe our items, however If you have any problems please contact us within 7 days of delivery. Operating Hours: M-F 9:00am – 6:00PM Central Standard TimeIs there a Buyitnow? We do not offer Buy it nows for auction items Will you ship to this country or this country? We ship to the US only. What is the history of the item? Most of our items are used and we do not know the history. We test them and picture their current condition. What’s Included? If it’s pictured it’s included. Please also read the details of the ad. Method of PaymentIf you have any questions, please email through ebay. Payment MUST be received within 7 DAYS from time auction ends. If payment is not received we will relist the item and proceed with non-paying bidder action that eBay advocates. We answer e-mail once a day around 3pm. Mon-Fri. If you send us an email later in the day, it may not be answered until the next day. If you have a timely question, please contact us. Bid with confidence! Your satisfaction is our goal. Please contact us if you have any problems. We will do everything we can to make your purchase a pleasant one. We ship with delivery confirmation included). For any payment questions please email us We will ship merchandise quickly after receiving payment, upon shipping the item to you we will email a tracking number to you. Merchandise will be packaged securely.", "ItemID": "173768610662", "EndTime": "2019-02-05T21:50:41.000Z", "StartTime": "2019-01-29T21:50:41.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Greg-Bennett-Design-Malibu-Blue-Electric-Guitar-/173768610662", "ListingType": "Chinese", "Location": "Carpentersville, Illinois", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1737686106628080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTU4Nlg2OTg=/z/KZwAAOSwGPNcECGv/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU4NlgxMDQx/z/eLQAAOSw8BdcECJG/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Ko8AAOSwenJcECIC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/FX8AAOSwM5tcECFy/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/2tsAAOSw6iZcECJV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/zmgAAOSwiwZcECJl/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/8gQAAOSw5EpcECJu/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/GBoAAOSwiJZcECJ4/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/k88AAOSwvENcECOU/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Kl0AAOSwSudcECOe/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/AecAAOSwjBhcECOv/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/5-AAAOSwMg5cECG2/$_57.JPG?set_id=8800005007"], "PostalCode": "60110", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "fastcashcarpentersville", "FeedbackRatingStar": "Purple", "FeedbackScore": 786, "PositiveFeedbackPercent": 99.4}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 125.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 125.0, "CurrencyID": "USD"}, "ListingStatus": "Active", "QuantitySold": 0, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT19H30M24S", "Title": "Greg Bennett Design Malibu Blue Electric Guitar ", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Blue"]}]}, "HitCount": 11, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1494047986", "StoreName": "fastcashcarpentersville"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 125.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "PO Box"], "GlobalShipping": false, "ConditionDescription": "Good condition, there are scartches, has wear from use, (Please see the pictures), has been tested and does work properly", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}