{"BestOfferEnabled": false, "Description": "Our eBay Store About Us Epiphone Les Paul Concert Acoustic/Electric Ukulele (Vintage Sunburst) The ukulele has long been a favorite instrument of guitar players and singers alike, whether its traditional Hawaiian musicians or rockers like Tom Petty, Eddie Vedder and George Harrison. Long known for its history of making great Les Paul guitars, Epiphone expands upon that knowledge and experience with the Les Paul Acoustic/Electric Ukulele Outfit. Like a traditional Les Paul Standard, the Epiphone Les Paul Ukulele features a solid mahogany body combined with a AAA grade flame maple top for great tone and great looks. The mahogany neck features a comfortable “D”-profile shape and is bolted onto the body with four-recessed screws for rock-solid stability. The rosewood fingerboard features a concert length 15\" scale with 19 silver nickel frets and a 16\" fingerboard radius.Unplugged, this Les Paul Uke has great natural acoustic tone and volume. But plug it in and it really comes alive. Equipped with a high-quality, piezo film pickup located under the saddle, both the natural tone of the strings as well as the sound of and the body are accurately captured and routed to its durable all-metal, rim-mounted 1/4\" output jack. Plug it into a PA System or amplifier and it sounds great! And loud too! For accurate tuning stability, the Epiphone Les Paul Ukulele features 14:1 geared machine heads. Unlike traditional \"friction\" tuners, these tuners have fine-tuning capability and wont slip. The Epiphone Les Paul Ukulele even comes with premium black nylon strings as well as a gigbag with accessory pocket for easy and safe transportation. Top it all off with a classic LP pickguard that not only looks cool but protects the beautiful flame Maple top as well and youve got a real Les Paul ukulele at an affordable price. Features:Body: MahoganyTop: Laminated AAA Flame mapleNeck: MahoganyNeck Shape: SlimTaper “D” ProfileScale: 15”Neck Joint: Bolt-on 4-bolt recessedFingerboard: RosewoodFrets: 19Binding: 1-layer body, frontNut Width: 1-5/16”Hardware: NickelMachine Heads: Open, 14:1 RadioBridge Pickup: Under-Saddle, Piezo FilmControls: PassiveBridge: Rosewood with PVC SaddleCase: Gig Bag includedGet your Epiphone Les Paul Concert Acoustic/Electric Ukulele from Sam Ash direct today with the security of our 45/60 day return/price protection policy. Product Details - Traditional Les Paul Standard shape featuring a solid Mahogany body combined with a AAA flame maple top - Mahogany neck features a concert length 15\" scale and bolt-on construction - Rosewood fingerboard features 21 nickel/silver frets with a 16\" fingerboard radius - Piezo film pickup located under the saddle, rim-mounted 1/4\" output jack Shipping Information Your gear will ship out within 2 days of order confirmation. At this time we can not ship PO Boxes, APO and FPO locations. Industry Leading 45-Day Return Policy We stand by the products we sell, and we'll certainly stand by you as well! We truly appreciate your business, and we want you to be 100% happy with your purchase. However, we know that one of the drawbacks of internet shopping is that you can't try something before you buy it. That's where our money-back guarantee comes in. If you are not completely satisfied with an item, for any reason, you can return it within 45 days of the shipping date for a complete refund of the merchandise price.* Due to the complexity of international shipping, we are unable to accept any returns on international orders. Before making a purchase outside of the United States, please know that products sold by Sam Ash use the standard 120V/60Hz voltage standard. Sam Ash is not responsible for any damage caused by not adhering to the voltage requirements. *All returns must be within 45 days of the date the item was shipped. Please do not accept any shipment if the packaging appears damaged in any way. We strongly suggest that you check your order after receiving it to be sure that it is in proper working order. Returned items must be in resalable condition. Resalable Condition means that the product(s) is exactly in the same condition as you received it. All exchanges must be pre-paid, returned in original packing, complete with blank warranty cards, owner's manual and show no sign of wear or abuse. In the event that the product is not in the same condition as you received it you may be subject to a minimum 15% restocking fee, repair charge or disqualification. Shipping and handling charges are non-refundable. Please call our Customer Service department if you have any questions about returning an item. CDs, DVDs, video tapes, sheet music, books, strings, computer hardware/software, drum heads, harmonicas, mouthpieces, sound cards, microphones, raw speakers, studio furniture, blank CDs/Tapes or Special Orders are not covered by this return policy.", "ItemID": "183668069862", "EndTime": "2019-02-06T15:48:41.000Z", "StartTime": "2019-02-03T15:48:41.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Epiphone-Les-Paul-Ukulele-Vintage-Sunburst-Used-/183668069862", "ListingType": "FixedPriceItem", "Location": "Tampa, FL", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1836680698628080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTc0WDUwMA==/z/yi0AAOSwJTNb2jS0/$_1.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "samashdirect", "FeedbackRatingStar": "PurpleShooting", "FeedbackScore": 58833, "PositiveFeedbackPercent": 99.2, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 98.72, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 98.72, "CurrencyID": "USD"}, "ListingStatus": "Active", "QuantitySold": 0, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "P1DT13H29M7S", "Title": "Epiphone Les Paul Ukulele (Vintage Sunburst) (Used)", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "MPN", "Value": ["EULPVSNH3"]}]}, "HitCount": 9, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1111655870", "StoreName": "Sam_Ash_Music_Direct"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalRefund": "MoneyBack", "InternationalReturnsWithin": "30 Days", "InternationalReturnsAccepted": "ReturnsAccepted", "InternationalShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "DiscountPriceInfo": {"OriginalRetailPrice": {"Value": 248.0, "CurrencyID": "USD"}, "PricingTreatment": "STP", "SoldOneBay": false, "SoldOffeBay": false}, "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Central America and Caribbean", "South America", "AL", "AD", "AT", "BY", "BE", "BA", "BG", "HR", "CY", "CZ", "DK", "EE", "FI", "FR", "DE", "GI", "GR", "GG", "HU", "IS", "IE", "IT", "JE", "LV", "LI", "LT", "LU", "MK", "MT", "MD", "MC", "ME", "NL", "NO", "PL", "PT", "RO", "SM", "RS", "SI", "ES", "SJ", "SE", "CH", "UA", "VA", "BN", "KH", "HK", "LA", "MO", "MY", "PH", "SG", "TW", "VN", "BM", "GL", "PM", "DZ", "AO", "BJ", "BW", "BF", "BI", "CM", "CV", "CF", "TD", "KM", "CD", "CG", "CI", "DJ", "EG", "GQ", "ER", "ET", "GA", "GM", "GH", "GN", "GW", "KE", "LS", "LR", "LY", "MG", "MW", "ML", "MR", "MU", "YT", "MA", "MZ", "NA", "NE", "NG", "RE", "RW", "SH", "SN", "SC", "SL", "SO", "SZ", "TZ", "TG", "TN", "UG", "EH", "ZM", "ZW", "BH", "IQ", "JO", "KW", "LB", "OM", "QA", "SA", "TR", "AE", "YE", "AF", "AM", "AZ", "BD", "BT", "CN", "GE", "IN", "JP", "KZ", "KG", "MV", "MN", "NP", "PK", "LK", "TJ", "TM", "UZ", "AS", "CK", "FJ", "PF", "GU", "KI", "MH", "FM", "NR", "NC", "NU", "PW", "PG", "SB", "TO", "TV", "VU", "WF", "WS", "PO Box"], "GlobalShipping": false, "ConditionDescription": "Like New", "QuantitySoldByPickupInStore": 0, "SKU": "EULPVSNH1", "NewBestOffer": false}