{"BestOfferEnabled": true, "Description": "Untested All items sold as is,Few hours home playing time on this (for real, original crap strings), 25 more guitars to be posted for sale: no reserve, most are like this- pretty much new, all have some minor flaw/ding or other- I will describe flaws. Photo shows condition. Epiphone guitar with whammy. Not sure of model- looks like SG to me. looks like walnut to me, heavy dense. Listed as project as neck joint shows unsightly glue. A-is, .99 cents start- No Reserve. You snooze, you loose. Shipped in Manufacturer's orig box, doubled inside a 2nd box. ------------- Epiphone Worn 1966 Wilshire with Tremotone Electric Guitar Like an SG guitar, the Wilshire's double-cutaway mahogany body with a glued-in mahogany neck that joins the body at the 22nd fret gives you ultimate upper fret access. Lightweight and comfortable, the Wilshire has excellent resonance and natural acoustic tone - even unplugged! Featuring Epiphone's LockTone„¢ Tune-o-matic/stopbar combination, the transfer of string vibration is improved even more giving this guitar excellent sustain and clarity. But here's what separates the Wilshire from the SG. Most early Epiphone guitars including the Wilshire were equipped with mini-humbucking pickups and Epiphone carries on this tradition. With its smaller size, narrow magnetic field and unique design combination, the mini-humbucker produces bright and focused output while retaining famous humbucker \"hum-free\" performance. A replica of the originals, they feature adjustable pole pieces, enamel wire, bar ceramic magnets and rounded nickel plated covers set in an original style black mounting ring with height adjustment screws. In 1957 Gibson purchased New York's Epiphone Guitar Company and moved production to Kalamazoo, Michigan. With plans to expand retail distribution by differentiating Epiphone dealers from Gibson dealers, Gibson began production of a new line of \"Kalamazoo-made and designed\" Epiphones in 1959. For over a decade, Epiphone solid body guitars and basses were produced right alongside Gibsons. These Epiphone guitars represented some of the highest quality and best sounding instruments of their generation. They provided unique shapes, pickup arrangements, and tonal signatures not seen on comparable Gibson models of the day. Under appreciated at the time of their release, numerous artists through the years have recognized the unique appeal of these guitars. Jimi Hendrix, Johnny Winter, Paul Gilbert and Steve Marriot are but a few of the artists that have embraced the tone and build quality of these Kalamazoo built Epiphones. One such Epiphone instrument was the Wilshire. Now with IMPROVED Tremotone! There's been a lot of tremolos developed over the years but few as unique and distinctive as Epiphone Tremotone with it's Rosewood insert and metal \"E\" insignia. Introduced in 1961, it was optional equipment on many classic Epiphone models. Epiphone engineers have taken that same, great design and improved it with a spring-loaded return system that allows for ultra-smooth operation and excellent return-to-pitch characteristics. Cool Retro-Looks! Also unique, the Wilshire features Epiphone's own \"batwing\" headstock. A classic design that improves tuning ease and accuracy by offering a straight string-pull design, the headstock is adorned like the original with the vintage \"Epiphone\" logo in gold. Other features include a 1960's SlimTaper (TM) neck profile with Rosewood fingerboard, premium 14:1 die-cast tuners and individual Volume and Tone controls for each pickup. And to give it that worn-in look and feel, Epiphone tops it all off with a thin satin finish. It could last a lifetime! As with all Epiphone's, the Wilshire is backed by Epiphone's Limited Lifetime Warranty and 24/7/365 Customer Service. Only 398 original 1966 Wilshires were produced and are selling today for $10,000 or more depending upon condition. If you're not fortunate enough to own an original or can't afford that kind of cash, here's your chance to own one with the same classic 1966 Epiphone vibe and tone. Cool!FeaturesBody Material: MahoganyNeck Material: MahoganyNeck Shape: 1960's SlimTaper„¢Neck Joint: Glued-InTruss Rod: AdjustableScale Length: 24.75\"Fingerboard Material: Rosewood with mother-of-pearl Dot InlaysBridge Pickup: NYT Mini-HumbuckerNeck Pickup: NYT Mini-HumbuckerControls: Bridge Volume, Neck Volume, Bridge Tone, Neck Tone, 3-way pickup selector (toggle)Fingerboard Radius:12\"Frets: 22 medium-jumboBridge: Redesigned Tremotone„¢ SystemNut Width: 1-11/16\"Hardware: NickelMachine Heads: Premium Die-Cast, 14:1 ratioWe do not accept P.O. BOXES - PLEASE PROVIDE A PHYSICAL ADDRESS. Am human, make errors. I fix. Beep Bop. READ feedback.", "ItemID": "283359410859", "EndTime": "2019-02-06T22:32:50.000Z", "StartTime": "2019-01-30T22:32:50.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Worn-1966-Ltd-Epiphone-Wilshire-Tremotone-electric-pre-sg-guitar-project-NR-/283359410859", "ListingType": "Chinese", "Location": "Manhattan, Illinois", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2833594108598080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg3NzQ=/z/9X8AAOSwPWtcUiHC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg2MTQ=/z/opgAAOSw27lcUiHB/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTMwMlgxMjAw/z/pLMAAOSwXh9cUiG2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg4Mjc=/z/1Z4AAOSwWI5cUiG4/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDEw/z/Jy4AAOSwjoFcUiG5/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDIx/z/A7IAAOSwHphcUiG7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTUxOVgxMjAw/z/KaoAAOSwwfFcUiG8/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMTA0/z/2~sAAOSw3BJcUiG-/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDc=/z/tL8AAOSwI01cUiG~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTIyWDEyMDA=/z/ROMAAOSwrfRcUiHC/$_57.JPG?set_id=8800005007"], "PostalCode": "60442", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "diesel.army", "FeedbackRatingStar": "Red", "FeedbackScore": 1072, "PositiveFeedbackPercent": 99.5}, "BidCount": 36, "ConvertedCurrentPrice": {"Value": 220.27, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 220.27, "CurrencyID": "USD"}, "HighBidder": {"UserID": "n***i", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 448}, "ListingStatus": "Active", "QuantitySold": 0, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "P2DT3H24M28S", "Title": "Worn 1966 Ltd Epiphone Wilshire Tremotone electric pre sg  guitar project NR ", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "MPN", "Value": ["N/A"]}]}, "HitCount": 636, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 222.77, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Another of my wallhangers. Still has original strings. unsure of model", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}