{"BestOfferEnabled": false, "Description": "--> Epiphone PRO-1 Les Paul Jr Electric Guitar Pack (Alpine White) Used This item is slightly used and has been thoroughly checked out by our experts to make sure it is in perfect working condition. We then re-sealed it in its original packaging with all factory included accessories. This item is guaranteed to be in \"as new\" condition and has virtually no cosmetic imperfections. This item is covered with a one year warranty from Sam Ash. The PRO-1 Les Paul Jr. has the same profile of the legendary Les Paul and features a Mahogany body and Hard Maple Neck. The Les Paul Jr. is powered by a powerful Epiphone Ceramic 700T™ Zebra-coil humbucker with an easy to use built-in Shadow® E-Tuner on the pickup mounting ring. Your Les Paul Jr. gets in tune and stays in tune easily thanks to Epiphone’s legendary Tune-o-Matic™ bridge and the same Premium diecast18:1 ratio tuners found on all PRO-1 instruments. And, when you’re not plugged in to Rocksmith, you can plug your Les Paul Jr. into a MityPRO™ Mini-Amplifier with built-in distortion, Master Tone and Volume, a standard ¼” instrument input, an MP3 input, and a headphone output. It’s 9V battery (with optional AC/DC power) allows you to practice or perform just about anywhere. Other PRO-1 innovative features includes an EZ-PRO™ C-shaped Neck, Ultra-Light strings, plus an exclusive Built-In Shadow® E-Tuner on the bridge pickup mounting ring.With the Rocksmith free download, plus the included Real Tone cable (a $79 value), you can plug your Les Paul Jr. in to the revolutionary video experience that since 2011 has taught millions around the world to play guitar while also offering a superior sound experience with built-in digital effects through either a PC or MAC that blows away most small amps found in other packs.Rounding out this package is a Beginners Guide to Guitar by guitar and tech guru Craig Anderton, free eMedia™ On-Line Lessons, and a deluxe fitted gigbag.Get your Epiphone PRO-1 Les Paul Jr Electric Guitar Pack today at the guaranteed lowest price from Sam Ash Direct with our 45-day return and 60-day price protection policy. Shipping Information Your gear will ship out within 2 days of order confirmation. At this time we can not ship PO Boxes, APO and FPO locations. Industry Leading 45-Day Return Policy We stand by the products we sell, and we'll certainly stand by you as well! We truly appreciate your business, and we want you to be 100% happy with your purchase. However, we know that one of the drawbacks of internet shopping is that you can't try something before you buy it. That's where our money-back guarantee comes in. If you are not completely satisfied with an item, for any reason, you can return it within 45 days of the shipping date for a complete refund of the merchandise price.* Have a question about your order? A Sam Ash Customer Service specialist is available to help! Call 800-472-6274, Monday - Saturday, from 10:00AM - 6:00PM EST. Due to the complexity of international shipping, we are unable to accept any returns on international orders. Before making a purchase outside of the United States, please know that products sold by Sam Ash use the standard 120V/60Hz voltage standard. Sam Ash is not responsible for any damage caused by not adhering to the voltage requirements. *All returns must be within 45 days of the date the item was shipped. Please do not accept any shipment if the packaging appears damaged in any way. We strongly suggest that you check your order after receiving it to be sure that it is in proper working order. Returned items must be in resalable condition. Resalable Condition means that the product(s) is exactly in the same condition as you received it. All exchanges must be pre-paid, returned in original packing, complete with blank warranty cards, owner's manual and show no sign of wear or abuse. In the event that the product is not in the same condition as you received it you may be subject to a minimum 15% restocking fee, repair charge or disqualification. Shipping and handling charges are non-refundable. Please call our Customer Service department if you have any questions about returning an item. CDs, DVDs, video tapes, sheet music, books, strings, computer hardware/software, drum heads, harmonicas, mouthpieces, sound cards, microphones, raw speakers, studio furniture, blank CDs/Tapes or Special Orders are not covered by this return policy.", "ItemID": "192813717158", "EndTime": "2019-02-06T16:36:34.000Z", "StartTime": "2019-02-03T16:36:34.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Epiphone-PRO-1-Les-Paul-Jr-Electric-Guitar-Pack-Alpine-White-Used-/192813717158", "ListingType": "FixedPriceItem", "Location": "Tampa, FL", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1928137171588080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MzcwWDUwMA==/z/q-UAAOSwR0dcVxiT/$_1.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "samashdirect", "FeedbackRatingStar": "PurpleShooting", "FeedbackScore": 58833, "PositiveFeedbackPercent": 99.2, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 269.88, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 269.88, "CurrencyID": "USD"}, "ListingStatus": "Active", "QuantitySold": 0, "ShipToLocations": ["US", "CA", "GB", "SK", "AU", "KR", "ID", "TH", "IL", "MX", "NZ"], "Site": "US", "TimeLeft": "P1DT14H16M32S", "Title": "Epiphone PRO-1 Les Paul Jr Electric Guitar Pack (Alpine White) Used", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "MPN", "Value": ["PPEG-ENPLAWCH1"]}]}, "HitCount": 6, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1111655870", "StoreName": "Sam_Ash_Music_Direct"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalRefund": "MoneyBack", "InternationalReturnsWithin": "30 Days", "InternationalReturnsAccepted": "ReturnsAccepted", "InternationalShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "DiscountPriceInfo": {"OriginalRetailPrice": {"Value": 548.0, "CurrencyID": "USD"}, "PricingTreatment": "STP", "SoldOneBay": false, "SoldOffeBay": false}, "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Central America and Caribbean", "South America", "AS", "CK", "FJ", "PF", "GU", "KI", "MH", "FM", "NR", "NC", "NU", "PW", "PG", "SB", "TO", "TV", "VU", "WF", "WS", "AL", "AD", "AT", "BY", "BE", "BA", "BG", "HR", "CY", "CZ", "DK", "EE", "FI", "FR", "DE", "GI", "GR", "GG", "HU", "IS", "IE", "IT", "JE", "LV", "LI", "LT", "LU", "MK", "MT", "MD", "MC", "ME", "NL", "NO", "PL", "PT", "RO", "SM", "RS", "SI", "ES", "SJ", "SE", "CH", "UA", "VA", "BN", "KH", "HK", "LA", "MO", "MY", "PH", "SG", "TW", "VN", "BM", "GL", "PM", "DZ", "AO", "BJ", "BW", "BF", "BI", "CM", "CV", "CF", "TD", "KM", "CD", "CG", "CI", "DJ", "EG", "GQ", "ER", "ET", "GA", "GM", "GH", "GN", "GW", "KE", "LS", "LR", "LY", "MG", "MW", "ML", "MR", "MU", "YT", "MA", "MZ", "NA", "NE", "NG", "RE", "RW", "SH", "SN", "SC", "SL", "SO", "SZ", "TZ", "TG", "TN", "UG", "EH", "ZM", "ZW", "BH", "IQ", "JO", "KW", "LB", "OM", "QA", "SA", "TR", "AE", "YE", "AF", "AM", "AZ", "BD", "BT", "CN", "GE", "IN", "JP", "KZ", "KG", "MV", "MN", "NP", "PK", "LK", "TJ", "TM", "UZ", "PO Box"], "GlobalShipping": true, "ConditionDescription": "Like New", "QuantitySoldByPickupInStore": 0, "SKU": "EPPENPLAW", "NewBestOffer": false}