{"BestOfferEnabled": false, "Description": "PLEASE FULLY READ Description & My Policy Killian Beer Logo Guitar Styled like a strat by California guitar co. has 2 Killian Beer logos affixed to Guitar - was displayed in a bar establishment - It plays but needs tune... the string saddle needs adjusting & (one) high L in missing see my finger - needs internation - California guitar co.Ship's Mainland USA either USPS or FEDEX Ground to a live address (work or home) no APO, territories, Hi or AK Large Item Pickup in NH is OK ************************************************ MY POLICY - PLEASE READ - MI POLÍTICA - POR FAVOR LEA I am a seller of many things & these items are from my wife's or my family estate. Some are unusual & some just common. soy un vendedor de muchas cosas y estos artículos son de mi esposa o mi patrimonio familiar. Algunos son poco & algunos sólo común. ------------------------------------------------------------------------------------------------------------ There are no guarantees. All items are used & are sold \"As is\" unless noted differently in the description. You will get what is pictured. No hay garantías. Todos los elementos se utilizan y se venden \"tal como están\", a menos que se indique lo contrario en la descripción. Recibirá lo que se imagina. Por favor tengan cuidado con ----------------------------------------------------------------------------------------------------------- Please beware modern digital camera, flashes & computer monitors make photos look different from original item. modernas cámaras digitales, flashes y monitores de ordenador hacer fotos muy diferente del elemento original. ------------------------------------------------------------------------------------------------------------ Due to the item's age do not expect items to be in perfect condition and I may not describe every little scratch or spot. Debido al tema de la edad no puede esperar a estar en perfecto estado y que no se pueden describir cada pequeño arañazo o in situ. ------------------------------------------------------------------------------------------------------------- I do not claim to be an expert on every item listed & describe them to the best of my knowledge. No tengo la pretensión de ser un experto en todos los elementos que se enumeran y describen a la mejor de mi conocimiento. -------------------------------------------------------------------------------------------------------------- Do not ask me to grade items. When asking about the conditions, please be specific on what you are looking for or at and I will try to help you. No me pida que me grado elementos. Cuando se les pregunta acerca de las condiciones, por favor, ser más específico acerca de lo que usted está buscando o a y voy a tratar de ayudarle. --------------------------------------------------------------------------------------------------------------- Electrical items are considered working if the motor works, the switch turns on, it lights up, or warms up. I do not fully test these items functionality down to every little detail. Since it is used, do not expect it to work as good as a new item. Artículos eléctricos se consideran como si el motor funciona, el interruptor, se enciende, se enciende la luz, o se calienta. No estoy del todo estos elementos prueba funcionalidad a cada pequeño detalle. Puesto que se emplea, no esperaba tan buena como la de un nuevo elemento. --------------------------------------------------------------------------------------------------------------- Payment is due in 3-4 days by Paypal. However I prefer immediately after the sale. So please pre-Inquire about other methods El pago debe hacerse en un plazo de 3-4 días por Paypal. Sin embargo yo prefiero inmediatamente después de la venta. Así que, por favor, antes de preguntar acerca de otros métodos --------------------------------------------------------------------------------------------------------------- Per ebay rules, an unpaid dispute will kick in after 4 days if the payment is not made. If you are out of town on vacation please let me know. As I am NOT A MIND READER. Por ebay, la falta de pago en controversia se iniciará después de 4 días si el pago no se efectúa. Si están fuera de la ciudad de vacaciones, por favor hágamelo saber. Como no soy adivino. ----------------------------------------------------------------------------------------------------------------- Sorry I cannot do Exchanges because I am not a store with stock! Lo siento no puedo hacer intercambios porque yo no soy una tienda con stock! ----------------------------------------------------------------------------------------------------------------- PLEASE check the cost of shipping, it is not cheap! If you think the cost is too high, Then please buy the item some other place. COMPRUEBE los gastos de envío, no es barato! Si usted piensa que el precio es demasiado alto, entonces compre el tema en otro lugar ------------------------------------------------------------------------------------------------------------------ I will combine items for lower shipping costs, if the items are compatible. Cast iron items do not mix with ceramics. VOY a combinar elementos de reducción de los costes de envío, si los elementos son compatibles. Hierro fundido los elementos no se pueden mezclar con cerámica. ------------------------------------------------------------------------------------------------------------------ We ship all small to medium items w USPS 90% of the time even if it is local (sorry I am not going to sit around for a low priced item to be picked up). we might use FedEx 10% of the time for big items. Enviamos todas las pequeñas y medianas partidas w USPS 90% del tiempo, aunque si es local (lo siento, no voy a estar sentados alrededor de un tema bajo precio para ser recogidos). que podríamos utilizar FEDex (servicio de paquetes) el 10% de la hora de grandes temas. ------------------------------------------------------------------------------------------------------------------- Pickup of LARGE & Heavy items is ok but it will have to be when I am available. Recogedor de GRAN & elementos pesados es bueno pero tendrá que ser cuando estoy disponible. -------------------------------------------------------------------------------------------- Larger heavy Items are sent FedEx GROUND to LIVE address MAINLAND lower 48 states. If you are not home to accept we can also send to your work. Mayores elementos pesados se envían FedEx por tierra a vivir dirección 48 estados continentales. Si no están en casa para aceptar también podemos enviar a su trabajo. ------------------------------------------------------------------------------------------------------------------ I ship to registered Ebay/Paypal addresses only within 2 days of received payment. Note if we have a Federal MONDAY holidays which will delay shipping with USPS by another day. I buque a registrado de Ebay/Paypal sólo se aborda dentro de los primeros 2 días después de recibido el pago. Nota: si tenemos un Gobierno Federal lunes festivos que se demora el envío con USPS por otro día ------------------------------------------------------------------------------------------------------------------ I use your paypal address to produce the shipping label and calculate the shipping costs. I will not ship to any other address except your work if that is convenient and are not home to accept delivery. Remember to keep your address up to date in PAYPAL. uso tu dirección paypal para producir la etiqueta de envío y calcular los gastos de envío. YO no se envía a cualquier otra dirección excepto su trabajo si que es conveniente y no están en casa a aceptar la entrega. Recuerde que su dirección de PAYPAL en ----------------------------------------------------------------------------------------------------------------- I do not bargain on price of the items. Yo no trato de precio de los artículos. ----------------------------------------------------------------------------------------------------------------- Please TRY to message me with any questions you may have a few days prior (NOT 1 hour before items ends) Por favor, trate de mensaje con cualquier pregunta que usted pueda tener unos días antes (NO 1 hora antes de que los elementos extremos)", "ItemID": "264146329171", "EndTime": "2019-02-17T04:36:14.000Z", "StartTime": "2019-01-18T04:36:14.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Killian-Beer-Logo-Guitar-Styled-like-strat-California-guitar-co-/264146329171", "ListingType": "FixedPriceItem", "Location": "Nashua, New Hampshire", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2641463291718080_2.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/VqMAAOSwWz5cV1vy/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/OeUAAOSwmlJcV1v0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/1-QAAOSwdxVcV1v5/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/tOMAAOSwXitcV1v8/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/yzQAAOSwPatcV1v-/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/4RIAAOSwIbpcV1wB/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/-scAAOSw5vxcV1wF/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/3aYAAOSwZupcV1wI/$_57.JPG?set_id=8800005007"], "PostalCode": "03064", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "sell-more", "FeedbackRatingStar": "Green", "FeedbackScore": 6187, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 149.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 149.99, "CurrencyID": "USD"}, "ListingStatus": "Active", "QuantitySold": 0, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "P12DT8H5M6S", "Title": "Killian  Beer Logo Guitar Styled like a strat by California  guitar co.", "HitCount": 10, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "untested", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}