{"BestOfferEnabled": false, "Description": "Washburn SS40-B Steve Stevens Signature Series Electric Guitar Washburn SS40-B Steve Stevens Signature Series Electric Guitar Click images to enlarge Description Washburn SS40-B Steve Stevens Signature Series Electric Guitar (Please scroll down to see all the pictures; pictures can be supersized by clicking on them.) Available for auction from Washburn is the Steve Stevens SS40-B electric guitar. This guitar was made in Korea from 1992 until 1996. The Washburn SS40 is one of Washburn's Steve Stevens signature models. It is a superstrat with similar specs to the US made SS-80 and SS-100 models, except with Washburn Eliminator pickups and a 600-S Floyd Rose type bridge. This guitar plays great and sounds even better and comes with a Road Runner hardshell case. Cosmetically the guitar does show some wear from age and use, see pics for more details. Also, the whammy bar, pickup selector switch and the middle locking nut are not original. Feel free to ask any questions, good luck and happy bidding. We pack carefully and ship promptly.   (See Pictures For Better Details) Pictures are of the actual item being auctioned. We never use stock photographs. PLEASE NOTE: When a FedEx shipping option is available, the auction will show an ESTIMATED shipping cost for the item via FedEx. This is automatically provided from FedEx, through Ebay, and is beyond our control. When the auction ends you will automatically receive an Ebay-generated invoice with a final shipping amount. This amount may be higher than the original estimate. Again, this is done automatically and is beyond our control.   INTERNATIONAL BIDDERS: PLEASE READ TERMS AND CONDITIONS BELOW Please contact us with any questions.   CONDITION   (See Pictures For Better Details)   AUCTION CONTENT One (1)  Washburn SS40-B Steve Stevens Signature Series Electric Guitar   TERMS AND CONDITIONS 1. GENERAL 1. All items are previously owned unless otherwise stated in the auction. 2. Rechargeable batteries -- No warranty or guarantee of any type is offered/included on used batteries. 3. DVDs and Video Games: most items are used. Digital downloads may or may not be available. We do not guarantee the validity of digital download codes. 4. Cell Phones: We are not able to verify if a particular phone will work with your service provider or in any particular foreign country. 5. Some items are sold \"as is.\" If an item is not fully functional, it may be listed as \"for parts or not working\" and sold \"as is.\" If you bid on such items this means you agree to accept the item \"as is,\" and the item will not be returned. We try to describe what we know to be wrong with such items, but at times (especially with electronic items) it is impossible to know all that may be wrong with the item. 2. CUSTOMER SERVICE 1. If you need assistance please contact us using the ebay \"Ask Seller a Question\" link. You may also call us Mon-Sat, 10:00am-4:00pm, Eastern Time-- 434-845-7296 3. PAYMENT 1. Our preferred method of payment is PayPal. 2. Payment is expected within 3 days from the end of the auction. If you can not pay within that time, please contact us for arrangements. If we are not contacted by the third day, an \"unpaid item\" case will be initiated. 3. Residents of Virginia will be charged sales tax of 5.3% as required by law. 4. SHIPPING 1. Please see the \" Shipping and payments\" tab that is in every listing for the shipping services available and cost. 2. If a shipping service is not shown to your location please contact us for an estimate. 3. When payment is made with PayPal, we will only ship to the PayPal address. This is due to the ebay buyer protection and PayPal seller protection policies. 4. FedEx and UPS cannot ship to Post Office Boxes. If you require shipping to a P O Box, choose USPS shipping and if USPS is not shown as an option, please contact us before bidding. 4.1 International 1. Duty, customs fees, tariffs, taxes, etc. - The item value used on the customs declaration form will be the amount you paid not including shipping cost.  We will not use a false or devalued amount on customs declaration forms. We will not indicate your purchase is a \"gift.\" Duty, customs fees, tariffs, taxes, etc. are not included in the payment made to us; these are all the responsibility of the buyer to pay. A 30% fee and any associated return shipping expenses will be charged the buyer for an item that is returned/refused due to non-payment of duty, customs fees, tariffs, taxes, etc. These will be deducted from any refund due. 2. International shipments can take up to 25 business days to arrive at a destination mainly due to delays in customs. Please allow adequate time for your item to arrive before contacting us. 4.2 Domestic 1. When UPS ground service has been selected at ebay checkout we reserve the right to substitute FedEx as the carrier for your package. 2. Some of the small and light weight items will be shipped by USPS only. 3. The shipping price calculator for FedEx shipping provides an ESTIMATED cost before the auction reaches its final value.  The invoice you receive is automatically generated by Ebay, based on the shipping costs as computed by the shipper. Please be aware that the price quote you receive before bidding may be less than the shipping price on the invoice. 5. RETURNS 1. Items that are not as described may be returned within 30 days of receiving the item. Items must be returned as received, with all packaging and parts. 2. Any item listed as for parts or not working may not be returned. Please note: items designated \"as is\" are damaged. Buyer should not expect a refund for any items designated \"as is\" or that are being sold for parts or repair. 3. Please contact us before returning an item.   Get images that make Supersized seem small.Tailor your auctions with Auctiva's Listing Templates! The complete eBay Selling Solution. Track Page Views WithAuctiva's FREE Counter", "ItemID": "312456202880", "EndTime": "2019-02-09T03:00:02.000Z", "StartTime": "2019-02-02T03:00:02.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Washburn-SS40-B-Steve-Stevens-Signature-Series-Electric-Guitar-/312456202880", "ListingType": "Chinese", "Location": "Lynchburg, Virginia", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/3124562028808080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTAyNFg1NzA=/z/LR8AAOSwJ~xcRocd/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg3MTg=/z/M~QAAOSwYwxcRocd/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODUwWDEyODA=/z/kPoAAOSw0ylcRoce/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODUwWDEyODA=/z/~pQAAOSwKL5cRoce/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg1NzY=/z/ivUAAOSwj91cRocd/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFgzODQ=/z/vXgAAOSwUHBcRocd/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg2Nzc=/z/buwAAOSw8iZcRoce/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg2NzY=/z/gtsAAOSwWrxcRoce/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODUwWDEyODA=/z/FqsAAOSwNqRcRoce/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg3MjY=/z/RVgAAOSwNJJcRoce/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg0NDE=/z/J6MAAOSw9ptcRocd/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg0MTc=/z/QpQAAOSwdGZcRoce/$_1.JPG?set_id=880000500F"], "PostalCode": "24502", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "hillcitytradingpost", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 14726, "PositiveFeedbackPercent": 99.7}, "BidCount": 4, "ConvertedCurrentPrice": {"Value": 127.5, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 127.5, "CurrencyID": "USD"}, "HighBidder": {"UserID": "e***i", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1195}, "ListingStatus": "Active", "QuantitySold": 0, "ShipToLocations": ["US", "CA", "GB", "DK", "RO", "SK", "BG", "CZ", "FI", "HU", "LV", "LT", "MT", "EE", "AU", "GR", "PT", "CY", "SI", "JP", "SE", "KR", "ID", "TW", "TH", "BE", "FR", "HK", "IE", "NL", "PL", "ES", "IT", "DE", "AT", "BS", "IL", "NZ", "SG", "CH", "NO", "SA", "UA", "AE", "QA", "KW", "BH", "HR", "MY", "CL", "CO", "CR", "DO", "PA", "TT", "GT", "SV", "HN", "JM", "AG", "AW", "BZ", "DM", "GD", "KN", "LC", "MS", "TC", "BB", "BD", "BM", "BN", "BO", "EG", "GF", "GG", "GI", "GP", "IS", "JE", "JO", "KH", "KY", "LI", "LK", "LU", "MC", "MO", "MQ", "MV", "NI", "OM", "PK", "PY", "RE", "UY"], "Site": "US", "TimeLeft": "P4DT5H52M57S", "Title": "Washburn SS40-B Steve Stevens Signature Series Electric Guitar", "HitCount": 144, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=45564895", "StoreName": "hillcitytradingpost"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 130.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["CN", "RU", "BR", "EC", "MX"], "GlobalShipping": true, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}