{"BestOfferEnabled": false, "Description": "Sweet deal! This is for a limited edition, Tom Delonge signature Epiphone. (Usually out of stock, VERY hard to get.) If you are a Blink 182 / Angels & Airwaves fan, this is your guitar. The tone is amazing. Pros:It feels and plays freaking amazing. Cons:It fell forward and hit my bedroom door and the fretboard cracked. I took it into Guitar Center for a pro repair (expensive) and they used this super powerful fretboard clear glue and clamps that totally sealed and saved it. It plays perfectly, there is just a brutal cosmetic scratch now. (Hence why it's 65% off.) And a few tiny cosmetic scratches (see photos) - everything is disclosed.-------The Epiphone Tom Delonge Signature ES-333 is built to the exact specifications of Blink-182's guitarist, Tom Delonge. This cool new archtop combines semi-hollowbody design with the raw power of a USA-made Gibson Dirty Fingers humbucker pickup in a one-of-a-kind signature model. The Epiphone Tom Delonge Signature ES-333 features a mahogany center block for robust sustain wrapped in a laminated maple body. A solid mahogany neck joined at the 17th fret and the unique and instantly recognizable Tom Delonge \"paintjob\" featuring an eye-catching cream-colored racing stripe down the center of it's brown gloss finished body makes a bold statement.Powerful Looks, Powerful Sound! Aside from the head-turning color-scheme, the real horsepower is under the hood and powered by one Humbucker pick-up. But it's not just any solitary Humbucker mind you! As Tom Delonge prefers for himself, this semi-hollowbody has one super-HOT Gibson USA Dirtyfingers Humbucker pickup right there at the bridge for sound that's guaranteed to cut through. Described as the critical union between power and dirt, Tom chose this pickup because \"It's awesome. It sounds so good. It has so much more clarity and volume and a much wider sound... I instantly fell in love with it.\" Turn it down with the lone volume knob and turn your amp up for a clean, vintage tone, with a hearty breath of smoke. Turn both the guitar and your amp up and smoke the neighbors with Tom's signature tone!Still Packed With More Value: Other details include a rosewood fingerboard with traditional \"Dot\" inlay, quality electronic parts including a full 1\" 500K Ohm potentiometer and heavy-duty output jack. It also features chrome hardware including premium 16:1 ratio Grover machine heads for superior tuning stability and accuracy. Also included as standard equipment on the Epiphone Delonge Signature ES-333 are Epiphone's exclusive LockTone locking Tune-o-matic bridge and stopbar tailpiece which pump out even more sustain and make string changes a breeze.Always There For You: The Epiphone Tom Delonge Signature ES-333 is protected by the Epiphone Lifetime Limited Warranty featuring Gibson 24/7/360 Customer Service and guarantees the instrument against defects in materials or workmanship.FeaturesLaminated maple/birch top, back, and rimsSingle-ply binding on top and backBrown with cream strips finishMahogany set neck with satin finishRosewood fingerboard22 medium jumbo fretsSingle-ply neck bindingDot inlays1960 Slim-Taper neck profile12\" radius24-3/4\" scale length1-11/16\" nut widthGrover die cast tuners1 Gibson USA Dirty Fingers humbucker1 volume controlEpiphone LockTone Tune-O-Matic bridgeEpiphone LockTone stopbar tailpieceChrome hardware\"Tom Delonge\" signature on the back of the headstockCase sold separately Epiphone Signature Tom DeLonge ES-333 Electric Guitar - 65% OFF!. Condition is Used. Shipped with FedEX.", "ItemID": "123622824665", "EndTime": "2019-02-07T22:08:00.000Z", "StartTime": "2019-01-31T22:08:00.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Epiphone-Signature-Tom-DeLonge-ES-333-Electric-Guitar-65-OFF-/123622824665", "ListingType": "Chinese", "Location": "Palmdale, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1236228246658080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/vaoAAOSwEnhcU2-L/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/AAgAAOSwfepcU2-g/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NDUwWDYwMA==/z/3J0AAOSwXgxcU3Ar/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NDUwWDYwMA==/z/9AwAAOSw~slcU3Ar/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NDUwWDYwMA==/z/oq0AAOSwB0lcU3At/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDcxNQ==/z/zTIAAOSwGplcU3Bu/$_32.JPG?set_id=880000500F"], "PostalCode": "93551", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "lemurianseedshop", "FeedbackRatingStar": "Purple", "FeedbackScore": 683, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 197.1, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 197.1, "CurrencyID": "USD"}, "HighBidder": {"UserID": "t***2", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 0}, "ListingStatus": "Active", "QuantitySold": 0, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "P3DT3H26M4S", "Title": "Epiphone Signature Tom DeLonge ES-333 Electric Guitar - 65% OFF!", "ItemSpecifics": {"NameValueList": [{"Name": "Body Type", "Value": ["Semi-Hollow"]}, {"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "Body Material", "Value": ["Maple"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "MPN", "Value": ["ETD3BRCH1"]}, {"Name": "Body Color", "Value": ["Brown"]}]}, "HitCount": 250, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 199.6, "CurrencyID": "USD"}, "ProductID": {"Value": "78667727", "Type": "Reference"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}