{"BestOfferEnabled": false, "Description": "ITEM DESCRIPTION Black Ebony Epiphone Special II Electric Guitar with Road Runner Polyfoam Case 8TEN1944 SKU: 5233214495 Description Please see pictures for condition. As ypou can see from the pictures the guitar is fantastic contion an comes with the case as shown. Product Information The Epiphone Les Paul Special II Electric Guitar is a much-loved model produced by Epiphone, and when you hold one of these musical instruments in your hands, you will understand why. It delivers the characteristic sound found in the original Gibson models and is an excellent guitar for both beginners and experienced guitarists. Affordable and stylish, this quality guitar is likely to become one of your favorite pieces of gear thanks to its superb tonality and visual appeal.Les Paul guitars from Epiphone feature mahogany construction of the body and neck. This construction creates a warm tone that is rich and fat across the entire tonal range from bass to treble. Bass notes sound especially resonant, making this a great instrument for playing power chords. Whether you are playing loud solos or smooth blues riffs through your favorite amp, the hardwoods bring out every nuance of your personal style. The fingerboard is made of rosewood, which offers comfort when making complex chord shapes, and the fingerboard radius is 12 inches. The neck joint features bolt-on construction and is fashioned in a 1960s Slim-Taper \"D\" profile. This neck shape lends itself to speed and precision, and it also makes the Les Paul Special II good for young players and those with small hands. The Special II is a wonderful gift for a child that is a beginner. You'll be starting them on the exciting path of musicianship as well as encouraging their appreciation of the Gibson Les Paul. They&rsquo;ll be able to enjoy the quality of these Les Paul Epiphone standard size guitars for many years. Dual humbucking pickups are used on this electric guitar for authentic Les Paul tones. There is an Epiphone 650R Humbucker at the neck and an Epiphone 700T Humbucker at the bridge. The pickup selection is easily controlled with a three-way toggle switch, and the guitar has one control knob each for volume and tone. While the overall quality of the tone is impressive, you&rsquo;ll also appreciate its capacity for volume. The notes ring out just as clear as they do on fine acoustic guitars.A Tune-o-Matic bridge on the Special II has long been the standard on Gibson Les Paul models because it offers the lengthy, screaming sustain prized by rockers from Jimmy Page to Ace Frehley. A stop-bar tailpiece also adds to the sustain of this instrument. These elements also make it easy to replace the strings when necessary even for a beginner. The nickel hardware on the model looks great under the lights of a stage. The finish is classy, giving the guitar a look that hearkens back to the days of Les Paul himself. The guitar is available in vintage sunburst, black, or heritage cherry sunburst.You could easily take this Epiphone Les Paul into the studio or play it on the road because the tone is simply that good. Whatever type of music you prefer or whatever your skill level, this is an instrument for those musicians who appreciate fine craftsmanship. The Epiphone Les Paul Special II Electric Guitar is available in both right and left-handed models. Cases for the guitar and other accessories are sold separately. The scale length is 24.75 inches, and the Special II guitar weighs approximately 7.9 pounds. SHIPPING INFORMATION Handling Time This item has a 1 business day handling time, which means it will ship from our warehouse within 1 business days, from the day after you ordered your item. Business days include Monday thru Friday excluding holidays. International Shipping We DO NOT ship any item Internationally RETURNS Returns are accepted within 30 days of confirmed delivery. Returns must be in resalable condition (same as purchased) and include a copy of the sales invoice you received with the item. Please contact us for more details -", "ItemID": "163518466643", "EndTime": "2019-02-05T20:32:47.000Z", "StartTime": "2019-01-31T20:32:47.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Black-Ebony-Epiphone-Special-II-Electric-Guitar-Road-Runner-Polyfoam-Case-/163518466643", "ListingType": "FixedPriceItem", "Location": "Cass City, Michigan", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1635184666438080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NjM4WDE2MDA=/z/faIAAOSwVIZcU1tz/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA3MVgxNjAw/z/xgAAAOSwFFVcU1tz/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA3MVgxNjAw/z/UkAAAOSwl1RcU1tz/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjMxWDE2MDA=/z/qmkAAOSwjfBcU1tz/$_1.JPG?set_id=880000500F"], "PostalCode": "48726", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "8ten1944", "FeedbackRatingStar": "TurquoiseShooting", "FeedbackScore": 48080, "PositiveFeedbackPercent": 99.6, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 236.95, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 236.95, "CurrencyID": "USD"}, "ListingStatus": "Active", "QuantitySold": 0, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT18H12M16S", "Title": "Black Ebony Epiphone Special II Electric Guitar with Road Runner Polyfoam Case", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "Body Material", "Value": ["Mahogany"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["ENJRWHCH1"]}]}, "HitCount": 4, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1513296273", "StoreName": "8TEN1944"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "ProductID": {"Value": "78667697", "Type": "Reference"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 0, "ConditionID": 3000, "ConditionDisplayName": "Used", "DiscountPriceInfo": {"OriginalRetailPrice": {"Value": 275.99, "CurrencyID": "USD"}, "PricingTreatment": "STP", "SoldOneBay": false, "SoldOffeBay": false}, "ExcludeShipToLocation": ["Alaska/Hawaii", "APO/FPO", "US Protectorates", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "TopRatedListing": true, "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "SKU": "5233214495", "NewBestOffer": false}