{"BestOfferEnabled": false, "Description": "VTG 1970's Harmony 02814 Electric Guitar & Unitec Hard Shell Padded Flight Case Up for sale is a VTG 1970's Harmony 02814 Electric Guitar & Unitec Hard Shell Padded Flight Case. The guitar comes in very good condition as shown. I don't see and dings or condition issues with the guitar. Plays good and has good action being easy on the fingers. The case is also in good condition but has some staining to the padding inside as shown. The padding inside is not formed for the guitar so additional padding will be needed to ship this safely so the guitar does not slide around inside. The case alone is worth $150!!! Ships insured.If you like the type of items I have and get in for sale you can add your self to my email list to be notified every week of the newly listed items to be the first to see and buy them. BY PURCHASING OR BIDDING ON THIS ITEM YOU AGREE TO THE FOLLOWING TERMS AND CONDITIONSAUCTION TERMS & CONDITIONS:Free Shipping is extended to the CONTIGUOUG U.S. Only. Shipping to HI, PR, AK, US VI....etc will cost more to ship and you will be asked to just pay the additional shipping cost. We reserve the right to chose an alternate shipping company on any and all \"Free Shipping Items\". Most items ship UPS however we also use USPS. Since we pay the shipping we reserve the right to chose the best shipping company to get your item to you.Shipping: Your package will usually shows up in LESS than 10 days but PLEASE ALLOW 2-3 WEEKS FOR DELIVERYINTERNATIONAL BUYERS: Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer's responsibility. I DO NOT WORK ON WEEKENDS. IF YOU PURCHASE AN ITEM LATE ON FRIDAY THROUGH SUNDAY AND YOU EMAIL ME YOU MAY NOT RECEIVE AN ANSWER UNTIL MONDAY. I have all my items in stock when I list them and do not drop ship from anyone. Occasionally I over list an item. This usually happens when I have to relist an item after someone does not pay and the item count gets mixed up. If you should purchase an item and I do not have it I will refund your money immediately. In the 11+ years I have been selling on EBay this has only happened 5 times. However, it is getting harder and harder to keep track of everything so please don't be disappointed if I have to refund your payment in these rare cases.RETURN POLICY: Due to eBay's HASSEL FREE RETUN POLICY a 15% restocking fee will be charged on ALL RETURNS. I accept returns on items that are defective only. If you have an item that you believe to be defective please email me to set up a return. I reserve the right to exchange the item if I have the same item in stock. Returns are not issued for changing your mind so please be sure the item is what you want. I cut my prices so low that I can not afford to deal with the people who buy-use-return. Returns cost everyone money in the end. I will issue a refund when an exchange is not available. If an item is damaged in shipping I will submit all the proper paperwork with the shipping company used and once cleared a refund for the item will be issued. Please keep all packing material as the shipping company may wish to see or pick up the damaged item. ALL RETURNS MUST COME WITH ORIGINAL PACKAGING, no exceptions.Please read entire description & view all photos before bidding. Contact us with any questions you might have about an item. We would much rather have you not place a bid on an item than to be disappointed with it. We are not experts in anything we sell and we do not pretend to be, so some of our knowledge may be limited. All items are sold AS-IS, AS-FOUND, and ALL SALES ARE FINAL, unless otherwise mentioned in auction description. PLEASE ask questions BEFORE you bid. We'll be more than happy to answer them but don't wait till the last minute. If you bid and win without having your questions answered you WILL be expected to complete the transaction. All items are described to the best of our knowledge. We reserve the right to disqualify any bidders with significant negative feedback and offer the item to the next highest bidder. All payments MUST be received 10 days after auction end, non payment will result in a credit request from EBay. Occasionally returns are necessary however return shipping fees are the buyers responsibility. I reserve the right to EXCHANGE the return with the same item if I have it in stock to do so. I will ship the return back at my expense. As with any business there are absolutely no refunds on shipping cost!", "ItemID": "312417772864", "EndTime": "2019-02-05T22:59:45.000Z", "StartTime": "2019-01-06T22:59:45.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/VTG-1970s-Harmony-02814-Electric-Guitar-Unitec-Hard-Shell-Padded-Flight-Case-/312417772864", "ListingType": "FixedPriceItem", "Location": "Valrico, Florida", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/3124177728648080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTAwM1gxNjAw/z/6ewAAOSwGtRX1xnc/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/yl8AAOSwgmJX1xnm/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTk3WDE2MDA=/z/ocUAAOSwFV9X1xng/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/3PAAAOSw9IpX1xnr/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/DlMAAOSwAuZX1xnx/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/KxkAAOSwFdtX1xn1/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTA2WDE2MDA=/z/y2EAAOSwdIFX1xnV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/7eMAAOSwGtRX1xn4/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE5OVgxNjAw/z/zX8AAOSwgmJX1xn7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTg4WDE2MDA=/z/1TsAAOSwFe5X1xn-/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAyMVgxNjAw/z/36kAAOSw9IpX1xoA/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzU0WDE2MDA=/z/LkYAAOSwFdtX1xoE/$_57.JPG?set_id=8800005007"], "PostalCode": "33594", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "fastjag1", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 11073, "PositiveFeedbackPercent": 99.3, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 168.98, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 168.98, "CurrencyID": "USD"}, "ListingStatus": "Active", "QuantitySold": 0, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT20H40M", "Title": "VTG 1970's Harmony 02814 Electric Guitar & Unitec Hard Shell Padded Flight Case", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Harmony"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Model", "Value": ["02814"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Model Year", "Value": ["1970's"]}, {"Name": "String Configuration", "Value": ["6 String"]}]}, "HitCount": 115, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=8270149", "StoreName": "JAG VENDING"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "ConditionDescription": "The guitar comes in very good condition as shown. I don't see and dings or condition issues with the guitar. Plays good and has good action being easy on the fingers. The case is also in good condition but has some staining to the padding inside as shown. The padding inside is not formed for the guitar so additional padding will be needed to ship this safely so the guitar does not slide around inside.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}