{"BestOfferEnabled": true, "Description": "You are bidding on a used Burswood Electric Guitar 08A07 with SD Slot for Recording & Playback. This guitar has some small scratches from regular use, but no chips. It is missing 1 knob (on the pickup selector). In over all nice condition, as shown. Please note: stand is for demonstration purposes only, and is not included. We are not professional guitar collectors, so please review our detailed photos and contact us if you have any questions. This item was donated and shows some wear. We have tried our best to show the wear in the photos, so please look closely. We take great care in packing and shipping, so your item will arrive safely and in the same condition that it left our store. Please remember to check the box to follow our Ebay store as we are frequently adding new items. Highlights Pickup with Record / Playback Capability SD Card Slot Nylon Strap Nice condition Auction Includes used Burswood Electric Guitar 08A07 with SD Slot for Recording & Playback (7E002122, Item# 8006) Strap Please note: Stand shown is for demonstration purposes only, not included Additional Payment Instructions Please verify the international shipping costs first before bidding. Typically the International shipping costs are much lower than the Ebay calculator shows. After you purchase, please confirm your shipping address and phone number and let us know if this address is a business or residential. Thank you. Before You Bid If you have any questions, or need any additional pictures on an item we have for sale, feel free to contact us. We do our very best to accurately describe each auction and item using detailed words & pictures. If there is any discrepancy with any purchase you make, communicate with us right away because our goal is always 100% satisfaction. Perfect feedback is as important to us as it is to you, so please reach out and communicate to us any issues you may have and we will try our best to resolve any problems. If you are an International buyer, please ask for a shipping quote before bidding, because some items need to ship Fedex or UPS because of their value or size. For items listed at over $100, buyers with zero feedback should contact us before bidding or we will cancel your bid or purchase. Shipping & Payment information We accept Paypal payments only. Payment Must be Received within 3 Business Days after auction has ended. Our handling time starts once the item is paid for. We include the cost of insurance and tracking in the shipping charges. We do NOT send expensive shipments without insurance and tracking. We can only ship to addresses that are confirmed Paypal addresses. For a majority of the light weight items we prefer to ship priority mail to save you money, and if an item weighs 13 oz or less, we will ship First Class or First Class Parcel. If your item is 14 oz or more, we may be able to send your item Parcel Select which is Ebay's name for what the Post Office calls Standard Post (formerly Parcel Post). Please note that service can sometimes take up to 2 weeks for delivery and we have no control over when it will arrive. We ship heavier items Fedex because their rates are much lower for heavier items. Fedex is also used when an expensive item requires insurance and safe shipping is required. Vintage musical instruments with a value of over $1,000 will need to be shipped by UPS. We are experts at packing and shipping so your item will arrive safely and in the same condition that it left our store. International Shipping Yes we ship Internationally. Paypal payments are not accepted from all countries, so you may want to contact us before bidding to confirm if we can ship to your location. Send us your complete address and let us know if it is a business or home address. We will determine if the item should be sent Priority Mail International, Priority Mail Express, or Fedex based on its size, weight, and value. We may charge a small handling fee on top of the shipping cost for items shipping out of North America. This handling charge will be shown in our auction. This handling fee covers the extra time to fill out all of the extra paperwork. Please ask for an International shipping quote before bidding. For orders that are shipped outside of the United States there may be local customs or duties. Please be aware that all countries have different fees and procedures for incoming packages. Please check with your country’s customs office for precise charges before placing your bid. We ship international shipments with duty and taxes unpaid. You are responsible to pay all duties, taxes, VAT, etc. imposed by your local government when the package arrives in your country. We cannot control delays due to customs in your country. If your tracking number shows the shipment is in your country, you need to be patient while it goes through the customs process. Note: if you are purchasing electronic equipment from us, please make sure that the item is compatible with the power requirements of your country. Warranty We offer a full 30 day warranty on most items unless noted above. If at any time this item fails within 30 days after receiving shipment, we will send you an exact replacement. If we do not have this item available, we will refund your money. Physically damaged equipment will not be replaced. Vintage items or vintage electronics equipment is guaranteed to work, but sold as is with no guarantees of working exactly as it would if it were to be sold new. We always do our best to describe any known issues in the item description. Return Policy Auction is final, but we guarantee against DOA if you contact us within 72 hours after receiving shipment. You MUST save all original packaging and inform your local delivery person if visible damage to the box is evident at the time of delivery. We may require you to send us pictures of the damage for our Fedex claim. If we cannot replace or repair the item, we will refund your money immediately after receiving the item back from you. You may return working items for a full refund if you can explain why the product was misrepresented, but you will have to pay the return shipping. About Miracle in the Making Miracle in the Making is the capital campaign for Shepherd of the Hills in Porter Ranch, CA. Our goal of this campaign is to expand our current facilities and to continue supporting missions with material needs and the gospel of God's love around the world.", "ItemID": "131974110804", "EndTime": "2019-02-05T02:51:16.000Z", "StartTime": "2016-10-18T02:51:16.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Burswood-Electric-Guitar-model-08A07-/131974110804", "ListingType": "FixedPriceItem", "Location": "Porter Ranch, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1319741108048080_2.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTI4MFgxNjAw/z/i5UAAOSwmLlYBYld/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNDA2/z/YaUAAOSwpLNYBYl0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjM4/z/ss4AAOSwZJBYBYl~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMzcx/z/j4EAAOSwmLlYBYmF/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ0NlgxNjAw/z/rm0AAOSw8gVYBYl3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNDY3/z/HiUAAOSw8w1YBYmZ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAzN1gxNDkw/z/i4kAAOSwNRdYBYmK/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/JaYAAOSw-CpYBYmI/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjY0/z/pqcAAOSwCGVYBYmC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMTc3/z/JH4AAOSwxKtYBYmV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMzQz/z/tLYAAOSwLF1YBYmO/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/JvYAAOSw-CpYBYmS/$_57.JPG?set_id=8800005007"], "PostalCode": "91326", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "shepherd_church", "FeedbackRatingStar": "Blue", "FeedbackScore": 64, "PositiveFeedbackPercent": 0.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 110.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 110.0, "CurrencyID": "USD"}, "ListingStatus": "Active", "QuantitySold": 0, "ShipToLocations": ["US", "Europe", "Asia", "CA", "AU"], "Site": "US", "TimeLeft": "PT30M48S", "Title": "Burswood Electric Guitar - model  08A07 ", "HitCount": 3761, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1027490783", "StoreName": "TheShepherdsCause"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "14 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Some small scratches from regular use, but no chips. Missing 1 knob (on the pickup selector). Overall nice condition, as shown. Please note: stand is for demonstration purposes only, not included.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}