{"BestOfferEnabled": false, "Description": "--> Epiphone Faded G400 Electric Guitar (Worn Cherry) Used This item is slightly used and has been thoroughly checked out by our experts to make sure it is in perfect working condition. We then re-sealed it in its original packaging with all factory included accessories. This item is guaranteed to be in \"as new\" condition and has virtually no cosmetic imperfections. This item is covered with a one year warranty from Sam Ash. As with Epiphones regular G-400, this \"worn\" SG features a traditional solid Mahogany body with a hand-fitted, glued-in Mahogany neck and a 22 fret Rosewood fingerboard. The neck profile is Epiphone most popular \"Slimtaper\" shape dating back to the 1960s and when combined its smooth, satin finish, it feels as comfortable as it is to play. At the heart of this SGs classic rock tone is a pair of high-output Alnico Classic (neck) and Alnico Classic Plus (bridge) Humbuckers, each with separate volume and tone controls that feature full-size 500K potentiometers matched with Epiphone’s rugged all-metal 3-way toggle pickup selector switch for long-life and rock-solid performance. Add Epiphones exclusive LockTone Tune-o-matic bridge and Stop-bar tailpiece and youve got even more devilish sustain! For ultimate tuning stability and accuracy the \"Worn\" G-400 features premium Grover 14:1 machine heads for dead-on tuning accuracy and stability. Case not included.Features:Body: MahoganyNeck: Mahogany, glued-inScale: 24.75”Neck Profile: SlimTaper “D”Nut width: 1.68\"Fingerboard: Rosewood, 22 fretFingerboard Radius: 12”Neck Pickup: Alnico Classic humbuckerBridge Pickup: Alnico Classic Plus humbucker:Bridge: LockTone Tune-O-MaticTailpiece: StopbarControls: Neck pickup: 1-Volume, 1-Tone/ Bridge pickup: 1-Volume, 1-Tone w/full-size 500K potentiometersHardware: NickelTuners: Grover 14:1 ratioCase: Not includedOrder your Epiphone Worn G-400 from Sam Ash Direct today with the security of our 45/60 day return/price protection policy, and be sure to take advantage of our fast, free shipping. Shipping Information Your gear will ship out within 2 days of order confirmation. At this time we can not ship PO Boxes, APO and FPO locations. Industry Leading 45-Day Return Policy We stand by the products we sell, and we'll certainly stand by you as well! We truly appreciate your business, and we want you to be 100% happy with your purchase. However, we know that one of the drawbacks of internet shopping is that you can't try something before you buy it. That's where our money-back guarantee comes in. If you are not completely satisfied with an item, for any reason, you can return it within 45 days of the shipping date for a complete refund of the merchandise price.* Have a question about your order? A Sam Ash Customer Service specialist is available to help! Call 800-472-6274, Monday - Saturday, from 10:00AM - 6:00PM EST. Due to the complexity of international shipping, we are unable to accept any returns on international orders. Before making a purchase outside of the United States, please know that products sold by Sam Ash use the standard 120V/60Hz voltage standard. Sam Ash is not responsible for any damage caused by not adhering to the voltage requirements. *All returns must be within 45 days of the date the item was shipped. Please do not accept any shipment if the packaging appears damaged in any way. We strongly suggest that you check your order after receiving it to be sure that it is in proper working order. Returned items must be in resalable condition. Resalable Condition means that the product(s) is exactly in the same condition as you received it. All exchanges must be pre-paid, returned in original packing, complete with blank warranty cards, owner's manual and show no sign of wear or abuse. In the event that the product is not in the same condition as you received it you may be subject to a minimum 15% restocking fee, repair charge or disqualification. Shipping and handling charges are non-refundable. Please call our Customer Service department if you have any questions about returning an item. CDs, DVDs, video tapes, sheet music, books, strings, computer hardware/software, drum heads, harmonicas, mouthpieces, sound cards, microphones, raw speakers, studio furniture, blank CDs/Tapes or Special Orders are not covered by this return policy.", "ItemID": "173776151597", "EndTime": "2019-02-06T16:35:02.000Z", "StartTime": "2019-02-03T16:35:02.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Epiphone-Faded-G400-Electric-Guitar-Worn-Cherry-Used-/173776151597", "ListingType": "FixedPriceItem", "Location": "Tampa, FL", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1737761515978080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTc0WDUwMA==/z/niQAAOSwsaVcVxg4/$_1.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "samashdirect", "FeedbackRatingStar": "PurpleShooting", "FeedbackScore": 58833, "PositiveFeedbackPercent": 99.2, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 283.88, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 283.88, "CurrencyID": "USD"}, "ListingStatus": "Active", "QuantitySold": 0, "ShipToLocations": ["US", "CA", "GB", "SK", "AU", "KR", "ID", "TH", "IL", "MX", "NZ"], "Site": "US", "TimeLeft": "P1DT14H15M3S", "Title": "Epiphone Faded G400 Electric Guitar (Worn Cherry) Used", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "MPN", "Value": ["EGGVWCCH1"]}]}, "HitCount": 12, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1111655870", "StoreName": "Sam_Ash_Music_Direct"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalRefund": "MoneyBack", "InternationalReturnsWithin": "30 Days", "InternationalReturnsAccepted": "ReturnsAccepted", "InternationalShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "DiscountPriceInfo": {"OriginalRetailPrice": {"Value": 582.0, "CurrencyID": "USD"}, "PricingTreatment": "STP", "SoldOneBay": false, "SoldOffeBay": false}, "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Central America and Caribbean", "South America", "BN", "KH", "HK", "LA", "MO", "MY", "PH", "SG", "TW", "VN", "BM", "GL", "PM", "DZ", "AO", "BJ", "BW", "BF", "BI", "CM", "CV", "CF", "TD", "KM", "CD", "CG", "CI", "DJ", "EG", "GQ", "ER", "ET", "GA", "GM", "GH", "GN", "GW", "KE", "LS", "LR", "LY", "MG", "MW", "ML", "MR", "MU", "YT", "MA", "MZ", "NA", "NE", "NG", "RE", "RW", "SH", "SN", "SC", "SL", "SO", "SZ", "TZ", "TG", "TN", "UG", "EH", "ZM", "ZW", "BH", "IQ", "JO", "KW", "LB", "OM", "QA", "SA", "TR", "AE", "YE", "AF", "AM", "AZ", "BD", "BT", "CN", "GE", "IN", "JP", "KZ", "KG", "MV", "MN", "NP", "PK", "LK", "TJ", "TM", "UZ", "AS", "CK", "FJ", "PF", "GU", "KI", "MH", "FM", "NR", "NC", "NU", "PW", "PG", "SB", "TO", "TV", "VU", "WF", "WS", "AL", "AD", "AT", "BY", "BE", "BA", "BG", "HR", "CY", "CZ", "DK", "EE", "FI", "FR", "DE", "GI", "GR", "GG", "HU", "IS", "IE", "IT", "JE", "LV", "LI", "LT", "LU", "MK", "MT", "MD", "MC", "ME", "NL", "NO", "PL", "PT", "RO", "SM", "RS", "SI", "ES", "SJ", "SE", "CH", "UA", "VA", "PO Box"], "GlobalShipping": true, "ConditionDescription": "Like New", "QuantitySoldByPickupInStore": 0, "SKU": "EGGVWCCHX", "NewBestOffer": false}