{"BestOfferEnabled": false, "Description": "2010 Epiphone DOT Studio Semi-Hollow Body Archtop Giutar | Worn Cherry Condition: Excellent Pre-Owned Condition with only minor signs of use. The Front of the body has almost no wear at all. The back has a couple scratches and scuffs (See Images). The Head stock has a couple of minor scratches as well. The guitar plays great, but could use a set up. There is some string buzz starting here & there. All Electronics are in perfect working condition. See images for more detail. The Epiphone Dot Studio, A New Twist on the Rock and Roll Machine The Epiphone Dot, Epiphone's version of the venerable ES-335 “Dot”, has been wowing guitar players all over the world for a decade. Vintage models (with vintage problems) can’t complete with our Epiphone Dot, which is simply one of the best deals today for guitar players who want the classic sound of an ES-335 at an affordable price. Now the Dot Studio gives players the exact same sound and quality in a stripped down studio model made of mahogany. Similar to our Les Paul Studio, the Dot Studio has all the tone and functionality of our “Dot” but with a fabulous Vintage Sunburst or Cherry finish. Epiphone is long famous for its own original semi-hollowbody models from the 1950s Kalamazoo, Michigan era, including the Riviera and the Sheraton. During the same time those guitars were being designed and constructed in Kalamazoo, the ES 335, first introduced in 1958, became a favorite of blues, rock, country, and pop acts for its elegant design and wide array of colorful tone combinations. Now, the Epiphone Dot Studio, named in reference to its mahogany body and plain fingerboard, opens up the availability of the sustain and resonance of the semi-hollow design for a bounty less than most solid body guitars. The “Dot” is the same axe that has been the bell weather of every rock and roll breakthrough. And now for the first time, the “Dot” puts that classic sound and over 40 years of refinements in your hands, the Epiphone way. Body Material: Laminate MahoganyTop Material: Laminated MahoganyNeck: MahoganyNeck Joint: Slim Taper \"D\" ProfileFingerboard: Dot InlayFingerboard Radius: 12\"Scale: 24.75\"Nut Width: Black 1.68Neck Pickup: Black, Open Coil Alnico Classic HumbuckerBridge Pickup: Black, Open Coil Alnico Classic HumbuckerControls: 1-Volume, 1-TonePickup Selector: Epiphone 3-Way ToggleTailpiece: Black LockTone Tune-O-Matic StopBarHardware: BlackColor: Worn Cherry Payment Online payments are accepted through PayPal ONLY. We do not accept any other forms of online payments. Cash/credit card payments are accepted with local pickup ONLY. Payment for all items is due within 5 days of the auctions selling date. All Indiana sales are subject to 7% sales tax. We ship items within 1 business day after receiving payment. Shipping & Returns US SHIPPING ONLY...PLEASE DO NOT ASK ABOUT SHIPPING OUTSIDE OF THE CONTINENTAL U.S. I WILL NOT RESPOND! The buyer has 30 days to return an item if they are not satisfied for a full refund, minus the shipping price. Our AS IS items DO NOT qualify for refunds or returns. Shipping is available within the continental United States. We ship our items using UPS Ground, USPS for smaller items. If a package is returned to us because of an incorrect address or if someone was not there to accept the package, the buyer is responsible for any additional shipping charges. If you have any questions regarding payment, shipping, or item condition please contact us for more information prior to bidding. We ship items within 2 business days after receiving payment. WE DO NOT SHIP TO P.O. BOXES UNDER ANY CIRCUMSTANCES Local Pickup All items are available for local pick up and are subject to 7% Indiana Sales Tax. All local pick up customers will be required to present a valid form of ID with the IDENTICAL name that appears on their eBay account. Customers must also sign an eBay invoice to verify the item was picked up and is what was described in the original auction. About Us Owned and operated by Jack and Cathy Batz. Cash Indiana Pawn Shop is a chain of family owned Pawnshops in NW Indiana. In 1963, Jack converted the Diner Bell restaurant into Jack's Gun Shop at the current Burns Harbor location. For the next two decades Jack’s Gun Shop operated as the one stop shop for hunters, fisherman, trap shooters, and other outdoor enthusiasts. During the early 1980’s economic depression Jack realized the need and opportunity to diversify and expand his business. Thus Jacks Gun Shop was converted into Jack’s Gun & Pawn shop. In 1992, Jack and Cathy opened their second store at the current Lake Station location and then in 1994 they opened their Michigan City store creating today’s Cash Indiana Corporation. From day one Jack and Cathy’s motto has been to treat every customer, as they would want to be treated with respect and fairness. This motto has bought them great success and satisfaction in helping NW Indiana with their financial troubles. ​Our goal is a happy customer. We strive for excellence. We never attempt to sell anything different than what is described. If there is any issue, please contact us immediately so we can resolve the problem. If the package or item has signs of damage upon receiving your shipment please inform us as soon as possible for insurance purposes. We look forward to serving you soon! About The Merchandise All of our items up for auction are items that we purchased from the public or Pawn loans that were forfeited; all items have been uploaded to Leads Online; a service that Police Departments across the United States access daily to check for stolen merchandise. We test and describe each and every item to the best of our ability. If there are some items that we cannot test we will state it in the listing. These types of items are listed “AS IS” and are sold with NO WARRANTY. We will always disclose any and all necessary information with each individual item. We will make every effort to disclose any imperfections or defects of any kind. We are experts at assessing an items condition; Mint, Excellent, Very Good, Good, Fair, and Poor. Please feel free to ask any questions. Photographs often describe an items condition better than any words can, so please don’t forget to check out the pictures. Actual photos of each item are shown in the auction!", "ItemID": "173767036490", "EndTime": "2019-02-04T22:45:26.000Z", "StartTime": "2019-01-28T22:45:26.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2010-Epiphone-DOT-Studio-Semi-Hollow-Body-Archtop-Giutar-Worn-Cherry-/173767036490", "ListingType": "Chinese", "Location": "Michigan City, Indiana", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1737670364908080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg5MTk=/z/v3UAAOSw8~hcRizK/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMzE3/z/mQEAAOSwKL5cRizM/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjU2/z/GQ8AAOSwWrNcRizO/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU5OVg5NzM=/z/pgkAAOSwlLlcRizQ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNTM2/z/h38AAOSwUu5cRizT/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjQz/z/yMgAAOSwAopcRizV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQwOFgxNjAw/z/UPkAAOSwwfFcRizY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU5OVgxNDcw/z/sKAAAOSwwDJcRizb/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDUx/z/rP4AAOSwyeNcRizd/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5NzA=/z/GucAAOSwkAxcRizf/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/pUwAAOSwkHxcRizh/$_57.JPG?set_id=8800005007"], "PostalCode": "46360", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "cashindianamichigancity", "FeedbackRatingStar": "Purple", "FeedbackScore": 569, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 20, "ConvertedCurrentPrice": {"Value": 202.5, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 202.5, "CurrencyID": "USD"}, "HighBidder": {"UserID": "m***s", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 291}, "ListingStatus": "Active", "QuantitySold": 0, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT3H37M6S", "Title": "2010 Epiphone DOT Studio Semi-Hollow Body Archtop Giutar | Worn Cherry", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "Model Year", "Value": ["2010"]}, {"Name": "Soundboard Style", "Value": ["Archtop"]}, {"Name": "Body Type", "Value": ["Semi-Hollow"]}, {"Name": "MPN", "Value": ["DOT Studio"]}, {"Name": "Body Color", "Value": ["Worn Cherry"]}, {"Name": "Model", "Value": ["DOT Studio WC"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Material", "Value": ["Laminated Mahogany"]}, {"Name": "Size", "Value": ["Full Size"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Features", "Value": ["Volume Knob", "With Pickup"]}, {"Name": "Product Line", "Value": ["Studio"]}]}, "HitCount": 286, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 205.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "Excellent Pre-Owned Condition with only minor signs of use.  The Front of the body has almost no wear at all. The back has a couple scratches and scuffs (See Images). The Head stock has a couple of minor scratches as well.  The guitar plays great, but could use a set up.  There is some string buzz starting here & there.  All Electronics are in perfect working condition.  See images for more detail.", "QuantitySoldByPickupInStore": 0, "SKU": "90533", "NewBestOffer": false}