{"BestOfferEnabled": false, "Description": "Make sure to check out my other 100 guitars!!! Shipping to the lower 48 states FedEx, no post office boxes. I will not ship anywhere else. Make sure to check out my other 100 guitars at my ebay store \"Axes Bold As Love Guitars\". I have added a new part to my ending statement. I now recommend that all the guitars I sell be set up to your preferences. ALL GUITARS MAY REQUIRE SET UP!!! Players have such varied opinions that I no longer want to hear about it. Here is a very cool Slick SL52 solid swamp ash electric guitar with some nice upgrades. This is the awesome sounding Les Paul type guitar . The maple/rosewood neck has near zero fret wear and nice action. The Body looks very nice, only mild surface scratches. Guitar features Slick's hand aged alnico 5 pickups and to me they sound better than many of the name brand upgrade pickups available. These guitars come stock with no tone control. I decided to add a push/pull tone control so the humbuckers can be split into single coils. All electronics work perfectly,and sound great on every setting,clean or with some distortion. I used a nice Japanese Nichicon polyester film and foil capacitor . More range of tone control and a smoother response. Action is great and this guitar wails. This guitar sounds really good,and it looks like a classic. Here's some Hype from Guitar Fetish: What's the formula for incredible LP sound?? Oh how about using the BEST wood... The BEST hardware...The BEST tuners....The BEST pickups...And finish it off with the thinnest finish, hand massaged to give you the warm, silky, old-school feel of a guitar that's been on tour for a while. Yeah that's how we do it. DO NOT underestimate this guitar just because it's so ridiculously affordable. Look- This is the real deal. Designed by Earl Slick in his New York studio. Each body is SOLID swamp ash. Necks are SOLID Canadian Hard Rock Maple. Fingerboards are Indian Rosewood. This is a serious recipe for tone. Hardware? You want Hardware? Slick spec'd out the best. It all starts with our wraparound bridge- machined from a solid billet of BRASS- No finish. Raw. Naked. Nude. The knob is a machined brass billet piece as well. Just one volume, but an elongated control cavity so you can add a tone control if you want. The tuners are our own design, with a bronze crown gear and bronze pinion gear and SOLID BRASS knob- the result is a tuner with basically NO backlash. It's smooth and very accurate, and you'll stay in tune! We put a graphite nut on every neck, hand slotted. The tilt-back headstock allows us to get the exact correct string break at the nut for ALL SIX STRINGS, and no string trees mean better tuning stability. We're running a Gibson-Standard 24 3/4\" scale length, a 43mm wide nut and a 12\" fretboard radius. The neck has twenty two nickel-silver 6105 profile medium jumbo frets, leveled, crowned and polished. Where the Slick SL52 really distinguishes itself is with the PICKUPS. We use a pair of Slick Brand, HAND AGED \"Slick Old School\" ALnico V pickups. Classic \"Patent Applied For\" style and sound- Alnico V bar magnets, Delrin bobbins, Formvar 42 gauge wire, German Silver baseplate and German Silver cover. Wound crazy-strong at 9.2K for the bridge and 8.0K for the neck. The pickups are not just built from the right stuff, but we hand age them- both cosmetically and magnetically. They look like old pickups... they feel like old pickups... they sound like old pickups. The feel and vibe is enhanced and preserved by the completely unique way that we finish Slick guitars. The solid ash body is NOT wood grain filled. It is NOT sealed. NO Polyurethane fillers. It's raw. We spray a single coat of old fashioned automotive paint and sand it back. The pores don't get clogged so the wood can breathe. It works. It sounds better. Louder. Fuller. You can feel it instantly. Slick SL52 Electric Guitar,Added Coil Splitting Tone Control,Capacitor Upgrade Click images to enlarge Description Make sure to check out my other 100 guitars!!!   Shipping to the lower 48 states FedEx, no post office boxes. I will not ship anywhere else. Make sure to check out my other 100 guitars at my ebay store \"Axes Bold As Love Guitars\". I have added a new part to my ending statement. I now recommend that all the guitars I sell be set up to your preferences. ALL GUITARS MAY REQUIRE SET UP!!!  Players have such varied opinions that I no longer want to hear about it.     Here is a very cool Slick SL52 solid swamp ash electric guitar with some nice upgrades. This is the awesome sounding Les Paul type guitar .I've owned this guitar for a while and it is one of those that I really hate to sell. Very cool guitar.  The  maple/rosewood neck has near zero fret wear and nice action. The  Body looks very nice, only  mild surface scratches. Guitar features Slick's hand aged alnico 5 pickups and to me they sound better than many of the name brand upgrade pickups available.  These guitars come stock with no tone control. I decided to add a push/pull tone control so the humbuckers can be split into single coils. All electronics work perfectly,and sound great on every setting,clean or with some distortion. I used a nice Japanese Nichicon polyester  film  and foil capacitor . More range of tone control and a smoother response. Action is great and this guitar wails. This guitar sounds really good,and it looks like a classic. Here's some Hype from Guitar Fetish: What's the formula for incredible LP sound?? Oh how about using the BEST wood... The BEST hardware...The BEST tuners....The BEST pickups...And finish it off with the thinnest finish, hand massaged to give you the warm, silky, old-school feel of a guitar that's been on tour for a while.  Yeah that's how we do it. DO NOT underestimate this guitar just because it's so ridiculously affordable. Look- This is the real deal. Designed by Earl Slick in his New York studio. Each body is SOLID swamp ash. Necks are SOLID Canadian Hard Rock Maple. Fingerboards are Indian Rosewood. This is a serious recipe for tone. Hardware? You want Hardware? Slick spec'd out the best. It all starts with our wraparound bridge- machined from a solid billet of BRASS- No finish. Raw. Naked. Nude. The knob is a machined brass billet piece as well. Just one volume, but an elongated control cavity so you can add a tone control if you want. The tuners are our own design, with a bronze crown gear and bronze pinion gear and SOLID BRASS knob- the result is a tuner with basically NO backlash. It's smooth and very accurate, and you'll stay in tune! We put a graphite nut on every neck, hand slotted. The tilt-back headstock allows us to get the exact correct string break at the nut for ALL SIX STRINGS, and no string trees mean better tuning stability. We're running a Gibson-Standard 24 3/4\" scale length, a 43mm wide nut and a 12\" fretboard radius. The neck has twenty two nickel-silver 6105 profile medium jumbo frets, leveled, crowned and polished. Where the Slick SL52 really distinguishes itself is with the PICKUPS. We use a pair of Slick Brand, HAND AGED  \"Slick Old School\" ALnico V pickups. Classic \"Patent Applied For\" style and sound- Alnico V bar magnets, Delrin bobbins, Formvar 42 gauge wire, German Silver baseplate and German Silver cover. Wound crazy-strong at 9.2K for the bridge and  8.0K for the neck. The pickups are not just built from the right stuff, but we hand age them- both cosmetically and magnetically. They look like old pickups... they feel like old pickups... they sound like old pickups. The feel and vibe is enhanced and preserved by the completely unique way that we finish Slick guitars. The solid ash body is NOT wood grain filled. It is NOT sealed. NO Polyurethane fillers. It's raw. We spray a single coat of old fashioned automotive paint and sand it back. The pores don't get clogged so the wood can breathe. It works. It sounds better. Louder. Fuller. You can feel it instantly.            A very sexy looking guitar.  Please look carefully at all the pictures,they are part of the description too.This one  sounds very good. A very cool guitar period!  I describe all guitars to the best of my abilities.I don't take every guitar apart to check every freaking screw.I disclose all pimples just so there are no misunderstandings.All guitars are sold as is. Insurance is included in my shipping and handling charges.I will not ship out of the U.S. My feedback is public record,and I aim to keep it good. I will no longer do local pickups period. Make sure to look at all pictures carefully,ask all question before you bid! All sales are final,and there will be no refunds, or returns unless you can prove an item was grossly misrepresented. Consider this a contract if you bid. Sorry it has to be like that,blame the clever scam artist that spend all their time trying to beat somebody instead of working!         Get images that make Supersized seem small.Tailor your auctions with Auctiva's Listing Templates! THE simple solution for eBay sellers. Track Page Views WithAuctiva's FREE Counter", "ItemID": "254106466141", "EndTime": "2019-03-04T14:01:24.000Z", "StartTime": "2019-02-02T14:01:24.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Slick-SL52-Electric-Guitar-Added-Coil-Splitting-Tone-Control-Capacitor-Upgrade-/254106466141", "ListingType": "FixedPriceItem", "Location": "Brooksville, Florida", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/2541064661418080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/p7MAAOSwKOZcVaK4/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/VWUAAOSwIndcVaK4/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/uSAAAOSwaSVcVaK4/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/ArAAAOSwJXNcVaK4/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/qFoAAOSwSn1cVaK4/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/WI0AAOSw3K1cVaK4/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/4NkAAOSw1rpcVaK4/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/yhEAAOSwZ6VcVaK4/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/MEsAAOSwW~JcVaK4/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/DYsAAOSwJ9tcVaK4/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/4mEAAOSwo6NcVaK4/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/qFsAAOSwFFVcVaK4/$_1.JPG?set_id=880000500F"], "PostalCode": "34613", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "axesboldaslovejimidavis", "FeedbackRatingStar": "Green", "FeedbackScore": 6477, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 249.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 249.99, "CurrencyID": "USD"}, "ListingStatus": "Active", "QuantitySold": 0, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "P27DT19H19M51S", "Title": "Slick SL52 Electric Guitar,Added Coil Splitting Tone Control,Capacitor Upgrade", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Slick"]}, {"Name": "Style", "Value": ["Single Cutaway"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Model", "Value": ["SL51"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Body Color", "Value": ["Reliced Sunburst Swamp Ash"]}, {"Name": "Body Material", "Value": ["Ash", "Solid Wood"]}, {"Name": "MPN", "Value": ["Does not apply"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}]}, "HitCount": 48, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=254269757", "StoreName": "Axes Bold As Love Guitars"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "ConditionDescription": "Used, but still awesome. Please scroll down on the ad to see all the pictures and read the entire description.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}