{"BestOfferEnabled": false, "Description": "GrassRoots G-I-48LP IV Blue LUNA SEA INORAN Model USED with Soft Case Item Description Condition : Used There are small scratches or paint peeling and dent, but not noticeable much, Good condition. No problem with the output and electrical system. ·All the maintenance is done by technical staff. ·Pegs are exchanged for things made by Maurice. A little twist is seen in the neck, but there is no hindrance to the performance. The truss rod works as it should. The frets show a little wear but they are at 80% life left currently. Body: Alder Neck: Maple (bolt on) Finger board: Rosewood 22F Pickup: Original single coil (front & center) Original humbucker (rear) Control: 2 Volume 1 Tone 3 Way Switch Weight : 3.86Kg Accessories : Soft Case ShippingShipping by EMS or DHL(international express mail service, with Tracking and Insurance, handling cost). EMS takes 3-7 days, DHL takes 2-4 days. We will ship your item within 5 business days with carefully packed. We can ship ONLY to your Paypal address. PaymentWe accept PayPal ONLY. Please contact us, if you want to choose a particular courier company to deliver the package. ReturnsMoney back guarantee within 30 days. We offer 30 days money back guarantee for defective products. The buyer must pay for returning it back to us. When there were defects in a instrument, please contact us. International Buyers - Please Note:Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer's responsibility. Please check with your country's customs office to determine what these additional costs will be prior to bidding/buying. These charges are normally collected by the delivering freight (shipping) company or when you pick the item up - do not confuse them for additional shipping charges. We do not mark merchandise values below value or mark items as “gifts” - US and International government regulations prohibit such behavior. About UsIf you have any problem, please contact us. Your satisfaction is important to us. We have results that I sold of tens of thousands of by Internet sale. We have pride ourselves in the Quality of items we offer. All our items has been checked by technician. As every seller dealing with pre-owned branded items in Japan we have as well license from local government to offer services of this kind. We are officially registered as legal business and we have to comply with all rules and regulations including tax requirements from the Japanese government.Categories Aria Pro II B.C.Rich Bacchus Burny EDWARDS Epiphone ESP Fender Custom Shop Fender Japan Fender USA FERNANDES Gibson Gibson Custom Shop GrassRoots Greco Gretsch Ibanez Jackson Mosrite MUSIC MAN Orville PRS Rickenbacker SCHECTER Squier Steinberger Tokai Valley Arts YAMAHA OTHER Links Visit Our eBay Store", "ItemID": "264121342636", "EndTime": "2019-02-05T15:14:30.000Z", "StartTime": "2019-01-06T15:14:30.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/GrassRoots-G-I-48LP-IV-Blue-LUNA-SEA-INORAN-Model-USED-Soft-Case-/264121342636", "ListingType": "FixedPriceItem", "Location": "OSAKA", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2641213426368080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFg1MDI=/z/h34AAOSwUulbzdlY/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFg5MDA=/z/2YYAAOSwGI9bzdlZ/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFg5MDA=/z/OS4AAOSw86Nbzdlb/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFg5MDA=/z/VMYAAOSwTY9bzdla/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFg5MDA=/z/L3MAAOSwds9bzdlZ/$_1.JPG?set_id=880000500F"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "spp-international", "FeedbackRatingStar": "Purple", "FeedbackScore": 922, "PositiveFeedbackPercent": 96.7}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 281.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 281.0, "CurrencyID": "USD"}, "ListingStatus": "Active", "QuantitySold": 0, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT12H53M47S", "Title": "GrassRoots G-I-48LP IV Blue LUNA SEA INORAN Model USED with Soft Case", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["GrassRoots"]}, {"Name": "Model", "Value": ["G-I-48LPIV"]}, {"Name": "MPN", "Value": ["G-I-48LPIV"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Body Color", "Value": ["Blue"]}, {"Name": "Body Material", "Value": ["Alder"]}]}, "HitCount": 49, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1293860862", "StoreName": "SPP international"}, "Country": "JP", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "60 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller", "InternationalRefund": "MoneyBack", "InternationalReturnsWithin": "60 Days", "InternationalReturnsAccepted": "ReturnsAccepted", "InternationalShippingCostPaidBy": "Seller"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 5, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["JP"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}