{"BestOfferEnabled": false, "Description": "Welcome to our eBay Store! MERCEDES S550 TRUNK FLOOR PANEL TRIM HANDLE 2007 2008 2009 2010 2011 2012 2013 Description--> Description PLEASE SEE PICTURES FOR VISUAL DETAILS BEFORE PURCHASE. YOU WILL RECEIVE THE PART THAT IS PICTURED. Donor Vehicle Model: S550 Year: 2007 Mileage: 0 (0 = not available or unknown) Stock Number: 96814 Store Number: 1 Part Detail Part Grade: Part Category: U Part Placement: Notes: S550 TRUNK COMPARTMENT FLOOR HANDLE This part will fit these makes and models with these options --> WARRANTY / GUARANTEE --> Most parts we sell through eBay Motors come with a 14 day money back guarantee unless otherwise stated. The 14 day period starts when you take possession of the part. No labor warranty is provided. No refund will be issued on parts that are returned due to insufficiant or incorrect address. In the event a part sold with a warranty fails to operate within the warranty period we will replace the part(s) with a functionally equivalent part or refund the part purchase price, at our option. No refund on deposits or unwanted special order parts or special \"cut\" items. Orignal shipping charges will be diducted from refund on unwanted items or wrong parts ordered regardless of free shipping cost. To return an item you must contact us via eBay Message within the ebay \"money back\" period to obtain a RMA number (return material authorization). PLEASE ALWAYS CHECK THE DETAILED CONDITION & MAKE SURE YOUR ORIGINAL PART MATCHES THE ONE SHOWN IN THE PICTURE ABOVE. Fitment: We take no responsibility regarding the fitment on your vehicle since we don't have any information about your vehicle. The interchange in the compatibility section, title, or description is just a guide of what the item possibly fits. Please use all the information including part numbers, item specifics, and pictures provided in the listing to insure correct fitment. It is your responsibility to confirm the fitment for your specific application. Please call your local dealer if unsure. Original shipping charges and return shipping charges are not refunded. Once you obtain an RMA number, Ship out the return item. --> SHIPPING NOTES ABOUT US HELP Core Charge. Core is an acronym for ‘Cash On Return’. A core charge is sometimes applied to rebuildable parts such as engines or alternators that can be redeemed for a portion of their original price. If the part you are purchasing has a core charge applied, it will be noted in the description. Parts Grading. A standard code system is used to communicate the condition and quality of a part between automotive recyclers, automotive repair shops, and insurers. Knowing how these codes are used will help you understand whether the part meets your expectations before you buy it and what you can expect from the part when you receive it. A Grade - The highest quality part. It is of low miles and/or exceptional condition for its age. B Grade - The second level quality part. It is of average miles and normal condition for its age. C Grade - The third level quality part. It has high miles and/or light damage. No Grade - A part that has not yet been graded. If you have a question about a part please contact us BEFORE purchasing. Our main contact method is by eBay Messages. We try to answer all messages within 24 hours. If we are unable to answer your questions before the listing ends the item will be re-listed again soon for you to purchase. Unlimited Auto Parts ships to US addresses within the 48 states only via UPS ground. No Alaska, Hawaii, Puerto Rico, APO, FPO or PO Box please. No International shipping available. Pick up at our facilities is available. Please email us prior to your purchase to arrange pick up. Items will be shipped within 1-2 days of purchase. Please allow 5-10 days for delivery. Most areas in the US are within 5 days. No expedited shipping is available. If an item arrives damaged, please contact us via eBay Message within 24 hours for instructions. Shipping Notes: Unlimited Auto Parts ships to US addresses within the 48 states only via UPS ground. No Alaska, Hawaii, Puerto Rico, APO, FPO or PO Box please. No International shipping available. Pick up at our facilities is available. Please email us prior to your purchase to arrange pick up. Items will be shipped within 1-2 days of purchase. Please allow 5-10 days for delivery. Most areas in the US are within 5 days. No expedited shipping is available. If an item arrives damaged, please contact us via eBay Message within 24 hours for instructions. Help: Core Charge. Core is an acronym for ‘Cash On Return’. A core charge is sometimes applied to rebuildable parts such as engines or alternators that can be redeemed for a portion of their original price. If the part you are purchasing has a core charge applied, it will be noted in the description. Parts Grading. A standard code system is used to communicate the condition and quality of a part between automotive recyclers, automotive repair shops, and insurers. Knowing how these codes are used will help you understand whether the part meets your expectations before you buy it and what you can expect from the part when you receive it. A Grade - The highest quality part. It is of low miles and/or exceptional condition for its age. B Grade - The second level quality part. It is of average miles and normal condition for its age. C Grade - The third level quality part. It has high miles and/or light damage. No Grade - A part that has not yet been graded. About Us: If you have a question about a part please contact us BEFORE purchasing. Our main contact method is by eBay Messages. We try to answer all messages within 24 hours. If we are unable to answer your questions before the listing ends the item will be re-listed again soon for you to purchase.", "ItemID": "302634718066", "EndTime": "2019-02-05T23:30:14.000Z", "StartTime": "2018-02-10T23:30:14.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/MERCEDES-S550-TRUNK-FLOOR-PANEL-TRIM-HANDLE-2007-2008-2009-2010-2011-2012-2013-/302634718066", "ListingType": "FixedPriceItem", "Location": "Houston, Texas", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/3026347180668080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NjAwWDgwMA==/z/0oIAAOSwqSBaf4CJ/$_0.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjAwWDgwMA==/z/QykAAOSwp7taf4CJ/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjAwWDgwMA==/z/qDEAAOSwXEdaf4CJ/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjAwWDgwMA==/z/W5QAAOSw8A1af4CJ/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjAwWDgwMA==/z/W5MAAOSw8A1af4CJ/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjAwWDgwMA==/z/F-wAAOSwRLZaf4CJ/$_1.JPG?set_id=880000500F"], "PostalCode": "77099", "PrimaryCategoryID": "33705", "PrimaryCategoryName": "eBay Motors:Parts & Accessories:Car & Truck Parts:Interior:Trim", "Quantity": 1, "Seller": {"UserID": "unlimitedautoparts_1", "FeedbackRatingStar": "Purple", "FeedbackScore": 899, "PositiveFeedbackPercent": 98.7, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 19.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 19.0, "CurrencyID": "USD"}, "ListingStatus": "Active", "QuantitySold": 0, "ShipToLocations": ["US"], "Site": "eBayMotors", "TimeLeft": "PT21H9M35S", "Title": "MERCEDES S550 TRUNK FLOOR PANEL TRIM HANDLE 2007 2008 2009 2010 2011 2012 2013 ", "ItemSpecifics": {"NameValueList": [{"Name": "Conditions & Options", "Value": ["S550 TRUNK COMPARTMENT FLOOR HANDLE"]}, {"Name": "Genuine OEM", "Value": ["Yes"]}, {"Name": "Interchange Part Number", "Value": ["225.MB1Q07"]}, {"Name": "Inventory ID", "Value": ["5492"]}, {"Name": "Designation", "Value": ["Used"]}, {"Name": "Stock #", "Value": ["96814"]}, {"Name": "PartNumber", "Value": ["225"]}, {"Name": "Mileage", "Value": ["0"]}, {"Name": "Model", "Value": ["S550"]}, {"Name": "Year", "Value": ["2007"]}, {"Name": "GTIN", "Value": ["Does not apply"]}]}, "HitCount": 33, "PrimaryCategoryIDPath": "6000:6028:6030:33694:33705", "SecondaryCategoryID": "33034", "SecondaryCategoryIDPath": "33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1495954373", "StoreName": "unlimitedautoparts_1"}, "Country": "US", "ReturnPolicy": {"ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "ConditionDescription": "USED PARTS MAY SHOW SIGNS OF WEAR INCLUDING MARKS AND OR SCRATCHES.A3BIN2", "QuantitySoldByPickupInStore": 0, "SKU": "5492", "NewBestOffer": false}