{"BestOfferEnabled": false, "Description": "Michael Kelly electric Guitar . Condition is Used. Plug it in to a speaker and had it playing other then that no other testing is dont i personally dont know how to play. Has minor wear but overall looks good. Selling as is. Don't have a case for it. This quick summary of my selling terms is provided for your convenience. Payment I accept PayPal (preferred). Payment is due within 3 days after the end of the sale. Domestic Shipping Terms Most items will ship by U.S. Postal Service. If required, insurance will be included in the item price or handling charge. Delivery Confirmation will be included on most shipments. Larger items usually ship by UPS. Additional shipping charges may apply for Alaska, Hawaii, APOs, Puerto Rico, Virgin Islands or other US territories. International Shipping Terms Not all items can ship internationally. Please contact me before bidding if you are outside the U.S. International orders will normally ship by US Postal Service International Priority Mail. Additional charges for shipping and insurance may apply. I will provide shipping estimates. Buyer is responsible for any customs duties. Delivery I normally ship within 2 business days after payment is received. Shipping may be delayed while waiting for a PayPal e-check to clear. Please provide a clear and correct address to expedite shipment! Refunds are giving back only if items where described wrong please contact me right way if there is any problem i will do everything i can to fix the problem. Fragile Items will have a invoice sent with options on shipping Fedex and USPS. Please look at pics they are part of the description.Feedback: I will leave feedback when feedback is left for me. That way i know you are happy with your item(s). For any reason you are not happy please let me know so i can fix the problem. Due to the fact ebay is giving 30 to 60 days for returns i will not be accepting returns anymore. If there is a problem or issue just message me and we can fix it. Sorry for any inconvenience.", "ItemID": "123626396913", "EndTime": "2019-03-05T01:16:39.000Z", "StartTime": "2019-02-03T01:16:39.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Michael-Kelly-electric-Guitar-/123626396913", "ListingType": "FixedPriceItem", "Location": "Niagara Falls, New York", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1236263969138080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/eX0AAOSwB0lcVj~I/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/8kQAAOSwm5xcVj~K/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/v90AAOSwuZVcVj~M/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/7WgAAOSw~llcVj~N/$_12.JPG?set_id=880000500F"], "PostalCode": "14305", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "cspeck38", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 320, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 225.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 225.0, "CurrencyID": "USD"}, "ListingStatus": "Active", "QuantitySold": 0, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "P28DT4H46M6S", "Title": "Michael Kelly electric Guitar ", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Michael Kelly"]}]}, "HitCount": 56, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}