{"BestOfferEnabled": true, "Description": "1991 Guild Nightbird CU (custom) Electric Guitar Offered here is a vintage 1991 Nightbird electric guitar and its original hardshell case. This instrument was designed by George Gruhn and Kim Walker, who became involved with Guild in the mid-80's and introduced many innovative new electric and acoustic models to the line of American made guitars built at Guild's Westerly, RI factory. ( it’s a 27 year old guitar) The features of this all-original Nightbird CU include: Solid mahogany body with routed sound chambers Solid Tiger Striped maple carved top with Amber burst finish Solid mahogany neck Bound ebony fingerboard with jumbo frets and slotted diamond inlays in pearl 24 3/4\" scale and 22 frets Tortoise shell pickguard and back plate Guild G logo headstock ornamentation in pearl Gold-plated hardware, including Grover tuning machines Two EMG 60 active humbucking pickups with phase switch and coil tap (pull knob) Weight: 8.4 lbs In every aspect, this model was designed and built to be an innovative state of the art guitar for its era, a top-of-the-line electric guitar. In terms of craftsmanship, Guild was more than up to the task. The fit and finish on the guitar is impeccable. It is still in excellent playing condition with everything working well and properly. ( it’s a 27 year old guitar) The EMG pickups, coupled with phase and coil tapping capabilities give it wide tonal range. The neck is straight and the bridge is adjusted for light touch action that is remarkably easy to fret. The medium jumbo frets show wear but they play fine. The ebony fretboard show a lot of ware marks in the right light, I think it looks cool and has no affect on playing. ( it’s a 27 year guitar) Cosmetically, this Nightbird II remains a gorgeous instrument with a particularly lovely Tiger Stripe maple top. However, it has been played a lot over its history and show plenty of honest playing wear when viewed close up. There are some tiny dings and swirls in the top and back. ( it’s a 27 year old guitar) It has a couple cracks in the fingerboard binding on the treble side of the neck at the 20th fret, and the 5th and 12th on the bass side. See pictures…… ( it’s a 27 year old guitar) I've done my best to photograph the guitar to capture the blems and the glory. Please look at all the pictures carefully as they offer the best description of the cosmetic condition of this instrument. Please note it’s a 27 year old guitar, is been played, its in great shape but its not Mint museum piece. The original Guild hardshell is also included. The case is in very good condition on the inside , but the exterior of the case shows much wear and tear on all its surfaces. the end case latches work, the center one is missing, but the case definitely shows how much use the guitar got in its earlier days. offered to the lower 48 USA states only. The guitar will be packed well and shipped fully-insured via UPS ground service. Ultimately, The Nightbird CUSTOM is an Awesome Guitar. It was made to be played and enjoyed, so it’s time to pass it on to the next owner. A terrific value for someone willing to forgive some minor cosmetic imperfections in exchange for a great and gorgeous instrument. Please buy with confidence as I take great care of anything I own and ship. I am available to answer any questions if needed, so please ask any and all questions before purchasing. Buyer is required to pay with PayPal within 3 days of check out. Will ship to the CONTINENTAL USA ONLY. NO INTERNATIONAL SHIPPING - Sorry!", "ItemID": "192760815233", "EndTime": "2018-12-22T19:05:25.000Z", "StartTime": "2018-12-17T05:06:41.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1991-Guild-Nightbird-Custom-Made-USA-/192760815233", "ListingType": "FixedPriceItem", "Location": "Des Moines, Iowa", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1927608152338080_2.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/a1kAAOSwkQhcFyt0/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjE5/z/HDIAAOSwo1lcFysC/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/dfcAAOSwPg9cFys7/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/754AAOSwqIhcFytK/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/DR8AAOSwQZVcFyuH/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/t54AAOSwW~JcFyuW/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNDgy/z/Pu8AAOSwrfRcFyvG/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/1sIAAOSw8kVcFyvX/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjE4WDEwNzc=/z/qj0AAOSwoEFcFyvt/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDgx/z/DEMAAOSwtvZcFywG/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/WTgAAOSwp3dcFywt/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzUxWDk5Ng==/z/Et8AAOSwwZxcFyw-/$_32.JPG?set_id=880000500F"], "PostalCode": "50310", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mtl68", "FeedbackRatingStar": "Blue", "FeedbackScore": 94, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1850.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1850.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "f***r", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 122}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "1991 Guild Nightbird  Custom, Made in the USA", "ItemSpecifics": {"NameValueList": [{"Name": "Body Material", "Value": ["Mahogany"]}, {"Name": "Brand", "Value": ["Guild"]}, {"Name": "Model Year", "Value": ["1991"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Nightbird"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Sunburst"]}]}, "HitCount": 85, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}