{"BestOfferEnabled": false, "Description": "Welcome! Please read entire description before bidding or asking questions! Winning bidder must pay for auction within 48 hrs of auction close. Bidders with less than 5 feedbacks, and/or multiple bid retractions,must contactme before bidding. I reserve the right to cancel bids from bidders with a sketchy bidding history. If you have questions, please ask before bidding! You are checking out a 87-88 Casio PG 380 Guitar Synth In tested working condition! All original as far as I can see, Floyd Rose with Wammy bar included but not pictured. Brand new set of D'Addario Regular Light EXL110-B25 strings just put on. Guitar great, a bit of scratchy noise on the pots that worked out when exercised. As far as midi sounds, they work but this was early technology for midi guitars and it was just ok as far as quality. Locks for string will be removed for shipping so that tension can be taken off the neck by loosening the strings. All will be in a ziplock bag in the case. Full manual can be downloaded here: http://mharding.net/wp-content/uploads/2016/05/Casio-PG380-Owners-Manual.pdf Cosmetically it is in excellent condition. Some light minor marks here and there but nothing crazy. This is in excellent vintage condition. One of the cleaner nicer ones I have seen here recently. Please see pics and judge for yourself! RETURNS I will accept returns up to 14 days from your receipt of item provided it's not as described and shows up here in the condition it left. I've had buyers try to swap their non-working components with mine before and then claim it doesn't work.It will have tamper proof tape on it. If that is broken, the return option is void. Auction includes the Casio PG 380 Guitar Synth with Hard Case I highly recommend using Uship for Very delicate heavy or bulky items. They come to me pick it up and deliver it to you safely. You must go to their website and setup an account, (it takes 5 minutes) and make the arrangements yourself. I have had great dealings with this service, but in no way am I responsible for damage during their handling. It is located in West Ft Lauderdale area. Just give them your location and approximate dimensions, for example, \"Drum set with hardware\" they take bids with drivers passing my area to yours, or you can set a price you are willing to spend for the transaction, It works and its easy! Costs less than UPS or Fedex for heavy or bulky items! I use a great deal of packing material to make sure everything arrives safely and this will be shipped in a strong box. . Please keep that in mind when calculating your shipping . Check out my feedback regarding packing! Yes my shipping may be more money then the other guys....but isn't spending a couple of bucks more, better than getting your merchandise damaged? My handling fee covers extra packing material, and or my time to find the best box for your item! FYI, If you pay fast I ship fast! International bidders are responsible for duties. Allshipping labels are being created through Paypal. When the label is made, Paypal will send you an email withthe tracking information for your order. If you haven't received the emailin a reasonable amount of time please make sure to check your SPAM folder. Payment is expected within 2 days of auction close. I accept PayPal only, for your protection and mine. If you don't have a Paypal account, please do not bid. Please note: I log all serial #'s so if you plan to purchase this for parts or swapping purposes then please don't even bother! Winning bidder must contact me within 48 hrs of auction close. If you have no feedback or multiple negative feedback, you must contact me before bidding or your bid will be withdrawn from the auction. If you have questions, please ask before bidding! My feedback rating is very important to me. So please contact me before leaving negative, or neutral feedback if you think your item has been represented incorrectly. I am only interested in a 100% positive experience for my buyers. Things can always be worked out. Thank you for looking. Paypal only within 48 hrs of auction close. _gsrx_vers_837 (GS 7.0.15 (837))", "ItemID": "183628968436", "EndTime": "2019-01-17T01:00:19.000Z", "StartTime": "2019-01-10T01:00:19.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1987-88-Casio-Ibanez-PG-380-Guitar-Synth-All-working-Japan-/183628968436", "ListingType": "Chinese", "Location": "Fort Lauderdale, Florida", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1836289684368080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA2M1gxNTk5/z/5OoAAOSwQZdcNoYT/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2M1gxNTk5/z/40cAAOSwcapcNoYT/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2M1gxNTk5/z/ENEAAOSwv0dcNoYV/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2M1gxNTk5/z/b6MAAOSw~slcNoYW/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2M1gxNTk5/z/Z7EAAOSwo6NcNoYX/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2M1gxNTk5/z/vHkAAOSwHAxcNoYY/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2M1gxNTk5/z/zpIAAOSwxHlcNoYY/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2M1gxNTk5/z/FhEAAOSwukZcNoYa/$_3.JPG", "https://i.ebayimg.com/00/s/MTU5OVgxMDYz/z/XyUAAOSwjkZcNoYa/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2M1gxNTk5/z/2uUAAOSwlEBcNoYb/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2M1gxNTk5/z/wsYAAOSwPuRcNoYb/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2M1gxNTk5/z/VMYAAOSwEqVcNoYd/$_3.JPG"], "PostalCode": "33321", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "protoolshd3-88", "FeedbackRatingStar": "Red", "FeedbackScore": 1072, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 3, "ConvertedCurrentPrice": {"Value": 735.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 735.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "3***e", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 4}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "1987-88 Casio Ibanez PG 380 Guitar Synth All working! Japan", "ItemSpecifics": {"NameValueList": [{"Name": "Country Of Manufacture", "Value": ["United States"]}, {"Name": "Brand", "Value": ["Casio"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Model", "Value": ["PG-380"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}]}, "HitCount": 247, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=19142343", "StoreName": "protoolshd3-88"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 745.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Middle East", "Oceania", "Southeast Asia", "RU"], "GlobalShipping": true, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}