{"BestOfferEnabled": true, "Description": "If your'e looking for a true collector's guitar, then your search is over!Out of only 300 of these beauties that were ever produced in 2007, this one is #22. It's the lowest production number I've ever seen for sale and one of the only ones, if not THE ONLY ONE up for sale presently in the U.S. I purchased the guitar from a collector and when I got it, it appeared to be in unplayed condition. Since Iv'e owned it, I have pulled it out 3 times and it has no more than an hour or so of play time on it. When I did play it, I was very gentle with my attack and fret hand. Yes! Of coarse it sounds and plays AMAZING!! Unlike many of the models presently for sale, this piece actually includes ALL the original accessories in unopened condition. You will notice that the number on the headstock and the painting do not match. 022 on the guitar and 057 on the painting. For some unexplained (and not-too-smart) reason, these items were never number matched when they were originally shipped. I never came across any that had matching numbers. All of the blemishes and apparent wear you see in the photos were placed there intentionally by the Custom Shop based on the research of the original. The new lucky owner will be shipped two packages. The guitar in the original box and the accessories also in the original box. I will personally pack them with the care and attention that collector Gibsons require (which is more than most). I will also cover the shipping, so please keep this in mind when bidding/making an offer. Below is the information about the guitar and its history. \"I can make a guitar speak. I can make it howl and move. I was rhythm guitarist. It's an important job.”– – John Lennon Whenever John Lennon played a Gibson, it became more than a guitar. It transformed into a powerful instrument of change. Whether issuing a desperate cry for \"Help!\" with his Gibson J-160E acoustic (a guitar he originally nicked from George Harrison), inciting political activism in \"Revolution\" on his prized Epiphone E230TD Casino (a guitar famously employed during the rooftop session of the Beatles' Apple headquarters), or during one of his last public appearances, at which he played his customized Gibson Les Paul Junior, Lennon's choice of guitars were an essential extension of his unique personality and creativity. In 1999, Epiphone created two limited-editions John Lennon Casino models, the Epiphone John Lennon \"65\" Casino (in Vintage Sunburst) and the Epiphone John Lennon \"Revolution\" Casino (stripped to its natural finish). Both guitars were immediate hits with players and Beatles' fans alike. And in 2002, Gibson Montana introduced the Gibson John Lennon J-160E Peace Model, a limited edition replica of the 1962 guitar that Lennon used faithfully while recording, in movies, and for live performances. The Gibson Custom Shop has now added to the prestigious line of John Lennon Gibsons, the Gibson John Lennon Les Paul, a faithful reproduction of the modified 1950s Les Paul Junior Lennon played at his unforgettable performance on August 30, 1972 at New York City's Madison Square Garden to benefit the One to One Organization, a group that helped children with learning disabilities. When Lennon bought the single-cutaway Gibson Les Paul Junior, it was still in its original factory condition—Tobacco Sunburst finish, single P-90 pickup, wraparound tail piece, and Kluson tuners—but he wanted it modified. As he told New York guitar luthier Ron DeMarino, he wanted a \"humberdincker\" pickup in it—obviously referring to a humbucker. (Somewhat surprisingly, the songwriter and musician who had helped usher in a cultural renaissance was blissfully unaware of many guitar specifics.) \"I'm a rhythmer,\" he would say. \"I don't know anything about these things.\" Instead of a humbucker, however, DeMarino installed a Charlie Christian pickup in the neck position. First used on the Gibson ES-150 in 1936, the Charlie Christian pickup, with its narrow string-sensing blade, was noted for its clear and powerful sound. Other changes to the guitar included removing the wraparound tailpiece, plugging the holes, and installing a Gibson tune-o-matic bridge with a stop tailpiece. Lennon was delighted with the results, but he had one final request: Sand off the Sunburst finish. When Lennon played the guitar at Madison Square Garden, the guitar's body was bare wood mahogany. Pull Quote\"It is such a special guitar,\" says Edwin Wilson, Gibson Custom's Historic Program Manager, who personally oversaw every aspect of the Gibson John Lennon Les Paul. \"Of course, any guitar the Beatles played is of significance. But because this was such a high-profile concert for John, his return to the stage after several years, the guitar is especially notable. Beyond that, there's the modifications he made to it—in and of themselves, these made this guitar an obvious choice to reproduce.\" Once Yoko Ono gave her enthusiastic endorsement of the project, Wilson flew to the John Lennon Museum in Japan, where the original instrument is on display, to inspect the guitar and document its unique characteristics. \"The museum's curator laid it out for me,\" says Wilson, \"and I went about taking pictures and recording various measurements. Yoko had a couple of stipulations: I couldn't remove or loosen the strings, and I had to wear cotton gloves when handling the guitar.\" Wilson recalls being overcome with a sense of awe when holding the original guitar. \"I've held a lot of special guitars in my time,\" he says, \"but this one was played by John Lennon himself at Madison Square Garden. Come on—who even gets close to a guitar like that every day?\" Among the peculiarities of the original Les Paul Junior, Wilson noted, were the frets: They were in unusually good shape. “Pre '57, Gibson made very thin frets, so if you had a very heavy fretting technique, or if you bent strings a lot, you’d have a lot of wear and tear. Nothing like that existed on the Lennon original. That leads me to believe that he played with a very light touch with his fretting hand. Another factor could be the extremely light gauge strings he used—.009s, I believe; they were very thin. It’s funny: John performed with such force, but I think it came from his entire body; he didn’t beat his strings to death.” (It should be noted that the John Lennon Les Paul is strung with a set of .010s. “That’s our one change,” says Wilson. “Most players prefer a little heavier gauge.”) While inspecting the original, Wilson was allowed to remove the back plate and section in front that covers the pickup magnets and toggle switch. Photos were taken so that the guitar builders at the Custom Shop could accurately reproduce the pickup wiring. According to Wilson, including the Charlie Christian pickup was a “have to.” Being that it was a unique modification that Lennon himself insisted on, to reproduce the guitar in any other fashion, in Wilson’s words, “would’ve run counter to the spirit of Lennon’s wishes.” After performing at Madison Square Garden, Lennon had his original Les Paul Junior refinished in Cherry, and the John Lennon Les Paul is representative of this alteration. “Getting the color to be exact is a real science,” says Wilson. “A lot of research and development goes into the aging process of what we do. We use a variety of tools and stains, not to mention a special buffing process. Plus, we have a special glaze that changes the patina of the color—it literally makes the guitar look old!” Various dents and dings have been scrupulously recreated; chief among them are Lennon’s scratch marks between the Charlie Christian pickup and the top cutaway. \"It’s such a distinctive mark,\" says Wilson. \"You look at it and think, Now, how would that ever happen? But that’s what separates John Lennon from everybody else. He had his own style of playing.\" Included in the purchase of the Gibson John Lennon Les Paul is a Custom Shop case, a certificate of authenticity, a custom care kit, and a signed Lennon print by famed artist Allison Lector. \"The bottom line is very simple,\" says Wilson. \"It’s a superb instrument. It plays like a dream and it sounds incredible. Not only that, but when you hold it, you feel like you own a piece of history.\" Only 300 made! - instant kharma collector's item.John Lennon was always a fan of Charlie Christian, and he also enjoyed tinkering with his guitars. So when he met New York luthier and guitar repairman Ron DeMarino in the early '70s, he asked him to take his 1950s Tobacco Sunburst Les Paul Junior and add the pickup made famous by the jazz legend. Later, at Lennon's request, DeMarino sanded off the 'burst finish and added the Tuno-O-Matic bridge and stop tailpiece. On August 30, 1972, Lennon used his customized Les Paul in its new, raw wood state during his famous benefit concert at New York's Madison Square Garden. Today, the guitar is on permanent display at the John Lennon Museum in Japan. Histroy of The John Lennon Les Paul Junior By Andy Babiuk, author of the book<em.beatles gear John Lennon”a name known worldwide as an icon, musician, and poet, the voice of a generation, and without a doubt, one of the most important and influential figures in rock 'n' roll history. It was John Lennon and the Beatles that forever changed the world of music and pop culture. As with all great musicians, the tools of the Beatles' trade at times became as important as their music. The instruments they chose helped to reflect their thoughts, ideas, and even lifestyles. The everlasting images of Lennon”with his Gibson J”160E guitar during the height of Beatlemania, or his Epiphone Casino on the rooftop of the Beatles' Apple headquarters, or his modified Gibson Les Paul Jr. at his famous 1972 Madison Square Garden concert”have all left a lasting impression on our minds. John Lennon is so closely associated with these instruments that the instruments themselves have become extensions of Lennon's personality. Lennon solo After the break”up of the Beatles, the prolific John Lennon immediately embarked on his successful solo career, recording and collaborating with wife Yoko Ono. It was during this time, in the early '70s, that John Lennon expressed his passion for New York City. \"It's the greatest place on earth,\" he said. \"I love the place 'cause this is where the music came from; this is what influenced my whole life.\" Soon after, on September 3, 1971, the Lennons left the U. K. for New York, never to return. Lennon enjoyed New York's artistic environment. \"There are these fantastic 20 or 30 artists who all understand what I'm doing and have the same kind of mind as me,\" he said. \"It's like heaven.\" Enter Ron DeMarino Ron DeMarino, a New York luthier known for his guitar repair and restoration work, met the Lennons in late 1971. \"I was at one of the guitar shops on 48th Street and overheard a guy who was looking for an old vintage amp for a friend,\" DeMarino recalls. \"The store didn't have that style of amp, but I did, so when the guy left the shop I told him that I had one to sell. He told me that it was for John Lennon, and I of course didn't believe him. The guy introduced himself as Claude and said he worked for Lennon. He gave me his phone number and asked me if I was really interested in selling the amp to call him. So I got back to my shop and gave Claude a call. Sure enough, after making some arrangements, I found out that the amp was indeed for John Lennon. \"That's when I got to know John, when he was still on Bank Street. It was around the time he was working with Elephant's Memory, and he was hanging around with their guitarist Wayne Gabriel, who they use to call Tex. They found out that my business was restoration work on guitars, so they had me start going through the many guitars that had to be worked on. I had worked my way into being sort of a confidant, in a good position with them. I was very straightforward; I was not ga”ga being around John or Yoko, so I guess they kind of liked that. I stayed doing work for them for a while. It was kind of a relaxed environment. There was never any stress or forced attitudes so anything that John told me was candid and truthful.\" DeMarino's relationship with John Lennon continued to grow. \"I started advising John on certain sales of guitars, just sort of advising him before any purchases were made as to whether it was a good purchase or not, that type of thing,\" he says. \"This was on vintage guitars, because a lot of times guys were trying to hock stuff to them. There were a number of very questionable pieces that I negated the sale on. I remember one time I helped John find a Cherry Les Paul Junior for his son Julian. There was a lot of stuff like that.\" Working Classics Hero DeMarino worked on many of Lennon's guitars and made modifications to them, too. \"I would meet John at the record plant, or John used to go down to Butterfly Studios”that's where he used to rehearse,\" DeMarino says. \"It was a building off of 10th Street, by the West Side Highway, four blocks from their apartment. It was a plain building in an industrial area, but inside there was a loading dock, and they had a big rehearsal studio in there. They were building a recording studio and a mobile recording studio in the back of a bread truck. So I used to get a call, and they would say, 'John wants you to meet him at Butterfly at 10 p.m.' I would meet him and he would give me his guitars to work on. We worked on so many of his guitars.\" Les Paul plus Charlie Christian One of the guitars Ron DeMarino was given to work on was a 1950s Gibson single”cutaway Tobacco Sunburst Les Paul Junior. \"I found out by sheer exposure, and by working on his instruments, that John messed around with his guitars a lot,\" says DeMarino. \"When I got the Les Paul Junior from John, it was in its original factory condition”Tobacco Sunburst finish, single P”90 pickup, wraparound tail piece, and Kluson tuners, but he wanted it modified. He didn't know much about guitars. For instance, he wanted a guitar with \"humberdincker\" pickups in it. Obviously he was referring to humbucker pickups, but he didn't know. He would say, 'I'm a rhythmer, you know? I don't know anything about these things.' I would try to talk him into getting a better sound out of this or that”like, 'Why don't you put these pickups in? You'll get a better sound.' That's when we did his Les Paul Junior, and I put a Charlie Christian pickup in . \"We put it in the neck position,\" says DeMarino. \"Installing the Charlie Christian pickup involved extensive routing and major modification to the back of the guitar. We left the Gibson P”90 pickup in the guitar and added a toggle switch wired for pickup selection. When I got the guitar back to John he liked the way it sounded.\" Co-hosting with Mike Douglas John and Yoko co”hosted The Mike Douglas Show on American television, February 14 ” 18, 1972. One of Lennon's guests was his hero Chuck Berry. John used his newly modified Tobacco Sunburst Gibson Les Paul Junior with the Charlie Christian pickup when he jammed with the great Chuck Berry as the two performed \"Johnny B. Goode\" and \"Memphis.\" More LP mods Soon after, DeMarino again received the Les Paul Junior back from Lennon for more modifications. \"John liked the way the Junior played and sounded but he thought it didn't stay in tune,\" DeMarino says. \"We talked about it, and I decided to remove the wraparound tailpiece, plug the holes, and install a Gibson Tune”O”Matic bridge with a stop tailpiece. I also took off the old Kluson tuning pegs and put on a new set of tuners. Nobody thought twice about modifying an old guitar in those days. It wasn't like today, where guys are worried about wrecking the value of a vintage guitar. We would just do whatever had to be done to make a guitar function better. And that's what I did with his Les Paul Junior. John also asked me to sand off the Sunburst Finish and put the guitar to bare wood, the mahogany. That's the last I worked on it. I think he liked the guitar because he ended up using it at the big show they did in New York at the Garden.\" JL at MSG On August 30, 1972 John Lennon used his customized Gibson Les Paul Junior in its new raw wood”modified state during his famous live performance at New York's Madison Square Garden to benefit the One to One Organization, a group that helped mentally retarded children. This is how John Lennon's modified Gibson Les Paul Junior exists to this day. It is part of the Lennon estate and is currently on display at the John Lennon Museum in Japan.FEATURESAuthentic reproduction of John Lennon's famous Les PaulIncludes Charlie Christian pickup in neck position, as preferred by LennonMahogany body and 1”piece mahogany neck with long tenon neck jointLimited Edition of 300 worldwideIncludes Custom Shop case, Certificate of Authenticity, custom care kit & signed Lennon print by famed artist Allison LefcortSPECIFICATIONSBody & Hardware:Solid mahogany body & aged chrome hardwareLightweight aluminum tailpiece with two thumb wheels on treble side of bridge,one on bassWraparound holes plugged & ABR-1 added; Stopbar moved back3-way Switchcraft switch added to normal Les Paul positioningNeck & Headstock:1-piece mahogany neck with long neck tenon22 fret rosewood fingerboard and pearloid dot inlaysEarly '50's rounded neck profile24 3/4\" scale length, 1 11/16\" nut widthSchaller tunersElectronics & Strings:P-90 single coil pickup in bridge position & Charlie Christian pickup in neckpositionPickguard modified for Charlie Christian pickup1 volume, 1 tone controlVintage Reissue .010 stringsIncludes Custom Shop case, certificate of authenticity, andsigned Lennon print by famed artist Allison LefcortSerialized LENNON001-300This limited edition guitar includes:Signed print on canvasby famed artist AllisonLefcort.Certificate of Authenticityand the Andy Babiuk article\"The Making of the OriginalJohn Lennon Special\" framedby a miltary-style caseresembling the jacket wornby John at The MadisonSquare Garden concert inApril 1972.", "ItemID": "202359299085", "EndTime": "2018-12-26T21:51:44.000Z", "StartTime": "2018-07-03T20:03:35.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/John-Lennon-Gibson-Les-Paul-Junior-2007-22-300-/202359299085", "ListingType": "FixedPriceItem", "Location": "Asheville, North Carolina", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/2023592990858080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTQ1N1gxNjAw/z/vqkAAOSwuVZbO8xI/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/7wsAAOSwoudbO8xL/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/0xMAAOSwo8pbO8xK/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/aGEAAOSwZrdbO8xK/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/1eIAAOSwil5bO8xK/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/qnYAAOSwxDtbO8xL/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/e2gAAOSw5ItbO8xL/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/oqMAAOSwT69bO8xJ/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/fcgAAOSwCKVbO8xL/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/ChsAAOSwTgdbO8xK/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/vOsAAOSwrj1bO8xH/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/X78AAOSwaqtbO8xI/$_32.JPG?set_id=880000500F"], "PostalCode": "28803", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "lostredwax", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 121, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 4199.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 4199.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "9***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 456}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "John Lennon Gibson Les Paul Junior (2007) #22 of 300", "ItemSpecifics": {"NameValueList": [{"Name": "Body Material", "Value": ["Mahogany"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model Year", "Value": ["2007"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Les Paul Junior"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Features", "Value": ["All Original Accessories Included"]}]}, "HitCount": 2059, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}