{"BestOfferEnabled": false, "Description": "NO RESERVE! Priced to sell. I am selling this, my Shop Black Yamaha Revstar RS502, with the Gator hardshell case I purchased separately. The guitar typically sells new with a low end Yamaha gig bag included. I kept and will include all the case candy and receipts. I have also had a complete set up and cleaning performed by a Sam Ash guitar tech to ensure perfect intonation and action. It has never been played outside an apartment. The guitar and case are in impeccably excellent condition, with the only damage outside of the extremely minimal and normal signs of wear are very minor screwdriver nicks on the bridge screw slot edges, which I have pictured up close for your inspection and as you can see, they aren’t particularly noticeable and do not effect the screw function whatsoever. My Review/Experience of the Guitar: The build quality, tone and style of this guitar are satisfyingly and surprisingly wonderful. Yamaha really outdid themselves with this new line of Revstars. The custom voiced YGD P90 pickups are delicious sounding in every position. The “dry switch” provides an additional menu of slightly thinner spank and quack tonal options you will definitely use. The design somehow exudes both vintage character and clean modernity at the same time. The solid mahogany of the body and set neck have a weight and sustain that couples that of a late 50’s Gibson but with the workhorse reliability of modern fabrication. The matte finish of the maple capped top and hardware set over cream binding are just beautiful to behold, and the finish is designed to wear uniquely to each player (think of it like a pair of high-end denim jeans). The “shop black” tonehue reads as slate grey, especially against the normal black triple ply pickguard, and in certain lights can give off a slight nuance of a subtle dark grey/blue/green. By the way, I’m almost reconsidering selling this as I write the description haha. I just need the funds unfortunately. The guitar retails new for $650 and the case retails for $120, totaling $770 (without tax). The value here is truly unbeatable. I require immediate payment and ship quickly. You can rest assured, my pictures and description provide a very accurate depiction of the instrument and its condition. Here is the Yamaha Stock Verbiage as well: YAMAHA REVSTAR RS502 Japanese minimalist style is simple to describe but hard to capture. With just enough of everything you need, and nothing that you don’t, the RS502 is exactly what it should be–beautifully simple. Pickups Designed from the ground up, Revstar features specially wound YGD pickups that are perfectly matched to each guitar. More than 50 prototype pickups were tested featuring different combinations of wire, windings, magnets and base plates. Eventually, a spec was settled on for each guitar model and the Revstar pickup series was born. This model features VP5 pickups (8.3k DCR) with Alnico V magnets, German silver baseplate and plain enamel wire for clear, vintage tone with bite. Dry Switch Designed especially for Revstar, Yamaha's proprietary Dry Switch gives you the versatility of a coil split, but with a tone that's miles ahead. Using a passive filter circuit painstakingly designed to give the perfect frequency response, the Dry Switch filters out low frequencies to give the punch and clarity of a single coil pickup minus the inevitable hum and hollow tone often associated with split humbucking pickups. And because it's a filter circuit, the Dry Switch works on both humbuckers and P90s for a totally unique, usable tone. Custom Hardware Inspired by the stripped-down custom Café Racer motorbikes popularized on the streets of London in the 1960s, Revstar's hardware captures the high-performance, individual character of those bikes with a wide range of totally unique, customized hardware. From the unique pickup covers and raw copper scratchplate on the Revstar Professional, to the totally custom floating aluminum tailpiece on the RS502T, each and every component is perfectly calibrated for great performance and unmistakable style—capturing the very essence of a Café Racer. Sound Image Inspired by raw power and performance, Revstar's sound is as unique and bold as its aesthetic. Working to evoke a visceral, unbridled power and an individual, organic tone that is made possible only by considering every detail, Yamaha's engineers chose materials carefully and designed custom pickups to make sure Revstar sounds as stunning as it looks.", "ItemID": "173618562487", "EndTime": "2018-11-06T15:40:41.000Z", "StartTime": "2018-11-01T15:40:41.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Yamaha-Revstar-RS502-Shop-Black-Electric-Guitar-W-Hardshell-Case-Barely-Used-/173618562487", "ListingType": "Chinese", "Location": "Boston, Massachusetts", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1736185624878080_2.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/me4AAOSw4vpb0eHL/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNDg0/z/pi4AAOSw1i5b0eG6/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/hbAAAOSwjNdb0eHA/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/mrAAAOSwBgpb0eHF/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/bzYAAOSw1CBb0eHI/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/ccoAAOSwjrFb0eHD/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/cXUAAOSwSxRb0eHB/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/NocAAOSwmFhb0eG9/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/WJoAAOSwfPlb0eHK/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/YLcAAOSw1KRb0eG7/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/DlwAAOSwBgZb0eG-/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/YVQAAOSw7pVb0eHG/$_12.JPG?set_id=880000500F"], "PostalCode": "02215", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "axeman0509", "FeedbackRatingStar": "Yellow", "FeedbackScore": 26, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 419.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 419.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "w***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 256}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Yamaha Revstar RS502 Shop Black Electric Guitar W/ Hardshell Case - Barely Used", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Yamaha"]}, {"Name": "Model Year", "Value": ["2016"]}, {"Name": "Non-Domestic Product", "Value": ["Yes"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Model", "Value": ["Revstar"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Soundboard Style", "Value": ["Flat Top"]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "Body Material", "Value": ["Mahogany", "Maple"]}, {"Name": "Product Line", "Value": ["Yamaha Revstar"]}, {"Name": "Custom Bundle", "Value": ["Yes"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["RS-502BLG"]}, {"Name": "Size", "Value": ["Full Size"]}]}, "HitCount": 166, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 424.0, "CurrencyID": "USD"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}