{"BestOfferEnabled": false, "Description": "Powered by Frooition All Items See our eBay store for more great items >> Shop CategoriesGift ItemsCollectable & VintageYairi & AlvarezEpiphoneFenderGibsonGodinGretschHagstromHamerHofnerLarriveeMartinPeaveyPRSTakamineTaylorWashburnParts & AccessoriesAcoustic GuitarElectric GuitarArch Top Hollow body ElectricsCases & GigbagsAmplifiersMicrophonesNon Music/Instrument SpecialsAcoustic ElectricOvationSpecials & Best offer itemsParkerBanjoGuildFraming Posters Case StickersMandolinApparel For Players12-String GuitarsCatalogs & ManualsAmplifier CoverDuesenbergSemi AcousticSanta CruzHigh End LuxuryEKOGoyaKayKramerLunaJacksonsilvertoneSquireTiescoOscar SchmidtO'CuilleainAriaD'AngelicoPedals Marked Down ClearanceMusic Man ElectricDeArmond/GuildTacomaEVHNationalResonatorRickenbackerGibson Parts & AccessoriesGifts by GibsonPIckupsPickup Mounting RingsMachine HeadsControl PotsBridgesRestoration & care kitsFull Zipper Top Line HoodieGuitar StrapsCablescables/cordsGibson Player HoodieGibson Player Black T-ShirtEpiphone parts/accessoriesGretsch Parts & AccessoriesIbanezDobroAAA JUST STUFFcomputerTennissportstoolsHeritage of Kalamzoo MIPianoG&LStratocasterTelecasterMustangIdeal GuitarBass GuitarMusicvoxFreemanESPCustom ShopHarmonyHeritageAlvarezSeagullBurnsYamahaEastwoodTunerHoliday ClearancePower suppliesJust StuffDigital TunerHuss & DaltonThe LoarGitaneLine 6DeanMosriteGarcia Gibson Acoustic J-45 Vintage Sunburst acoustic/el The New Cutaway edition Item Description CLOSEOUT Yessss!! A J-45 Cutaway! Known as \"The Workhorse,\" Gibson's J-45 is one of the best-known acoustics in the music world. The J-45 Cutaway acoustic-electric guitar's round-shoulder dreadnought shape gives your music full, balanced expression, warm bass, and excellent projection, while its cutaway design provides full access to the fingerboard. The J-45 Cutaway features all that rich tone, thanks to its AA-grade Sitka spruce top and a solid mahogany body. And, for unbelievable onstage tone, there's an LR Baggs VTC pickup system installed on the Gibson J-45 Cutaway. Get yours today. Gibson J-45 Cutaway Acoustic-electric Guitar at a Glance: \"The Workhorse\" features choice tonewoods for incredible tone Rosewood fingerboard with rolled edges and dot inlays Get amazing sound onstage courtesy of LR Baggs VTC electronics \"The Workhorse\" features choice tonewoods for incredible tone Known as \"The Workhorse,\" the Gibson J-45 body style is among Gibson's most beloved. This particular workhorse features a superb blend of tonewoods, giving you rich, strong sound - day in, day out. The J-45 Cutaway features a AA-grade Sitka spruce top for presence, while pattern-grade Honduras mahogany adorns its back and sides. Other touches include hand-scalloped, radiused top bracing, a tapered dovetail neck joint, and a single-ring rosette with 3-ply binding. Rosewood fingerboard with rolled edges and dot inlays The Gibson J-45 Cutaway's fingerboard comprises high-grade rosewood, which is personally inspected and qualified by Gibson experts before it enters the Gibson factories. It's a resilient and durable wood, making way for a balanced and stable fingerboard and giving each chord and note enhanced clarity and bite. The dot inlays on the J-45 are made of genuine mother-of-pearl and are added to the fingerboard using a special Gibson process that eliminates gaps and doesn't require fillers. What's more, the J-45 Cutaway's fingerboard boasts a rolled edge that's lightly beveled, which enhances the instrument's smooth playability. Get amazing sound onstage courtesy of LR Baggs VTC electronics The Gibson J-45 Cutaway comes with LR Baggs' popular VTC acoustic pickup system - a popular choice among Sweetwater's acoustic guitarists. This system features a low-profile under-saddle transducer that's proven more stable and durable than many standard ribbon-type pickups. Its sleek and effective design removes unnecessary internal components to enhance the coupling between the pickup and the guitar and improve the sensitivity of the transducer for a robust, lively, and natural acoustic sound with excellent dynamics and delicate high end. Combined with an onboard preamplifier with an unobtrusive and removable volume control mounted just inside the soundhole, the VTC gives your Gibson Acoustic J-45 Cutaway the amplification you need, with zero compromises for tone or convenience. Gibson J-45 Cutaway Acoustic-electric Guitar Features: The classic acoustic Workhorse Cutaway design provides full access to the fingerboard Solid Sitka spruce top offers great projection and tone Solid mahogany back and sides offer warm, round sound LR Baggs VTC electronics transfer every nuance of your tone to your PA or amp Softened fingerboard edge adds increased playing comfort New finishing oil maximizes the tonewoods' natural vibrancy Delivers the premier tone - and a timeless appearance - J-45 series! String Type Steel Number of Strings 6 Body Shape Round Shoulder Dreadnought Left-/Right-handed Right-handed Color Vintage Sunburst Finish Nitrocellulose Lacquer Top Wood Sitka Spruce Back & Sides Wood Mahogany Body Bracing Traditional scalloped X-bracing Binding Multi-ply top, single-ply back, multi-ply single ring rosette Neck Wood Mahogany, hide glue neck joint Neck Shape Slim taper Radius 12\" Fingerboard Material Rosewood Fingerboard Inlay Mother-of-pearl dots Number of Frets 20 Scale Length 24.75\" Tuning Machines Grover Nickel Rotomatics Bridge Material Rosewood Nut/Saddle Material Tusq/Tusq Nut Width 1.725\" Electronics LR Baggs Element VTC Strings Lights 12-53 Case Included Gibson USA Hardshell case Important Buyer Info Important Buyer Info Payment S&H Rates/Limits Cancellation/Returns About Us Important Buyer Info Exemplary Service to you: Promises do not count; what does count is our history of always keeping our promises. Please take a moment to browse our 4,400-plus perfect feedbacks and look forward to receiving superior service. When you buy/win this, you will appreciate our unmatched after-purchase service. We \"Stay with you\" until all elements of the transaction conclude to your satisfaction. Description Policy: Used guitars that are listed as \"Pristine\" are perfect. They are \"as new\"so nothing more to talk about. \"Mint\" are 9.0 to 9.95 condition. In our opinion it is very difficult for a used guitar to be a perfect ie; may have insignificant fine, slight rub marks on the back, pick marks etc. We do describe any meaningful issues at the top of the listing. If there are minor aesthetic issues such as pick marks or not-thru-the-finish rubs and scratches; expect them. We always note if a case or other accessories is included. Cases and other accessories are not included unless stated or pictured in listing. If unclear, please email questions before you buy, Our replies are frank. We often get the question \"why do your prices change?\" Our prices do not \"change\" but do get temporarily lowered when selected for eBay Markdown. When the Markdown sale ends, eBay automatically returns to the normal listed price. The sales rarely are for the duration of the listing ie; our listings are 30 day listings but Markdown sales end in 7 to 10 days. Do not lose out; The sale time remaining is shown at the top of the listing where the pricing info is displayed. We cannot honor sale prices after the sale ends. Important Information About Our Special Sales: We use eBay's 'Markdown Manager' to put select items on Sale reducing the listed price. All our listings display the 14 day return policy but once an item is marked down or on closeout, it is As noted in the eBay published return policy information at the top of the listing, Markdown sales purchases are final. About Pricing decisions:When possible, for comparison, we show retail prices supplied by the manufacturer (\"MSRP\"). Vintage and collectable prices are researched in buyer's guides, eBay prior sales, other online sales and highest prices found for similar items. We have been awarded highest status in which we take great pride. It is awarded for adhering to eBay high standards, for our high level of service, for 4,400+ perfect, enthusiastic feedbacks, for provided candid, articulate guitar descriptions and, above all else for our respect for you! Our customers exhibit the same high standards when submitting a best offer, buy it now or having the high, winning bid. All of these are your promise to honor ebay policy and pay within the 3-day time frame. We believe in you and work really hard to be sure You can believe in Us! Best Offer Sales (\"OBO\"): From time-to-time select-guitars are listed giving you the option to make an offer. This adds some fun and gives you the opportunity to affect the price you buy it for. Obviously we cannot sell at less than we pay for an item but if you make a reasonable offer, leaving some profit, most likely Your offer will be accepted. Your OBO will be responded to immediately. . . We do not play one eBayer off against another. You offer will never be declined, it will be either accepted or get a counteroffer. Please note: OBO or Marked down sale items are all sales final and cannot be returned. Once you make the purchase, it cannot be cancelled. Ebay will respond to the unpaid purchase and if it remains unpaid will result in a non-payer strike which can result in a loss of your eBay privileges. Guitar set ups and strings are not warrantied since rough handling, travel/shipping can affect the setup. This is especially so if being shipped through many zones and atmospheric differences. Prior to listing, Guitars are setup to guitar manufacturer's specs but you should expect to need to set up upon arrival. Most listings use the specification releases of the manufacturer. We assume no responsibility for changes made by manufacturer. . . do not rely on posted specs. Unless otherwise noted or when the quantityis greater than 1, The Guitar pictures used in the listing are always of the actual guitar you will receive. Always rely upon the pics over the printed specs. We no longer list serial Nos. due to the proliferation of knock-offs using stolen serial Numbers. Email for serial number sufficient to check guitar manufacture date. *** exception: new and mint accessory items we may use stock photos, never for guitars. International Buyer Policy: Beginning this 2016, CITES regulation surrounding the international shipment of rosewood instruments has increased s&h costs for international shipments. It is required a CITES certificate be provided for each guitar containing Rosewood. Upon arrival postal and or customs may charge you brokerage, duty, VAT, tax, oversize charges, etc. for which you are responsible. Each country has package size restrictions. Packages refused by your country and returned/received back by GuitarStable will receive a full refund of the purchase price less the s&h since s&h is not refunded by usps. Most countries have loss/damage coverage limits, usually 2500usd, if loss/damage occurs we assume no responsibility for amounts in excess of these limits. Inquire if a concern. Due to the higher costs as well as the higher risks involved in international handling, except as noted, we do not accept returns from international buyers. We are happy to work with international buyers but need you to recognize that, relative to domestic shipping, international s&h has greater costs for packaging, documentation and handling. In addition, upon arrival you may have paid duty, VAT or other tax for which GuitarStable is not responsible. It is due to these difficulties and risks that we do not accept international returns. Please note: Canada. Hawaii, Alaska, Puerto Rico, and other U.S. possessions Inquire for rates. Please inquire. Payment Payment If you PREFER PAYMENT by American Express, Visa, MasterCard or Discover we are happy to offer our approved Secure Merchant Account to make your payment. To get the credit card secure payment form, after you clicked on buy it now and before you click on pay now, Email us requesting the form. Based upon our experience, Your credit card is the safest payment because your credit card company's first allegiance is to you Not The Seller. If you ever have a paypal issue, you will then wish you decided to trust your credit card. S&H Rates/Limits S&H Rates/Limits Our primary shipper is USPS. You are free to choose your preferred carrier with any additional costs borne by you. S&h rates are based upon oversize Dimensional Weight plus high value insurance. To see specific s&h costs open the 'Payment and Shipping' tab at the top of the listing. Email GuitarStable for shipping charges to Canada, Hawaii, Mexico, Alaska. Puerto Rico and other North American locations. You may also get more specific information clicking on \"Ask Seller A Question\" tab. Domestic Shipping time: Economy s&h leaves our warehouse in 3 to 5 business days. Standard ships in 1 to 2 days and Expedited Ships the first Business day after payment. We work to keep s&h cost low- If cost is important to you please choose economy. If you choose the faster premium s&h please do not penalize us, for the choice you made, in the shipping ratings. Please remember that any feedback lower than a 5 Ebay rates as a negative. We strive for your awarding us all \"5's.\" If there is a problem email us before you do feedback. We Strive for your Enthusiastic Feedback GuitarStable is a Worldwide safe shipper. eBay demands tracking information be available so International s&h options are Standard and expedited to insure you receive door-to-door tracking. International buyers are responsible for all the taxes required by their government. Due to Safety, taxes and other costs International all sales are final and may not be returned. Cancellation/Returns Cancellation/Returns We accept returns per the following conditions: Returned product and retail packaging must be same as shown in auction pic. For authorization, Email us within 10 days. Item must be shipped within 14 days from purchase. Please do not ship unless emailed to do so. Returns must ship prepaid, insured and arrive safely. Regardless of return reason, seller s&h costs both ways (including the amount we have paid for s&h) are deducted from refund. Markdown sales are final & not eligible for refund. Restocking fee is 10% (16.00 min). Prior to shipping, all our products are inspected. If the product arrives with damaged packaging, please check the product, and if damaged, report it to your post office to have them return the product. Once you have purchased or won an item you are expected to complete the transaction. Under no circumstance do we accept cancellation after purchase unless Ebay policy provides for such. Those who do not complete the transaction will be reported to Ebay and receive a non-payer strike per eBay policy. About Us About Us We have been serving you since 1996. We are focused on really good guitars, pedals and accessories, at really good prices. Our Customers tell us they feel we are a special kind of dealer, more of a neighborhood Guitar store than one of the Biggies. We are liked for our small footprint. We are a longtime guitar and accessory provider for players and collectors. We sell only online and limit our Guitars and other items to very special & quality items. Browse our feedback. . . As do the thousands of others we've served, we think you will like our offerings, prices and, definitely our service. We are open to working with you when you want to trade in your guitar(s) and accessories and are happy to provide quotes. Our trade in rates are commensurate with the industry's leading dealers. We respect when you want to make an offer and accept offers that are reasonable. You may want to email for a copy of the trade in policy. We like the idea of letting you help set the price. We also hate disappointing so, when you are going to make an offer consider \"reasonable\" is defined as a offer price that includes profit. Margins on guitars listed are relatively low. Offers that are \"Low-ball\" won't work since to accept such an offer would not be a really good business model to follow. This is especially true when we have already marked down a guitar. The being said, if there is room for an acceptable profit in an offer, we will accept that offer. We have perfect feedback most of which commend our integrity, sterling, very fast service and fair pricing. We have also been a pioneer in services like layaway (eBay now does not permit us to offer it) super-safe, super-fast shipping, responding to requests to find special guitars, etc. You will want to look for the eBay Markdowns. The markdowns are great buys and all Markdowns sales final. Since anyone can brag, we'd like to invite you to shop us and give us the chance to prove we deserve you. Thanks We Do Not Have A Brick & Mortar Location - We Strictly An Online Seller Helpful Links Add to Favorite Sellers Sign up to Newsletter View Feedback Contact Seller Visit seller's eBay Shop About Seller Page More Items!View more great items IMPORTANT SELLER-TO-BUYER INFO (1/1/2019) Exemplary Service to you: Promises do not count; what does count is our history of always keeping our promises. Please take a moment to browse our 4,400-plus perfect feedbacks and look forward to receiving superior service. When you buy/win this, you will appreciate our unmatched after-purchase service. We \"Stay with you\" until all elements of the Description Policy: Used guitars that are listed as \"Pristine\" are perfect. They are \"as new\"so nothing more to talk about. \"Mint\" are 9.0 to 9.95 condition. In our opinion it is very difficult for a used guitar to be a perfect ie; may have insignificant fine, slight rub marks on the back, pick marks etc. We do describe any meaningful issues at the top of the listing. If there are minor aesthetic issues such as pick marks or not-thru-the-finish rubs and scratches; expect them. We always note if a case or other accessories is included. Cases and other accessories are not included unless stated or pictured in listing. If unclear, please email questions before you buy, Our replies are frank. We often get the question \"why do your prices change?\" Our prices do not \"change\" but do get temporarily lowered when selected for eBay Markdown. When the Markdown sale ends, eBay automatically returns to the normal listed price. The sales rarely are for the duration of the listing ie; our listings are 30 day listings but Markdown sales end in 7 to 10 days. Do not lose out; The sale time remaining is shown at the top of the listing where the pricing info is displayed. We cannot honor sale prices after the sale ends. Important Information About Our Special Sales: We use eBay's 'Markdown Manager' to put select items on Sale reducing the listed price. All our listings display the 14 day return policy but once an item is marked down or on closeout, it is As noted in the eBay published return policy information at the top of the listing, Markdown sales purchases are final. About Pricing decisions: When possible, for comparison, we show retail prices supplied by the manufacturer (\"MSRP\"). Vintage and collectable prices are researched in buyer's guides, eBay prior sales, other online sales and highest prices found for similar items. We have been awarded highest status in which we take great pride. It is awarded for adhering to eBay high standards, for our high level of service, for 4,400+ perfect, enthusiastic feedbacks, for provided candid, articulate guitar descriptions and, above all else for our respect for you! Our customers exhibit the same high standards when submitting a best offer, buy it now or having the high, winning bid. All of these are your promise to honor embay policy and pay within the 3-day time frame. We believe in you and work really hard to be sure You can believe in Us! About Best Offer Listings: Select-guitars are listed using eBay’s Best Offer link giving you the option to make an offer. Do not email offers, you must use the Best Offer link in the listing. This adds some fun and gives you the opportunity to affect the price you buy it for. Obviously we cannot sell at less than we pay for an item but if you make a reasonable eBay best offer, leaving some profit, most likely Your offer will be accepted. Your offer will be responded to immediately. . . We do not play one eBayer off against another. You offer will never be declined, it will be either accepted or get a counteroffer. Please note: Best Offer or Marked down sale items are all sales final and cannot be returned. Once you make the purchase, it cannot be cancelled. Ebay will respond to the unpaid purchase and if it remains unpaid will result in a non-payer strike which can result in a loss of your eBay privileges. Guitar set ups and strings are not warrantied since rough handling, travel/shipping can affect the setup. This is especially so if being shipped through many zones and atmospheric differences. Prior to listing, Guitars are setup to guitar manufacturer's specs but you should expect to need to set up upon arrival. Most listings use the specification releases of the manufacturer. We assume no responsibility for changes made by manufacturer. . . do not rely on posted specs. Unless otherwise noted or when the quantityis greater than 1, The Guitar pictures used in the listing are always of the actual guitar you will receive. Always rely upon the pics over the printed specs. We no longer list serial Nos. due to the proliferation of knock-offs using stolen serial Numbers. Email for serial number sufficient to check guitar manufacture date. *** exception: new and mint accessory items we may use stock photos, never for guitars. International Buyer Policy: Beginning this 2016, CITES regulation surrounding the international shipment of rosewood instruments has increased s&h costs for international shipments. It is required a CITES certificate be provided for each guitar containing Rosewood. Upon arrival postal and or customs may charge you brokerage, duty, VAT, tax, oversize charges, etc. for which you are responsible. Each country has package size restrictions. Packages refused by your country and returned/received back by GuitarStable will receive a full refund of the purchase price less the s&h since s&h is not refunded by usps. Most countries have loss/damage coverage limits, usually 2500usd, if loss/damage occurs we assume no responsibility for amounts in excess of these limits. Inquire if a concern. Due to the higher costs as well as the higher risks involved in international handling, except as noted, we do not accept returns from international buyers. We are happy to work with international buyers but need you to recognize that, relative to domestic shipping, international s&h has greater costs for packaging, documentation and handling. In addition, upon arrival you may have paid duty, VAT or other tax for which GuitarStable is not responsible. It is due to these difficulties and risks that we do not accept international returns. Please note: Canada. Hawaii, Alaska, Puerto Rico, and other U.S. possessions Inquire for rates. Please inquire. On Oct-13-18 at 16:22:16 PDT, seller added the following information:", "ItemID": "202479517142", "EndTime": "2019-01-20T04:30:54.000Z", "StartTime": "2018-10-23T22:29:02.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-Acoustic-J-45-Vintage-Sunburst-acoustic-el-New-Cutaway-edition-/202479517142", "ListingType": "FixedPriceItem", "Location": "Deerfield, Illinois", "PaymentMethods": ["PayPal", "VisaMC", "Discover"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2024795171428080_2.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NjQ4WDg1MA==/z/cfIAAOSw~kJaal62/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTUwMFgxMDE4/z/NioAAOSwHo5aal63/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTUwMFg5OTg=/z/4BUAAOSwWMhaal65/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTUwMFg5OTk=/z/WjIAAOSwIBJaal66/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTUwMFg5OTg=/z/GKUAAOSw9NBaal67/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTUwMFg3MDE=/z/uSQAAOSw05taal69/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTUwMFg2OTU=/z/pbUAAOSwBV5aal6-/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTUwMFg2MzM=/z/HYEAAOSwIspaal6~/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTUwMFg5OTg=/z/jrIAAOSwPOhaal7A/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTUwMFg3NDg=/z/hy8AAOSww-Baal7B/$_1.JPG?set_id=880000500F"], "PostalCode": "60015", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "guitarstable", "FeedbackRatingStar": "Red", "FeedbackScore": 4544, "PositiveFeedbackPercent": 99.2}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 2171.96, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2171.96, "CurrencyID": "USD"}, "HighBidder": {"UserID": "2***2", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 4}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson Acoustic J-45 Vintage Sunburst acoustic/el The New Cutaway edition", "ItemSpecifics": {"NameValueList": [{"Name": "MPN", "Value": ["2509200577"]}, {"Name": "UPC", "Value": ["Does not apply"]}]}, "HitCount": 329, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=37224811", "StoreName": "guitarstable"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": true, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "ABSOLUTELY PRISTINE  AS New No issues s&h reflects dimensional shipping weight and High value coverage", "QuantitySoldByPickupInStore": 0, "SKU": "1700", "NewBestOffer": false}