{"BestOfferEnabled": true, "Description": "Fender Mark Knopfler “Artist series” Stratocaster Greetings and thanks for your interest in this listing for an Outstanding, Authentic, very hot, Fender Mark Knopfler Stratocaster electric guitar Please, click HERE and see 34 HD photos of this gem. All original – basically UNPLAYED – Knopfler Strat that proudly shows the distinctive sparkling, beautiful, Hot Rod Red nitro lacquer finish (815 Fender)!!! This Knopfler Strat is in almost IMMACULATE condition: still has the original protective film on both pickguard and trem cover. Very low fretwear (estimated 10 max 20%). I had two Knop Strats in my private collection; 10 months ago I sold one for 3.2K (you can read it - please, check my feedback)... This is the last one I got, and this is a beauty! Production year: 2008 · Model Name - Mark Knopfler Stratocaster · Model Number - 011-7800-815 · Series - Artist Series · Color - Hot Rod Red (nitro-cellulose lacquer finish) · Body - Comfort contoured '57 lightweight ash body · Neck - Vintage tinted '62 maple neck, \"C\" shape (nitrocellulose lacquer finish) · Fingerboard - Rosewood (7.25\" radius) · No. of Frets - 21 Medium Jumbo nickel silver frets · Pickups - 3 Texas Special single-coil strat pickups · Controls - Master Volume, Tone 1 (neck pickup), Tone 2 (middle pickup) · Pickup Switching - 5-Position Blade · Bridge - American Vintage Synchronized Tremolo · Machine heads - Fender/Gotoh Vintage Style tuning machines · Hardware - Chrome · Pickguard - 3-ply, 11-hole, Mint Green · Scale length - 25.5\" · Width at nut - 1.625\" · Unique Features - Dot inlays, transitional decal, Mark Knopfler signature on ball of headstock · Case - Deluxe black hardshell case 34 HD photos, please check them all out. Guitar comes with its original HSC and ALL CASE CANDY, as pictured. I am an honest seller with extensive knowledge of guitars. I am a super-collector and I also have 30 years of playing experience. I’m knowledgeable of what I’m selling and I’ve made every effort to represent this item accurately. I am confident that the future owner will not be disappointed. Should you have any questions, comments, and/or concerns regarding the shipment and/or the item please do not hesitate to contact me! PLEASE READ THESE DETAILS BEFORE BIDDING! YOUR EBAY BID IS A CONTRACT! Please bid with caution. The following conditions are set to ensure the quality of our business to provide a satisfaction guarantee. Please do not let it deter you. Read the entire description and terms carefully. Placing a bid for this auction constitutes agreement to all the conditions on this page. Please ask all questions prior to bidding as all sales are final and binding. Please understand that bid retractions ruin auctions and leave a black mark on your Ebay record. PAYMENT Payment is to made by via PayPal (I’ll not ship to a non verified Paypal address) within 3 days of the auction closing or I will relist the item if I have not heard from you. I’d be happy to work with you if you can't make payment within 3 days but you must contact me prior to the close of auction. Zero feedback, please contact me before bidding. No negative feedback allowed. SHIPPING Shipping and handling for this Item is Free USA Only!! I guess $130 should cover most of other int'l destinations. I’m not responsible for any duties, brokerage or import fee's when shipping outside of the continental US. If you have 0 feedback or negative feedbacks, please, email before bidding. If not we will adjust the balance due after the original payment is made or alter your invoice to include the increased cost. Shipping and handling for this item does include insurance. The item will be shipped within 1 business day after payment is received. Payments are due within 7 days of purchase. Items are thoroughly inspected for condition and tested for proper operation before shipping - any claims for damage incurred in the shipping process must be exclusively reported to the shipping company. My own responsibility ends up in the exact moment I get the shipment receipt from the Express Courier or the Post Office. If any of our terms seem disagreeable -- PLEASE DO NOT BID!! Bidding on this item is an acknowledgement that you understand and consent to all our terms and policies. ------------------------ I am more then happy to answer any questions you have regarding this product, but please take a moment to first read all the information provided on this page because the answer to your question is probably already here. If it is not, then the best way to contact me is by Email, I’ll answer your questions as quickly and as best as I can. Please, check my very positive feedback and buy with confidence! You won’t be disappointed with this guitar. Thank You! So, BID AWAY AND GOOD LUCK!", "ItemID": "163429513861", "EndTime": "2018-12-16T17:29:44.000Z", "StartTime": "2018-12-13T22:52:15.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/W-E-S-O-M-E-Fender-USA-Mark-Knopfler-Hot-Rod-Red-Stratocaster-FREE-SHIP-USA-/163429513861", "ListingType": "FixedPriceItem", "Location": "Seymour, Connecticut", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1634295138618080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/48AAAOSwI9FcElcM/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/53sAAOSw-FRcElcP/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg2OTU=/z/K5oAAOSwb8BcEldE/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/sxgAAOSweiFcElck/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/0QkAAOSw~rhcElc5/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/jBcAAOSwjMtcElcU/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/uM0AAOSwcqxcElcz/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/dZMAAOSwkvtcElcb/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/8nUAAOSwCK1cElcg/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/X5gAAOSwVRBcElc9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/ytwAAOSwb15cEldZ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/Q34AAOSwL-xcEleE/$_57.JPG?set_id=8800005007"], "PostalCode": "06483", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "tcs611", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 383, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 2900.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2900.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "n***d", "FeedbackPrivate": false, "FeedbackRatingStar": "Green", "FeedbackScore": 6791}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "Europe"], "Site": "US", "TimeLeft": "PT0S", "Title": "A W E S O M E  Fender USA Mark Knopfler Hot Rod Red Stratocaster - FREE SHIP USA", "ItemSpecifics": {"NameValueList": [{"Name": "Body Material", "Value": ["Ash"]}, {"Name": "Brand", "Value": ["Fender"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Exact Year", "Value": ["2008"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Color", "Value": ["Red"]}]}, "HitCount": 82, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Beautiful Knopfler Strat Signature from my private collection - FREE USA Shipping !!!", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}