{"BestOfferEnabled": false, "Description": "Hello, item has been dropped $700- priced to sell. Thanks for looking at my one of a kind-hand built Dave Gilmore 57 reissue Strat in candy Apple red with a AA flame/curly maple neck. It’s right handed. Comes with hand aged wood,plastics and hardware. All parts are genuine fender with the exception of the DG20 EMG signature pick ups and hand made neck. The axe is a 2002 Alder fender body and trem with a beautiful hand made AA flame/curly Canadian maple neck (pictures do not do this justice). It’s a vintage C style neck with medium jumbo frets with a hand made bone radius profiled nut. It feels and plays amazing. Dave uses a 60’s profile necks and I modeled this on my 62 pre cbs Strat, feels very nice. Guitar weighs 8.1pb. The action is low and fast, I have set it with 9’s and a full 3 semitones (g) floating tremolo (exact to daves specs all be it he uses 9.5 custom strings, and shortens the tremolo arm). I like a Super light and responsive trem so it’s set up with a modern 2 point bridge and added Callahan hand rolled saddles-you can dive bomb this thing and it’s as smooth as silk and will not go out of tune and still has that vintage look. It also has Robert cray signature vintage tuners installed and literally never goes out of tune. I built this, as for me this was such a iconic Strat from the momentary/ devision bell tours,and was his #1 during that time. And to me it sounds like nothing else and the 94 pulse show really captured this. He still uses it live today along with his trusty black Strat. I was surprised fender have never made the Red Strat hence me doing this myself. Every section of this guitar is hand made and hand aged, ever screw, plastic and spring.I studied the pictures and the body has some light were with more hardware aging. It has some modern tweaks and this thing can be used from blues to metal with ease. Took over 6 months to build and it’s a stunning. I trained as a Luther and have worked for Some prestigious makers over the years. The price is reflective of the time and detail spent- and a custom shop version at this level would be $6k. Comes with a brand new fender pro case (black/logo), and can be shipped anywhere in the USA. Shipping is estimated and may vary. I am based in LA. Get yourself a truly stunning one of a kind made in the USA fender partscaster. Thank you for looking and please let me know if you have any questions. NO RESERVE Thanks again. Please see some feedback from other builds. New message from: floydlover177 I received the Strat yesterday. Been playing it ...sublime guitar. Super Nice action. I've played rare Gibsons (Les Pauls, 345) all my life. Never could find a Fender that I liked (This one ... excellent Thin neck, like a Gibson, good action) ... So far, this guitar is darn cool. New message from: hypnosiscenter I love this guitar!!. You really did a phenomenal job. I've picked up hundreds of Fenders in Guitar shops over the years,put them down and went back to Gibson. Can’t believe the fender that finally converted me was not even built by the company!! Excellent action, sound amazing and a total 1 off to boot!... Thanks again.", "ItemID": "132928071858", "EndTime": "2019-01-28T18:08:35.000Z", "StartTime": "2019-01-23T18:08:35.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/USA-Fender-Strat-Dave-Gilmore-57-Reissue-Candy-Apple-Red-Stratocaster-Reduced-/132928071858", "ListingType": "Chinese", "Location": "Glendale, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1329280718588080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/DxQAAOSw1r5bZhp8/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/L-IAAOSwW7JbZhqH/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTk5WDc0OQ==/z/MYQAAOSwW7JbZhsu/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/W5kAAOSw4a1bZhqR/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTk5WDc0OQ==/z/SKUAAOSwWUtbZhpx/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/hrEAAOSw6tNbZhn-/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTk5WDc0OQ==/z/XfwAAOSwa81bZhpw/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTk5WDc0OQ==/z/i~QAAOSwIMtbZhre/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/hiYAAOSwl71bZhn7/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/s2kAAOSwqSJbZhn8/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTQzWDE0NDk=/z/3WoAAOSw6rxbcIHK/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDk=/z/Jp4AAOSwI2xbcIHi/$_12.JPG?set_id=880000500F"], "PostalCode": "91202", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "love13sp", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 267, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 1099.95, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1099.95, "CurrencyID": "USD"}, "HighBidder": {"UserID": "n***s", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 383}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "USA Fender Strat Dave Gilmore 57 Reissue Candy Apple Red Stratocaster Reduced $", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "Model", "Value": ["Stratocaster 57 Reissue"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Color", "Value": ["Red"]}]}, "HitCount": 48, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 1124.95, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}