{"BestOfferEnabled": false, "Description": "Squier Telecaster Obey Electric Guitar SQU-IC060538275 Squier Telecaster electric guitar featuring Shepard Fairey Obey Propaganda graphics. This guitar starts out as a great Telecaster with Duncan designed humbucker and Alnico single coil pickups. But then Fender had artist Shepard Fairey design the most contemporary graphic design and applied it to the front of this great instrument. This line is called the Freedom of Expression series and it really shines. The hardware recieved what Fender calls the \"Rustic and Worn\" treatment to all the metal parts. It gives this instrument the oxidized look of a guitar that has had years of sweat in clubs and on the road. This is an out of production instrument and a Tckbite Extreme find. Guitar plays great and also looks great hanging on the wall as wall art. Information from Manufacturer: Note-info from manufacturer is presented as a overview from the manufacturer and there may be differences in the actual instrument up for sale, these changes can come about as part of our refurbish procedure or running changes by the manufacturer, please contact us with any questions. Please note that our office hours are M-F 8-5 Eastern Time, we are closed on weekends and major holiday's. Instrument is for sale on more than one platform and we reserve the right to end the sale of this item early, so don't hesitate if this instrument is for you! Manufacturers Info: Obey graphics by Shepard Fairey. This Squier Telecaster Electric Guitar with graphics by artist Shepard Fairey is a must for the Obey collector, or for the rocker who wants a guitar with cool, contemporary graphics. Shepard Fairey's artwork has gone beyond skateboards to take the modern art world by storm. Underneath the Obey collage or propaganda artwork lurks a hot, high-powered Telecaster equipped with a bridge humbucker and a single coil neck pickup. Oxidized worn hardware gives this guitar the look of a veteran. Specs: Body: Agathis Neck: Maple C-shape with Rosewood Fingerboard Frets: 22 Medium Jumbo Hardware: Unplated Machine Heads: Die Cast Neck Pickup: Alnico Single Coil Bridge Pickup: Duncan Designed HB102B Humbucker Alnico SWitching: 3 Way Controls: 1 Vol, 1 Tone Feature: Obey Propaganda Graphic Fretboard Radius: 9.5\" Nut Width: 1.65\" Scale Length: 25.5\" Condition This is a used instrument and will show signs of use. There are scratches on the back, but overall is in very good to excellent condition. The frets show no wear and the overall look is that this instrument had very little use. Guitar plays great, all controls work and instrument frets very easily. The front of the instrument is perfect with the graphics clear and sharp.", "ItemID": "183355080615", "EndTime": "2018-12-24T07:52:15.000Z", "StartTime": "2018-08-01T14:55:08.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Squier-Telecaster-Obey-Graphic-Electric-Guitar-SQU-IC060538275-/183355080615", "ListingType": "FixedPriceItem", "Location": "Grifton, North Carolina", "PaymentMethods": ["PayPal", "VisaMC", "Discover", "AmEx"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1833550806158080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg5NTU=/z/u-QAAOSwuMNbYcgC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNDI5/z/DasAAOSwfbRbYcgI/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjMz/z/VH4AAOSwg5VbYcgQ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg3ODg=/z/RsgAAOSwvmxbYcgW/$_57.JPG?set_id=8800005007"], "PostalCode": "28530", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "tickbitesupply", "FeedbackRatingStar": "Red", "FeedbackScore": 2375, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 299.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 299.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "s***t", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 123}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Squier Telecaster Obey Graphic Electric Guitar SQU-IC060538275", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Black"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Telecaster Obey"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Brand", "Value": ["Squier"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Inventory Number :", "Value": ["SQU-IC060530275"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}]}, "HitCount": 655, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=3983883", "StoreName": "tickbitesupply"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": true, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "This is a used instrument and will show signs of use. There are scratches on the back, but overall is in very good to excellent condition. The frets show no wear and the overall look is that this instrument had very little use. Guitar plays great, all controls work and instrument frets very easily. The front of the instrument is perfect with the graphics clear and sharp", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}