{"BestOfferEnabled": false, "Description": "EVH Wolfgang Standard Lefty Snow White Guitar Mint SKU: SS2154 Brand: EVH Color: Snow White Condition: Used Body Type: Solid String Configuration: 6 String Dexterity: Left-Handed Body Color: Snow White Model: Wolfgang Standard MPN: 5107011576 STREET SOUNDS AN AUTHORIZED EVH DEALER IS PROUD TO OFFER THIS: EVH WOLFGANG STANDARD LH MINT CONDITIONNO DENTS,NO DINGSLEFT-HANDEDCOLOR: SNOW WHITE2018 PRODUCTIONSET UP INCLUDED The EVH Wolfgang WG Standard LH boasts the same style and massive sound Eddie Van Halen created at a price the everyday southpaw musician can afford. Offering many of the premium features as its more expensive brethren, the Wolfgang WG Standard LH has a basswood body with special comfort cut forearm contour for maximum playing ease, quilt maple top on transparent finish, two-piece bolt-on maple neck with graphite reinforcement rods to hold strong against the ravages of temperature and humidity, a convenient truss rod adjust spoke wheel at the base of the neck, and a speedy 12-16 compound radius maple fingerboard with comfortably rolled edges and 22 jumbo frets. Bridge and neck position EVH Wolfgang humbucking pickups are mounted directly to the body and increase resonance transfer, resulting in sustain for days on end. This axe is also equipped with two domed control knobs that have been dialed-in to Van Halens exacting specifications, including a smooth-feeling 500k volume pot that makes it easy to find a unique sound while retaining the crisp high-end sparkle of the EVH Wolfgang pickups. The EVH-branded Floyd Rose Special bridge and R2 locking nut consistently stay in tune through the deepest whammy dives and horse whinnies. Decked out for playing performance and comfort, the Wolfgang WG Standard is available in Transparent Black or Snow White. The Transparent Black model features off-natural body binding, a black headstock and black chrome hardware; the Snow White features black hardware and a black headstock. GENERAL Model Name: Wolfgang WG Standard LH, Maple Fingerboard, Snow White Model Number: 5107011576 Series: Wolfgang Standard MSRP: $748.29 Color: Snow White BODY Body Shape: Wolfgang Body Material: Basswood Body Finish: Gloss NECK Neck Material: Maple Neck Shape: Wolfgang Backshape, 0.790\" @ 3rd - .0880\" @ 12th Scale Length: 25.5\" (648 mm) Fingerboard Radius: 12\" to 16\" Compound Radius (304.8 mm to 406.4 mm) Number of Frets: 22 Fret Size: Jumbo String Nut: Floyd Rose R2 Locking Nut Width: 1.635 (41.5 mm) Headstock: EVH-Branded Neck Plate: NA Neck Finish: Hand-Rubbed Oil Fingerboard: Maple Position Inlays: Black Dots ELECTRONICS Bridge Pickup: EVH Wolfgang Humbucking Neck Pickup: EVH Wolfgang Humbucker Controls: Volume, Tone Pickup Switching: 3-Position Toggle: Position 1. Bridge Pickup, Position 2. Bridge And Neck Pickups, Position 3. Neck Pickup Pickup Configuration: H/H HARDWARE Bridge: EVH Floyd Rose Tuning Machines: EVH-Branded Orientation: Left-Hand Pickguard: N/A Control Knobs: Black Plastic MISCELLANEOUS Strings: EVH Branded (.009-.042 Gauges) Included Accessories: Wrenches and Tremolo Arm STREETSOUNDS 30 DAY TRIAL PERIOD INCLUDED STREETSOUNDS 1 YEAR WARRANTY INCLUDED FREE UPS GROUND INSURED SHIPPING IN CONTINENTAL U.S. THIS ITEM DOES NOT SHIP TO BRAZIL, NEW ZEALAND, CHILE, GREECE", "ItemID": "303031961198", "EndTime": "2019-02-20T21:30:41.000Z", "StartTime": "2019-01-16T20:09:24.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/EVH-Wolfgang-Standard-Lefty-Snow-White-Guitar-Mint-/303031961198", "ListingType": "FixedPriceItem", "Location": "Brooklyn, New York", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/3030319611988080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/OTYwWDU2MQ==/z/sRQAAOSw2sxcP49x/$_12.PNG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDMwNg==/z/rwwAAOSwzTJcP49x/$_12.PNG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDMzNA==/z/qUIAAOSwHrlcP49x/$_12.PNG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODU0WDEyODA=/z/~wIAAOSw2hxcP49y/$_12.PNG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzY5WDEyODA=/z/iKUAAOSwcGpcP49y/$_12.PNG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjM2WDEyODA=/z/EAIAAOSw9ptcP49x/$_12.PNG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTE5WDEyODA=/z/rm4AAOSwUMBcP49x/$_12.PNG?set_id=880000500F"], "PostalCode": "11209", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "rockystreetsounds", "FeedbackRatingStar": "TurquoiseShooting", "FeedbackScore": 27062, "PositiveFeedbackPercent": 99.9}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 429.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 429.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "u***_", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 122}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "EVH Wolfgang Standard Lefty Snow White Guitar Mint", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["EVH"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Dexterity", "Value": ["Left-Handed"]}, {"Name": "Body Color", "Value": ["Snow White"]}, {"Name": "Model", "Value": ["Wolfgang Standard"]}, {"Name": "MPN", "Value": ["5107011576"]}]}, "HitCount": 604, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=157392609", "StoreName": "STREETSOUNDS NYC"}, "Country": "US", "ReturnPolicy": {"Refund": "Money back or replacement (buyer's choice)", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": true, "QuantitySoldByPickupInStore": 0, "SKU": "SS2154", "NewBestOffer": false}