{"BestOfferEnabled": false, "Description": "At top 40 guitarsour customers satisfaction is our first concern.All of out items have a 14 day return policy.If after 14 days you are not completely satisfiedwith your purchase, please return it for a full refund....Peace be with you... *all returned items must be in the same condition theywere at the time of sale. All original packing must be included. # Up for Sale is a 2018 Charvel Pro-Mod San Dimas Style 1! Transparent Black Burst Burst Quilt Maple Top Finish! This is really cool. You are looking at a 2018 Charvel Pro-Mod San Dimas Style 1 Electric Guitar. This is a \"HH\" (Humbucker, Humbucker) pickup configuration, with a Floyd Rose Locking Tremolo. Seymour Duncan JB Humbucker in the bridge and a Seymour Duncan '59 Zebra in the neck. High Performance guitar. A \"Super Strat\" style. From The Web: When you pick up a Charvel Pro-Mod San Dimas Style 1 HH FR, you're getting an off-the-shelf solidbody electric guitar that looks great, plays magnificently, and sounds amazing as is. Forget about after-market mod - these are the scorching hot Seymour Duncan humbuckers you were going to grab anyway. That Floyd Rose tremolo bridge is the real deal too, and 2-point locks mean zero string slippage. If you've never experienced the action of a compound-radius neck, then you're in for a treat, but even if you have, you'll love the feel of the hand-rubbed urethane finish, and graphite reinforcement means you never have to worry about warping. What's more, the quilt veneer on the alder body gives this Pro-Mod San Dimas Style 1 HH FR stunning good looks, without adding unwanted weight. The Pro-Mod series continues upon Charvel’s storied legacy of innovative excellence in high-performance guitar design, offering the latest technology and top-notch features that modern players need. An ideal instrument for dazzling high-speed playing, the San Dimas® Style 1 HH FR M QM boasts scorching sound, stunning style and grin-inducing playing feel and performance. Featuring an alder body with an elegant quilt maple top, this guitar also has a bolt-on two-piece maple neck with a pair of graphite reinforcement rods to resist bending and warping under environmental stresses. The speed neck profile is designed for lightning fast playing and completely unhindered position shifts while the comfortably rolled fingerboard edges provide the broken-in feel of an instrument with plenty of playing miles on it, and plenty more to go. Its maple fingerboard hosts 22 jumbo frets and black dot inlays, and has a heel-mounted spoke wheel for quick and convenient truss rod adjustments. High-output Seymour Duncan® JB and Seymour Duncan '59 humbucking pickups are directly mounted to the body, cranking out high-octane rock ‘n’ roll tone with plenty of sweet overtones. The volume control conceals a push/pull coil split to have even more tonal variations on tap while the No-Load tone control operates like a standard tone control from positions one through nine, removing itself from the circuit at position ten for transparent sound, letting the full natural voice of the guitar shine through. Dive to rumbling depths or add a well-placed rising harmonic without sacrificing your tuning with the Floyd Rose® 1000 series double-locking recessed tremolo bridge system. Designed with style in mind, the San Dimas Style 1 HH FR M QM is available in a variety of striking and elegant finishes, complete with a Charvel neck plate, sealed die-cast tuners and standard strap buttons.Tech Specs Body Type: Solidbody Body Shape: San Dimas Left-/Right-handed: Right-handed Number of Strings: 6 Body Material: Alder Top Material: Quilt Maple Body Finish: Gloss Polyester Color: Transparent Purple Burst Neck Material: 2-piece maple w/ graphite reinforcement Neck Shape: Speed Neck w/ rolled fingerboard edges Radius: 12\"-16\" Fingerboard Material: Maple Fingerboard Inlay: Black Dots Number of Frets: 22, Jumbo Scale Length: 25.5\" Nut Width: 1.6875\" Nut Material: Floyd Rose FRT 02000 locking Bridge/Tailpiece: Floyd Rose FRT-O2000 double-locking tremolo (recessed) Tuners: Charvel-branded die-cast Neck Pickup: Seymour Duncan SH1N '59 humbucker Bridge Pickup: Seymour Duncan JB TB4 humbucker Controls: 1 x volume (push/pull coil-split), 1 x no-load tone control, 3-way blade pickup switch Serial Number: #MC182364 Nut Width: 1.68\" Weight: 8.35 lbs. Case is NOT Included Cosmetics: Excellent Condition. Both Top and Back are very clean. Neck, Fretboard and Headstock are in fine condition. Pristine. Dripping with \"Mojo\" It is used. Not perfect. Look at the pictures closely. They will tell the story. We are here to help! Top 40 guitars is a Veteran owned business.", "ItemID": "392234783962", "EndTime": "2019-02-18T02:05:20.000Z", "StartTime": "2019-02-11T02:05:20.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2018-Charvel-Pro-Mod-San-Dimas-Style-1-HH-Floyd-Rose-WOW-MINTY-NO-RESERVE-/392234783962", "ListingType": "Chinese", "Location": "Santee, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/3922347839628080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/Nzk5WDUxNA==/z/eckAAOSwwDJcRgoN/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU0N1g5OTc=/z/l6EAAOSwkfxb72Zz/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTM1M1g3NzM=/z/rR8AAOSwgNFb72ap/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU1NlgxMDE5/z/OLUAAOSwqxdb72fa/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzgyWDU0MA==/z/PtAAAOSwn7Rb72eO/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ4MVg4Nzk=/z/z7oAAOSw2fRb72g7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTM1OFg3NDc=/z/msUAAOSwA29b72bs/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/UvgAAOSw86Nb72gQ/$_57.JPG?set_id=8800005007"], "PostalCode": "92071", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "top40powertrio", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 13259, "PositiveFeedbackPercent": 99.7}, "BidCount": 45, "ConvertedCurrentPrice": {"Value": 635.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 635.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "u***u", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 33}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2018 Charvel Pro-Mod San Dimas Style 1 HH Floyd Rose WOW! MINTY! NO RESERVE!!!!!", "ItemSpecifics": {"NameValueList": [{"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Country/Region of Manufacture", "Value": ["Mexico"]}, {"Name": "Model Year", "Value": ["2018"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Brand", "Value": ["Charvel"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Transparent Black Burst Burst"]}, {"Name": "Model", "Value": ["Pro-Mod San Dimas Style 1"]}]}, "HitCount": 333, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=47416021", "StoreName": "Top 40 Guitars"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 645.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "2018 Charvel Pro-Mod San Dimas Style 1 Electric Guitar, Excellent Condition, See ad below for Full Description", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}