{"BestOfferEnabled": false, "Description": "At top 40 guitarsour customers satisfaction is our first concern.All of out items have a 14 day return policy.If after 14 days you are not completely satisfiedwith your purchase, please return it for a full refund....Peace be with you... *all returned items must be in the same condition theywere at the time of sale. All original packing must be included. #5871 Up for Sale is a2015 ESP LTD Kirk Hammett KH-202! Kirk Hammett Signature Guitar! This is really cool. You are looking at a 2015 ESP LTD Kirk Hammett KH-202 Signature Guitar. Metallica axeman Kirk Hammett's signature guitar gives you a comfortable contoured basswood body that fits you like a glove, while a speedy maple neck and rosewood fingerboard pave the way for extremely fast fretting. The guitar's bolt-on design delivers sustain for weeks, while specially designed ESP humbuckers dish out a massive arsenal of tone and a Floyd Rose bridge serves up the vibe.Hammett's KH-202 delivers classic looks and performance Nothing screams hard rock like ESP's high-mass double-cutaway design, which gives the KH-202 incredible sustain and bite. Designed to resemble Kirk's original ESP without the road wear, its deep black finish sets off the iconic skull and crossbone inlays on the rosewood fingerboard. The dual ESP-designed extreme-gain humbuckers put out tons of confrontational tone with a 3-way pickup selector that lets you explore a vast tonal range. And a true Floyd Rose tremolo lets you pull off deep dive-bombs that always return to pitch.ESP Signature series guitars deliver the goods Working closely with the influential guitar players in their roster, ESP has built an impressive collection of artist signature instruments. From George Lynch to Ron Wood to Gus G. to James Hetfield; like Kirk, they are the who's who of rock and metal guitardom; and their signature axes sport the personalized features and specs that make them unique. ESP's Signature series is all about tone and playability — and because they're members of ESP's affordable LTD series, these guitars offer incredible value.ESP guitars: built to rock hard ESP started as a manufacturer of after-market guitar parts in Japan in the late 1970s. By the mid-'80s, ESP was making custom guitars for some of the biggest names in rock. An exacting eye toward playability and craftsmanship has made ESP Guitars one of the most visible and prevalent guitar brands in rock and metal. Their commitment to quality is second to none, and with an impressive roster of endorsers, it's clear that ESP makes the axes that today's guitar heroes use.Tech Specs Body Type: Solidbody Body Shape: Hammett Left-/Right-handed: Right-handed Number of Strings: 6 Body Material: Basswood Color: Black Neck Material: Maple Neck Shape: Extra Thin U Radius: 13.77\" Fingerboard Material: Rosewood Fingerboard Inlay: Skull & cross bones Number of Frets: 24, Extra Jumbo Scale Length: 25.5\" Nut Width: 1.653\" Nut Material: Locking nut Bridge/Tailpiece: Floyd Rose Special Tremolo Tuners: LTD tuning machines Neck Pickup: ESP LH-301N Humbucker Bridge Pickup: ESP LH-301B Humbucker Controls: 2 x volume, 1 x tone, 3-way blade pickup switch Our luthier did a complete setup. Frets are in great shape. Neck is Straight. Brand new strings were installed. Gig ready on Arrival! Serial Number: #L15120035 Nut Width: 1.65\" Weight: 7.05 lbs. Case is NOT Included Cosmetics: Excellent Condition. Both Top and Back are very clean. Neck, Fretboard and Headstock are in fine condition. Pristine. Dripping with \"Mojo\" It is used. Not perfect. Look at the pictures closely. They will tell the story. We are here to help! Top 40 guitars is a Veteran owned business.", "ItemID": "143068979624", "EndTime": "2019-01-07T02:05:27.000Z", "StartTime": "2018-12-28T02:05:27.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2015-ESP-LTD-Kirk-Hammett-KH-202-Signature-Guitar-MINT-CONDITION-NO-RESERVE-/143068979624", "ListingType": "Chinese", "Location": "Santee, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1430689796248080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTUzNFg5NDk=/z/hbUAAOSwYPNcJXOa/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzIwWDUzNg==/z/6ZkAAOSwkAxcJXMo/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTUzOFg3Njk=/z/lpcAAOSwcnZcJXPZ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU2NFgxMDk0/z/ktIAAOSwTEZcJXTN/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/Njc2WDUwOQ==/z/F6sAAOSw~2VcJXRm/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTUxNlg4NzA=/z/KTMAAOSwZbVcJXj8/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/JDMAAOSwFSNcJXi7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/oZgAAOSwmE5cJXiO/$_57.JPG?set_id=8800005007"], "PostalCode": "92071", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "top40powertrio", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 13196, "PositiveFeedbackPercent": 99.7}, "BidCount": 14, "ConvertedCurrentPrice": {"Value": 289.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 289.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "s***c", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 230}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2015 ESP LTD Kirk Hammett KH-202 Signature Guitar! MINT CONDITION! NO RESERVE!!!", "ItemSpecifics": {"NameValueList": [{"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Country/Region of Manufacture", "Value": ["China"]}, {"Name": "Model Year", "Value": ["2015"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Brand", "Value": ["ESP LTD"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Body Color", "Value": ["Gloss Black"]}, {"Name": "Model", "Value": ["KH-202"]}]}, "HitCount": 465, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=47416021", "StoreName": "Top 40 Guitars"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 294.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "2015 ESP LTD Kirk Hammett KH-202 Signature Electric Guitar, Excellent Condition, See ad below for Full Description", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}