{"BestOfferEnabled": true, "Description": "Up for sale is my much beloved, and largely un-played, Gibson “Guitar of the Month” for February 2008– the original SG Diablo. The first carved top SG offered by Gibson - finished in Metallic Red with Gold Hardware and Cream Binding, 24 frets, a rosewood fretboard, 50's rounded neck profile, and Burstbucker pro pickups. The guitar is 100% original and in excellent condition overall (see pictures). The only real wear is on the gold tailpiece, where my hand evidently rested on the rare occasion that I played this instrument (please see picture), and I failed to properly clean it before storing it. A very small blemish on an otherwise pristine example of this guitar. I am the original owner (smoke free home), and purchased this guitar at Best Buy of all places, ha (remember when they sold guitars) – and paid 1483.00 (including tax)! I am selling it “as is” – so review the images carefully – and knocked a few hundred off my purchase price to cover the cost to potentially replace the tailpiece if it bothers you! If you have any questions, let me know.I am letting this guitar go because it has largely existed in its case for the last ten years –as I almost exclusively play my Gibson SG standard. I love this guitar, but it is almost too nice for me, ha! I am also looking for funds to purchase a new Taylor Acoustic guitar, which will see more routine play than this guitar has! Includes original “Guitar of the Month” Gibson hard shell case and shroud. Paypal only. Shipping to lower 48 states only – no international shipping – no P.O. Box or APO…will ship via UPS and need valid street address. While the listing suggests that counter offers can be made - I did not know how to eliminate this feature. It should be known that I will not accept an offer for less than the listed price ~ Thanks! FEATURES Body Wood: Mahogany Scale Length: 24-3/4\" Neck Joint: Set-in Neck Wood: Mahogany Fretboard: Rosewood Neck Shape: rounded Frets: 22 Nut Width: 1.6875 Fretboard Radius: 12 Bridge: Nashville Tune-o-matic Pickup Bridge: Burstbucker Pro 2 Pickup Neck: Burstbucker Pro 1 Controls: 1 Vol, 1 Tone, 3 way PU selector Tuners: Grover Hardware color: Gold OVERVIEW A limited-edition rethinking of a rock classic with a fiery finish, cool 3-D top, and tweaked fretboard that gives you even more tonal range for searing leads.The Gibson SG Diablo is an exciting electric guitar update that adds depth to the SG--a guitar that was ahead of its time when it was introduced in 1961. A carved top with a 3-D effect plus other tweaks add brilliance and punch to its sound. The Diablo guitar's controls have been streamlined to one volume and one tone,in addition to the standard three-way switch. The volume control has also been moved closer to the bridge pickup for easy access and volume swells. Gibson's Burstbucker pickups--a No. 1 in the neck, and a No. 2 in the bridge--give the SG Diablo the subtle variations of true, vintage humbucker tone with historically unmatched bobbin windings and Alnico II magnets, just like the original PAFs in the Gibsons of the late 1950s and early 1960s. The new SGDiablo also takes the SG's 24-3/4-inch scale length mahogany neck and adds two additional frets--for a total of 24--allowing an even higher register of notes from a guitar already known for its searing lead-playing capacity. Gibson's traditional round neck profile and rosewood fingerboard enhances the guitar's resonance and sustain, and secures its reputation as the fastest guitar neck in the world. It is available only in a Red Metallic finish, with matching headstock. Grover tuners and gold hardware seal the deal. Like all Guitars of the Month, production is limited. The Gibson Logo The most innovative and revolutionary stringed instruments of all time have carried the name Gibson--the Les Paul, the ES-335, the Explorer, the Flying V,the SG. The list goes on and on. There is no mistaking the classic, hand-cut mother of pearl logo, in layed into a pressed fiber-head veneer that is then glued to the face of the mahogany headstock. A thin coat of lacquer finishes the process. It is the most recognizable logo in all of music, representing more than a century of originality and excellence. There is simply no equal. Angled Headstock The angled headstock is another example of Gibson's industry-changing way of thinking. Every Gibson headstock is carved out of the same piece of mahogany as the neck. It is not a glued-on headstock, and the process takes craftsmanship,time, and effort. But the rewards are worth the effort. The headstock is carefully angled at 17 degrees, which increases pressure on the strings and helps them stay in the nut slots. An increase in string pressure also means there is no loss of string vibration between the nut and the tuners, which equals better sustain. Adjustable Truss Rod The adjustable truss rod is a Gibson innovation that revolutionized the guitar.Before this groundbreaking discovery in the early 1930s, the truss rod was used only to strengthen and stabilize the neck. By making it adjustable, the truss rod now allows a guitar to be set up using a variety of string gauges, as well as string heights. This easily accommodates any style of playing, and allows a limitless range of set-up options. And by placing it at the base of the headstock, the adjustable nut is easily accessible, even while the strings are still on the guitar. '50s Rounded Neck Profile No guitar neck profiles are more distinguishable than the neck profiles employed on the Gibson models of today. The more traditional '50s neck profile--found on the SG Diablo--is the thicker, rounder, more time-honored profile, emulating the neck shapes of the iconic late '50s Gibson models. The neck is machined in Gibson's rough mill using wood shapers to make the initial cuts. But once the fingerboard gets glued on, the rest--including the final sanding--is done by hand. That means there are no two necks with the exact same dimensions. So while it still has the basic characteristics of its respective profile, each neck will be slightly different, with a distinct but traditional feel. 24-Fret Rosewood Fingerboard Rosewood has always graced the fingerboards of the world's finest stringed instruments, including many of today's Gibsons. The fingerboards on Gibson SG Diablos are constructed from the highest-grade rosewood on the planet, but there's one key difference the Diablo takes the SG's 24-3/4-inch scale length neck and adds two additional frets. That's a total of 24 frets, which allows an even higher register of notes from a guitar already known for its searing lead-playing capacity. The rosewood is personally inspected and qualified by Gibson's team of skilled wood experts before it enters the factories to befitted onto the neck of the SG Diablo. The resilience of this dense and durable wood makes these fingerboards extremely balanced and stable, and gives each chord and note unparalleled clarity and bite. The 12-inch radius of the fingerboard provides smooth note bending capabilities and eliminates\"dead\" or \"choked out\" notes, common occurrences on fingerboards with lesser radiuses. Nickel and Silver Alloy Fret Wire The fret wire on the Gibson models is a combination nickel and silver alloy(approximately 80 percent nickel and 20 percent silver) specifically designed for long life and superior wear. Gibson's traditional \"medium/jumbo\"fret wire is first shaped by hand, then cut to an exact 12-inch radius. After hand pressing it into the fingerboard, a machine press finishes the job to eliminate the gap between the bottom of the fret wire and the fingerboard. Trapezoid Inlays The classic trapezoid inlay is one of the most distinguishable features of many traditional Gibson models, including the SG Diablo. A figured, swirl acrylic gives these inlays that classic pearl look. They are inserted into the fingerboard using a process that eliminates gaps and doesn't require the use of fillers. Set-Neck Construction Like all classic Gibson guitars, the necks on Les Pauls and SGs are distinguished by one of the more traditional features that have always set them apart--a glued neck joint. Gluing the neck to the body of the guitar insures a wood-to-wood contact, no air space in the neck cavity, and maximum contact between the neck and body, allowing the neck and body to function as a single unit. The result? Better tone, better sustain, and no loose or misaligned necks. Solid Mahogany Body Probably the most central of all SG features is its solid mahogany body. The mahogany goes through the same rigorous selection process as all of Gibson's woods, and is personally inspected and qualified by Gibson's team of skilled wood experts before it enters the factories. Inside the Gibson factories,humidity is maintained at 45 percent, and the temperature at 70 degrees. This insures all woods are dried to a level of equilibrium, where the moisture content does not change during the manufacturing process. This guarantees tight-fitting joints and no expansion, and controls the shrinkage and warping of the woods, in addition to reducing the weight. It also improves the woods'machinability and finishing properties. Consistent moisture content means that the SG Diablo will respond evenly to temperature and humidity changes long after it leaves the factory. Gibson's Original Burstbucker Pickups Gibson's drive to recapture the magic of the original \"Patent AppliedFor\" humbucker pickups of the 1950s culminated with the introduction of the original Burstbucker line in the early 1990s. Using the windings on the '57Classic pickups as a median, Gibson engineers successfully captured the subtlevariations of true, classic Gibson humbucker tone with historically unmatched bobbin windings, unpolished Alnico II magnets, and non-potted asymmetrical coils. The Diablo's Burstbucker 1 (neck position) has two slightly underwoundcoils, and the Burstbucker 2 (bridge position) has one underwound and one overwound coil. Together, they supply a more open sound and slightly higher output, which allows preamps to be driven a little harder to achieve a morenatural break-up. As with all Gibson pickups, every part is precisely manufactured at Gibson USA in Nashville, Tennessee, insuring tight, seamless fittings, and superior workmanship. Tune-O-Matic Bridge The Tune-o-matic bridge, also known as the ABR-1, was the brainchild of legendary Gibson president Ted McCarty in 1954. At the time, it was a true revelation in intonation, and set a standard for simplicity and functionality that has never been bettered. This pioneering piece of hardware provides a firm seating for the strings, allowing the player to adjust and fine-tune the intonation and string height in a matter of minutes. It also yields a great union between the strings and body, which results in excellent tone and sustain.It is combined with a separate stop bar tailpiece, essentially a modified version of the earlier wraparound bridge. To this day, the Tune-O-Matic remains the industry standard. It is the epitome of form and function in electric guitar bridge design, and is one of the most revered and copied pieces of guitar hardware ever developed. Nitrocellulose Finish Applying a nitrocellulose finish to any Gibson guitar--including the Gibson SG Diablo--is one of the most labor-intensive elements of the guitar-making process. A properly applied nitro finish requires extensive man hours, several evenly applied coats, and an exorbitant amount of drying time. But this fact has never swayed Gibson into changing this time-tested method, employed ever since the first guitar was swathed with lacquer back in 1894. Why? For starters, a nitro finish dries to a much thinner coat than a polyurethane finish, which means there is less interference with the natural vibration of the instrument, allowing for a purer tone. A nitro finish is also a softer finish, which makes it easily repairable. You can touch up a scratch or ding on a nitro finish, but you can't do the same on a poly finish. In addition, a nitro finish is very porous in nature, and actually gets thinner over time. It does not seal wood in an airtight shell--as a poly finish does--and allows the wood to breathe and age properly. A Little SG History In 1961, the Les Paul was redesigned with a thinner body and two sharp cutaway horns that making the upper frets more accessible while lowering production costs. The new guitar was popular, but Les Paul the guitarist did not like it and asked to have his name removed. Gibson renamed the model the \"SG\"which was short for \"solid guitar\". Though Les Paul's name was officially removed from the model in 1961, the plastic Les Paul nameplates(positioned between the rhythm pickup and fingerboard) were in abundance in the Gibson factory and SG models having these nameplates were built and sold by Gibson up to end of 1963. SGs have been the choice of world-class artists such as Pete Townsend, Eric Clapton, Tony Iommi, and Angus Young.", "ItemID": "173643432389", "EndTime": "2018-11-19T20:25:07.000Z", "StartTime": "2018-11-16T01:26:25.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-SG-Diablo-2008-GOTM-Original-case-/173643432389", "ListingType": "Chinese", "Location": "Ann Arbor, Michigan", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1736434323898080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/-HcAAOSwMg5b7hq6/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/c2YAAOSwHOZb7hq3/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/6aAAAOSwzqtb7hq7/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/OB0AAOSw-GNb7hq3/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/hYIAAOSwJtJb7hq6/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/7FIAAOSwIkNb7hq3/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/ZekAAOSwihVb7hq3/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/KzgAAOSwLNxb7hq3/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/wI4AAOSw1KRb7hq5/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/qWgAAOSwPTlb7hq6/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/APEAAOSwtmNb7hq6/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/TL4AAOSwAQVb7hq5/$_32.JPG?set_id=880000500F"], "PostalCode": "48103", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "artguyandtheflypaper", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 233, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 1250.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1250.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "c***r", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 114}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson SG Diablo 2008 GOTM with Original case", "ItemSpecifics": {"NameValueList": [{"Name": "Body Material", "Value": ["Mahogany"]}, {"Name": "Product Line", "Value": ["Gibson SG"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model Year", "Value": ["2008"]}, {"Name": "Model", "Value": ["SG Diablo"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Body Type", "Value": ["Solid Body"]}, {"Name": "Body Color", "Value": ["Red"]}]}, "HitCount": 181, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 1275.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}