{"BestOfferEnabled": true, "Description": "Lightly Used Variax Standard Electric Guitar. **Includes with 2 batteries and battery charger.** Line 6 Variax Standard Modeling Solidbody Electric Guitar at a Glance:Yamaha craftsmanship makes this one extremely playable guitarVariax HD technology delivers amazing tones and instant tuningsWorkbench software lets you create your own dream guitarsYamaha craftsmanship makes this one extremely playable guitarOne of the things that's made Yamaha guitars a favorite around Sweetwater is that you always get more than you pay for when you pick up one of their instruments. Even without any of the frills Line 6's Variax HD technology has to offer, the Variax Standard is a wonderful guitar to play, with the smooth action and classic single-coil sound you'd expect out of a high-end axe. When you add in the expansive range of modeled tones and tunings, you're never going to want to put your Variax Standard down.Variax HD technology delivers amazing tones and instant tuningsYou're guaranteed to be well-equipped for any studio or stage situation with the Line 6 Variax Standard. Right out of the case, your Line 6 Variax Standard comes with dozens of impeccable instrument models. Rare vintage electrics, fabulous acoustics, and even exotic instruments are waiting at your fingertips. What's more, changing tuning is as easy as turning a dial - no delay, no mechanized tuners, just instant results. The latest Variax HD software brings you more stellar HD instrument and pickup models than ever before, and the real magic happens when you tap into the Workbench HD software.Workbench software lets you create your own dream guitarsThis Line 6 Variax Standard packs the latest Variax HD technology, bringing you more stellar models of rare vintage electric guitars, classic acoustic guitars, and exotic instruments. You'll be blown away once you start exploring these with the Workbench HD software, which gives you more tonal control and all-around tweakability than you ever thought possible. Create your own unique instrument model, then use Workbench HD to fine-tune individual string pitch, string volume, pickup position, and much more. You've never tweaked your tone like you can with the Variax Standard!Line 6 Variax Standard Modeling Solidbody Electric Guitar Features:The next generation of Variax modeling guitarsCombines Line 6 modeling with Yamaha craftsmanshipIncludes alder body, Alnico V single-coil pickups, and custom hardwareVariax HD modeling engine provides instrument, pickup, and tuning modelsFree downloadable Workbench HD software lets you customize your setups", "ItemID": "362503187899", "EndTime": "2018-12-09T01:01:19.000Z", "StartTime": "2018-12-06T18:32:13.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Line-6-Variax-Standard-Electric-Guitar-White-/362503187899", "ListingType": "Chinese", "Location": "Vicksburg, Mississippi", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/3625031878998080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTI5OFg5NzQ=/z/hOYAAOSw0d1b~DGl/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTI0OVg5Mzc=/z/0zgAAOSwHjtb~DGl/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTI0OVg5Mzc=/z/AnEAAOSwXgxb~DGl/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTI0OVg5Mzc=/z/OAIAAOSwm5xb~DGl/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTI0OVg5Mzc=/z/fqUAAOSwIsdb~DGl/$_32.JPG?set_id=880000500F"], "PostalCode": "39180", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "josharroo", "FeedbackRatingStar": "Blue", "FeedbackScore": 69, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 600.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 600.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***a", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 372}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Line 6 Variax Standard Electric Guitar - White", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Line 6"]}, {"Name": "Product Line", "Value": ["Variax"]}, {"Name": "Model", "Value": ["Variax Standard"]}, {"Name": "Size", "Value": ["Standard"]}]}, "HitCount": 48, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 610.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}