{"BestOfferEnabled": true, "Description": "1988 Fender Stratocaster Eric Clapton Signature Model in Red Finish Made in USA Serial number SE804230 first year in production The guitar is in excellent collector’s condition and 100% original and includes the original tweed hardshell case. This guitar was made the first year of production in 1988. Those early ( 1988 & 1989 ) guitars are very sought after due to their soft V neck profile and due to the fact that being the first signature models together with the Yngwie Malmsteen model, Fender paid extra attention for their quality. Also, that time the production numbers of those guitars were considerably lower than those of today. That period Fender built the guitars according to the orders from the dealers , since not so many people were used to the idea of signature models. Therefore, those models were more or less considered as limited editions. The guitar is in excellent condition, without any rusty parts or scratches, dents…etc. The neck and the fingerboard are extremely clean without any sign of wear on the maple. In 1985, Dan Smith approached Clapton to discuss a plan to create a signature guitar built to his own specifications. Clapton asked Fender to make a guitar with the distinctive V-shape neck of his Martin acoustic as well as a \"compressed\" pickup sound. Based on Clapton's brief, Fender made two early prototypes: one with a neck based on measurements taken from Blackie and one with a slightly softer V shape which Clapton ultimately deemed preferable. Both prototypes featured electronics based on the Elite Stratocaster including its 12 dB MDX mid-boost circuit intended to make the Stratocaster's single-coils sound more like a humbucker. Clapton liked the boost circuit but asked for more dynamic range, prompting Fender to replace the \"Elite\" pickups with Gold Lace Sensor pickups and an updated MDX circuit that had been tweaked up to deliver 25 dB of boost in the midrange at around 500 Hz. Clapton first used Gold Lace Sensors on three prototype signature models built by George Blanda and Michael Stevens – one was finished in Torino Red and the other two in Pewter Grey Metallic – in the \"Prince's Trust Concert\", in June 1986. She is one of the best guitars I have owned and has been with me since 1989. I am looking to downsize my collection and since I do not play her as much as my acoustics now, she is up for sale to a good home.", "ItemID": "132871866682", "EndTime": "2018-11-29T16:20:46.000Z", "StartTime": "2018-11-29T16:01:43.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fender-Stratocaster-1988-Eric-Clapton-Signature-Model-Red-Finish-/132871866682", "ListingType": "Chinese", "Location": "Hockessin, Delaware", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1328718666828080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/j~sAAOSwDJRbj~w4/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/s4MAAOSwKqlbj~xB/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/nosAAOSwQFZbj~w6/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/uTYAAOSwfbpbj~w9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/wDkAAOSwP7Nbj~ww/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTQxWDE2MDA=/z/SzQAAOSwHn9bj~wy/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTM0OFgxNjAw/z/HLUAAOSwR4hbj~w1/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAxWDE1MzA=/z/nU4AAOSwBP9bj~4c/$_57.PNG?set_id=8800005007"], "PostalCode": "19707", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "satedeschi", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 372, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 1200.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1200.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "n***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1131}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Fender Stratocaster 1988 Eric Clapton Signature Model in Red Finish", "HitCount": 3, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 1225.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Excellent condition", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}