{"BestOfferEnabled": false, "Description": "2011 Gibson Les Paul Traditional Pro With OHSC 2011 Gibson Les Paul Traditional Pro in a Honeyburst (aka Plaintop) finish with a 50's neck profile. Guitar weighs 9.8 pounds. It comes with the original Gibson hard shell case. Lots of dings on the body, but you have to look close to notice them. Nothing that takes away from the looks or playability. Just adds to the mojo/Jimmy Paige vibe and reminds you that this guitar is to be played/enjoyed, not left in the case to be a closet queen. It is mostly original other than pickup covers and paper in oil caps. Plays really nice and is a super nice and super warm sounding guitar. It has the stock coil taps/push/pull pots. It does have kill switch mod which can be seen in the pics. Upgraded amber switch tip. Frets have 95% life left. Case is a little beat up outside and a little dirty on the inside, but fully functional and does the job perfect. Case is 10 of 10 functionally, and 8 of 10 aesthetically (looks wise).A little more info about the killswitch if you're not familiar: It’s a spring-back type button. So whenever you press it down it cuts out and when you let it go comes back. It gives the same effect as toggling your pickup switch with the other pickup volume turned off. The good thing about a kill switch is that you don’t have to keep one of your pickup volumes off in order to get that effect. You can switch between pickups without forgetting your volume is off and still get the effect whenever you want it. It’s the effect Ace Frehley always does at the beginning of every live version of “Cold Gin”. Much used effect that’s cool to have.Les Paul Traditional Pro '50sThe Les Paul Standard of the late 1950s is the most prized electric guitar ever put into production, and one of the all-time greatest templates for rock and blues tone. Now Gibson USA brings you that classic '50s package in the new Les Paul Traditional Pro '50s, an instrument equipped to perform alongside the most revered Les Pauls in history. Wearing the hand-buffed look of a gently faded vintage guitar, the Les Paul Traditional Pro '50s features a high-gloss nitrocellulose-finished \"Honeyburst\" top with natural satin back and sides. The Les Paul Traditional Pro '50s also carries two of Gibson USA's most accurate reproduction-PAF humbucking pickups, a time-tested hardware complement, and a few subtle switching tricks up its sleeve, making it a Les Paul for the ages, and a versatile tone machine for the contemporary player, too. The Les Paul Traditional Pro '50s is crafted with all the classic ingredients that helped to make this model a legend. A carved Grade-A maple top contributes clarity and sustain, while a Grade-A mahogany body adds depth and richness, and is subtly chambered to enhance resonance and reduce weight. A solid quarter-sawn one-piece mahogany neck is glued in with a traditional mortis & tenon joint, and carved in a rounded \"Traditional profile\" that blends comfort and speed. Topped with a Grade-A rosewood fingerboard with 22 medium-jumbo frets, with a 12\" radius for each choke-free bending, the neck culminates in a headstock with the preferred 17-degree backward pitch for improved string pressure in the PLEK-cut Corian nut. To take it all over the top, the Les Paul Traditional Pro '50s carries two of Gibson USA's most popular humbucking pickups, a 57 Classic in the neck position for sweet, warm vocal tones, and a hotter Burstbucker 3 in the bridge for gutsy crunch and soaring lead tones. These acclaimed units are made with genuine Alnico II magnets and wound with 42 AWG wire, just like the legendary PAFs of the late 1950s, and offer a blend of depth and clarity that few pickups can match today. Both pickups have black-and-cream \"zebra striped\" bobbins, and they are installed uncovered, to mirror a popular modification of believed to enhance high-end response. To up the ante on versatility, push-pull switches on their independent volume pots split the coils of each pickup for authentic single-coil tones. A Tune-o-matic bridge and stopbar tailpiece ensure a solid anchor and optimum sustain, while a set of Grover Locking tuners with chrome keystone buttons give the look of another popular upgrade of vintage Les Pauls. Further classic appointments include acrylic trapezoid fingerboard inlays, a mother-of-pearl Gibson headstock logo and silkscreened gold \"Les Paul Model\", cream binding and pickguard, and gold Top-Hat. Check out the Les Paul Traditional Pro '50s today from your authorized Gibson dealer, and grab a hefty dose of that classic '50s tone and feel. Each guitar comes protected in a plush-lined hardshell case with black exterior, and includes owner's manual and adjustment literature, along with Gibson's Limited Lifetime Warranty and 24/7/365 customer service. BodyTopMapleBackMahoganyBody TypeTraditional Weight ReliefBindingCreamAdhesiveFranklin Titebond 50NeckSpeciesMahoganyProfileRounded '50sBindingCreamTruss RodTraditional AdjustableJoint Angle5° (+/- 15 seconds)AdhesiveFranklin Titebond 50Neck FitJointMortise & TenonAdhesiveFranklin Titebond 50Joint Angle Tolerance+/- .005\"FingerboardSpeciesRosewoodFrets22Radius12\"Nut/E.O.B1.695\"/2.260\"InlaysAcrylic TrapezoidsNutMaterialCorianWidth1.695SlotsGibson PLEK SystemHeadstockLogoMother of Pearl \"Gibson\" Logo with Scripted \"Les Paul Model\"Truss Rod CoverBlack and White Antique Bell TunersModelLocking Grover™ Keystone TunersPlatingChromeTuning Ratio18:1 BridgeTypeTune-O-MaticMaterialZamakPlatingChromeTailpieceTypeStop BarMaterialZamakPlatingChromeHardwareKnobsGold Top HatsPickguardCreamToggle Switch WasherCream with Gold ImprintPickup Mounting RingsCream plasticControl Plate CoverBlack plasticStrings.010 - .046, Genuine Gibson stringsStrap ButtonsAluminumPickupsNeck PositionZebra '57 Classic (Alnico II)Bridge PositionZebra BB3 (Alnico II)ElectronicsPotentiometers2 Push/Pull Volume Controls, 2 Tone ControlsType500k Linear Volume, 500k Non-linear ToneCoil WiringMachine WoundToggle SwitchThree-way Switchcraft with Cream Plastic TipOutput JackTraditional 1/4\"FinishSealerNitrocelluloseProcess1-1.5 milsGloss Honeyburst/Natural Satin Back and SidesCaseTypeGibson HardshellCase ExteriorBlackCase InteriorWhite Plush", "ItemID": "332968429479", "EndTime": "2019-02-26T20:49:44.000Z", "StartTime": "2018-12-21T07:01:54.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-Les-Paul-Traditional-Pro-2011-Honeyburst-50s-Neck-Profile-aka-Plaintop-/332968429479", "ListingType": "FixedPriceItem", "Location": "Oldenburg, Indiana", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/3329684294798080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA3NFgxNjAw/z/ZlkAAOSws0pcHI6z/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA3NFgxNjAw/z/z6gAAOSwQ5pcHI68/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA3NFgxNjAw/z/TmoAAOSwSidcHI7D/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA3NFgxNjAw/z/fZYAAOSwcH5cHI7L/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA3NFgxNjAw/z/RAUAAOSw29JcHI7S/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA3NFgxNjAw/z/CiEAAOSwIGxcHI7Z/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA3NFgxNjAw/z/M~oAAOSwM6FcHI7i/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA3NFgxNjAw/z/mXwAAOSwIsdcHI7q/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA3NFgxNjAw/z/pGAAAOSwVP5cHI7y/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA3NFgxNjAw/z/A30AAOSw-GNcHI79/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA3NFgxNjAw/z/lHwAAOSwQwFcHI8W/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA3NFgxNjAw/z/A6QAAOSw-GNcHI8l/$_57.JPG?set_id=8800005007"], "PostalCode": "47036", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "dependableguitars", "FeedbackRatingStar": "Red", "FeedbackScore": 1005, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1499.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1499.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "r***2", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 0}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson Les Paul Traditional Pro 2011 Honeyburst 50s Neck Profile aka Plaintop", "ItemSpecifics": {"NameValueList": [{"Name": "Product Line", "Value": ["Gibson Les Paul"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model", "Value": ["Les Paul Traditional Pro"]}, {"Name": "Model Year", "Value": ["2011"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Color", "Value": ["Honeyburst Plaintop"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Material", "Value": ["Mohogany", "Maple", "Rosewood"]}, {"Name": "Size", "Value": ["Full Size"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}]}, "HitCount": 3286, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "2011 Gibson Les Paul Traditional Pro in a Honeyburst (aka Plaintop) finish with a 50's neck profile. Guitar weighs 9.8 pounds.  It comes with the original Gibson hard shell case. Lots of dings on the body, but you have to look close to notice them.  Nothing that takes away from the looks or playability.  Just adds to the mojo/Jimmy Paige vibe and reminds you that this guitar is to be played/enjoyed, not left in the case to be a closet queen.  It is mostly original other than pickup covers and paper in oil caps. Plays really nice and is a super nice and super warm sounding guitar. It has the stock coil taps/push/pull pots. It does have kill switch mod which can be seen in the pics. Upgraded amber switch tip.  Frets have 95% life left.  Case is a little beat up outside and a little dirty on the inside, but fully functional and does the job perfect.  Case is 10 of 10 functionally, and 8  of 10 aesthetically (looks wise).", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}