{"BestOfferEnabled": true, "Description": "Stock PhotoMake Those Notes Last Forever!Add a true metal guitar to your collection with the Schecter Hellraiser C-1 FR-S solidbody electric guitar! This Hellraiser gives you a mahogany body, a quilt maple top, a thin mahogany neck, and a rosewood fretboard that deliver hard-hitting lows and a soaring top end. What's more, Schecter gave the Hellraiser C-1 FR-S an ultra-cool Sustainiac neck pickup, which lets you pull off flying solos like nothing else out there. Add this to an EMG 81 humbucker and a Floyd Rose tremolo and you have one mean metal machine.Schecter Hellraiser C-1 FR-S Solidbody Electric Guitar at a Glance:Rock-solid construction with high-end appointmentsSustainiac humbucker gives you never-ending toneFloyd Rose 1000 Series bridge/tailpiece lets you carve out hardcore bendsRock-solid construction with high-end appointmentsWhen you pick up a Schecter Hellraiser C-1 FR-S guitar, you'll be amazed by all of the details and finishing touches that make this a truly remarkable instrument. Its beautiful quilt maple top appears to leap off the surface, and the intricate inlays in its bound fretboard add a special touch of class. What's more, these details aren't just cosmetic. The Hellraiser C-1 FR-S features a set neck with an Ultra Access heel carve, which gives you easy access to those higher, hard-to-reach frets.Sustainiac humbucker gives you never-ending toneYou just can't beat the sheer sustain you'll get out of your Schecter Hellraiser C-1 FR-S's Sustainiac humbucking neck pickup... literally! That's because this unique pickup design features a special sustain circuit that's designed to let notes ring on as long as you like. Just kick in the sustain circuit, play a note or chord on your Hellraiser C-1 FR-S, and let the electromagnetic feedback carry your sound as long as you like. You haven't busted out a solo till you've rocked a Hellraiser C-1 FR-S!Floyd Rose 1000 Series bridge/tailpiece lets you carve out hardcore bendsSchecter knows that serious shredders like you demand absolute performance out of their guitars. That's why they loaded the Hellraiser C-1 FR-S with a real Floyd Rose 1000 Series tremolo bridge. A remake of the original Floyd Rose blade tremolo, this incredible bridge lets you grab on, rock out, and never worry about pulling your action out of whack. You'll get both the rock-solid reliability and the tight response you need when you rock out with a Schecter Hellraiser C-1 FR-S!Schecter Hellraiser C-1 FR-S Solidbody Electric Guitar Features:Full-featured solidbody electric guitar made for modern playing stylesSlim body style and thin neck provide you with fast action and a comfortable feelBeautiful quilt maple top adds spank to a rich mahogany body and responsive 3-piece mahogany neckSustainiac neck pickup delivers limitless sustain and wicked lead toneSet neck with Ultra Access heel carve gives you easy access to your upper fretsFloyd Rose 1000 Series Tremolo bridge gives you easy flexibility and reliable stabilityNeck-though-body design adds impressive sustain to your toneIf you want a guitar with amazing sustain, then pick up a Schecter Hellraiser C-1 FR-S solidbody electric guitar!", "ItemID": "202533374592", "EndTime": "2019-01-04T12:21:35.000Z", "StartTime": "2018-12-10T20:00:54.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Schecter-Hellraiser-Sustainiac-EMG-Floyd-Rose-Electric-Guitar-/202533374592", "ListingType": "FixedPriceItem", "Location": "Fort Myers, Florida", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2025333745928080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NTIwWDE2MDA=/z/ZDEAAOSw76lcDsRO/$_32.JPG?set_id=880000500F"], "PostalCode": "33905", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "dollysdoodads", "FeedbackRatingStar": "Yellow", "FeedbackScore": 49, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 849.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 849.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "c***n", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 624}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "*** Schecter Hellraiser *** Sustainiac *** EMG *** Floyd Rose * Electric Guitar ", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Schecter Guitar Research"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Color", "Value": ["Black Cherry"]}, {"Name": "MPN", "Value": ["1826"]}]}, "HitCount": 245, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}