{"BestOfferEnabled": true, "Description": "This guitar has the tone, feel, looks, vibe - it has it all!!! We are pleased to present another stellar selection from Gibson Memphis's 2019 Collection: the limited edition 1959 ES-330. It is in as ne w, mint, showroom condition! Though another guitar with a burst finish from that year tends to steal all the historical glory, these ES-330s are proof that the Les Paul wasn't the only incredible new instrument to roll off the line in Kalamazoo, Michigan in 1959! When it was first introduced, the ES-330 stood apart from it Gibson brethren because of its fully-hollow construction and single-coil P-90 pickups. These factors gave it a woodier, more midrange-forward voice that inspired jazz greats like Grant Green to adopt it as their instrument of choice. Later, alt-rockers like William Reid of The Jesus and Mary Chain discovered that the ES-330's clarity and midrange punch made it a brilliant building block for their brand of sonic mayhem, and many others in that scene followed. Nowadays, you can find people playing everything from jangly indie rock to gutbucket blues to grungy fuzz-laden riffs to crunchy classic rock on the ES-330, and it excels in all of these applications and more (oh, and it's still a great jazz guitar, too!). All of these delightful sonic characteristics are present in these '59 reissues thanks to the Gibson Memphis team's perfectionist tendencies. They started with the classic 3-ply Maple-Poplar-Maple body and brace it with quartersawn Adirondack spruce. Adirondack spruce is a perpetual favorite among staff, and for good reason: when used to brace a hollowbody, it gives the guitar lots of headroom and a percussive, responsive attack. So, even when played unplugged, the '59 ES-330 sings out with a loud, clear voice, and it has a open, spacious top end. Two Memphis Historic Spec P-90s complete the package by kicking out plenty of vintage-inspired tone. They produce plenty of punchy midrange to go with a rich, touch-sensitive top-end and warm, clear lows. Oh, and the '59 ES-330 has superb handfeel thanks to the late fifties rounded neck profile! We are proud to present such an inspiring instrument, and once you play one we think you'll agree: this is one fine '59! Specifications: Brand~Gibson MemphisModel~Limited Edition 1959 ES-330Finish Color~Vintage Burst - VOSFinish Type~Gloss Nitrocellulose LacquerWeight~6.18 lbs.Bracing~Quartersawn Adirondack SpruceTop Wood3~-Ply Maple/Poplar/MapleBack & Sides Wood~3-Ply Maple/Poplar/MapleNeck Wood~Quartersawn MahoghanyNeck Shape~Late Fifties RoundedNeck Dimensions~.920 1st - .970 12thFingerboard~Bound A-Grade Dark RosewoodFingerboard Radius~12\"Inlays~Pearloid DotsFrets~22Scale Length~24-3/4\"Nut Material~BoneBinding~Single-Ply CreamPickups~MHS P-90 Rhythm in Neck, MHS P-90 Lead Bridge (reverse polarity)Controls~2 Volume, 2 Tone, 3-Way Selector SwitchHardware~NickelBridge~ABR-1 with Plated Brass SaddlesTailpiece~Thinline TrapezeTuners~Grover Milk Bottle RotomaticsCase~Gibson HardshellCOA~Yes ------------------------**Please don't bid or make an offer unless you plan on completing the sale. Please check out our other auctions! PLEASE READ: *Insured* UPS ground shipping INSURED within the continental US is $65. Sorry, but we can't declare a lower value on the customs form. Due to abuses on eBay, all sales are final, and as is, but we happily answer ANY questions. We have a long history on eBay with 100% positive feedback! Buyer is responsible for filing any damage claims. Though we offer as much detail as possible, and do so in good faith, kindly ask all questions prior to purchase. Payment is due within 24 hours of end of auction unless other arrangements are made prior to close of auction. NO INTERNATIONAL buyers unless prior contact is made. Thanks for looking and let me know if you have any further questions! Phone and Skype appointments available for serious buyers!", "ItemID": "283388442099", "EndTime": "2019-02-22T16:28:25.000Z", "StartTime": "2019-02-20T20:13:44.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-Memphis-Limited-2019-1959-ES-330-Amazing-P-90-Vintage-Sunburst-/283388442099", "ListingType": "FixedPriceItem", "Location": "Colorado Springs, Colorado", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2833884420998080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NjE5WDE1MDA=/z/Q-MAAOSw~gZcbbRz/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTUwMFg2MTk=/z/DRIAAOSwulFcbbR1/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTUwMFg1OTc=/z/0rIAAOSwUvVcbbR2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDQxNA==/z/AqgAAOSwI7ZcbbR3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA4NlgxMDAw/z/ksYAAOSwPEhcbbR4/$_57.JPG?set_id=8800005007"], "PostalCode": "80908", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "guitars*guitars*guitars", "FeedbackRatingStar": "Red", "FeedbackScore": 1268, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 2950.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2950.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***j", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 3306}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson Memphis Limited 2019 / 1959 ES-330 ~ Amazing P-90, Vintage Sunburst!", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model", "Value": ["ES-330"]}]}, "HitCount": 28, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "“It is in as ne w, mint, excellent condition!”", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}