{"BestOfferEnabled": true, "Description": "CASTLE RENTAL & PRIVATE PAWN #5 STERLING Electric Guitar ALBERT LEE HH ELECTRIC GUITAR Description: ELECTRIC GUITAR: STERLING MODEL ALBERT LEE HH ELECTRIC GUITAR, 6 STRING, RIGHT HANDED Details Additional Details for eCommerceITEM HAS BEEN TESTED & COMES W/ WHAT IS PICTURED Musical Instrument Condition Rating90% - Very Good - In Great Condition and Primary Features Functional Instrument Appearance95% - Excellent Condition : Very Clean, might have some minor wear, dings, scratches, or finish cracks, but otherwise very close to new condition. Knobs - Tuners - Electronics - Input Jack95% - Guitar is like new - Very little wear - All original Musical Instrument CaseNot Included Number of Strings6 STRING Country of ManufactureOTHER COUNTRY Body StyleSOLID DexterityRight Handed Payment PayPal is the ONLY online payment method we accept at this time. Your PayPal account must be a Verified U.S. PayPal Account. We also recommend that you use a Confirmed Ship To Address. Shipping Your item will be shipped within 1-3 business day(s). After shipping your items will be delivered within 1-10 business days. Terms of Sale Tax applies in: AR About Us Locally-owned and managed, Castle Rental & Private Pawn has served Northwest Arkansas’ rental and pawn needs for almost 40 years!We offer the best choice for obtaining your wants and needs, whether you’re looking for a little money and/or wanting to buy something specific. Castle does it all, with the most benefits for our customers and at the best prices… guaranteed! Furniture, appliances, TV’s, computers, smartphones, jewelry, tools, firearms, hunting and fishing gear, musical equipment, boats, ATV’s, vehicles and much, much more are waiting for you at Castle.If you need cash, Castle is committed to offering more money than any competitor, for your item of value. No pawn is too big or small – from five dollars to a million dollars, Castle has you covered! We offer confidential transactions in-store, or in your home, and protect you and your transaction with courtesy reminders by phone, text, or email.If you need or want something for yourself, your home, or your business, we provide multiple opportunities to make easy-ownership a reality – cash purchase, in-store layaway, and several short-term and long-term rental and rental-ownership options. Layaway in-store with only 10% down, and a minimum payment of 10% a month until paid in full or, if you would prefer to take it home today, our rental-ownership option is the absolute best rental program in the country.Good credit, bad credit, or no credit – everyone is approved to rent from Castle! Trade-in your old item; we’ll pick it up and haul it off when we deliver and set up your new item, at no extra cost to you. Never worry about downtime; every rental includes free repair and loaner units during the length of the rental, and we offer extended warranties that outlast both the rental and the manufacturer. Layaway in your home, as every rental includes a “Same As Cash” option which affords you up to six months to pay off your rental for the tag’s cash price, less any rental payments paid.We've built customer relationships that span decades and generations. Our management team has over 100 years of combined service with the company, so the names and faces are familiar and consistent. Castle is a medium sized company; large enough to handle the big stuff, but small enough to be nimble and responsive. Give us the chance to earn your business and we'll make sure you never have cause to look elsewhere. Things I Buy: Jewelry, Electronics, Firearms Bravo Store Systems Point-of-Sale Operating System Bravo Omni-Commerce solutions offers Brick & Mortar stores the only fully integrated eBay API that seamlessly & effortlessly combines the in-store Point-of-Sale to all eBay commerce selling activities. Click here & find out why eBay stated \"Bravo has best solved Brick & Mortars can sell on eBay\"", "ItemID": "264126810764", "EndTime": "2019-01-24T00:54:02.000Z", "StartTime": "2019-01-09T19:07:58.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/STERLING-Electric-Guitar-ALBERT-LEE-HH-ELECTRIC-GUITAR-HA2005572-/264126810764", "ListingType": "FixedPriceItem", "Location": "Berryville, Arkansas", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2641268107648080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NjAwWDgwMA==/z/7JEAAOSwxO9cNkZ~/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/S7MAAOSw5wJcNkaA/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/yBYAAOSwUu5cNkaC/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/yD4AAOSwsZhcNkaD/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/e6AAAOSwZddcNkaG/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/40UAAOSwH1pcNkaI/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/XgYAAOSwWDlcNkaK/$_1.JPG?set_id=2"], "PostalCode": "72616", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "castlerp5", "FeedbackRatingStar": "Red", "FeedbackScore": 1584, "PositiveFeedbackPercent": 98.8}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 239.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 239.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "h***c", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 60}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "STERLING Electric Guitar ALBERT LEE HH ELECTRIC GUITAR (HA2005572)", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["STERLING"]}, {"Name": "Model", "Value": ["ALBERT LEE HH ELECTRIC GUITAR"]}]}, "HitCount": 123, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=65150927", "StoreName": "CastleRP 5"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}