{"BestOfferEnabled": false, "Description": "Everything you need A-Z For Sale - We Have a Buy It Now item! Gibson USA 2006 Les Paul Model 60's Neck Electric Guitar Very NICE! Super Clean!! Slightly Used, Minty Condition!See All Pics for what will get shipped right to your door!As Always, Will be Professionally Packed for Protection & usually ships within 1 day to arrive safely & securely right to your front door - when you \"Buy It Now!\"GOOD LUCK! Model / MPN: 2006 Les Paul 60'sLes Paul Standard '60s Neck is just like the regular LP Standard model, with the exception of the neck contour. As the name says, this one has the '60s style neck shape. Solid single-cut body made of mahogany and carved flame maple with cream color binding. Standard two-piece bridge unit fronted by a pair of Standard Alnico V humbuckers with standard controls unit. Mahogany neck is set in and topped with a 22-fret rosewood fingerboard. Includes: 2006 Gibson USA Les Paul Model 60's Style Neck Electric Guitar in Desert BurstNice Padded charcoal gray fur lined Gibson USA Case (the combination lock has never even been opened)Pickguard (not installed)Gibson USA Guitar strapTruss Rod guitar adjusting toolOwner's manualPre-Pack checklist card Condition:This item is slightly used, in Excellent condition! Was taken very well care of! Mostly hung on the display wall looking pretty! Pickguard included was never installed so will need to take it somewhere to have a professional install it properly. The guitar case is in Excellent shape, and still has that \"new car\" smell, never gave it a combination for the lock, so you'll be the first! May show some minor signs of cosmetic wear - possibly a light scratch or scuff here or there, but nothing major that stands out, or which affects its operation (see all zoomed in pics). Neck is straight, frets are still in great shape! Features: (via manufacturer)Dual humbuckers on a carved maple top USA-made Les Paul '60s style neckWeighs approx. 10.54 lbs Technical Specs: Body Body shape featuressingle cutawayBody styleLes Paul-style body Pickguard Cream HardwareBridge/TailpieceChrome tune-o-matic bridge & stopbar tailpieceTunersTonePros™ Fingerboard Rosewood w/ Trapezoid fingerboard position markers GeneralFinish colorsTobacco Desert BurstFinish effectsGloss Graphics Made inUSANumber of strings6 strings Neck Number of frets22 fretPeghead (headstock)black face w/ \"Gibson\" Logo and Scripted \"Les Paul Model\" PickupsPickups brand and modelBurstBucker Pro pickups Pickups configuration2 humbucker pickups ElectronicsControls2 tone controls, 2 volume controls & 3-way toggle switchVolume controls2 Please Note: Guitar stand shown in pic is not included.************* Please see all zoomed in photos for exact item(s) that will get shipped to your door when you \"Buy It Now\"! \"Buy it Now\" & you will receive the exact item(s) you see in pics Item will be professionally packed with extreme care for protection, and will most of the time, get shipped out the same day - to be delivered right to your doorstep! Good Luck! Please Note: When stated, “Free” Shipping Quote is for USA lower 48 states ONLY! HI, AK, and PR, are not included so please email prior to buying And don't forget to check out my other items in my store at: Everything You Need A - Z! When you buy from us, expect to receive what you see in the pictures. We do our absolute best to thoroughly test all of our merchandise and accurately describe and depict any flaw or defect we find. When an item's condition is defined, we are simply expressing our own opinion. We know the feeling of buying something sight unseen only to find out the seller was not that accurate. Please inspect all pictures, if you do come across an issue that we may have overlooked, please contact us, and we will be happy to work with you to resolve the issue. We do not guarantee or warranty any Batteries or Calibrations, unless specified otherwise, as they are maintenance issues, therefore, may need to be performed periodically. Batteries are an item that may need to be replaced or rebuilt time to time and are sold as is. Please keep in mind with shipping, when you buy a guitar from us, you are not just paying for shipping. You are paying for our time and experience in packaging delicate items, as well as the cost of new boxes, shipping peanuts, bubble wrap, etc. Shipping Quote is for USA lower 48 states to a physical address only. Buyer Pays shipping & handling if stated. We accept PAYPAL ONLY! All payments are due within 24 hours. Read Payment instructions before bidding. Buyer is responsible for return shipping. Item must be in its original condition as it was received. A 20% restocking fee will apply. Upon receiving your item, thoroughly inspect all contents within. If item received is damaged in any way from shipping, notify FedEx immediately, and they will require you to have ALL original packaging & shipping materials for the item in order to prevent any delays for a claim, per FedEx. Please e-mail any questions or concerns, prior to bidding. Thanks for Looking at our Auction!! And good luck in bidding! Thanks for stopping by!", "ItemID": "192826360434", "EndTime": "2019-02-21T01:31:32.000Z", "StartTime": "2019-02-15T02:40:59.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2006-Gibson-USA-Les-Paul-LP-60s-Style-Neck-Electric-Guitar-Tobacco-Burst-MINTY-/192826360434", "ListingType": "FixedPriceItem", "Location": "USA", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1928263604348080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMDQ5/z/0fwAAOSw-8BbYNlP/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDcx/z/5sQAAOSwGDZbYNlU/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDcx/z/5tEAAOSwGDZbYNlX/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDcx/z/tnUAAOSwIOtbYNla/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA3MVgxNjAw/z/sJ0AAOSwLyhbYNlg/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA3MVgxNjAw/z/vXQAAOSwGo5bYNld/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDcx/z/z5sAAOSwKjlbYNni/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA3MVgxNjAw/z/m5QAAOSwUC1bYNli/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA3MVgxNjAw/z/wu8AAOSwXclbYNlt/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA3MVgxNjAw/z/AIcAAOSwPAtbYNlw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA3MVgxNjAw/z/jyQAAOSwnr9bYNme/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA3MVgxNjAw/z/iH0AAOSwOGlbYNmi/$_57.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "kostalota", "FeedbackRatingStar": "Green", "FeedbackScore": 7471, "PositiveFeedbackPercent": 99.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1495.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1495.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "t***t", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 613}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2006 Gibson USA Les Paul LP 60's Style Neck Electric Guitar Tobacco Burst MINTY!", "ItemSpecifics": {"NameValueList": [{"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Product Line", "Value": ["Gibson Les Paul"]}, {"Name": "Model Year", "Value": ["2006"]}, {"Name": "Model", "Value": ["Les Paul '60s"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Tobacco Desert Burst"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "MPN", "Value": ["LP6TDBNH1"]}]}, "HitCount": 36, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=42091554", "StoreName": "Everything U need A to Z"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["US Protectorates", "APO/FPO", "PO Box"], "GlobalShipping": false, "ConditionDescription": "Item that has been used previously. The item may have some signs of cosmetic wear, but is fully operational and functions as intended. See listing for more details and description of any imperfections.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}