{"BestOfferEnabled": false, "Description": "Duesenberg Starplayer TV Blue Sparkle W/OHSC & Case Candy, Free Shirt Med (Never worn and brand new), Near Mint Excellent Condition. Shipped with USPS Parcel Select Ground. Hello there!! Thank you for checking out this guitar. I’ve sadly decided to sell this beauty. Against my will actually, gotta pay off some bills so gotta downsize my guitar collection. I’ve hard a hard time playing this guitar because I couldn’t get over how beautiful it is. It’s like a piece of art rather then a guitar. Kind of the “new guitar syndrome” I’ve only ever used this guitar at home or in studio to keep this guitar pristine. This guitar sounds incredible!! Probably the best playing guitar I’ve ever owned. But I do not play it enough to keep it. It is setup with brand new Elixir Nanoweb 10’s with low action. Comes with all case candy and a free medium Duesenberg shirt I got from them. I bought this straight from Germany and paid for customs. I didn’t want to buy this guitar from a third party like guitar center or whatever and have everyone’s filthy paws on it. So this is actually sent from the factory. *If you have never owned a Duesenberg guitar, just a note that the tremolo bars stay on inside the case. That’s how it is and how they designed it. Weird I know, but the guitar amazingly stays in tune! Please only bid if you are willing to buy. And because of the price tag on this guitar, experienced buyers only! No bids from 0% or negative feedback ebayers! Please feel to ask me any questions. Duesenberg Starplayer TV - Blue Sparkle with Case It’s not for nothing that the Starplayer TV is Duesenberg’s bestselling guitar. Its punchiness, open sound and robustness, the always in-tune Deluxe Tremola and perfect playability make the Starplayer a very versatile instrument. In addition, the Starplayer’s arched top and back bestows the guitar with a very stylish look. Even being such a versatile instrument, it always retains its discreet character and enriches every type or style of music with its distinct Duesenberg sound. This is proven by the many guitarists that come from all corners of the musical spectrum who chose this model. By now, The Domino P-90 neck pickup and the Grand Vintage Humbucker bridge pickup, an open and transparent sounding PAF-Type, have given the Starplayer TV its classic sound. Even the most exalted guitar-wishes can be fulfilled by our Special-Models. Let it be Skai leather covering, piezo bridge, aluminum Stop-Tailpieces, mother-of-pearl guitar top, Gold-Top or Sparkle finish or even equipping the guitar with Little-Toaster-Pickups – there’s a Starplayer TV guitar for everyone. And lastly, lefties are not left out: There are even two Lefthand-models in our catalog! Specification: Neck Type: traditionally glued in Wood: 1-piece maple Width: 42,5 mm / 1.67\" (nut), 52 mm / 2.05\" (12th fret) Thickness: 21 mm / 0.8\" (1st fret), 24 mm / 0.95\" (12th fret) Shape: D Fingerboard: indian rosewood Radius: 30,5 mm / 12\" Inlays: pearloid dots Frets: 22 jumbo 2,8 x 1,0 mm Scale length: 650 mm / 25.6\" Trussrod: steel dual-action Headstock: black veneer Body Type: Semi-acoustic with sustain block, bent sides, f-hole Top: laminated spruce Back, sides: laminated flamed maple Size: 46 x 34 x 7 cm / 18.11\" x 13.38\" x 2.75\" Binding: cream Pickguard: newer flat gold with logo (different materials on some special models) Finish: PUR lacquer (polyester used on sparkle, pearl and pearloid tops). Back and sides trans-black, except on some special models (Classic, Rebound, Mike Campbell) Hardware Tuners: Duesenberg Z-Tuners, \"Art Diego\" buttons Bridge: Duesenberg steel saddle bridge Tailpiece: Aluminum stop tailpiece (non-trem models only) Tremolo: Duesenberg Deluxe Tremola (trem models only) Strap pins: Duesenberg standard Hardware color: nickel Strings: Duesenberg DSA10 (010-013-017-028-042-050) Electrics Pickup (neck): Duesenberg Domino P-90 Pickup (middle): - Pickup (bridge): Duesenberg Grand Vintage Humbucker Wiring: 1 volume, 1 tone, 3-way pickup selector Accessories Case: Custom Line case (included) Tools: all required allen keys (included)", "ItemID": "163497520307", "EndTime": "2019-01-31T04:58:14.000Z", "StartTime": "2019-01-21T04:58:14.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Duesenberg-Starplayer-TV-Blue-Sparkle-W-OHSC-Case-Candy-Free-Shirt-Med-Mint-/163497520307", "ListingType": "Chinese", "Location": "Poulsbo, Washington", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1634975203078080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/OTI4WDEyNDI=/z/CFwAAOSwwkRcRUrR/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/UzMAAOSwj9JcRUqe/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/nSAAAOSwNXtcRUrP/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/YjAAAOSwfTlcRUqs/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/mQoAAOSwO-hcRUrd/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/YGcAAOSw8cFcRUqP/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/0gsAAOSwsZhcRUrh/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/JPoAAOSwzExcRUrW/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/Cj0AAOSwjrFcRUrm/$_12.JPG?set_id=880000500F"], "PostalCode": "98370", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jesus_is_king_777", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 360, "PositiveFeedbackPercent": 100.0}, "BidCount": 8, "ConvertedCurrentPrice": {"Value": 1775.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1775.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***l", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 226}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Duesenberg Starplayer TV Blue Sparkle W/OHSC & Case Candy, Free Shirt Med, Mint!", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Duesenberg"]}, {"Name": "Model", "Value": ["Starplayer TV"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Country/Region of Manufacture", "Value": ["Germany"]}, {"Name": "Body Type", "Value": ["Semi-Hollow"]}, {"Name": "Body Color", "Value": ["Blue Sparkle"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}]}, "HitCount": 484, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 1800.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}