{"BestOfferEnabled": false, "Description": "--> Fender Player Jaguar Electric Guitar (Black) Used This item is slightly used and has been thoroughly checked out by our experts to make sure it is in perfect working condition. We then re-sealed it in its original packaging with all factory included accessories. This item is guaranteed to be in \"as new\" condition and has virtually no cosmetic imperfections. This item is covered with a one year warranty from Sam Ash. The Player Series Jaguar guitar offers a contemporary take on the famous Fender that helped pave the way for new emerging genres and styles for decades. Featuring its signature 24\" scale length with a modern playing feel, this Player Jaguar also provides incredible tones thanks to a set of Player Series Jaguar pickups with coil-splitting. Vintage-inspired appointments tie together this wonderfully modern, yet still classic Jaguar incarnation. From budding musicians to well-seasoned guitarists, you can be sure that the Player Jaguar will inspire you to craft your own unique sound. Signature 24\" Scale Length with a Modern Playing FeelWith a shorter 24\" scale length, the Jaguar already provides an exceptionally slinky playing feel on its own. Add a modern \"C\" neck carve and a contemporary 9.5\"-radius fingerboard with 22 frets and you can expect pure Fender playability thats truly unmatched.Player Series Jaguar Pickups with Coil-SplittingUnder the hood of this Player Jaguar sits a perfect pairing of a Player Series Alnico 2 single-coil Jaguar pickup with a powerful Player Series Alnico 3 Jaguar humbucker. Whats more? This modern marvel even comes with a slide switch thatll give you instant access to single-coil tones from the bridge position. All of that combined with 3-way pickup switching gives you a massive range of tonal possibilities.Vintage-Inspired AppointmentsWhile this is clearly a modern instrument, Fender recognizes that they need to remain true to their heritage. For this Player Jaguar, the alder body sports more traditional body contours while the vintage-style floating tremolo provides you with the additional tonal expression that helped make the original models legendary in the first place.Features:Gloss-Finished Alder BodyShort-Scale Modern \"C\" Maple Neck with 22-Fret, 9.5\"-Radius FingerboardPlayer Series Jaguar H/S Pickups with Coil-Split Switch and 3-Way Pickup SwitchingStandard Cast/Sealed Tuners and Vintage-Style Bridge with Floating Tremolo TailpieceCase Not IncludedGet your Fender Player Jaguar Electric Guitar today at the guaranteed lowest price from Sam Ash with our 45-day return and 60-day price protection policy. Shipping Information Your gear will ship out within 2 days of order confirmation. At this time we can not ship PO Boxes, APO and FPO locations. Industry Leading 45-Day Return Policy We stand by the products we sell, and we'll certainly stand by you as well! We truly appreciate your business, and we want you to be 100% happy with your purchase. However, we know that one of the drawbacks of internet shopping is that you can't try something before you buy it. That's where our money-back guarantee comes in. If you are not completely satisfied with an item, for any reason, you can return it within 45 days of the shipping date for a complete refund of the merchandise price.* Have a question about your order? A Sam Ash Customer Service specialist is available to help! Call 800-472-6274, Monday - Saturday, from 10:00AM - 6:00PM EST. Due to the complexity of international shipping, we are unable to accept any returns on international orders. Before making a purchase outside of the United States, please know that products sold by Sam Ash use the standard 120V/60Hz voltage standard. Sam Ash is not responsible for any damage caused by not adhering to the voltage requirements. *All returns must be within 45 days of the date the item was shipped. Please do not accept any shipment if the packaging appears damaged in any way. We strongly suggest that you check your order after receiving it to be sure that it is in proper working order. Returned items must be in resalable condition. Resalable Condition means that the product(s) is exactly in the same condition as you received it. All exchanges must be pre-paid, returned in original packing, complete with blank warranty cards, owner's manual and show no sign of wear or abuse. In the event that the product is not in the same condition as you received it you may be subject to a minimum 15% restocking fee, repair charge or disqualification. Shipping and handling charges are non-refundable. Please call our Customer Service department if you have any questions about returning an item. CDs, DVDs, video tapes, sheet music, books, strings, computer hardware/software, drum heads, harmonicas, mouthpieces, sound cards, microphones, raw speakers, studio furniture, blank CDs/Tapes or Special Orders are not covered by this return policy.", "ItemID": "183668128899", "EndTime": "2019-02-05T01:05:38.000Z", "StartTime": "2019-02-03T16:40:34.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fender-Player-Jaguar-Electric-Guitar-Black-Used-/183668128899", "ListingType": "FixedPriceItem", "Location": "Tampa, FL", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1836681288998080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MzcxWDUwMA==/z/6qcAAOSwYbdcVxmF/$_1.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "samashdirect", "FeedbackRatingStar": "PurpleShooting", "FeedbackScore": 58838, "PositiveFeedbackPercent": 99.3, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 549.88, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 549.88, "CurrencyID": "USD"}, "HighBidder": {"UserID": "s***n", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 43}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "CA", "GB", "SK", "AU", "KR", "ID", "TH", "IL", "MX", "NZ"], "Site": "US", "TimeLeft": "PT0S", "Title": "Fender Player Jaguar Electric Guitar (Black) Used", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "MPN", "Value": ["0146303506"]}]}, "HitCount": 66, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1111655870", "StoreName": "Sam_Ash_Music_Direct"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalRefund": "MoneyBack", "InternationalReturnsWithin": "30 Days", "InternationalReturnsAccepted": "ReturnsAccepted", "InternationalShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "DiscountPriceInfo": {"OriginalRetailPrice": {"Value": 674.99, "CurrencyID": "USD"}, "PricingTreatment": "STP", "SoldOneBay": false, "SoldOffeBay": false}, "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Central America and Caribbean", "South America", "AS", "CK", "FJ", "PF", "GU", "KI", "MH", "FM", "NR", "NC", "NU", "PW", "PG", "SB", "TO", "TV", "VU", "WF", "WS", "AL", "AD", "AT", "BY", "BE", "BA", "BG", "HR", "CY", "CZ", "DK", "EE", "FI", "FR", "DE", "GI", "GR", "GG", "HU", "IS", "IE", "IT", "JE", "LV", "LI", "LT", "LU", "MK", "MT", "MD", "MC", "ME", "NL", "NO", "PL", "PT", "RO", "SM", "RS", "SI", "ES", "SJ", "SE", "CH", "UA", "VA", "BN", "KH", "HK", "LA", "MO", "MY", "PH", "SG", "TW", "VN", "BM", "GL", "PM", "DZ", "AO", "BJ", "BW", "BF", "BI", "CM", "CV", "CF", "TD", "KM", "CD", "CG", "CI", "DJ", "EG", "GQ", "ER", "ET", "GA", "GM", "GH", "GN", "GW", "KE", "LS", "LR", "LY", "MG", "MW", "ML", "MR", "MU", "YT", "MA", "MZ", "NA", "NE", "NG", "RE", "RW", "SH", "SN", "SC", "SL", "SO", "SZ", "TZ", "TG", "TN", "UG", "EH", "ZM", "ZW", "BH", "IQ", "JO", "KW", "LB", "OM", "QA", "SA", "TR", "AE", "YE", "AF", "AM", "AZ", "BD", "BT", "CN", "GE", "IN", "JP", "KZ", "KG", "MV", "MN", "NP", "PK", "LK", "TJ", "TM", "UZ", "PO Box"], "GlobalShipping": true, "ConditionDescription": "Like New", "QuantitySoldByPickupInStore": 0, "SKU": "F6303506X", "NewBestOffer": false}