{"BestOfferEnabled": false, "Description": "Up for sale, a 1972 Gibson SG Deluxe in excellent condition and in perfect working order. This guitar features a rich Walnut nitro lacquer finish with original \"Gibson\" embossed chrome pickup covers, very rarely seen on this model and only available from 1971-72! The tone and sustain is everything you'd want from a vintage SG, and the stock patent stickered T Top humbuckers deliver great warmth and articulate, powerful tone. The guitar's bold acoustic voice translates well through the pickups with ample low end, meaty midrange, and glassy treble frequencies with great harmonic content. Easy on the back at only 7lbs 14oz, this SG is resonant and well balanced. Professionally setup here at Mike & Mike's Guitar Bar and strung with 10-46 strings, this SG Deluxe is ready for stage and studio use.The three-piece mahogany neck has a profile that begins as a more slender C down near the nut and grows gradually deeper as you move up the fretboard, graduating into near \"baseball bat\" territory by the time you reach the 12th fret. This profile is extremely comfortable, filling the palm and fretting easily with low action and solid intonation. And while there are an assortment of shallow nicks on the profile, it's nothing distracting to the palm or impeding playability in the slightest. The original Gibson wide/flat frets are intact, showing only moderate wear near the nut and limited wear further up the board. Not quite in the \"fretless wonder\" category of some Gibsons, these frets retain their full, original height and have plenty of life. The original nut has a 1 9/16\" width and the headstock sports uncommon and original nickel Grover tuners with metal tulip buttons that turn very smoothly and hold pitch well.On the body, all of the electronics work as they should, with individual Volume and Tone controls coupled to a three-way pickup selector switch. Under the hood, everything is just as it was when this guitar left the factory, with untouched solder joints, original CTS pots which date to the 15th week of '72, and tone caps and stock shielding in the control cavity to give the guitar a low noise floor, ideal for recording. These pickups have clean patent stickers on the baseplates and untouched solder joints, and the embossed covers are particularly uncommon. The bridge base is a newer Gibson ABR-1 which retains original saddles, and there is a bit of scuffing around the bridge thumbwheels on the top. Cosmetically, the nitro lacquer finish shows light buckle rash on the back and assorted minor battle scars, with some nicks and dings around the body edges, particularly on the lower bout. The guitar exhibits no cracks or repairs, and this is an honestly played and professionally setup vintage Gibson. The chrome pickup covers and plastic parts are quite clean too.A vintage Gibson \"chainsaw\" hardshell case is included. Check out our shop \"Mike & Mike's Guitar Bar,\" and please let us know if we can answer any questions! Shipping in the continental USA will be $70, fully insured and shipped via FedEx Ground. Expedited shipping available for an additional fee at buyer's request. We will happily ship WORLDWIDE, but please contact us for an accurate international shipping quote before bidding or buying, as cost varies by buyer location. International orders will be declared as “merchandise,” and the value of merchandise will be declared as the amount paid. We cannot declare anything as a gift or for a lesser value. No exceptions! The customer is responsible for all taxes and duty, which may be collected upon delivery, as well as any additional charges involved with import. We have all necessary CITES paperwork in-hand to ship rosewood worldwide.We do our best to describe all items with honesty and accuracy, but to be sure, please contact us with any questions or concerns prior to bidding or buying. We require payment within 48 hours of auction end. In the unlikely event of a return, buyer pays all shipping costs. Your positive feedback and five star ratings are very important to us, and we appreciate your communication in resolving any issues!", "ItemID": "153277570797", "EndTime": "2018-12-17T21:18:58.000Z", "StartTime": "2018-11-25T22:52:47.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1972-Gibson-SG-Deluxe-Vintage-Electric-Guitar-Walnut-Embossed-Pickups-w-Case-/153277570797", "ListingType": "FixedPriceItem", "Location": "Seattle, Washington", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1532775707978080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/YXYAAOSwjQVb-yJb/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/6d4AAOSwsDZb-yJh/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/1A4AAOSwmfhb-yJj/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/BpsAAOSwpLdb-yJq/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/kVQAAOSwXMxb-yJf/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/bl8AAOSwPuRb-yJz/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/aEoAAOSw4c5b-yJd/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/zpUAAOSwEX5b-yJs/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/2NQAAOSwBJVb-yJv/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/gMIAAOSwIbtb-yJm/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/mesAAOSwV3hb-yJo/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/9tgAAOSwmkBb-yJx/$_57.JPG?set_id=8800005007"], "PostalCode": "98117", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mmguitarbar", "FeedbackRatingStar": "Red", "FeedbackScore": 2591, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 2349.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2349.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "u***u", "FeedbackPrivate": false, "FeedbackRatingStar": "Green", "FeedbackScore": 6567}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "1972 Gibson SG Deluxe Vintage Electric Guitar Walnut Embossed Pickups w/ Case", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Walnut"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Material", "Value": ["Mahogany"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model", "Value": ["SG Deluxe"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["1972"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}]}, "HitCount": 688, "PrimaryCategoryIDPath": "619:3858:33034", "SecondaryCategoryID": "118985", "SecondaryCategoryName": "Musical Instruments & Gear:Vintage Musical Instruments:Vintage Guitars & Basses:Electric Guitars", "SecondaryCategoryIDPath": "619:181162:181163:118985", "Storefront": {"StoreURL": "https://stores.ebay.com/id=269063702", "StoreName": "Mike and Mikes Guitar Bar"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}