{"BestOfferEnabled": true, "Description": "Please feel free to contact us with any questions you may have about this listingor any other items that we carry in our store! Thank you for taking the time to visit Blues Angel Music's eBay store! Blues Angel Music, est. in 1997 in Pensacola, Florida, has been named by NAMM (National Association of Music Merchants) as one of the \"TOP 100\" music stores in the USA since 2011!!! Your satisfaction is our #1 objective! 2008-2009 Fender American Standard Stratocaster Electric Guitar, Sienna Ex, #Z8095412 Blues Angel Music is proud to be an Authorized Fender Dealer! The guitar you see is the actual guitar you will receive! *Please read shipping information at the bottom of the listing* This Fender American Standard Strat has been previously gently owned. It plays and sounds great. There are few minor cosmetic imperfections such as light scratches that can be seen in the photos and pick swirls and very light scratches that are too light to see in the photos. The neck is straight but does have some very small impressions on the back of it. The frets also show a very minor amount of wear. We invite you to view the photos and please be sure to message us with any questions that you may have about this guitar. DescriptionThe American Standard Stratocaster® is the same great best-selling, go-to guitar it has always been, and now it's upgraded with aged plastic parts and full-sounding Fender Custom Shop Fat '50s pickups. The latest iteration of our time-honored classic, it is the very essence of Strat tone and remains a beauty to see, hear and feel. Product SpecsModel Name American Standard Stratocaster®, Rosewood Fingerboard, Sienna SunburstModel #0110400747Series American StandardCountry Of Origin USColor Sienna SunburstBody AshBody Finish UrethaneBody Shape Stratocaster®Neck Material MapleNeck Shape Modern \"C\"Scale Length 25.5\" (648 mm)Fingerboard RosewoodFingerboard Radius 9.5\" (241 mm)Number of Frets 22Frets Size Medium JumboString Nut Synthetic BoneNut Width 1.685\" (42.8 mm)Position Inlays DotTruss Rods Bi-Flex™Truss Rod Wrench 1/8\" Hex (Allen)Bridge Pickup Custom Shop Fat '50s Single-Coil Strat®Middle Pickup Custom Shop Fat '50s Single-Coil Strat®Neck Pickup Custom Shop Fat '50s Single-Coil Strat®Controls Master Volume, Tone 1. (Neck Pickup), Tone 2. No-Load Tone Control (Middle and Bridge Pickups)Pickup Switching5-Position Blade: Position 1. Bridge Pickup, Position 2. Bridge and Middle Pickup, Position 3. Middle Pickup, Position 4. Middle and Neck Pickup, Position 5. Neck PickupPickup Configuration SSSBridge 2-Point Synchronized Tremolo with Bent Steel SaddlesHardware Finish ChromeTuning Machines Deluxe Staggered Cast/SealedPickguard 3-Ply ParchmentStrings Fender® USA Bullets® 3250L, NPS, (.009-.042 Gauges)Unique Features New Bent Steel Saddles with Elongated String Slots, Copper Infused High Mass 100% Metal Bridge Block, Thinner Undercoat Finish for Improved Body Resonance, Tinted Neck, Aged Plastic PartsIncluded Accessories Molded rectangular SKB® case, Cable, Strap, Polishing ClothDimensions 6.00x17.50x43.00 INActual Weight: 7.10 Lbs *Shipping Information*We use Fed Ex or USPS for our shipping services.Expedited shipping is available for an additional cost.\"ALL\" orders over $50.00 require a signature.If you do not wish to have a signature for your item you must submit to us that you do not wish to have a signature on your item and that you assume any and all responsibility in the event your purchased item is lost during shipment or stolen from your home.ALL shipped items include insurance\"Free Shipping\" applies only to the contiguous 48 states, and not to Alaska and Hawaii.Large Packaged Items such as Guitars, Basses, Amps, Drums, and Keyboards being shipped to Post Office Boxes will incur additional charges.We ship most of our new items in custom-made, double-walled boxes, as many original manufacturer's shipping boxes are not strong enough to withstand multiple shipments, and have already been used at least once to ship to us. As such, your item may not come in the original manufacturer's box. We do our very best to ensure that your instrument arrives safely and securely. See our feedback for positive comments on how well we ship!Packaging:Our items no matter the size or shape are professionally packed by our expert shipping department. Please see our feedback for what customers say about shipped items. ALL of our guitars at Blues Angel Music are professionally detailed and set up by our very own Master Luthiers! We want your guitar to arrive in the best condition possible and ready to play! Please note that temperature and humidity changes occurring during shipping may affect setup, and the responsibility of any desired changes to setup resides with the buyer. Rest assured that most customers are satisfied with setup upon arrival! If you're ever passing through Northwest Florida, be sure to stop by and say hello! We're home of the World's only full-scale Drum Set Fish Tank created by Animal Planet's hit TV show \"Tanked!\" WANT MORE? SEE OUR OTHER LISTINGS#EAM#01.17.19", "ItemID": "333020830452", "EndTime": "2019-01-19T18:37:10.000Z", "StartTime": "2019-01-17T23:58:38.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/08-09-Fender-American-Standard-Stratocaster-Electric-Guitar-Sienna-Ex-ISS4339-/333020830452", "ListingType": "FixedPriceItem", "Location": "Pensacola, Florida", "PaymentMethods": ["PayPal", "VisaMC", "Discover", "AmEx"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/3330208304528080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTM0NVgxNjAw/z/XVoAAOSwkjJcQRJp/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODE2WDE2MDA=/z/16YAAOSw-V1cQRJm/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE2MFgxNjAw/z/S0EAAOSwyApcQRJw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTUzWDE2MDA=/z/YlgAAOSwpwBcQRJy/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIyNVgxNjAw/z/5ugAAOSwlINcQRJ2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzkwWDE2MDA=/z/IgwAAOSw-sVcQRJ0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIxN1gxNjAw/z/cvsAAOSwP85cQRJt/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA4OFgxNjAw/z/Lx0AAOSwXyBcQRJ7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA5OVgxNjAw/z/3sUAAOSwltxcQRJr/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTMxWDE2MDA=/z/1yAAAOSwckZcQRJ4/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMzU0/z/ByIAAOSwg0dcQRJ9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA3MVgxNjAw/z/lksAAOSwDsZcQRJ~/$_57.JPG?set_id=8800005007"], "PostalCode": "32507", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "bluesangelmusic850", "FeedbackRatingStar": "Red", "FeedbackScore": 4320, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 799.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 799.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "s***8", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 3}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "08-09 Fender American Standard Stratocaster Electric Guitar, Sienna Ex #ISS4339 ", "ItemSpecifics": {"NameValueList": [{"Name": "Size", "Value": ["Full Size"]}, {"Name": "Body Color", "Value": ["Sienna"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["American Standard Stratocaster"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["2008-2009"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Brand", "Value": ["Fender"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["0110400747"]}]}, "HitCount": 26, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=13970765", "StoreName": "Blues Angel Music"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["RU", "BR"], "GlobalShipping": false, "ConditionDescription": "This Fender American Standard Strat has been previously gently owned. It plays and sounds great. There are few minor cosmetic imperfections such as light scratches that can be seen in the photos and pick swirls and very light scratches that are too light to see in the photos. The neck is straight but does have some very small impressions on the back of it. The frets also show a very minor amount of wear. We invite you to view the photos and please be sure to message us with any questions that you may have about this guitar.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}