{"BestOfferEnabled": false, "Description": "MIJ, made in japan, Gibson, Lespaul, White, SG, Höfner, Duesenberg, Ibanez, ATELIER Z, ARIA, ESP, Caparison, Killer, COMBAT GUITARS, GUYATONE, Greco, Sugi Guitars, TEISCO, DEVISERA, Nil, Bacchus, VANZANDT, Fernandes, Fender Japan, Fujigen, MOON GUITARS, momose, Yairi Guitar, YAMAHA, TOKAI, Zemaitis, VOX, B, C, Rich, Epiphone, Gibson, Gretsch, Suhr, Schecter, Charvel, Jackson, Dean, Tom Anderson, Fender, Paul Reed Smith, Melancon, Mosrite, Rickenbacker, Robert Benedetto, Washburn, Ibanez, kramer, EDWARDS, Burny, Grassroots, 2000 Epiphone Japan LPS-85F All Original ~ Les Paul Standard / Deep Joint ~Very Good+ Condition !!Made in Japan Down from here. Photo is dent and scratches, etc.. About scratches that are hard to see. To make it easy to understand the condition of the scratches, I lighted the light strongly. 2000 Epiphone Japan LPS-85F All Original ~ Les Paul Standard / Deep Joint ~Very Good+ Condition !!Made in Japan Body Maple Top, Mahogany Back. Neck Mahogany, Deep Joint. Scale 22F. 24.75inch (628mm), Gibson Medium Scale. Nut Width About 1.69inch (43mm). Pickup Epiphone Japan PAF style. Control 2Volume, 2Tone, 3Way Toggle-SW. Bridge Tune O Machic Stop Tailpiece. Machine heads Epiphone Japan. Color Lemon Drop. Weight About 7.89pound ( 3.58Kg ) This is Used Guitar. The strap pin has been changed to the lock type. I changed the bridge's tone pot and the output jack to new one. The hard case is deteriorated, and partially repaired by Glue. There are scratches and dents. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. It was manufactured by Fujigen factory in 2000. About Gibson's copy model in Japan, it changed from Orville in the 1990's to Epiphone Japan. It has a formal license from Gibson, we can dignifiedly say \"Les Paul\". Both Orville and Epiphone are produced by Fujigen in japan. As you all know, Epiphone in recent years is produced outside of Japan such as China and Korea. This is made in Japan. Made in japan of Epiphone is very popular in japan. Especialy the Lemon drop color and tiger flame maple top. There are many similar Epiphones made in China and Korea, but Japanese-made things do not seem too much in japanese used guitars market. I can say the Lemon drop color and tiger flame maple top model of made in japan is especialy rare model. Unfortunately, Japanese-made Epiphone is not currently being made. The biggest difference is the shape of the head. It is called \"Gibson head\", it is unique to Japan. Making is very polite, and neck joint is deep. You can feel a made in Japan. And, It is relatively lightweight than normal Les Paul. You will be able to move actively on the stage. The remaining amount of the Frets are many. You do not have to change the new frets for some time. Accuracy of the product is high. Epiphone Japan is Great !! About guitar play, Current state, the space between the strings and the frets is standard. And, remaining amount of the Frets are many. Thanks to that, I feel easy to play the guitar. This Epiphone is Deep joint. Therefore Un pluged sound is very loud. You can feel vibrations transmitted to the body. The pickups are Epiphone japan original of PAF style. It gives very good distortion sound and clean sound. It can say that it can correspond to various music. All parts, all made in japan. Let's enjoy the Epiphone Japan ! It is cleanliness. I polished with guitar exclusive polish, so it is in a very clean state. I after the finger board cleaning, painted beeswax. The aim is moisturizing and and protection. Current neck condition, very good ! roughly straight ! There is no problem with the Truss rod and it can be adjusted. Remaining Frets are 95% on average. You can play immediately after it is delivered to you. I was set new strings. Regular tuning. ( Inch : 009, 011, 016, 024, 032, 042 )Guitar playing, is comfortable. All is working well. It is in a very good condition. The Truss rod Wrench is not included. All Original.Note : I changed the bridge's tone pot and the output jack to new one. The strap pin has been changed to the lock type. The Hard Case Included. The Key was lost. Look at the photos, please verify by yourself! It will be professionally pack. Double air packing. And ships inside a sturdy cardboard box. This electric guitar is USED. Please consider it when bidding. Thank you. Payment I accept PayPal only. Please pay within 3 days after the auction closed. Shipping Worldwide shipping from Japan! EMS / Shipping includes a tracking number. / / / Destination cost Delivery time / / / Asia : $1204 ~ 7daysUS Canada : $1405 ~ 8 daysEurope : $1606 ~ 10 daysOceania : $1405 ~ 8 daysSouth America : $2608 ~ 12 days This item is shipped within 3 business days after payment is confirmed. Terms of Sale International buyers - Please Note: Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer's responsibility. Please check with your country's customs office to determine what these additional costs will be prior to bidding/buying. These charges are normally collected by the delivering freight (shipping) company or when you pick the item up -do not confuse them for additional shipping charges. Please contact us first with 30 working days for any returns, Buyer pays shipping cost from buyer's country to Japan when being returned. In case of return, the shipping cost won't be refunded. We sell various kinds of Japanese products to international customers. Our goal is to provide the best quality products and service and your satisfaction is the most important to us. Happy bidding!! Thank you !!", "ItemID": "254127748898", "EndTime": "2019-02-24T05:04:38.000Z", "StartTime": "2019-02-17T05:04:38.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2000-Epiphone-Japan-LPS-85F-All-Original-Les-Paul-Standard-Deep-Joint-MIJ-/254127748898", "ListingType": "Chinese", "Location": "Nagoya-shi,Kita-ku, Aichi", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2541277488988080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/7nAAAOSwaPNcUkP~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI0MFgxNjAw/z/jeAAAOSw8iZcUkQD/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/PKoAAOSwO7dcUkQH/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/k0kAAOSwTxJcUkQJ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/mW0AAOSwZ2tcUkQc/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/dAcAAOSw8~hcUkQz/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/a8cAAOSw4MNcUkRb/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/dtYAAOSw8U9cUkRU/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/z4gAAOSwwkRcUkR0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/c~EAAOSwCitcUkRx/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE2NlgxNjAw/z/G-wAAOSwh7tcUkSC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/zhsAAOSwQSlcUkSN/$_57.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jguitar-shop", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 376, "PositiveFeedbackPercent": 100.0}, "BidCount": 16, "ConvertedCurrentPrice": {"Value": 518.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 518.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "2***g", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1120}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Americas", "Europe", "Asia", "AU"], "Site": "US", "TimeLeft": "PT0S", "Title": "2000 Epiphone Japan LPS-85F. All Original. Les Paul Standard. Deep Joint. MIJ.", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Epiphone Japan"]}, {"Name": "Model Year", "Value": ["2000"]}, {"Name": "Modified Item", "Value": ["Yes"]}, {"Name": "Model", "Value": ["LPS-85F Les Paul Standard"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Bundle Description", "Value": ["The Hard Case"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Modification Description", "Value": ["I changed the bridge's tone pot and the output jack to new one. The strap pin has been changed to the lock type."]}, {"Name": "Body Color", "Value": ["Lemon drop"]}, {"Name": "Custom Bundle", "Value": ["Yes"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Series", "Value": ["Original"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["001148"]}]}, "HitCount": 993, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "JP", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 528.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["APO/FPO", "Africa"], "GlobalShipping": false, "ConditionDescription": "Very Good+ Condition. This is Used Electric Guitar. The electric guitar when connect to the amplifier, sound output is normal. There are scratches and Dents. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. Please Read the descriptions for details.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}