{"BestOfferEnabled": false, "Description": "Mint/Like New These guitars have never been played out. All the factory accessories are included. Please see the photos above; they are a representation of the actual item for sale. Gibson Les Paul Junior Tribute Doublecut Solidbody Guitar 2019 Worn Brown + Bag Rebirth of a Solidbody Classic Strap on the Gibson Les Paul Junior Tribute Doublecut solidbody electric guitar and experience a primal instrument that's primed for rock 'n' roll. The Les Paul Junior Tribute pays homage to one of the 1950s' most beloved guitars. From its single P-90 pickup to its SlimTaper neck profile to its simple-yet-sturdy hardware, you'll love the instantly recognizable LP single-cutaway design and vintage vibe. With original LP Juniors becoming harder and harder to get a hold of, this Les Paul Junior Tribute Doublecut puts a classic in your hands. Double cutaway mahogany slab body Gibson built the Les Paul Junior Tribute with one thing in mind: to deliver the feel, sound, and vibe of a genuine LP Junior to your hands. This axe features a premium-quality mahogany slab body that retains the distinctive Les Paul shape. The nickel-plated wraparound bridge anchors your strings to the body for great sustain, proving that sometimes simple is better. It's the perfect example of a purpose-built instrument, and a real blast from the past. One P-90 pickup in the bridge position You won't be able to get enough of the Les Paul Junior Tribute Doublecut's lone single-coil P-90 pickup. Plug the Les Paul Junior Tribute into your favorite amp and prepare to be astounded by the sound. The pickup straddles the perfect line between single-coil clarity and humbucker power. Yet, when cranked, it screams with a midrange snarl all its own. It's no coincidence that leagues of players got their start with this guitar — and keep coming back to it time and time again. SlimTaper neck feels great and provides exceptional playability This Gibson Junior sports a comfortable, fast-action neck with a SlimTaper profile. Early Gibson guitars had huge, sometimes ungainly necks. By 1960, Gibson had gradually carved down this profile into what became their SlimTaper neck. As your fingers moved down this neck, the precisely controlled width-to-thickness ratio of the Firebird's SlimTaper neck offers a consistent, fast, and comfortable feel. It's no wonder many life-long guitar players consider the SlimTaper Gibson's finest neck. Gibson Les Paul Junior Tribute Solidbody Electric Guitar Features: Reproduction of the straightforward Les Paul Junior Tribute Single P-90 chimes and snarls with the best Great sustain and midrange character, thanks to premium mahogany slab body Maple neck with SlimTaper profile for comfortable playability Simple hardware for authentic looks and feel plus great tuning stability Tech Specs: Body Type: Solidbody Body Shape: Junior Les Paul Doublecut Left-/Right-handed: Right-handed Number of Strings: 6 Body Material: Mahogany Body Finish: Nitrocellulose Lacquer Color: Worn Brown Neck Material: Maple Neck Shape: Slim Taper Radius: 12\" Fingerboard Material: Rosewood Fingerboard Inlay: Acrylic Dots Number of Frets: 22, Medium Scale Length: 24.75\" Nut Width: 1.695\" Nut Material: Tektoid Bridge/Tailpiece: Compensated Wraparound Tuners: Vintage Deluxe Bridge Pickup: P-90 Single-coil Controls: 1 x volume, 1 x tone Case Included: Gig Bag Manufacturer Part Number: LPJDT19WBCH1 INCLUDED:Gig Bag Strap Documentation/Manual Cleaning Cloth Truss Rod Wrench Allen Key Check out my other auction listings! and be sure to add me to your favorites list. CONTACT INFORMATION You can e-mail us with any questions you may have about an item. We are very easy to reach, and we are glad to help. Just click \"Ask a question\" in the questions and answers area below. Please note that we are not in the office after 5:00PM EST on weekdays, or all day Saturdays and Sundays. Questions asked over the weekend will be answered on the following business day. SHIPPING INFORMATION Items are shipped within one business day of payment. To avoid a lost or stolen item, your package may ship \"Signature Required.\" If you have special shipping instructions or would like your item shipped UPS instead of USPS or FedEx, please contact us before you make a purchase. We collect local sales tax here in Indiana. This applies to Indiana residents who we ship to, as well as non-Indiana residents who drive here for local pickups. We also collect sales tax in other states around the country. Please check eBay's tax information on the \"Shipping and payments\" tab above to see if we are collecting tax in your area. PLEASE NOTE Shipping quotes are estimates only. We use eBay’s shipping calculator, which provides estimated shipping charges on listings where “Free Shipping” is not offered. Ebay's FedEx calculator on the item page quotes eBay's discounted FedEx shipping rates, which we honor. At checkout, however, buyers in certain areas will see the calculator attempt to charge the full retail price. FedEx's full retail price is the price you pay if you were to walk into a FedEx retail location. The difference between eBay's discounted rate and this retail price can be as much as 40%. If you estimate shipping with a zip code that is different from the zip code registered to your User ID, eBay’s shipping calculator will make the adjustment at checkout. Additionally, FedEx charges a surcharge for delivery in certain rural areas of the country that does not, for some reason, show up in eBay’s estimate calculator; but it does at checkout (we wish we could control this, but we can’t — we have contacted eBay many times about this issue). FedEx does this based on the +4 extension of your primary 5-digit zip code. For example, eBay’s shipping calculator may quote you one price based on your primary 5-digit zip, and then figure out that your requested street address at checkout places you within the rural surcharge area, changing the shipping price to an alternate amount that was originally quoted. If there is a discrepancy in your shipping cost, please send us a screen shot of the quoted price to you on our item page and we can override the eBay checkout calculation to get you the cheapest rate. RETURN INFORMATION We want you to be completely happy with your purchase. If the item you receive is not as described or has been damaged in shipping, please contact us immediately. We will make every effort to promptly resolve any problem. Your satisfaction is our top priority. We are happy to offer free shipping on some of the items we offer. Please note that if you decide to return something where free shipping was offered, our shipping costs are non-refundable.", "ItemID": "372606422462", "EndTime": "2019-02-20T11:57:10.000Z", "StartTime": "2019-02-20T11:22:31.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-Les-Paul-Junior-Tribute-Doublecut-Solidbody-Guitar-2019-Worn-Brown-Bag-/372606422462", "ListingType": "FixedPriceItem", "Location": "Fort Wayne, Indiana", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/3726064224628080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/ODAxWDE2MDA=/z/g98AAOSwJ~xcT14b/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg2MjQ=/z/jDQAAOSwWAhcT14d/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzA2WDE2MDA=/z/rEUAAOSwA3xcT14Z/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU5OVgxMjc0/z/5fcAAOSwuQhcT14g/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg2Mjk=/z/CzAAAOSwU7pcT14h/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg4MDU=/z/yigAAOSwCYJcT14i/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg4NjE=/z/TNAAAOSwf1xcT14k/$_57.JPG?set_id=8800005007"], "PostalCode": "46818", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jeffsmusicgear", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 14549, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 499.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 499.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "t***n", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 2445}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson Les Paul Junior Tribute Doublecut Solidbody Guitar 2019 Worn Brown + Bag", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "MPN", "Value": ["LPJDT19WBCH1"]}, {"Name": "Body Material", "Value": ["Mahogany"]}, {"Name": "Model", "Value": ["Les Paul Junior"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}]}, "HitCount": 22, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=36123540", "StoreName": "jeffsmusicgear"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "TopRatedListing": true, "GlobalShipping": false, "ConditionDescription": "Mint/Like New. These guitars have never been played out. All the factory accessories are included.  Please see the photos above; they are a representation of the actual item for sale.", "QuantitySoldByPickupInStore": 0, "SKU": "LPJDT19WBCH", "NewBestOffer": false}