{"BestOfferEnabled": false, "Description": "Your satisfaction is our number one goal. Keep in mind that we offer hassle-free returns if needed. If you have any questions or problems, please contact us. Please Note: All included items are shown in the pictures 235120935 Features: Ebony Fingerboard Schecter Custom String-Thru Body Bridge Mahogany Body with Quilted Maple Top Schecter's Hellraiser Extreme-5 electric bass guitar is a premium instrument made with top notch woods and electronics. This bass is truly a work of artistic craftsmanship. The Hellraiser Extreme-5 has a multi-laminate maple and walnut neck. It's made from 3 pieces of maple and 2 center strips of walnut. This well balanced combination of select wood takes the bright tones of maple and adds a dark tone from the walnut strips. It's often used for Thru neck construction, giving the acoustic tone of the instrument a perfect string vibration transfer to the body. The ebony fingerboard has a snappy, crisp attack with the density of Maple, but with more brittle grains, oilier pores, and a stronger fundamental tone than Maple. It has a tremendous amount of percussive overtones in the pick attack, that mute out shortly thereafter to foster great, long sustain. Inside the Hellraiser Extreme-5 are both single and dual-coil EMG 40TW pickups, each with its own output. The single-coil mode is a new version of the J pickup built in the CS (ceramic and steel). The dual-coil mode is the popular CS dual-coil consisting of two coils opposite one another creating a pickup similar to model 40CS. A push/pull volume pot allows you to change from the clarity of a single-coil to the fatness of a dual-coil. Grover Bass tuners top off this bad boy. The Grover ˜MINI\" is lightweight, compact and durable for modern electric basses. Gear ratio is 20:1. Housing is specially machined to achieve the precise tolerance that prevents slippage and allows fine tuning. Sealed gear box has permanent lubrication that makes the MINI friction-free for life. Case sold separately. Features Neck-thru construction w/ultra access Mahogany body w/Quilted Maple top Multi-laminate maple & walnut neck Ebony finger board w/ 24X jumbo frets Mother of Pearl gothic cross inlays Mother of Pearl multi-ply bindings Grover bass tuners EMG 40TW pickups Vol (tap)/Vol (tap)/EMG active 18v B64 3-band EQ Schecter custom string-thru body or top load bridge 35\" Scale Black chrome hardware What's included: Schecter DIAMOND SERIES Hellraiser Extreme 5 string Bass- Right handed What's not included: Case Condition: This bass has been previously owned and is in great playing condition. It has some very light wear and tear from use. 235120935 Payment & Checkout Checkout: After the auction has ended please click the checkout button to proceed with your payment. Payments: Payments must be received within 3 days. Unpaid cases will automatically be open by eBay 7 days after purchase. Taxes: Sales tax is charged for items shipped to: MN*(6.875%), WI*(5.0%) All Emails and Invoices will be sent to your registered eBay Email Address. If you are not receiving our emails please check your email spam filters. Shipping We Ship to confirmed addresses only! Make any changes to your address before paying. All items will be shipped to your confirmed billing address! Shipping Carriers: SurePost, UPS & USPS 1-6 Day. We choose the shipping carrier at our discretion. Local Pickups: Please contact us for local pickup information. Product Guarantee We offer a 30 Day Money Back Guarantee unless noted \"As Is\" or \"For Parts or Not Working\". We do not offer returns on international orders. We do our very best to accurately describe our items, however If you have any problems please contact us right away. Frequently Asked Questions What are your operating hours? M-F 9:00am - 5:00PM Central Standard Time Do you ship internationally? We ship internationally on select items. What is the history of the item? Most of our items are used and we do not know the history. We test them and picture their current condition. What's Included? 99% of the time If it's pictured it's included. Please also read \"What's included\" How long do I have to make payment? You have 3 days to make payment. Prestalia e-commerce solutions. Protect Your Product With a Consumer Priority Service Warranty", "ItemID": "292754347307", "EndTime": "2019-01-15T06:37:21.000Z", "StartTime": "2018-10-02T17:32:05.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Schecter-DIAMOND-SERIES-Hellraiser-Extreme-5-string-Bass-Right-handed-/292754347307", "ListingType": "FixedPriceItem", "Location": "Minneapolis, Minnesota", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2927543473078080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTEwMFgxMTAw/z/WIcAAOSwMFFbs6ua/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTEwMFgxMTAw/z/zDoAAOSwA~1bs6uY/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTEwMFgxMTAw/z/5OQAAOSwx5hbs6uY/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTEwMFgxMTAw/z/HF0AAOSwfr1bs6uY/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTEwMFgxMTAw/z/NRsAAOSwHMhbs6uY/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTEwMFgxMTAw/z/W~kAAOSwtJxbs6uY/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTEwMFgxMTAw/z/DlMAAOSwAfVbs6uY/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTEwMFgxMTAw/z/bOkAAOSwZKpbs6uY/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTEwMFgxMTAw/z/FloAAOSwr3xbs6uY/$_1.JPG?set_id=880000500F"], "PostalCode": "55421", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "epawnamerica", "FeedbackRatingStar": "RedShooting", "FeedbackScore": 150873, "PositiveFeedbackPercent": 99.5, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 695.16, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 695.16, "CurrencyID": "USD"}, "HighBidder": {"UserID": "6***3", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 2}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Schecter DIAMOND SERIES Hellraiser Extreme 5 string Bass- Right handed", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Schecter"]}, {"Name": "String Configuration", "Value": ["5 String"]}, {"Name": "Model", "Value": ["DIAMOND SERIES Hellraiser Extreme"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}]}, "HitCount": 218, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=16525387", "StoreName": "ePawnAmerica"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "APO/FPO", "US Protectorates", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "TopRatedListing": true, "GlobalShipping": false, "ConditionDescription": "This bass has been previously owned and is in great playing condition. It has some very light wear and tear from use", "QuantitySoldByPickupInStore": 0, "SKU": "ebay-961062", "NewBestOffer": false}