{"BestOfferEnabled": false, "Description": "Fender Stratocaster Deluxe Roadhouse Stratocaster w/ Plush Gigbag. Condition is Used. Shipped with USPS Priority Mail. I picked this up around 2015 and I'll tell you for sure, you will rarely see this much guitar for the money. Not played enough to justify keeping it - virtually no signs of wear on it. Yes, it's Mexican, but this could be the only guitar you need on stage and will go up against the American Strats easily. While it is on the \"more affordable\" end of the spectrum, I was shocked the first time I picked it up - a few notches above the standard MIM Strat, and maybe some USA Strats! Shipped in it's original box with top-of-the-line Fender Plush gig bag with all the case candy that came with it and vibrato bar; you are getting a very nice package here, practically unused! I have original pearloid pick guard (shown) and will install it if you say so, your call. If not, I will hang on to it and you will get the Genuine Fender Parts replacement (with matching back plate) that is presently mounted on it. Much nicer I think. This video demo says it better than I can: https://youtu.be/qhGdM6ytQBU Fender's Deluxe Roadhouse Stratocaster tears the place down with extra-scorching Strat sound and style. Its three Texas Special single-coil pickups are wired for supercharged tonal versatility, with a special V6 rotary switch (disguised as the middle tone knob) that delivers six distinct onboard-preamp tone settings from wiry single-coil to searing lead. The S-1 switch built into the volume knob bypasses the preamp completely for pure Strat tone.Other features include a tinted maple neck with \"modern C\" profile and large '70s-style headstock, 9.5\"-radius maple or rosewood fingerboard with 22 medium jumbo frets, five-way pickup switch, four-ply aged white pearloid pickguard, three aged white control knobs (master volume/S-1, V6, master tone), and vintage-style synchronized tremolo bridge. Fender Deluxe Roadhouse Stratocaster Specifications: Model Name: Deluxe Roadhouse StratocasterModel Number: 0145012341Series: Deluxe BodyBody Material: AlderBody Finish: Gloss PolyesterBody Shape: Stratocaster NeckNeck Material: MapleNeck Finish: Gloss UrethaneNeck Shape: Modern \"C\"Scale Length: 25.5\" (648 mm)Fingerboard: MapleFingerboard Radius: 9.5\" (241 mm)Number of Frets: 22Fret Size: Medium JumboString Nut: Synthetic BoneNut Width: 1.650\" (42 mm)Position Inlays: Black or White DotTruss Rod Nut: 3/16\" Hex AdjustmentNeck Plate: 4-Bolt Standard ElectronicsBridge Pickup: Texas Special Single-Coil StratMiddle Pickup: Texas Special Single-Coil StratNeck Pickup: Texas Special Single-Coil Strat Controls: Master Volume, Master 6-Position V6 Rotary Tone Switch, Master TonePickup Switching: 5-Position Blade: Position 1. Bridge Pickup, Position 2. Bridge and Middle Pickup, Position 3. Middle Pickup, Position 4. Middle and Neck Pickup, Position 5. Neck Pickup Pickup Configuration: SSSSpecial Electronics: The 6-position V6 rotary switch utilizes the onboard preamp to provide 6 distinct tone settings ranging from wiry single-coil to scorching lead. The S-1 Switch bypasses the preamp completely. HardwareBridge: Vintage-Style Synchronized TremoloHardware Finish: ChromeTremolo Arm Handle: Vintage-Style Tremolo ArmTuning Machines: Standard Cast/SealedPickguard: 4-Ply Aged White PearloidControl Knobs: Aged White PlasticSwitch Tips: Aged White MiscellaneousStrings: Fender USA, NPS, (.009-.042 Gauges) Unique Features: Onboard Preamp with Rear Mounted Battery Compartment, Large '70s Style Strat® Headstock and Logo Decal, Dual Wing String Trees, Lightly Tinted Neck .", "ItemID": "183690449180", "EndTime": "2019-02-24T21:58:26.000Z", "StartTime": "2019-02-17T21:58:26.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fender-Stratocaster-Deluxe-Roadhouse-Stratocaster-w-Plush-Gigbag-/183690449180", "ListingType": "Chinese", "Location": "Christiana, Tennessee", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1836904491808080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTI4MFg3MjA=/z/gngAAOSwxS9cacyi/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTI4MFg3MjA=/z/vDIAAOSweWtcacyu/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTI4MFg3MjA=/z/zSkAAOSwHQdcacy4/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTI4MFg3MjA=/z/ny4AAOSwk25caczE/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTI4MFg3MjA=/z/l54AAOSwKk5caczO/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTI4MFg3MjA=/z/WLcAAOSwqiRcaczZ/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTI4MFg3MjA=/z/638AAOSwjedcaczj/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTI4MFg3MjA=/z/g6IAAOSwaP5cadM4/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTI4MFg3MjA=/z/W~gAAOSw3AFcadNA/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTI4MFg3MjA=/z/k0QAAOSw8adcac0R/$_32.JPG?set_id=880000500F"], "PostalCode": "37037", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "kdbot", "FeedbackRatingStar": "Red", "FeedbackScore": 1025, "PositiveFeedbackPercent": 100.0}, "BidCount": 2, "ConvertedCurrentPrice": {"Value": 500.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 500.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "t***j", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 53}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Fender Stratocaster Deluxe Roadhouse Stratocaster w/ Plush Gigbag", "ItemSpecifics": {"NameValueList": [{"Name": "Body Material", "Value": ["Alder"]}, {"Name": "Brand", "Value": ["Fender"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Roadhouse"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Yellow"]}]}, "HitCount": 392, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 510.0, "CurrencyID": "USD"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}