{"BestOfferEnabled": false, "Description": "L1 Epiphone DOT-CH ES335 Cherry Red Semi-Hollow Body Electric Guitar Right-Handed. if i'm not wrong it's year 2002 ES335 modal, please do your own research from provided pictures. used in good working order, shows some signs of usage, include hard case, case is good shape , sound is great, numbers on inside tag handwritten over the original numbers please see pictures. serial number on the Nike is all intact. we will use a oversize box for transport, i wish to get this guitar to you all intact undamaged. great guitar i hope to find a good home for it. Hello i'm new to this and still learning, if you need more info or pictures, please let me know. we will ship the way you wish. just let us know hello. i'm new to this and still learning, if you need more info or pictures, please let me know. : Please don't assume, no need to guess, We encourage you to carefully read the description, examine the photos, and ask any questions before you bid : This is for our consumer's protection and it is a non-negotiable policy Import duties, taxes, and charges are not included in the item price or shipping cost. These charges are the buyer's responsibility.Please check with your country's customs office to determine what these additional costs will be prior to bidding or buying.Happy Bidding ...: Condition :... New Never Used New - Open Box New No Box used in great condition x Cosmetic Blemishes Excellent + outside appearance x Scuffs & Scratches from normal used x Absolutely Stunning ... Great Condition... has been used but not abused, Please see pictures We guarantee all of our items are authentic and represented honestly. Please be absolutely certain that you want the item prior to bidding. The pictures are an important part of the description, PLEASE study them closely and bid on what you see and know. The item you see in the photos is exactly what you will receive. If we fail to include an important detail, please feel free to ask questions. we will respond to emails immediately. There will be plenty of time to gather all of the information needed to make a good decision. If you?re happy with your purchase, please leave positive feedback. we want to earn positive feedback for EVERY transaction. Our goal is to bring interesting things to Ebay and Stay a trusted member of the community Thanks for reading and?. Happy Bidding! ======================================================================= Please read below. Important Please don't ask us to ship any other address other than currently registered paypall address. If you need to use different address, please be sure to make changes / add new address with your paypal account before making a purchase. We can only ship to current paypal registered and confirmed addresses. We don't guarantee your ability to update software or upgrade Firmware, transfer of ownership & software : Items are sold AS IS Note: For any returns there is a 20% Restocking fee All California residents must pay 9% sales tax Shipping ABOUT P.O.BOX SHIPPING'S. IF YOUR PAYPALL REGISTERED ADDRESS IS P.O.BOX, PLEASE SELECT ONLY USPS OPTION WE OFFER. IF YOU STILL PAY WITH UPS OR FEDEX, WE WILL STILL USE USPS CARRIER FOR P.O.BOX ADDRESS AND REFUND THE DIFFERENCE (IF ANY) BACK TO YOU. OR PLEASE CONTACT US BEFORE CHOOSING CARRIER, IF IT MATTER TO YOU International Shipping According to UPS or USPS for International Shipping services (for custom purposes i guess), it is required to provide the receivers contact info such as phone number. As soonest you Complete the purchase, please contact us with your phone number so we can be able to complete the shipping form process and have your item shipped to you as soonest possible Thank you We can't give an exact estimate until the item is ready and packaged to be shipped. Shipping & handling price is just an estimate By Ebay most of the time it's correct It may be bit more or less. If the shipping price we have listed turns out to be less than the actual cost of shipping and handling, We will refund the rest back to you. And if it more we will ask for it. Questions asked in weekends might not be answered till Monday we are open 6 days a week Make payments to Pasadena Pawn Shop Office Hours: Monday - Friday: 10:00am to 5:00pm Saturdays: 11:00am to 3:00pm Sundays: Closed Auctions do not end early - Please don't Ask If you don't see a Buy It Now in our Ebay Listing - please don't ask me for one and do not ask me to end the auction for you if you need more pictures, please let me know. Thanks : MoSes We strive to make your eBay experience a good one. make every effort to list all of our items accurately Compatibility of any product is the purchasers' responsibility Please read the product ad carefully. We endeavor to list all available information in the ad, therefore, in many cases an item's specifications may have been obtained via the Internet. If you have any questions regarding this product please visit the manufacturer's web site or call their customer service before placing your bid. if you wish to stop by your self or send someone over to test or inspect the item. we are open 6 days a week and most any item is available for inspection, must be over 18 years of age: If you require more info regarding the condition of the item or need additional pictures please ask before bidding We are not a reaper center nor we reaper or refurbish merchandise our item's are sold AS IS & the auctions are final some of our auctions include a guaranty DOA if it's offered it will be posted above on the top of the page in items description, in that case if the guaranty is offered You have 1 day to return We strive to list all our items accurately, however, some of our items may have cosmetic imperfections such as case scratches, minor blemish and discoloration due to age, normal wear and tear, that do not in any way affect the performance of the unit. For these reasons, our Guaranty only covers the operation of the item and not the cosmetics. - shipping and insurance are not refundable in that case - ....: Payment Methods :.... Sorry if Paypal Can't OK your transaction we can't accept your payment, it will be refunded and we Will ask you to pay by Other Payment methods Local Pickups You Could Pay At Our Store With Paypal Credit Card Or Any Other Credit Card At The Time Of The Pickup. Items Paid By Paypal Online Transfers Must Be Shipped To Your Paypal Shipping Address To newly registered ebay members and if PayPal can't OK your transaction We WE Will ask you to pay by OTHER ....:: Sending Payments By Mail ::.... Please ! perches Tracking Service / traceable method. (UPS, FedEx, etc). - and provide the TR# / information after you send the payment will ship AFTER payment clears my bank Items will only be send to your credit card / payPal mailing address No COD's Absolutely No Credit Card Transactions From Indonesia & Malaysia -=- Turkey and Azerbaijan This is for our consumer's protection and it is a non-negotiable policy.I encourage you to carefully read the description, examine the photos, and ask any questions before you bid Please contact me regarding your peyment if your not sure of your payment before placing your bid Items will only be send to your payPal mailing address ALL INTERNATIONAL ORDERS REQUIRE A PHONE NUMBER PLEASE ENTER YOUR PHONE NUMBER IN OUR CHECKOUT SYSTEMS TRANSACTION NOTES Many countries impose their own customs, duties, taxes, etc. on items being shipped from a foreign country. We are not responsible for your country's imposed taxes and any other charges. SHIPPING INFORMATION: We ship most item(s) within 1-to-2 business days after payment is received and verified (UPS - USPS - FedEx - or Buyer's UPS Account #) Will Call for local buyers We process all of our orders 6 days a week and ship 3-to-4 x per week After end of the auction it will take a day or so to get the item professionally packaged we don't do our packaging - it's don by a professionals at next-door to our shop some large items might take extra day or so to make custom box's we will take our time to do the best job we can and get the items to you nice and safe Shipping and handling fee provided by me at the Ebay auction is only an Estimate of the Shipping cost for most of the time it will cover the US 48 stats At the conclusion of the auction please contact us within 24 hours by email or phone with your choice of payment method, shipping preference and mailing address. if no contact has been made in 3 days after end of the auction - we Reserve The right to re-list the item Unpaid auction wins will be forfeited seven (7) after days after end of the auction Non-Payer report will be filed with eBay to recover the closing fees of the auction. All California residents must pay 9% sales tax Thank you, for your interest in our EBay auctions Moses30 leaves feedback once you give feedback and an item is paid. Due to the number of sales we have on eBay, we have adopted a feedback policy that seems to work for our customers and ourselves. We go through our feedback file and submit feedback for those who have filed feedback on us. This policy ensures that everyone gets proper recognition and makes the process a bit smoother for both parties. If you are satisfied with our transaction, please leave a positive feedback and we will be sure to reciprocate when we do our updates. We leave positive feedback when items are paid for, simple as that. All unresolved bids will be reported to eBay and negative feed back will be made. In other words, we give feedback once you give feedback and have paid. Due to the volume of our sales, we can only leave feedback every so often. Please be patient with us, we will leave you feedback when we have the time. Pasadena Pawn Shop", "ItemID": "283351861186", "EndTime": "2019-01-30T00:29:22.000Z", "StartTime": "2019-01-25T00:29:22.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Epiphone-DOT-CH-ES335-Cherry-Red-Semi-Hollow-Body-Electric-Guitar-Right-Handed-/283351861186", "ListingType": "Chinese", "Location": "Pasadena, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2833518611868080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/16cAAOSwTEZcSlcu/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Q3sAAOSwcGpcSldW/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/tLcAAOSwFlJcSlcz/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/GY8AAOSwA3xcSldr/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/UyMAAOSwe9VcSlcx/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/M0EAAOSwd7FcSldP/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/aOoAAOSwGBRcSldR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/f4EAAOSwuZVcSlcw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/t6cAAOSwBVdcSldS/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/WmIAAOSw5AhcSldU/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/z14AAOSwfTlcSldY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/S-MAAOSwuvpcSldb/$_57.JPG?set_id=8800005007"], "PostalCode": "91107", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mrmoses", "FeedbackRatingStar": "Red", "FeedbackScore": 2720, "PositiveFeedbackPercent": 98.7}, "BidCount": 7, "ConvertedCurrentPrice": {"Value": 365.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 365.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "d***6", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 11}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "Europe", "CA", "JP", "AU", "CN", "KR", "ID", "TW", "TH", "HK", "BS", "IL", "MX", "NZ", "SG", "SA", "AE", "QA", "KW", "BH", "MY", "CL", "CO", "CR", "PA", "TT", "GT", "HN", "JM", "AG", "AW", "BZ", "DM", "GD", "KN", "LC", "MS", "TC", "BB", "BD", "BM", "BN", "BO", "EG", "GF", "GP", "JO", "KH", "KY", "LK", "MO", "MQ", "MV", "NI", "OM", "PK", "PY", "RE"], "Site": "US", "TimeLeft": "PT0S", "Title": "Epiphone DOT-CH ES335 Cherry Red Semi-Hollow Body Electric Guitar Right-Handed", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["DOT CH"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Body Type", "Value": ["Semi-Hollow"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Body Color", "Value": ["Cherry Red"]}, {"Name": "Model Year", "Value": ["2002"]}, {"Name": "Country/Region of Manufacture", "Value": ["Saint Helena"]}, {"Name": "Product Line", "Value": ["Epiphone"]}]}, "HitCount": 520, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=4836188", "StoreName": "Armenian Musical Instruments"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 370.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["AZ", "GE", "AM", "BT", "UZ", "RU", "KG", "TJ", "TM", "IN", "AF", "KZ", "MN", "JP", "NP", "FJ", "PG", "SB", "MH", "NR", "WF", "GU", "FM", "TO", "NC", "AS", "PF", "CK", "VU", "AU", "KI", "PW", "WS", "TV", "NU", "SK", "SI", "EE", "UA", "GI", "AD", "RS", "AI", "SV", "DO", "VC", "PR", "VG", "HT", "AN", "VI", "PH", "LA", "VN", "GY", "SR", "AR", "FK", "UY", "EC", "VE", "BR", "PE", "PM", "SL", "GM", "YT", "CM", "KE", "GW", "ER", "SN", "TG", "MA", "BI", "GQ", "MR", "CD", "EH", "CG", "KM", "BJ", "DZ", "ZM", "SO", "SZ", "ET", "NE", "TZ", "BF", "GH", "DJ", "CV", "ML", "BW", "MG", "SH", "RW", "LR", "SC", "LY", "NG", "LS", "GA", "CF", "ZW", "MU", "GN", "CI", "TD", "MW", "AO", "TN", "UG", "MZ", "NA", "ZA", "IQ", "LB", "YE", "TR"], "GlobalShipping": true, "ConditionDescription": "Epiphone DOT-CH ES335 Cherry Red Semi-Hollow Body Electric Guitar Right-Handed. if  i'm not wrong it's year 2002 ES335 modal, please do your own research from provided pictures. used in good working order, shows some signs of usage, include TKL hard case, case is good shape , sound is great, numbers on inside tag handwritten over the original numbers please see pictures. serial number on the Neck is all intact. we will use a oversize box  for transport 50x24x12 this should be sufficient for UPS, i wish to get this guitar to you all intact undamaged. great guitar i hope to find a good home for it.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}