{"BestOfferEnabled": false, "Description": "Your satisfaction is our number one goal. Keep in mind that we offer hassle-free returns if needed. If you have any questions or problems, please contact us. Please Note: All included items are shown in the pictures 23522001395 Features: Epiphone presents the new Les Paul Studio LT, an incredible introduction to the world’s greatest electric guitar that is affordable for everyone. The Les Paul Studio LT has all the classic “Les Paul” features including a carved Mahogany top, powerful Zebra-Coil Ceramic humbuckers, and a Mahogany neck with an easy-to-play tapered neck joint. Available in Ebony, Heritage Cherry Sunburst, Vintage Sunburst, and Walnut color finishes. Classic Les Paul Style: The Les Paul Studio LT has everything new players need to get that one-of-a-kind Les Paul sound without breaking the bank. The all-Mahogany body has a carved top and is slightly lighter and slimmer than full-size Les Pauls so it’s easy to hold for long practices and gigs. The bolt-on Mahogany neck has a “Les Paul” scale length of 24.75” with a 1.68” nut, a 2-way adjustable truss rod for a perfect setup, a Rosewood fingerboard with pearloid dot inlays, and a smooth tapered neck joint for easy reach to upper frets. Zebra Coil Humbuckers: The Les Paul Studio LT’s classic “Les Paul” power comes from two Zebra Coil Ceramic Humbuckers. Owners of vintage Les Pauls often remove their pickup covers for a better bass response and magnetic pull, revealing the black & white (“zebra”) bobbins underneath. Ceramic pickups have a higher output than vintage Alnico magnet pickups and are designed to provide a tight low-end response with both a smooth mid-range and a slightly more pronounced top end tone. Ceramic magnets have been a favorite of metal and hard rock guitarists for decades. The Les Paul Studio LT has a 650R in the rhythm position and a 700T in the lead position. Controls include volume and tone for each pickup and an all-metal 3-way pickup selector. Rock Solid Epiphone Hardware: The Les Paul Studio LT features Epiphone-designed rock solid all-nickel hardware including the classic Les Paul bridge combo of a LockTone Tune-o-matic bridge and Stopbar tailpiece, a non-rotating ¼” output jack, and premium die-cast 14:1 ratio machine heads. What's included: Epiphone Les Paul Studio LT Electric Guitar Heritage Cherry Sunburst Case Condition: This guitar has been previously owned and is in great playing condition. It has some every light scratches and light wear and tear from playing. 23522001395 Payment & Checkout Checkout: After the auction has ended please click the checkout button to proceed with your payment. Payments: Payments must be received within 3 days. Unpaid cases will automatically be open by eBay 7 days after purchase. Taxes: Sales tax is charged for items shipped to: MN*(6.875%), WI*(5.0%) All Emails and Invoices will be sent to your registered eBay Email Address. If you are not receiving our emails please check your email spam filters. Shipping We Ship to confirmed addresses only! Make any changes to your address before paying. All items will be shipped to your confirmed billing address! Shipping Carriers: SurePost, UPS & USPS 1-6 Day. We choose the shipping carrier at our discretion. Local Pickups: Please contact us for local pickup information. Product Guarantee We offer a 30 Day Money Back Guarantee unless noted \"As Is\" or \"For Parts or Not Working\". We do not offer returns on international orders. We do our very best to accurately describe our items, however If you have any problems please contact us right away. Frequently Asked Questions What are your operating hours? M-F 9:00am - 5:00PM Central Standard Time Do you ship internationally? We ship internationally on select items. What is the history of the item? Most of our items are used and we do not know the history. We test them and picture their current condition. What's Included? 99% of the time If it's pictured it's included. Please also read \"What's included\" How long do I have to make payment? You have 3 days to make payment. Prestalia e-commerce solutions. Protect Your Product With a Consumer Priority Service Warranty", "ItemID": "233105210092", "EndTime": "2019-02-25T04:38:59.000Z", "StartTime": "2019-01-22T15:21:57.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Epiphone-Les-Paul-Studio-LT-Electric-Guitar-Heritage-Cherry-Sunburst-/233105210092", "ListingType": "FixedPriceItem", "Location": "Minneapolis, Minnesota", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2331052100928080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTEwMFgxMTAw/z/irsAAOSwEJ1cRzUZ/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTEwMFgxMTAw/z/HA8AAOSwZ2FcRzUZ/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTEwMFgxMTAw/z/PXwAAOSwJ89cRzUZ/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTEwMFgxMTAw/z/nDgAAOSwgZlcRzUZ/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTEwMFgxMTAw/z/4YkAAOSwjQVcRzUZ/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTEwMFgxMTAw/z/DqAAAOSwJOJcRzUZ/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTEwMFgxMTAw/z/yG0AAOSwj9JcRzUZ/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTEwMFgxMTAw/z/qOMAAOSwtaBcRzUZ/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTEwMFgxMTAw/z/YxkAAOSwRbpcRzUZ/$_1.JPG?set_id=880000500F"], "PostalCode": "55421", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "epawnamerica", "FeedbackRatingStar": "RedShooting", "FeedbackScore": 152158, "PositiveFeedbackPercent": 99.5, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 250.12, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 250.12, "CurrencyID": "USD"}, "HighBidder": {"UserID": "2***d", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 390}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Epiphone Les Paul Studio LT Electric Guitar  Heritage Cherry Sunburst", "ItemSpecifics": {"NameValueList": [{"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Les Paul Studio LT"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Brand", "Value": ["Epiphone"]}]}, "HitCount": 420, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=16525387", "StoreName": "ePawnAmerica"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "TopRatedListing": true, "GlobalShipping": false, "ConditionDescription": "This guitar has been previously owned and is in great playing condition. It has some every light scratches and light wear and tear from playing.", "QuantitySoldByPickupInStore": 0, "SKU": "ebay-1038053", "NewBestOffer": false}