{"BestOfferEnabled": false, "Description": "2005 Epiphone Dot-NA Semi-Hollow Body Electric Natural Guitar w/ Soft Case Product Description 247071YM-x400-GTA1 Up for sale is this 2005 Epiphone Dot-NA Semi-Hollow Body Electric Natural Guitar w/ Soft Case . This item is in excellent pre-owned condition, If you have any further questions regarding the condition of this item, please refer to the attached photos. Winner will receive exactly what’s presented in the photos. Brand: Epiphone Model: Dot-NA Size/Dimensions: What's Included: 2005 Epiphone Dot-NA Semi-Hollow Body Electric Natural Guitar w/ Soft Case (see images) Physical Condition: Excellent pre-owned condition 9/10, see images for specific detail FREE SHIPPING *We do our absolute best to accurately describe every item. Sometimes we miss something. Please notify us if you see something listed inaccurately and we will address the situation right away. Additional Details Entreprenartist Entreprenartist is committed to honesty and transparency. We are a company that cares about our customers; making sure that customers find exactly what they want is our number one priority. Feedback We take our clients' feedback very seriously and strive to address the needs of every customer. However, sometimes a product fails to live up to expectations. As a marketplace platform, we will address any issues as soon as possible and are always ready to hear from you. Shipping Your item will enter our patented distribution process immediately upon purchase. We guarantee that all items ship within three (3) business days (Monday - Friday) but you'll find that we often get it out to you much faster than that. We offer both FedEx and USPS domestic shipping options, but please be aware that FedEx will not deliver to a PO Box. If you choose FedEx for shipping and you have a PO Box, your order will be canceled. All international orders will be fulfilled by either UPS or USPS. We do not ship to APOs and will NOT make changes on customs forms. Please bid accordingly based on the import taxes/duties relative to your country. We can not alter shipping addresses after payment and checkout have concluded. We reserve the right to alter shipping methods and carriers at our sole discretion without warning. We reserve the right to use whichever delivery method we deem best. All orders will be shipped within 3 business days and customers will be notified of tracking via email. If it's not in the photos it's not included. If you see a boxed item, please rest assured that we are not selling an empty box. Returns We offer hassle-free 30 day returns. If you are unhappy with your purchase, please file a return request and we will provide a prepaid return shipping label. We are not responsible for printing the label, nor mailing the returned item. Depending on the nature of the return, we reserve the right to charge return shipping. In instances where it is our fault (received wrong item, received broken item, etc.) return shipping will not be charged. All returns are subject to a restocking fee. For items shipped as new, the restocking fee is 15% - once the item has been either opened or the exterior packaging altered in any way. Partial refunds are not available. However, we offer a 100% Money Back guarantee if you are not happy with your item. If you do not feel that a transaction was ideal, contact us and we will do whatever we can to make it right. By bidding on or purchasing one of our items you agree to the terms above. Entreprenartist", "ItemID": "192804170685", "EndTime": "2019-01-29T03:20:04.000Z", "StartTime": "2019-01-26T03:20:04.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2005-Epiphone-Dot-NA-Semi-Hollow-Body-Electric-Natural-Guitar-w-Soft-Case-/192804170685", "ListingType": "Chinese", "Location": "Wayne, New Jersey", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1928041706858080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/NQcAAOSwV51cS9Hq/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/vS4AAOSwd7FcS9Hp/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/vn4AAOSwlEBcS9Ho/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/uiEAAOSwXIdcS9Hs/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/zFgAAOSwsO5cS9Ho/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/SXsAAOSwv0dcS9Ho/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/DkMAAOSwU0hcS9Hs/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/9goAAOSwgb1cS9Ho/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/wXQAAOSw6jJcS9Ho/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/ToMAAOSwsrlcS9Hq/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/tcMAAOSwJ89cS9Ho/$_1.JPG?set_id=880000500F"], "PostalCode": "07470", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "entreprenartist", "FeedbackRatingStar": "TurquoiseShooting", "FeedbackScore": 32648, "PositiveFeedbackPercent": 96.4}, "BidCount": 24, "ConvertedCurrentPrice": {"Value": 250.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 250.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "r***h", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 3}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2005 Epiphone Dot-NA Semi-Hollow Body Electric Natural Guitar w/ Soft Case ", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "MPN", "Value": ["does not apply"]}, {"Name": "Model", "Value": ["DOT-NA"]}, {"Name": "Model Year", "Value": ["2005"]}]}, "HitCount": 266, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1077122905", "StoreName": "entreprenartist"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 255.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "SKU": "247071YM-x400-GTA1", "NewBestOffer": false}