{"BestOfferEnabled": false, "Description": "Up for sale, a 1961 Rickenbacker 425 Combo in exceptional condition and in perfect working order. A rare model with a vibrant original Fireglo finish, the 425 was the little brother of the 450, and this early iteration features the unique thin stamped metal truss rod cover as well as the deeper 1 5/8\" body which would be slimmed down later in the '61 calendar year. Boasting a modern pickguard and electronics, this Ric functions flawlessly, with the cutting, chiming sound of a single toaster top pickup. The maple neck through body construction gives the guitar a nice ringing quality acoustically, and the guitar weighs in at a mere 7lbs 9oz. Professionally setup here at Mike & Mike's Guitar Bar, we've had this Rickenbacker strung with 10-46 strings and low, slinky action. The neck has a medium C shaped profile that borders on the more slender side of things, with a very thick slab Brazilian rosewood fretboard. The original frets have been leveled and crowned in guitar’s lifetime and while the frets currently are quite low in terms of overall height and crown, they still play cleanly in all registers and currently show zero wear. The scale length measures a full 24 3/4\" and the nut width is 1 9/16\". On the headstock, the original Kluson Deluxe single line tuners with white buttons are intact, turn smoothly, and are very clean cosmetically. The very thin stamped metal \"Rickenbacker\" truss rod cover is original as well and only used for a short period of time on select Rickenbacker models. The electronics are all top-tier modern components, with a Rickenbacker toaster pickup that reads 6k ohms, full size CTS pots, and a Switchcraft 1/4\" output jack, all mounted to a new anodized gold aluminum pickguard which shields the electronics well for an ideal signal to noise ratio. The tone control works as it should for a Rickenbacker of this era, in that the most bass response is present when the knob is all the way up, and more treble is introduced as you roll the knob down. The two-way tone switch also engages a much thinner jangly sound. The original chrome plated bridge and compensated saddle are intact, and the bridge base has a stamped \"AC\" prefix serial number which dates to March of 1961. Cosmetically, the guitar is a very well cared for example with a 100% original gloss nitro lacquer Fireglo finish. There is light quilt figuring in the maple on the body wings on the back of the guitar too! Hidden beneath the pickguard, there is a small route adjacent to the bass side edge of the bridge (for reasons unknown) and visible wear is limited to some scuffs and minor nicks on the guitar as a whole and on the back edges of the slab body. The finish is very vibrant with great saturation, and the Fireglo lacquer contrasts nicely with the aluminum anodized gold guard. A vintage Rickenbacker hardshell case is included. Check out our shop \"Mike & Mike's Guitar Bar,\" and please let us know if we can answer any questions!Shipping in the continental USA will be $70, fully insured and shipped via FedEx Ground. Expedited shipping available for an additional fee at buyer's request. We will happily ship WORLDWIDE, but please contact us for an accurate international shipping quote before bidding or buying, as cost varies by buyer location. International orders will be declared as “merchandise,” and the value of merchandise will be declared as the amount paid. We cannot declare anything as a gift or for a lesser value. No exceptions! The customer is responsible for all taxes and duty, which may be collected upon delivery, as well as any additional charges involved with import. We have all necessary CITES paperwork in-hand to ship rosewood worldwide.We do our best to describe all items with honesty and accuracy, but to be sure, please contact us with any questions or concerns prior to bidding or buying. We require payment within 48 hours of auction end. In the unlikely event of a return, buyer pays all shipping costs. Your positive feedback and five star ratings are very important to us, and we appreciate your communication in resolving any issues!", "ItemID": "173704261705", "EndTime": "2018-12-28T10:01:07.000Z", "StartTime": "2018-12-23T02:35:36.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1961-Rickenbacker-425-Combo-Vintage-Electric-Guitar-Fireglo-w-Case-/173704261705", "ListingType": "FixedPriceItem", "Location": "Seattle, Washington", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1737042617058080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/J2IAAOSw~odcHu34/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/~1sAAOSwIr5cHu3-/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/vG4AAOSwFZZcHu4A/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/ZrwAAOSwVMJcHu4F/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/OtAAAOSwOcpcHu4C/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/D6AAAOSwxx1cHu36/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/oN8AAOSwLeFcHu38/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/peMAAOSwu4dcHu4L/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/uKoAAOSw5YlcHu4Q/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/9coAAOSwt0dcHu4O/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI4NVgxNjAw/z/F4MAAOSwKwhcHu4J/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/~j0AAOSwEVlcHu4H/$_57.JPG?set_id=8800005007"], "PostalCode": "98117", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mmguitarbar", "FeedbackRatingStar": "Red", "FeedbackScore": 2591, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 2649.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2649.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "c***w", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 154}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "1961 Rickenbacker 425 Combo Vintage Electric Guitar Fireglo w/ Case", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Rickenbacker"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Fireglo"]}, {"Name": "Model", "Value": ["425 Combo"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["1961"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Body Material", "Value": ["Maple"]}]}, "HitCount": 141, "PrimaryCategoryIDPath": "619:3858:33034", "SecondaryCategoryID": "118985", "SecondaryCategoryName": "Musical Instruments & Gear:Vintage Musical Instruments:Vintage Guitars & Basses:Electric Guitars", "SecondaryCategoryIDPath": "619:181162:181163:118985", "Storefront": {"StoreURL": "https://stores.ebay.com/id=269063702", "StoreName": "Mike and Mikes Guitar Bar"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}