{"BestOfferEnabled": false, "Description": "Gibson Dependable Home of the most First and most Dependable Gibson parts on Ebay U.S.A. and Worldwide Bidders Welcomed Please note that we do not participate in Ebay's Global Shipping Program.Out international buyers will not be required to pay import fees upfront during checkout through Ebay. How many of you Gibson fans out there have always wanted to build yourselves that awesome Gibson project guitar, but didn’t want to spend the money on a Gibson guitar only to dismantle it. Well, here is your opportunity do so. We sell Gibson parts and project guitars specifically for the purpose of building your own custom Gibson guitar. Who says Fender has to be the only good project brand out there. Our goal is to change that myth by offering quality Gibson projects and parts to those of you who want to create that ultimate Gibson dream guitar. Make sure you look at all three shipping options for the best price to your location. Description: Fender Rosewood American Stratocaster Neck.Neck: Modern C neck.Markings: Has \"Feb 02 2002\" stamped on the heal.Serial Number: Z1037747Year: 2002 Fretboard: Rosewood with scale of 25.5\".Inlays: Dot.Includes: Comes with Nut, Truss Rod, String Tree, and Frets. Condition: The finish has checking lines in it.The lower headstock edge has a pair of finish chips.The back of the neck has finish wear in it. The first fret has a ding in the board.The first three frets have lite fret wear. Otherwise the neck is in good condition. Please Note: Unless mentioned otherwise under the condition section, the neck is straightwith no cracks, breaks, or pitting to it and the frets have no wear. Please feel free to ask questions you may have. Only contact us through the auction within Ebay. Any messages sent to an e-mail address will not be received. Also, please make question relevant to the listing. Non-relevant questions will be ignored. What do I do if there is an issue with my item when I receive it? If you receive an item and have an issue with it, please contact us first before leaving feedback and before opening a dispute case so that the issue can be resolved properly. We are unable to resolve issues when a third party, such as Ebay or Paypal, is involved. What shipping costs the buyer actually pays for: (Present on the printed package label.) The cost of the chosen shipping service estimated by the weight, size, and destination of the package. (Not Present on the printed package label.) The cost of Stamps.com shipping insurance which averages from $1.29 to $5.06 depending on the item value. (Not Present on the printed package label.) The cost of packaging which varies from $.26 to $7.80 depending on the size and type of package.(Not Present on the printed package label.) The cost of bubble wrap and tape if it is necessary for the package. This can be $.00 to $1.05 depending on the size and type of package.(Not Present on the printed package label.) The cost of the label and printer ink. This cost is $.17.(Not Present on the printed package label.) Ebay's 9% final shipping value fee they now charge sellers on shipping costs. This can range from $.29 to $8.32. Ebay charges this fee because to many buyers have complained about high shipping fees. Ebay feels this fee will help curve the issue. Coincidentally Ebay does not return this fee to the buyer, but keeps it for themselves. We feel that if the average buyer was made aware of the real total shipping costs, then maybe they would be less likely to assuming the cost of shipping on the package label is the total cost of shipping. For Example, when you pay $35 for shipping on a guitar body from us and then read only $25 on the package label, keep in mind that there are other unseen costs that go into the total shipping cost. We charge only the bare minimum for shipping. We want to remove this final shipping value fee from our total shipping fees in order to bring them down again. So buyers, please contact Ebay and push them to remove this seller fee from their system. Ebay must learn to stop punishing all sellers for the faults of only a few. Also, we have some of the best experience with shipping these products around the country and world. Whenever we search through listings we rarely see shipping charges that are much more than the total cost of shipping from other sellers. Much of the time we see charges where the seller is likely losing money on the final value because of their low shipping charges. USA Shipping Winner pays for all shipping and packaging costs. That cost is listed above by Ebay.We ship everything on the first business day after the payment is received.The buyer has the choice of USPS Priority Mail, USPS Parcel Post, or UPS Ground.Eastern United States buyers are recommended to use USPS Priority Mail.Western United States buyers are recommended to use USPS Parcel Post Mail.Package will be shipped with Signature Confirmation and USPS Insurance.Please allow all purchases up to 10 business days for delivery. Do not rely on the estimated shipping time.We do combine shipping for the purchase of multiple items, but contact us before paying to request a hold. International Shipping Winner pays for all shipping and packaging costs. That cost is listed above by Ebay.We ship everything on the first business day after the payment is received.Packages are shipped with USPS Priority International Mail.Package will be shipped with a Customs number and USPS Insurance.Please allow all purchases up to 3 weeks for delivery. Do not rely on the estimated shipping time.We do combine shipping for the purchase of multiple items, but contact us before paying to request a hold.Packages may be prone to extra customs fees in the buyer's country.The buyer is responsible for all import fees. Payment We accept Paypal and some alternative means of payment.Buyers have 7 days to pay for won auctions valued under $200.Buyers have just 4 days to pay for won auctions valued over $200.All non-paying bidders are added to our blocked bidder list. Important to KnowRefunds: We only offer refunds for items that are received with an issue. Otherwise all sales are final so read the entire listing do your research before bidding.Non-Payments: We have a \"No Excuse Policy\". Once your bid is placed you are responsible for any penalties incurred for not paying.Leaving Poor DSR's: We consider any buyer who leaves less than 3 stars on any category to be hostile and we will block them from bidding. Please reconsider by reading below.Description: Remember that we only sell used parts. Every item will probably have some sort of flaw so please read about it before bidding.Communication: We are a high volume seller and cannot contact every buyer. If you have a concern then please contact us through the listing.Shipping Time: Everything ships on the first business day following the payment. If buyers want faster shipping then they have to pay for a faster shipping service.Shipping Fees: Buyers only pay for the weight of the package, via the shipping service they choose, and for the packaging costs. Also, because of Paypal, we have to charge buyers extra fees for delivery confirmation and insurance. You are paying the cheapest fee possible on your package so there is no reason to leave any poor rating for shipping charges. Also international import taxes and fees are not our responsibility and are not to be considered shipping costs. They are not be counted against us as they are the importers responsibility. The formula for shipping costs is listed below.Domestic: USPS shipping cost + $16.86 of packaging and insurance cost.International: USPS shipping cost + $12.15 of packaging and insurance cost. All of our Gibson parts are Gibson USA parts only. Anyone who worries about getting Epiphone parts, or even something cheaper, doesn’t have to worry about that with our parts. We guarantee our parts are what we say they are or we’ll refund you your money back. For those who question the legitimacy of our guitars and parts, if you don't trust the description or our immaculate feedback then, by all means, please do not bid. If you need reassurance of our credibility, then please review our feedback and see all of our satisfied customers for yourself. We will always try our best to leave the customer with a good Ebay experience. Thanx for looking at our listing and good luck bidding.", "ItemID": "202602352514", "EndTime": "2019-02-28T01:00:28.000Z", "StartTime": "2019-02-21T01:00:28.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fender-2002-USA-Rosewood-American-Stratocaster-Neck-/202602352514", "ListingType": "Chinese", "Location": "Glassboro, New Jersey", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2026023525148080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NDgwWDY0MA==/z/vOwAAOSwgPVcbHh-/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDgwWDY0MA==/z/Q30AAOSwjARcbHiB/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDgwWDY0MA==/z/UeIAAOSw8yxcbHiC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjQwWDQ4MA==/z/AD0AAOSwZ2pcbHj3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjQwWDQ4MA==/z/u4sAAOSwyHJcbHj0/$_57.JPG?set_id=8800005007"], "PostalCode": "08028", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "gibsondependable", "FeedbackRatingStar": "TurquoiseShooting", "FeedbackScore": 31113, "PositiveFeedbackPercent": 99.0}, "BidCount": 33, "ConvertedCurrentPrice": {"Value": 275.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 275.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "x***w", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 67}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": " Fender 2002 USA Rosewood American Stratocaster Neck", "ItemSpecifics": {"NameValueList": [{"Name": "Modified Item", "Value": ["No"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Brand", "Value": ["Fender"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}]}, "HitCount": 458, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=214185793", "StoreName": "gibsondependable"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 280.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}