{"BestOfferEnabled": true, "Description": "Reluctantly Selling my USA Custom Shop/Boogie Street Guitar 4 of 7 Paul Stanley Padauk Preacher. It is in my personal opinion one of the coolest looking and natural playing guitars I have ever had. Guitar has low action, frets are still in great shape. The neck feels great. I do not know much about the guitar other than it was made around 2007(what the previous owner said) It is numbered 4 or 7 on the back of head stock, boogie street guitars custom. Here is a link I found to some other pictures -https://www.flickr.com/photos/ericmckenna/sets/72157603398113018/with/2094181022/. It is very hard to find out any info on this. The toggle switch will probably need to be replaced or just cleaned. The bridge position is really finicky about working every time. The Seymour Duncan's Sound great but I do not know what model they are. Comes with a hard shell case. I have looked and cannot see any other major scratches or issues on the guitar besides maybe some light surface scratches from a pick, that being said it may have other light scratches that I may have missed. My opinion may not be the same as yours. I know what I paid and I know what it's worth so I am not just going to give it away cheap. I will start bidding low but have the right to end Auction at anytime if it looks like it will not sell at what I need for it. Below are some specs I pulled off internet. Ask all the questions you want. https://www.flickr.com/photos/ericmckenna/sets/72157603398113018/with/2094181022/NO international shipping or inquiries. International inquiries and potential scammers will be reported and blocked. Potential fraudulent activity will be reported as well. Absolutely no deals will be made violating eBay policies. Please contact me with any questions. PayPal payments only!!Please look at the pictures as this is the exact item you will receive. Shipping is an additional 55.00 and will include delivery confirmation, and in some cases signature required. This is to protect me so I know you accepted the package in good condition. Bid With confidence, honest seller here. Pictures will be taken prior to packing to show conditions before leaving my care. Please check out my other Auctions for extra games, controllers, Game Systems, guitars, movies, music, and toys. I try to post new items every week. Due to many bad experiences on our short time as eBay sellers please read the following: No shipping outside USA No zero feedback bidders AS IS No RETURNS Accepted Payment Methods: PayPal Only Shipping Policy: Ships from Abilene TX to: Continental U.S. $55.00 -We ship all orders via UPS or USPS. This is at our discretion depending on what the situation may require. If you want additional insurance please let us know and we can add it to the invoice before you pay. -Orders made through us will only ship to United States. We are unable to ship internationally at this time due to the extra shipping costs that go with international shipping. If we have something that you are interested in you can contact us via email and, if possible, we will calculate shipping costs and figure out the best way to ship the product to you. -Buyer assumes all shipping costs, to be paid at time of purchase. -It is possible that orders placed early enough may ship on the same day. However, it can take up to two business days to process an order for in-stock items before it is shipped. -We do not offer returns, as we try to list everything to the best of our knowledge. If for some reason we do approve a return, these are the rules that you are excepting when you bid. Shipping costs will not be refunded for returns that we must approve. The buyer must assume all shipping costs when returning an item to us. This means if we allow a return it is on you to pay to ship it back to us. -We reserve the right to hold, delay, or cancel any order that it feels may be fraudulent. Additional information may be requested from the customer to resolve such cases. -One of the best ways for customers to avoid triggering a potential hold on their order is to make sure that their shipping name and address matches their billing name and address when placing the order and paying with paypal. I will only ship to the address listed on EBAY unless you ask otherwise. -It is the responsibility of the customer to prove their identity if the above situation occurs. This item is sold As-Described and cannot be returned unless it arrives in a condition different from how it was described or photographed.", "ItemID": "323702905228", "EndTime": "2019-02-27T17:17:40.000Z", "StartTime": "2019-02-20T17:17:40.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Washburn-Guitar-Paul-Stanley-Kiss-Boogie-Street-USA-Custom-Shop-Preacher-4-7-/323702905228", "ListingType": "Chinese", "Location": "Abilene, Texas", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/3237029052288080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/WB4AAOSwk4hcbYZC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/eo4AAOSwp~VcbYYZ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/UbgAAOSw5~pcbYYq/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/bPgAAOSwY8NcbYYh/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/3p8AAOSwk1hcbYY6/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/z8MAAOSw8yxcbYY0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/vqsAAOSw5LZcbYbx/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/uuYAAOSwsixcbYaq/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/2VQAAOSwBPxcbYaj/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/ZeUAAOSwpUVcbYZP/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/FdMAAOSwQXdcbYZK/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/GmIAAOSwiLZcbYaw/$_57.JPG?set_id=8800005007"], "PostalCode": "79606", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "sweetblondebarbieshobbies", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 140, "PositiveFeedbackPercent": 100.0}, "BidCount": 20, "ConvertedCurrentPrice": {"Value": 1291.6, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1291.6, "CurrencyID": "USD"}, "HighBidder": {"UserID": "i***5", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 52}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Washburn Guitar Paul Stanley Kiss Boogie Street USA Custom Shop Preacher 4 of 7", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Natural"]}, {"Name": "Brand", "Value": ["Washburn"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Material", "Value": ["Padauk"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["2007"]}, {"Name": "Body Type", "Value": ["Solid"]}]}, "HitCount": 418, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1401412908", "StoreName": "Sweet Blonde Barbie&#39;s Hobbies"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 1316.6, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Guitar is used but in great working order", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}