{"BestOfferEnabled": true, "Description": "FENDER Vintage Johnny Marr Jaguar Electric Guitar Rosewood Fretboard Mint Made in the U.S. in 2012 Includes hardshell case + FREE SHIPPING in the Continental U.S. Also includes original documentation, manual, Allen wrench and guitar strap Your Price: $1295 Johnny Marr is best known as the strikingly dynamic guitarist-arranger-songwriter behind the Smiths, who redefined and ruled U.K. pop in the 1980s. A master of melody, layering and texture, Marr has brought his own instantly identifiable genius to the proceedings ever since, in stints with The The, the Pretenders, Modest Mouse and the Cribs—to say nothing of his solo career and innumerable guest appearances. The Johnny Marr Jaguar is a fantastically non-standard model that is as distinctive as the sounds he wrings from it. SPECS: Maple neck based on Marr’s 1965 Jaguar, with custom profile and vintage-style heel truss rod adjustment7.25”-radius rosewood fingerboard with 22 vintage-style fretsDual custom-wound Bare Knuckle® Johnny Marr single-coil pickupsFour-position blade pickup switch mounted in lower-horn chrome plateDual upper-horn slide switches (universal bright and pickup-switch position four bright)Jaguar bridge with Mustang® saddles, nylon post inserts for improved stability and chrome coverVintage-style floating tremolo tailpiece and “taller” tremolo arm with nylon sleeve insert to prevent arm swing4-way Pickup SwitchRather than traditional slide switches, Marr’s signature Jaguar has a special four-way blade pickup switch on the lower horn, delivering the bridge pickup alone, the bridge and neck pickups in parallel, the neck pickup alone, and the neck and bridge pickups in series. 2 Bright Slide SwitchesIn an extra-special design element, the upper horn of the Johnny Marr Jaguar features two slide switches—a \"universal\" bright switch that kicks everything up a notch or two, and a separate bright switch that only affects the \"series\" pickup switch position. Custom Neck ProfileIn an especially authentic touch, the neck on this signature model has a comfortably broken-in custom profile (the shape of the neck in cross section) based directly on Marr’s 1965 Jaguar.\u2028 Bare Knuckle Single Coil PickupsFor specially voiced tone worthy of such an inventive and versatile guitarist, this Jaguar is built with \"Bare Knuckle\" Johnny Marr single-coil custom-wound neck and bridge pickups. Bridge Post Tremelo Arm (Whammy Bar)The Johnny Marr Jaguar features special nylon bridge-post inserts for improved bridge stability, and a \"taller\" tremolo arm with a nylon-sleeve insert to keep it from swinging loose. Please see the pictures for this ad! Payment Please submit payment through PayPal within 3 days of commitment to purchase. Shipping Free shipping in the continental U.S. with USPS Priority Mail. Otherwise, the buyer pays for the actual cost of shipping using USPS Priority Mail International. For international shipments, import duties, taxes and charges are not included in the item price or shipping charges. Expedited shipping available, via Priority Mail or Overnight shipping. Prioirty Mail upgrades are usally only a few dollars extra. Overnight shipping is usually around $15 more. Overnight shipping is not guaranteed. Please contact us for more information. Satisfaction Guarantee Every attempt is made to provide high quality products for buyers. We are honest, up-front and transparent about the quality of our products. Product descriptions are intended to be accurate and not misleading. If you should have any concerns upon receipt of your item, please contact us as soon as possible so that every attempt to reconcile the transaction to your complete satisfaction will be made. Returns 30-day buyer paid return policy. It is also assumed that the item is returned in the same condition as when delivered, otherwise the return will not be honored. Authenticity Guarantee I guarantee my products to be 100% authentic. I do not deal in knock-offs or faux merchandise. See all my products at RW Collectibles https://ebay.to/2qf0shq Thank you for your business!", "ItemID": "273525922495", "EndTime": "2018-12-16T23:34:43.000Z", "StartTime": "2018-10-25T20:34:57.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/FENDER-Vintage-Johnny-Marr-Jaguar-Electric-Guitar-Rosewood-Fretboard-Mint-/273525922495", "ListingType": "FixedPriceItem", "Location": "Seymour, Connecticut", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2735259224958080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTUzOFg4MzU=/z/oQYAAOSwPjhb0iN1/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU5OVgxMjAw/z/jQQAAOSw9z1b0iOr/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU5OVgxMjAw/z/m4EAAOSwiiVb0iO9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ1NFg3OTE=/z/E-YAAOSwDOpb0iNX/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU5OVgxMjAw/z/wvUAAOSwb3hb0iOP/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU5OVgxMjAw/z/05YAAOSwJ2pb0iQX/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU3OFg5OTM=/z/alYAAOSwX6Rb0iQz/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNTk5/z/2jYAAOSwb3hb0jC5/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNTk5/z/0C8AAOSwqnVcCS8D/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzM5WDEzODY=/z/H5gAAOSwrQ5cCS8r/$_57.JPG?set_id=8800005007"], "PostalCode": "06483", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "rwcollectibles", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 111, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1295.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1295.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "e***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 100}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "FENDER Vintage Johnny Marr Jaguar Electric Guitar Rosewood Fretboard Mint", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "MPN", "Value": ["0116400750"]}, {"Name": "Model", "Value": ["0116400750"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "UPC", "Value": ["717669853372"]}, {"Name": "Body Color", "Value": ["Kandy Orange Metallic"]}, {"Name": "String Configuration", "Value": ["6 String light gauge"]}]}, "HitCount": 514, "Subtitle": "Low action, Knopfler, Marr, ChrisIsaak strat type sound", "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Well cared for, excellent condition. This guitar is a breeze to play and it sounds great.  Multiple pickup settings (4 x 2).  Whammy bar.  Includes hardshell case.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}