{"BestOfferEnabled": false, "Description": "Up for sale is a hard to find 2017 Paul Reed Smith CE24 Reclaimed Wood. Very limited. We are an authorized PRS dealer and sold this guitar new. The customer traded it in towards a PRS Fatback 24 I had gotten in. The guitar grades in near excellent with a light sheen in the satin finish on the lower horn ( from picking) and some hardware aging on the bridge. One small mark on the side of the top horn. ( see last three pictures). Please note the holes and marks by the bridge are original nail holes from the reclaimed wood. Each one of these guitars was unique. Minimal fretwear. Great playing guitar. Very lightweight at 6 lbs, 13 oz. Very resonant. Includes original bag and paperwork. Shipping is free within the continental US. Thanks for looking! PRS Guitars Unveils Limited Edition Reclaimed Wood GuitarsMarch 9, 2017PRS Guitars is proud to offer a small batch of “Reclaimed Limited” CE 24 Semi-Hollow and S2 Vela Semi-Hollow guitars that showcase two exotic wood species new to PRS: Peroba Rosa and Brauna Preto. This reclaimed wood, which is native to southeastern Brazil’s Atlantic Forest, is typically more than 100 years old. PRS Guitars Senior Wood Manager, Michael Reid, sourced these woods from old buildings, noting that their density, unique aesthetic, and history would lend them to guitar making.“Michael has been sourcing wood for me and the company since before there was an official ‘PRS Guitars.’ Wood is our lifeblood, and I trust Michael’s instincts. This old, reclaimed wood is wonderfully resonant and beautiful. Hearing these guitars now, I just have to smile knowing Michael was right again,” said Paul Reed Smith.Peroba Rosa (photo above), typically used as siding, was selected for the top wood. The density of this wood combined with the semi-hollow body construction gives the Reclaimed Limited CE24 Semi-Hollow and S2 Vela Semi-Hollow a unique sound that is punchy but also warm and full. Brauna Preto (photo below), typically used as the supporting posts of these old buildings, is used for the fretboards due to its tight-grain and sustain. These guitars are finished in Natural satin nitro. Any nail holes and any wear or discoloration have been left in the top wood to showcase its history. By leaving the Peroba in its most “original” form, every instrument is rendered unique with each top boasting its own character.“The forest has come full circle, so to speak. I like to think using this wood showcases Brazil’s rich history of music and guitar making,” said Michael Reid, PRS Senior Wood Manager. “Reclaiming these timbers also allows me to personally make a contribution to sustaining and celebrating Brazil’s resources.”Production on these Reclaimed Limited guitars will be capped at approximately 600 instruments, but the order window for Authorized PRS Dealers is from March 9 – April 30, 2017 only.MEET THE MODELSReclaimed Limited: CE 24 Semi-Hollow", "ItemID": "392249345833", "EndTime": "2019-03-02T01:28:05.000Z", "StartTime": "2019-02-27T14:36:50.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2017-Paul-Reed-Smith-CE24-Limited-Reclaimed-Wood-/392249345833", "ListingType": "FixedPriceItem", "Location": "Memphis, Tennessee", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/3922493458338080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/Qy8AAOSwsnNcdp8P/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/04cAAOSwL35cdp8V/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/N~0AAOSw2hhcdp8b/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/RpEAAOSwZ2pcdp9Y/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/KFQAAOSwYnhcdp9O/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/93YAAOSwwmBcdp9e/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/sgkAAOSwqUBcdp9k/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/ZeAAAOSwyQJcdp9G/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/8W0AAOSwey5cdp8o/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/aHYAAOSwEo1cdp8g/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/BG4AAOSwVVlcdp8y/$_57.JPG?set_id=8800005007"], "PostalCode": "38135", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "rushgeoff", "FeedbackRatingStar": "Red", "FeedbackScore": 1415, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1399.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1399.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "b***4", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 415}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2017 Paul Reed Smith CE24 Limited Reclaimed Wood", "HitCount": 198, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}