{"BestOfferEnabled": false, "Description": "ES-Les Paul VOS 2015 Goldtop Goes Full Circle: The Optimum Marriage of Solid and Semi n/a Combining Les Paul styling, ES-335 versatility and seminal Goldtop looks via vintage-toned MHS humbuckers, comfortable rounded 'C' neck profile with rolled binding, historic details and more. F-Hole emblem engraved truss rod cover The iconic symbol of the Gibson ES line is now the hallmark of Gibson Memphis Redesigned neck dimensions Added thickness to Peghead transition provides greater strength and stability Historic truss rod Superior Adjustability due to the Teflon coating, larger diameter rod, original brass anchor and larger washer Bone nut Bone for smooth tuning and excellent durability Rolled neck binding Binding is rounded off to comfortably fit the contours of the player's hand Low profile frets Lower fret height provides smooth playability and accurate intonation New finish colors New variations on your favorite vintage color schemes as well as all new, eye catching colors Capacitor changes Less treble cut than previous capacitor results in a tone with a harmonically rich, singing quality MHS Humbucker Pickups Total PAF tones from vintage-style windings with mismatched coils New for 2015 ▪F-Hole emblem engraved truss rod cover: The iconic symbol of the Gibson ES line is now the hallmark of Gibson Memphis ▪Redesigned neck dimensions: Added thickness to Peghead transition provides greater strength and stability ▪Historic truss rod: Superior Adjustability due to the Teflon coating, larger diameter rod, original brass anchor and larger washer ▪Bone nut: Bone for smooth tuning and excellent durability ▪Rolled neck binding: Binding is rounded off to comfortably fit the contours of the player's hand ▪Low profile frets: Lower fret height provides smooth playability and accurate intonation ▪New finish colors: New variations on your favorite vintage color schemes as well as all new, eye catching colors ▪Capacitor changes: Less treble cut than previous capacitor results in a tone with a harmonically rich, singing quality ▪MHS Humbucker Pickups: Total PAF tones from vintage-style windings with mismatched coils Body Top Back Top Wood Species: Maple, Poplar, Maple Pieces: 3-Ply Grade: Figured Binding: Cream Back Wood Species: Maple, Poplar, Maple Pieces: 3-Ply Density: Plain Binding: Cream Rims Species Wood: Maple, Poplar, Maple Pieces: 3-Ply Grade: Plain Weight Weight Relief: ES-LP Center Block Average Weight (body only): 1.3925 kg / 3.070 lbs Materials Used Glue: Franklin Titebond 50 Tonal, Resonant, and/or Technical Effect: The sound waves resonate within the hollow airspace of the Maple veneered Body, around the F-holes, and throughout the solid glue joints. Body Contour Carve: ES-LP (Semi-Hollow) Neck Neck Wood Species: Mahogany Pieces: 1 Details Truss Rod: Historic Profile: Rounded \"C\" Thickness at Fret 1: 21.59 mm / .850\" Thickness at Fret 12: 24.13 mm / .950\" Other Materials: Franklin Titebond 50 Average Weight: 544.31 gm / 1.2 lbs Peg Head Type: SP-1 Inlay: Mother of Pearl Logo: Mother of Pearl \"Gibson\" Silkscreen: Gold \"Les Paul Model\" Headstock Angle: 17 degrees Tonal, Resonant, and/or Technical Effect: The rounded neck provides an ergonomic feel and the mahogany adds a rich tonal quality Neck Fit Joint Angle: 4 degrees Joint Angle Tolerance: 0 deg 0 min 15 sec Type: Mortise and Tenon Adhesive: Franklin Titebond 50 Gauges Used: Pitch Height Gauge, Alignment Gauge Nut Style: White Material: Bone Width: 4.318 cm / 1.700\" Slots: E: 1.2268 mm / 0.0483 inches A: 0.9601 mm / 0.0378 inches D: 0.6934 mm / 0.0273 inches G: 0.4534 mm / 0.01785 inches B: 0.3467 mm / 0.01365 inches e: 0.2667 mm / 0.0105 inches Fingerboard Wood Species: Rosewood Pieces: 1 Shade: Dark Fingerboard Details Radius: 30.48 cm / 12 \" Frets: 22 Nut/End of Board: 4.318 cm / 1.700\" @ nut, 5.6007 cm / 2.205\" @ end of board Scale: 62.865 cm / 24.75\" Binding: Cream Side Dots (Color): Black Fingerboard Inlays Style: Trapezoid Material: Pearloid Dimensions: 16.51 mm x 29.718 mm / 0.66\" x 1.17 \" Average Weight: 145.1496 gm / 5.12 oz Finishes Gold Top Color Code: GT Surface Texture: Smooth/ Hi Gloss 90 Sheen Lacquer - Finished in V.O.S. Filler: Walnut Sealer: 1-1.5 mils Top: Gold Top Coat: Hi Gloss Lacquer/ 90 Sheen 7-8 mils Scraped: Fingerboard Sides, Body and Nut Electronics Pickups Rhythm Lead Style: MHS Humbucker MHS Humbucker Winds/Coil: Screw side/Slug side: 4900/5100 5200/5400 Material of Wire (gauge): Enamel (42) Enamel (42) Coil Dimensions (per coil): 6.6294 cm x 1.7272 mm / 2.61\" x 0.68 \" 6.6294 cm x 1.7272 mm / 2.61\" x 0.68 \" Coil Material: ABS ABS Coil Winding Process: Scatter Wound Scatter Wound Pole Piece Material: Nickel plated steel Nickel plated steel Pole Piece Position from Nut: 47.4218 cm / 18.670\" 59.5173 cm / 23.432 \" Slug Material: Nickel plated steel Nickel plated steel Slug Dimensions (diameter x length): 4.7498 mm x 1.24206 cm / 0.187\" x .489\" 4.7498 mm x 1.24206 cm / 0.187\" x .489\" Magnet Material: Alnico III Alnico II Magnet Position from Nut: 48.26 cm / 19\" 58.42 cm / 23\" Magnet Dimensions: 6.35 cm x 1.27 mm / 2.5\" x 0.5\" 6.35 cm x 1.27 mm / 2.5\" x 0.5\" Polarities: Screw side is the south pole of magnet Screw side is the south pole of magnet Cover: V.O.S. Nickel plated V.O.S. Nickel plated Qfactor: 3.21 3.2 ResistanceDC: 7526 ohms 7963 ohms Resonant Frequency: 2859.84 Hz 2695.19 Hz Tonal & Resonant Advancements: Historically accurate \"Patent Applied For\" replica with airy tone and unbalanced coils. Slightly under wound. Control Pocket Assembly Volume Type: CTS 500K Linear Peak Voltage: 1080V Range: 0-500K Power Rating: 1/4 watt above 100K ohms Resistance Tolerance: 500K +/- 20% Minimum Resistance: 100 ohms Tone Type: CTS 500K Audio Peak Voltage: 1080V Range: 0-500K Power Rating: 1/4 watt above 100K ohms Resistance Tolerance: 500K +/- 20% Minimum Resistance: 100 ohms Capacitors: Lead Value Rhythm Value Orange Drop .022 mF Orange Drop .015 mF Hardware Tuning Keys Style: Kluson Single Ring Tulip Button Material: Body is stamped steel with plastic tulip button Weight: 22.6796 gm / 0.8 oz Tuning Keys Details Tuning Ratio: 15:1 Gear Type: Synchronized spur gear system What is allowable turn: +/- 4 degrees Plating specs: V.O.S. Nickel Part numbers: 430-14006 / 430-14007 String Dimensions E: 1.1684mm / 0.046\" A: 0.9144 mm / 0.036\" D: 0.6604 mm / 0.026\" G: 0.4318mm / 0.017\" B: 0.3302mm / 0.013\" e: 0.2540mm / 0.010\" Bridge Style: Tone Pro AVR-2 Material: Die cast alloy Plating Specs: V.O.S. Nickel Part number: 430-10155TP Weight: 61.235 gm / 2.16 oz Dimensions of String Slots E: 1.2268 mm / 0.0483 inches A: 0.9601 mm / 0.0378 inches D: 0.6934 mm / 0.0273 inches G: 0.4534 mm / 0.01785 inches B: 0.3467 mm / 0.01365 inches e: 0.2667 mm / 0.0105 inches Tailpiece Style: Lightweight Stop Bar Compensated: No Material: Aluminum Plating Specs: Nickel Part number: 430-11738 / 430-10907 (Studs) Weight: 113.3981 gm / 4.0 oz Output Jack Style: 1/4\" mono with dual tip contact Jack Plate Style: Les Paul Square Material: ABS - Cream (V.O.S.) Part Number: 430-19299 Weight: 2.0 gm / 0.07 oz Strap Buttons Material: V.O.S. Aluminum Part numbers: 430-19150 Weight: 2.268 gm / 0.080 oz Plastics Truss Rod Cover Style: Black and white bell with engraved F-Hole (V.O.S.) Part Number: 430-19802 Knobs Style: Gold Top Hats (V.O.S.) Part Number: 430-19778 Dial Pointers Yes/No: Yes Switch Washer Style: Cream with hot stamp gold (V.O.S.) Part Number: 430-19293 Trim Rings Style: Cream (V.O.S.) Accessories Case Style: Hard Shell Color: Tan Strap Locks: No COA/Other: Gibson Memphis COA Comments", "ItemID": "283306250157", "EndTime": "2018-12-16T21:28:33.000Z", "StartTime": "2018-12-16T16:47:52.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-ES-Les-Paul-VOS-goldtop-/283306250157", "ListingType": "FixedPriceItem", "Location": "Phoenix, Arizona", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/2833062501578080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NzU2WDE2MDA=/z/ujQAAOSwMjpcFoBv/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/BQQAAOSwXWhcFoBx/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/nyMAAOSwn01cFoB0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTk4WDE1OTk=/z/nrcAAOSwEVtcFoB2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNTk2/z/q9sAAOSwfsdcFoB5/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Qy4AAOSwWz5cFoB7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODE4WDE2MDA=/z/mokAAOSwOcpcFoDw/$_57.JPG?set_id=8800005007"], "PostalCode": "85053", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "lynnadeck", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 411, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1499.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1499.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "0***2", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 426}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson ES Les Paul VOS goldtop", "ItemSpecifics": {"NameValueList": [{"Name": "Product Line", "Value": ["Gibson ES"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model", "Value": ["Es LES PAUL"]}, {"Name": "Body Type", "Value": ["Semi-Hollow"]}, {"Name": "Body Color", "Value": ["Gold"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model Year", "Value": ["2015"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}]}, "HitCount": 62, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Excellent condition", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}