{"BestOfferEnabled": true, "Description": "Custom Ernie Ball Music Man ReflexLike the 25th Anniversary version, but a custom follow-on edition (custom colors, finishes, appointments)Gorgeous Quilted Maple top, natural finishThe Reflex is an extremely versatile guitar, that can do all the dual humbucking LP-style tones as well as a mix of single coil Strat/Tele-style tones. This is a particularly exquisite and unusual specimen, due to its custom wood selection and finish. I bought this one used about three years ago, the only one I've seen in this natural color combination from a USA seller. About the time I bought this one I did see one with the same finish listed new from a seller in Germany for over $3000. That's the only other natural finish quilted top one I've ever seen anywhere.The Reflex model is based on the 2009 Ernie Ball MusicMan 25th Anniversary model, so this one was manufactured in 2010 or later. I couldn't find exact Reflex specifications on the official Ernie Ball Music Man site, since it is out of production, but found specs on a couple of mainstream music store sites as well as described in online demo videos by Ernie Ball and others. I can't guarantee these specs but all seem to agree with each other and match what I see in person in this guitar. The one I'm selling is an Ernie Ball Custom model so may have some differences - I've described the ones I can see.Below is a summary of the specs I found online (with my edits in parentheses):Crafted by Ernie Ball MUSICMAN in San Louis Obispo, California.Finish: Natural, with cream binding on the body and with chrome hardware.Body: Chambered basswood, with quilted maple top and mahogany tone block. (Quite resonant.)Neck: Birdseye maple - back of the neck unpainted, hand oiled and waxed for a smooth satin feel. Bolt-on (5 bolt) neck construction.Scale: 25.5\"Fretboard: Birdseye maple, with large black dot inlays (unlike the usual Ernie Ball Music Man mini dots). 12“ fretboard radius.Frets: 22, high profile, medium widthNut: 41.3 mm. (I measured 1 5/8\")Headstock: Birdseye mapleTuners: Schaller M-6 IND locking tunersBridge: Original Music Man vintage tremolo.Pickups: 2x DiMarzio custom humbuckers (Neck pickup is a zebra with no cover) Electronics: 1x volume, 1x tone, 5-way blade switch, 2-way toggle switch series/parallelAdditional details (my description):Guitar weighs 7 lbs 10 1/2 ozSlightly asymmetrical neck profile, extremely comfortable to meNeck pickup has no chrome cover (came that way to me) and looks like a zebra pickup. I also noticed the neck pickup has the screw-top and hidden flat pole pieces in same order as the bridge, which is unusual, so this was either custom ordered that way or possibly modified. Other Reflex guitars I've seen online have two chrome covers or two uncovered zebra pickups and the screw-top pole pieces opposing.5-way switch gives the following settings:- Neck humbucker- split inside coils- Both humbuckers- split outside coils- Bridge humbuckerThen the toggle switch toggles between series and parallel. Series settings have extra punch, almost like a gain switch.In most guitars, humbucker coils are in series within the pickup and then pickups are typically in parallel with other pickups. In this guitar, there are more choices, while still being simple to operate.When using the humbuckers individually, series sounds like a normal humbucker, bold and with lots of bite. Parallel gives a thinner or softer choice.When using the split coil settings (2 and 4), parallel gives something like two-pickup strat/tele settings, like neck and bridge since there is no middle pickup here.Some commenters on forums say the parallel setting is just more quiet, but others hear a difference in tone - I hear a difference in tone but you may or may not. If not, you can still think of the series setting as a gain boost for leads. Bottom line, 10 different pickup settings that are easily controlled.It is currently set up with medium height action and the tremolo bridge not floating. With such a fine instrument I will leave it to you to put on new strings of your choice and set it up the way you want - no sense me spending $ and raising the price if it is not the way you would set it up.Comes with the original Music Man USA form-fit Reflex hardshell case, tremolo bar, extra tremolo springs, case keys, and case candy as shown in pics.Incredibly versatile. Wonderful tone choices. And it is gorgeous and unique! For fans of twin humbuckers and especially the LP, or Axis body shapes, this is an awesome upgrade with body contours and tons of tone choices.Liking any particular model guitar is subjective so no guarantees that you will see it the same as me. I expect most serious watchers of this guitar will already know what it is or have played other Ernie Ball models and have a reasonable idea about this one. It is an exceptional (and exceptionally beautiful) version of the Reflex guitar. I have tried to be thorough in the description and condition comments. If you have any questions or want to see more pics, please ask before bidding. As I bought it used, I am selling as-is, only accepting returns if not as described here, in accordance with eBay Buyer Protection policies.Shipping to continental USA only. This will be extremely well packed, shipped insured, and require a signature at delivery to protect both of us. See my perfect feedback and positive comments about packing.While I think it is priced fairly, I will consider serious offers, so feel free to make an offer.Happy Bidding!", "ItemID": "132880041868", "EndTime": "2018-12-15T21:28:27.000Z", "StartTime": "2018-12-06T21:38:32.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Custom-Ernie-Ball-Music-Man-Reflex-Quilted-Maple-top-Birdseye-Neck-w-OHSC-/132880041868", "ListingType": "Chinese", "Location": "Bonney Lake, Washington", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1328800418688080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA4MFgxNTQ3/z/r1AAAOSwUflbpwl0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg4Mjk=/z/kfIAAOSwQ3tbpwl6/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg3MzI=/z/NmQAAOSwRE9bpwmA/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzIwWDk2MA==/z/X-YAAOSwyGRbpwmF/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA4MFg4MTA=/z/RhsAAOSwrlBbpwmP/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA4MFg4MTA=/z/znQAAOSwLKNbpwmW/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA4MFg4MTA=/z/APcAAOSwHgRbpwmd/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA4MFg4MTA=/z/mgoAAOSweKJbpwmk/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjQ5WDE2MDA=/z/19QAAOSwBQ9bpwmo/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA4MFgxNTYy/z/R6gAAOSw1u9bpwmz/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzIwWDk2MA==/z/mqIAAOSwJr1bpwm4/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA4MFgxNDQw/z/HycAAOSwcTlbpwm~/$_57.JPG?set_id=8800005007"], "PostalCode": "98391", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "smileycloud", "FeedbackRatingStar": "Purple", "FeedbackScore": 682, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 1700.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1700.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "r***s", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 570}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Custom Ernie Ball Music Man Reflex, Quilted Maple top, Birdseye Neck, w/OHSC", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Natural"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Reflex"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Body Material", "Value": ["Basswood"]}, {"Name": "Brand", "Value": ["Ernie Ball Music Man"]}]}, "HitCount": 123, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 1725.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "ConditionDescription": "Used.  Very good to excellent.  I think it is in excellent condition, but to be conservative for this listing I would call it very good to excellent condition, like 8 out of 10.  Bought used 3-4 years ago, used it very lightly, kept in my smoke-free home and has no smoke smell - I'm pretty sensitive to that.  There is a little bit of discoloration or marring of some sort on the chrome cover of the bridge pickup and a little on the base of the bridge.  There are two tiny dents that I can find, on the bottom edge (see pic).  Only other flaws I can find are - very faint pick marks in the finish, between the pickups and the volume knob only visible when the light glances off it just right and a few faint scratches in the finish on the back and edge (none through the wood).  Case is in good shape - interior is immaculate and the exterior has some scuffs as would be expected, mostly on the bottom side.  See description and photos for more details.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}