{"BestOfferEnabled": false, "Description": "This is guitar is a Fender American Elite Telecaster Thinline - Natural w/ Maple Fingerboard.I own two of these (the other is a limited run with Mahogany body). I have no reason to keep two, and so that is the ONLY reason for selling. It is truly a GREAT guitar. Everything is original other than I tend to REALLY enjoy the look of a wood pick guard. So that is what you are seeing in the pictures. I will be sending the original pick guard with it as well so that you can decide what you prefer. This will also include the hard shell case that is included with the Elite models. Following specs are cut, copy and paste from the spec page for this guitar. A Thinline for the Modern PlayerFender's American Elite Telecaster Thinline semi-hollowbody electric guitar is a great instrument for pickers who love the classic platform but need a wider palette of tones. You'll get the noise-free twang and cut Fender Noiseless Tele pickups are known for. An S-1 switch adds new pickup voicings to the American Elite Tele Thinline. And features like a 9.5\"-14\" compound-radius fretboard make these guitars effortless to play. The Fender American Elite Telecaster Thinline is the future of one of the most popular workhorse guitars ever.Fender American Elite Telecaster Thinline Electric Guitar at a Glance:Familiar tones with a twistNeck designed with you in mindSemi-hollow constructionFamiliar tones with a twistOnboard the American Elite Telecaster Thinline is a duo of Fender's fourth-generation Noiseless single-coil pickups. These improved designs deliver the Telecaster's familiar punch and twang. But the Noiseless circuitry eliminates unwanted signal noise and hum, making the guitar ideal for live performance and touring. The S-1 switch, imbedded in the volume knob, adds new pickup combinations for additional Tele tones. And the ash and maple construction is a tried-and-true combination that has proven itself over decades.Neck designed with you in mindFender has been known for their iconic neck profiles since their beginning. The American Elite Telecaster Thinline continues the tradition with a comfortable contour that's not too thin, not too wide. The 9.5\"-14\" compound fretboard radius ensures comfort while chording, and it flattens out up high for unimpeded string bending and vibrato. And the neck's rolled fretboard edges feel like a well worn guitar as soon as you open the case.Semi-hollow constructionAn addition you're sure to appreciate on the American Elite Telecaster Thinline is the semi-hollow construction. This design imparts more air and acoustic resonance to your guitar tone. And it makes the guitar lighter on your shoulder for those marathon gigs. The guitar also maintains its balance well. And putting the S-1 switch in the volume knob ensures the American Elite Tele Thinline looks and functions just like your favorite thinlines from the past. Fender American Elite Telecaster Thinline Electric Guitar Features:Upgraded American Telecaster Thinline4th-generation Fender Noiseless pickupsS-1 switch offers more sonic optionsIdeal 9.5\"-14\" compound-radius fretboardSemi-hollow construction opens the tone and removes weight", "ItemID": "113405152665", "EndTime": "2018-12-04T17:08:42.000Z", "StartTime": "2018-11-27T17:08:42.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fender-American-Elite-Telecaster-Thinline-Custom-wood-pick-guard-/113405152665", "ListingType": "Chinese", "Location": "Stillwater, Minnesota", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1134051526658080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTE5NVgxNjAw/z/fGgAAOSwLKhb~XeC/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/m8UAAOSwXI1b~XdT/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/5Q8AAOSwa~Fb~XdV/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/UdYAAOSwiwZb~XdS/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/yqIAAOSwujJb~XdR/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjQwWDY0MA==/z/xlIAAOSwKSlb~XdR/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/1BMAAOSwBqZb~XdY/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/dEIAAOSwXc9b~XdT/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/iJYAAOSwteFb~XdV/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/WBIAAOSwaPNb~XdW/$_32.JPG?set_id=880000500F"], "PostalCode": "55082", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "djbreck", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 104, "PositiveFeedbackPercent": 100.0}, "BidCount": 5, "ConvertedCurrentPrice": {"Value": 1205.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1205.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "y***y", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 452}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Fender American Elite Telecaster Thinline - Custom wood pick guard ", "ItemSpecifics": {"NameValueList": [{"Name": "Body Material", "Value": ["Ash"]}, {"Name": "Brand", "Value": ["Fender"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Telecaster Thinline"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Body Type", "Value": ["Semi-Hollow"]}, {"Name": "Body Color", "Value": ["Clear"]}]}, "HitCount": 422, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 1230.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}