{"BestOfferEnabled": true, "Description": "For sale and local pick up. Ok so here is an Ibanez 1978 2619 that has a story behind it. This guitar was stolen from the store that had it for sale in the state of WI in 1978. The person who stole the guitar painted only the front of the guitar black and etched out the serial number with a wood burner. The guitar was recovered and sat in police evidence room for 2 years before the store owner could receive it back after the court date. Ibanez would not warranty the guitar since it was altered. So the store owner had to sell it as a used guitar. I purchased this guitar from the original legit buyer who bought it in 1981 and he has owned it until I bought it. He was a professional musician and took it with him for over 40 years while he made his living. I was going to take and buff off the black paint but to me it looks fantastic how it is. It seems to be a violin burst from what I can tell. The binding has the classic issues on the dot marker side of the fretboard like most of the artist from this time period. However it is not anywhere near as bad as some I have come across and the area I have taken pictures of have the most issues. All of the hardware is original except for the Ibanez Cloud Emblem at the rear of the tail piece. I bought an exact Ibanez made new production one and put it on there myself. The pick ups and pots and everything else is The pick ups sound very good. The volume and tone pots all work correctly. The neck has a great profile similar to a vintage es335 neck. The frets are in pretty good shape considering how old the guitar is in. The ebony fretboard and inlays look fantastic to me. The neck joint is in great shape. The tuning keys have the original pearl buttons and look awesome. There are no major issues at all with the guitar. I believe it is in average condition for the age. No major dents or dings. No cracks either. It even has the original input jack. Now other than the guitars alterations with the paint on just the front of the body and the serial number being etched away, I think the guitar looks fantastic, plays well and is still a very nice guitar that is becoming harder and harder to find. Also I am offering this for local pick up in the state of Tennessee. Since the shipping rates seem to have gone through the roof, I am sorry to have to offer only this. However, if you have a Fed ex account where you can get a better discount on shipping, I will be happy to box it up in a case that is non original that purchased along with the guitar when the guy bought it in 1981. And you will have to put the insurance and your return address on the shipping label you create. So for sale for local pick up only unless you have a way to create a label and send me the file to print out with the exact instructions listed above.", "ItemID": "113610579786", "EndTime": "2019-02-05T04:39:28.000Z", "StartTime": "2019-02-01T18:45:03.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1978-Ibanez-Artist-2619-Original-Flying-Finger-Pick-Ups-Nice-Vintage-Guitar-/113610579786", "ListingType": "FixedPriceItem", "Location": "Dickson, Tennessee", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1136105797868080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/tTcAAOSwa1hcVIP0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/sloAAOSwhY9cVIQA/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/qSEAAOSwsQJcVIQL/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/lswAAOSw~atcVIQX/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/VzQAAOSw-V1cVIQl/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/rf0AAOSwAIdcVIQv/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/8kYAAOSwcXhcVIRB/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/kVMAAOSwFSNcVIRL/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/av8AAOSwSxVcVIRY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/HagAAOSwjmFcVIRk/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/6E8AAOSwyn1cVIRu/$_57.JPG?set_id=8800005007"], "PostalCode": "37055", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "bigtim1973", "FeedbackRatingStar": "Red", "FeedbackScore": 2059, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 850.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 850.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "r***y", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 235}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["None"], "Site": "US", "TimeLeft": "PT0S", "Title": "1978 Ibanez Artist 2619 with Original Flying Finger Pick Ups Nice Vintage Guitar", "HitCount": 91, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}