{"BestOfferEnabled": true, "Description": "Selling my 2009 Gibson Explorer 7 String. Very Rare find - took me years to locate one!Previous owner changed wiring for a kill-switch and a toggle (notice 2 knobs instead of 3). Not sure what the wiring was meant to do, as I could never discern a difference in tone when switching the toggle. Might be due to the EMG pickups sounding very much the same.I mounted Schaller strap lock pins on it.Comes with Original case and paperwork.Selling because I'm more of a Les Paul guy, and I'm looking to purchase a 7-string LP.From Gibson's website:7-String ExplorerBorn alongside the Flying V when rock and roll was still a toddler, Gibson's Explorer was the most radical electric guitar ever unleashed upon the unsuspecting music world of 1958. Way ahead of its time, it failed to gain a foothold among the generally conservative players of the day, but became a major rock icon by the late '60s, and has been taken up by countless guitar heroes over the course of the intervening decades. Flash forward to the 21st century, and the 7-string has become the choice of an increasing number of thrash and nu-metal players, who seek eviscerating tones with the gut-rumbling potential of an added low-B string. Enter Gibson's 7-String Explorer, a natural marriage of rock's most radical shape and the specs demanded by the most adventurous 7-string players on the scene today. This new addition to the line for Gibson's \"Rocktober\" celebrations combines the proven tonal advantages of mahogany neck and body with the scorching performance of EMG pickups, all the solid playability of Gibson construction and hardware, and a none-more-black gloss Ebony nitrocellulose finish, resulting in an unmatched package for the heavy rocker.BodySpeciesThe body of each 7-String Explorer is crafted from solid mahogany, a legendary tone wood has yielded some of the most classic tones in the history of rock. DesignThe 7-String Explorer follows the classic lines of the original Gibson Explorer, with its radical \"lightning bolt\" shape that results in a pointed treble-side horn and an extreme wedge at the bass-side lower bout. In addition to creating a revolutionary look, the Explorer body offers superb upper-fret access thanks to its high neck/body joint, and contributes to a unique resonance and tonal response. Tonal CharacteristicsMahogany is a medium-dense wood with excellent resonance and superior sustain, and it offers a rich, round, warm tone, but with plenty of high-end sheen and good midrange presence. The overall result is a pleasing, open tone with excellent balance, regardless of pickup selection.FinishColorThe 7-String Explorer is finished in high-gloss Ebony. Surface TextureA high-gloss finish with 90-sheen lacquer gives the 7-String Explorer a slick, contemporary look and a smooth, fast playing feel. ProcessThe 7-String Explorer is hand-finished in nitrocellulose in a process that is carefully monitored to ensure minimum build-up, in an effort to produce a finish that breathes with the guitar and enhances natural resonance. Unlike many other manufacturers, who settle for a polyurethane finish, Gibson opts for a nitrocellulose finish that will encourage the natural vibration of the instrument for a purer tone. In addition, a nitro finish is very porous and actually gets thinner over time.Neck and HeadstockSpeciesThe neck of the 7-String Explorer is constructed from solid mahogany, cut using the superior \"quarter sawn\" orientation for improved strength and resonance, and glued to the body at a 3.5-degree angle (pitch). Mahogany is the most traditional wood for Gibson electric guitar necks, and offers an outstanding combination of strength and resonance. It makes an excellent sonic and visual partner to the solid mahogany body. Truss RodGibson's traditional truss rod, found in most all of our guitars, is highly responsive to the individual adjustments you'll want to make to personalize and optimize string action and sustain.ProfileThe neck on the 7-String Explorer is carved to Gibson's comfortable, slim, but rounded Explorer profile, which offers a smooth playing feel in the hand and allows the speed that contemporary guitarists demand. Joint Angle3.5° (+/- 15 seconds)HeadstockThe 7-String Explorer carries the classic \"droopy\", in-line headstock of the original Explorer, but -- of course -- with seven tuners on its upper side.LogoThe headstock of the 7-String Explorer is adorned with a simple Gibson logo silkscreened in gold at its furthest extent.FingerboardSpeciesThe 7-String Explorer carries an unbound rosewood fingerboard, the traditional fingerboard of the original Explorer, and countless classic Gibson electric guitars. Rosewood is both hardwearing and sonically superlative, adding sweetness and depth to the guitar's overall sound. RadiusThe 12-inch radius of the 7-String Explorer's fingerboard provides smooth note bending capabilities and eliminates \"dead\" or \"choked out\" notes, common occurrences on fingerboards with lesser radiuses.FretsThe 7-String Explorer sports 22 jumbo frets, all immaculately dressed and polished for speed and performance. InlaysIn order to preserve its mean, dark esthetics, the 7-String Explorer's fingerboard carries no inlays, only side-dot position markers are provided. Tonal CharacteristicsRosewood fingerboards are known for their rich, round tone, which enhances the excellent balance and overall resonance of the mahogany neck and body.PickupsModelA pair of EMG active pickups, long popular with thrash, nu-metal, and heavy rock guitarists, equip the 7-String Explorer for serious action on delivery. A high-output EMG 81-7 in the bridge position and a smoother EMG 707 in the neck position ensure an excellent balance between pickups, and deliver a wide range of contemporary tones, from a warm, singing, vocal neck tone to a punchy, snarly and aggressive bridge tone. The 9V battery required to power them yields upwards of 3,000 hours of use, so battery changes are infrequent. Magnet MaterialWhile many of the EMG 81-7 and 707's specs are proprietary to the EMG company, these popular contemporary pickups do use classic alnico V magnets, which serves to enhance their smooth response and excellent dynamics. Employed in an active pickup of this type, alnico V nevertheless contributes to a hot, high-gain tonal assault that fits the 7-String Explorer to a \"T\". Tonal CharacteristicsThe EMG 81-7 and 707 pickups give added high-fidelity scorch and sizzle to the combination of warmth, resonance and sustain that the 7-String Explorer's body and neck woods deliver. These pickups yield outstanding clarity and an unusually broad frequency range, with an extremely dynamic response throughout the spectrum. They excel at high-gain rock styles, but also purr beautifully when applied to smokier clean tones.HardwareTuning KeysThe headstock of the 7-String Explorer is equipped with seven Grover Mini Rotomatic Tuners, with an efficient turns ratio of 14:1. Grover Rotomatics are recognized as one of the finest tuners in the industry, and represent a high-performance option on any guitar.BridgeIn 1954, Gibson revolutionized guitar hardware when it debuted the Tune-o-matic bridge, setting a standard for simplicity and functionality that has never been bettered. Included on the 7-String Explorer, where it is updated for the 7-string requirements, the tune-o-matic provides a firm seating for the strings, allowing the player to adjust and fine-tune the intonation and string height in a matter of minutes. It also yields excellent coupling between strings and body, maximizing resonance, tone, and sustain.TailpieceEvery Tune-o-matic bridge is combined with a separate \"stopbar\" tailpiece, which is essentially a modified version of the earlier wraparound bridge that's designed to further enhance the connection between the strings and the body. The 7-String Explorer's stopbar tailpiece is made from Zamac then plated with chrome, and had been updated to load seven strings.", "ItemID": "273676327588", "EndTime": "2019-01-29T15:53:18.000Z", "StartTime": "2019-01-28T18:45:37.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2009-Gibson-Explorer-7-String-/273676327588", "ListingType": "FixedPriceItem", "Location": "Colorado Springs, Colorado", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2736763275888080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/RWEAAOSwyn1cT0y8/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/MkMAAOSwBAZcT0zI/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/-y0AAOSwnCdcT0zP/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/M0cAAOSwpLdcT0zZ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/dnoAAOSwJXxcT0zh/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/D88AAOSwaeNcT0zm/$_57.JPG?set_id=8800005007"], "PostalCode": "80920", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "sculdheizo", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 210, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1700.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1700.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "r***e", "FeedbackPrivate": true, "FeedbackRatingStar": "Red", "FeedbackScore": 1197}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2009 Gibson Explorer 7 String", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model", "Value": ["Explorer 7-String"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Ebony"]}, {"Name": "String Configuration", "Value": ["7 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["2009"]}]}, "HitCount": 78, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Good Condition - light scuff and scratches from light use. Previous owner re-wired electronics - probably restorable.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}