{"BestOfferEnabled": false, "Description": "Here’s your chance to get a custom-shop quality instrument for a fraction of the price. This was a project of mine years ago, but I just haven’t been playing as much lately. Body is solid wood (ash I think), with a really well-done gold sparkle finish. No dings or scratches that I can find. Neck is Warmoth, in highly figured birdseye maple with boatneck profile and pearloid face dots. There is some significant finish checking on the neck (see pictures). Came like that from the factory, but does not affect playability at all. Pickups are Rio Grande Muy Grande with pearloid tops. Came pre-wired from factory with switch and pots on pearloid pickguard. Gold Wilkinson tremolo bridge, custom order Sperzel gold locking tuners with pearloid buttons, gold Dunlop strap locks, pearloid back plate, metal gold/pearl knobs, and even decals applied to the headstock. These were applied over the finish, so should be easy enough to remove if you choose. All professionally assembled by Tim at Superior Guitar Works. There is come slight corrosion on the pickup pole pieces and the strap locks. The knobs were designed for solid shaft pots, but current pots are split-shaft. This makes it look like the knobs “wobble” as you turn them. Just the way it looks, knobs are on securely and function normally. Just set up with Ernie Ball 10’s by Tone Tailors in Lititz, PA. Full disclosure, the bridge pickup was acting a little squirrely when I tested it out before I packed it up, but turning the tone knob up and down once did the trick. Maybe just a dirty or loose connection but I wanted to point it out. Includes generic tweed case in good shape with no structural issues. Auction also includes black leather strap with strap locks, hex keys for bridge saddles and knob set screws, tremolo bar, and case keys. TERMS AND CONDITIONS Please all questions prior to bidding as all sales are final and items are sold as is. I have done my best to describe condition of item as accurately and honestly as possible. Shipping will be to U.S.A. only, fully insured for amount of winning bid. No international sales, sorry. If you have less than 10 positive feedback please contact me prior to bidding. I reserve the right to cancel any bids if you don’t meet this feedback history or fraud is suspected. Guitar is listed on other sites, so I reserve the right to end the auction early if it sells elsewhere. By bidding, you agree to all terms in this listing. Thanks and good luck! On Nov-27-18 at 15:58:48 PST, seller added the following information: Lots of questions about shipping. Seems the calculator is giving some really high numbers. I will only charge actual cost to ship. Will ship UPS or USPS, your call. If you want to check actual shipping cost, box weighs 25.8 lbs and measures 52”x20”x8”.On Nov-30-18 at 17:47:40 PST, seller added the following information: I've gotten several questions about weight and nut width. She's looking like 9.1 lbs on the trusty bathroom scale, and 1 5/8\" at the nut. I added pics as well. Thanks for the questions and good luck.On Nov-30-18 at 18:07:40 PST, seller added the following information: FWIW I don’t have calipers to measure but width. Hopefully you can judge from picture.", "ItemID": "233019221335", "EndTime": "2018-12-01T20:39:00.000Z", "StartTime": "2018-11-24T20:39:00.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Custom-gold-sparkle-strat-style-electric-guitar-Warmoth-neck-/233019221335", "ListingType": "Chinese", "Location": "Lititz, Pennsylvania", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2330192213358080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/WoUAAOSwFZZb-bWr/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/WH0AAOSwlx9b-bWt/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/SUIAAOSwU1Nb-bWw/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/mIMAAOSwBZBb-bW0/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/UOEAAOSwNUlb-bW3/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/y1sAAOSwZtRb-bW5/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/594AAOSwhfRb-bW9/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/4U8AAOSwRYNb-bW~/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/rysAAOSwhspb-bXB/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1N1gxMjAw/z/~UIAAOSwO-pcAefL/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/lcgAAOSwwXRcAeey/$_32.JPG?set_id=880000500F"], "PostalCode": "17543", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "tkema396", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 133, "PositiveFeedbackPercent": 100.0}, "BidCount": 9, "ConvertedCurrentPrice": {"Value": 587.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 587.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***b", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 379}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Custom gold sparkle strat style electric guitar with Warmoth neck", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Unbranded"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Custom"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Gold"]}]}, "HitCount": 443, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 597.0, "CurrencyID": "USD"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}