{"BestOfferEnabled": false, "Description": "B.C. Rich Mockingbird Exotic Classic + OHSC For your consideration is a USED B.C. Rich Mockingbird Exotic Classic + OHSC Note: This item is sold to customers within the United States only! A Division of O. DiBella Music, Inc. - Est. 1910 456 South Washington Ave. Bergenfield, NJ 07621 TERMS & CONDITIONS By placing a bid for this item, you agree that you have read and accept the following terms and conditions: ACCEPTANCE OF AN ORDER: O. DiBella Music, Inc. will refuse any eBay order if the buyer has a rating of zero, a history of negative feedback, and/or a history of retracted bids. If you win an auction and receive an invoice, we expect prompt payment. If you are unable to pay within 24 hours of receipt of our invoice, please contact us and let us know your intentions. Failure to pay or contact us within 24 hours of being invoiced may result in the item being offered to another bidder or relisted. CANCELLATION OF AN ORDER: If you win an auction but change your mind about buying the item, please contact us immediately. We are very understanding and will not punish you with negative feedback for cancelling an order as long as you talk to us, and do it quickly! When an order is cancelled we will issue a Mutual Agreement through eBay which ends the transaction. FEEDBACK:We leave feedback for buyers after we receive feedback from them first. We rarely leave negative feedback. To receive negative feedback from us, you really must earn it. The best way to earn negative feedback is to snipe an auction from another bidder at the last second, then ignore our invoices and requests for payment. On the other hand: We always leave positive feedback for those who pay promptly and communicate with us. As we write this, we have received over 4,000 positive feedbacks and very few negative feedbacks. Our negative feedbacks are usually from newbies with \"0\" feedback ratings. For example: One newbie's guitar was damaged by UPS; he did not contact us, he just left negative feedback. A simple email or phone call and he would have received a full refund, and we would have had the damaged item returned to us at our own expense. Instead, he received reciprocal negative feedback from us, and he now owns a broken guitar. Moral of the story: Do not leave negative feedback before contacting us (or any other seller). PAY-PAL POLICY: O.DiBella Music, Inc. reserves the right to refuse PayPal payments if the seller is unverified and/or the shipping address is unconfirmed. PAYMENT (U.S.A. ONLY): O. DiBella Music, Inc. accepts the following payment methods for U.S. customers: PayPal - Verified buyers with confirmed shipping addresses only. Credit Card - You may pay directly by Visa, MasterCard, American Express or Discover. A toll-free number is provided for your convenience. SHIPPING (U.S.A. ONLY): O. DiBella Music, Inc. ships via UPS or U.S. Postal Service at our discretion unless otherwise stated. We will combine shipping charges when more than one item is purchased. If you purchase more than one item please wait for invoice before making payment. We have daily UPS pickups at our store and do our best to ship items within 3 business days. U.S. Postal Service shipments may take longer since we do not visit the Post Office daily. Also, certain items, notably guitars and other instruments, may take longer to ship than an off-the-shelf boxed item, as special care is taken in preparing an instrument for shipping. INTERNATIONAL ORDERS: We will ship outside the U.S.A. UNLESS OTHERWISE NOTED. If the description says U.S.A. ONLY, then (you guessed it!) we will not ship the item to buyers outside the U.S.A. If the above terms and conditions are acceptable to you, please feel free to place your bid. Good luck!", "ItemID": "283270051765", "EndTime": "2019-02-17T05:07:17.000Z", "StartTime": "2018-11-20T18:43:51.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/B-C-Rich-Mockingbird-Exotic-Classic-OHSC-/283270051765", "ListingType": "FixedPriceItem", "Location": "Bergenfield, New Jersey", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/2832700517658080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg1NTE=/z/ipEAAOSwsDZb9FRG/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjQ0/z/AwcAAOSwZUFb9FRK/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg1NTY=/z/saMAAOSwjrFb9FRO/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjEz/z/btAAAOSwvoxb9FRQ/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg4OTM=/z/VAwAAOSwNpRb9FRF/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5NTk=/z/saEAAOSwjrFb9FRM/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAwMVgxNjAw/z/jo0AAOSwXitb9FRC/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDY4WDE2MDA=/z/6A4AAOSwL4Rb9FRA/$_1.JPG?set_id=8800005007"], "PostalCode": "07621", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "456music", "FeedbackRatingStar": "Green", "FeedbackScore": 8909, "PositiveFeedbackPercent": 99.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 575.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 575.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "3***b", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 884}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "B.C. Rich Mockingbird Exotic Classic + OHSC", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["B.C. Rich"]}, {"Name": "Model", "Value": ["Classic"]}, {"Name": "Body Type", "Value": ["Classical"]}, {"Name": "Series", "Value": ["Classic"]}, {"Name": "Body Color", "Value": ["Natural"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Size", "Value": ["Full Size"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}]}, "HitCount": 865, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=69386198", "StoreName": "456Music"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "Super Clean - 100% Functional and Set Up to PLAY!", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}