{"BestOfferEnabled": false, "Description": "Charvel SD2 HH Pro Mod Floyd Rose San Dimas Okoume Guitar Mint 2018 SKU: SS2452 Brand: Charvel Condition: Used Body Type: Solid String Configuration: 6 String Dexterity: Right-Handed Body Color: Okoume Country of Manufacture: Mexico Series: Pro Mod SD2 MPN: 2965101557 UPC: 885978896912 STREET SOUNDSEST. 1988 IS PROUD TO BE AN AUTHORIZED CHARVEL DEALER FEATURING THIS: CHARVELPRO MOD SD2 2H SAN DIMAS OKOUME GUITAR Pedigreed shredders from the 80s, Pro-Mod San Dimas guitars are packed with high-speed playability and innovative design elements that epitomize Charvels definitive combination of time-honored style and modern features, power and performance. The Pro-Mod San Dimas Style 2 HH FR M Okoume offers an okoume body coupled with a bolt-on two-piece maple neck with graphite reinforcement rods for rock-solid stability, despite the ravages of the road and climate. Engineered for effortlessly nimble and highly-expressive playing, this guitar has a speed neck profile with a hand-rubbed urethane gel back finish, a 12-16 compound radius maple fingerboard with 22 jumbo frets and black dot inlays, as well as a heel-mounted spoke wheel for quick and easy truss rod tweaks. Hot-rodded for unparalleled performance and versatile sound, this instrument is equipped with a high-output Seymour Duncan JB humbucking bridge pickup and a warm, fat Seymour Duncan 59 humbucking neck pickup, controlled with a three-way blade switch. The volume control hides a push/pull coil split for even more highly useful tonal variationsideal for everything from a biting lead sound to thick, chunky rhythm work, while the No-Load tone control operates like a standard tone control from positions one through nine, removing itself from the circuit at position ten for transparent sound, letting the full natural voice of the guitar shine through. The Floyd Rose 1000 series recessed tremolo bridge system allows players to scream and rumble without sacrificing tuning stability. General Model Name: Pro-Mod San Dimas Style 2 HH FR M Okoume, Maple Fingerboard, Natural Model Number: 2965101557 Series: Pro-Mod Style 2 MSRP: $1249.99 Color: Natural Body Body Shape: Style 2 Body Material: Okoume Body Finish: Satin Neck Neck Material: 2-Piece Maple with Graphite Reinforcement Neck Shape: Speed Neck with Rolled Fingerboard Edges Scale Length: 25.5\" (648 mm) Fingerboard Radius: 12\" to 16\" Compound Radius (304.8 mm to 406.4 mm) Number of Frets: 22 Fret Size: Jumbo String Nut: Floyd Rose FRT 02000 Locking Nut Width: 1.6875\" (42.86 mm) Truss Rod Nut: Heel-Mount Truss Rod Adjustment Wheel Neck Plate: 4-Bolt Angled Heel Neck Finish: Hand-Rubbed Urethane Fingerboard: Maple Position Inlays: Black Dots Electronics Bridge Pickup: Seymour Duncan JB TB4 Humbucking Neck Pickup: Seymour Duncan '59 SH1N Humbucking Controls: Volume (Push-Pull Coil Split), Tone Pickup Switching: 3-Position Blade: Position 1. Bridge Pickup, Position 2. Both Inner Coils, Position 3. Neck Pickup - (Split Engaged) - Position 1. Bridge Outer Coil, Position 2. Both Outer Coils, Position 3. Neck Outer Coil Pickup Configuration: HH Hardware Bridge: Floyd Rose FRT-O2000 Double-Locking Tremolo (Recessed) Tuning Machines: Charvel Branded Die-Cast Orientation: Right-Hand Hardware Finish: Black Pickguard: None Control Knobs: Knurled Flat-Top Miscellaneous Strings: NPS, .009-.042 Gauges PHOTO OF ACTUAL GUITAR 2018 PRODUCTION MINT CONDITIONNO ISSUESPERFECT NECK, FRETS, ELECTRONICSNO DENTS NO DINGSSTREET SOUNDS 30 DAY TRIAL PERIOD INCLUDED SN: MC187646GUITAR WEIGHT: 7LBS. 15OZ. FREE SHIPPING IN CONTINENTAL U.S. INSURANCE IS INCLUDED ON ALL SHIPMENTS", "ItemID": "302857219679", "EndTime": "2019-02-18T22:50:34.000Z", "StartTime": "2018-08-24T18:06:56.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Charvel-SD2-HH-Pro-Mod-Floyd-Rose-San-Dimas-Okoume-Guitar-Mint-2018-/302857219679", "ListingType": "FixedPriceItem", "Location": "Brooklyn, New York", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/3028572196798080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/ODUwWDEyODA=/z/E6gAAOSw1SJbgEk9/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDYzNw==/z/a6QAAOSw76xbgEk8/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDU0OQ==/z/qwMAAOSwDJRbgEk-/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDYzOA==/z/gggAAOSwkV1bgEk9/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDYzOA==/z/36EAAOSwDehbgEk9/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDYzOA==/z/AqgAAOSwBP9bgEk9/$_12.JPG?set_id=880000500F"], "PostalCode": "11209", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "rockystreetsounds", "FeedbackRatingStar": "TurquoiseShooting", "FeedbackScore": 27062, "PositiveFeedbackPercent": 99.9}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 699.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 699.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "t***n", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 269}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Charvel SD2 HH Pro Mod Floyd Rose San Dimas Okoume Guitar Mint 2018", "ItemSpecifics": {"NameValueList": [{"Name": "UPC", "Value": ["885978896912"]}, {"Name": "Brand", "Value": ["Charvel"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Body Color", "Value": ["Okoume"]}, {"Name": "Country of Manufacture", "Value": ["Mexico"]}, {"Name": "Series", "Value": ["Pro Mod SD2"]}, {"Name": "MPN", "Value": ["2965101557"]}]}, "HitCount": 2440, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=157392609", "StoreName": "STREETSOUNDS NYC"}, "Country": "US", "ReturnPolicy": {"Refund": "Money back or replacement (buyer's choice)", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "SKU": "SS2452", "NewBestOffer": false}