{"BestOfferEnabled": false, "Description": "GOLD RUSH PAWN CO. Epiphone SG G-400 Left Hand Cherry 2006 with Hard Case Description: ELECTRIC GUITAR: EPIPHONE MODEL SG G-400 , 6 STRING, LEFT HANDED, NICE HARD CASE Details Additional Details for eCommerceIN HARD CASE Musical Instrument Condition Rating90% - Very Good - In Great Condition with light signs of use Instrument Appearance90% - Excellent Condition : Very Clean, might have some minor wear, dings, scratches but otherwise very close to new condition. Knobs - Tuners - Electronics - Input Jack90% - Very little wear Musical Instrument CaseHard Case Included Number of Strings6 STRING Country of ManufactureMade in China Body StyleSOLID DexterityLeft Handed Notes: This guitar is in very nice condition. See photos. It has been played. Light normal use with some light scratches and one dent inside of the top arch - see photos. The case has a couple of scuffs on the outside and looks really nice inside. (GR1044421) Payment PayPal is the ONLY online payment method we accept at this time. Your PayPal account must be a Verified U.S. PayPal Account. We also recommend that you use a Confirmed Ship To Address. Shipping Your item will be shipped within 1 business day(s). After shipping your items will be delivered within 1-10 business days. Terms of Sale Tax applies in: MT About Us Gold Rush Pawn Company opened the doors in Kalispell, Montana in 1980. We are the oldest local family owned and operated pawn shop in the Flathead Valley. There is just one Gold Rush Pawn Company. You get our personal attention when you deal at Gold Rush. We have a friendly knowledgeable staff who treat customers right. We are located just 35 miles from Glacier Park. If you are in the area, make sure to stop in! We do pawn loans plus buy, sell and trade on most items of value. We offer layaways for your convenience. With 10% down, 10% due monthly and 10 months to pay for the item. If you are looking for a pawn loan we have many options. We try to loan you the maximum amounts and we never put an item out for sale before 60 days from the original loan date. That way if you are a few days or even a couple of weeks late, your item will still be waiting for you. We offer 1/2 price 7 day loans as well. Our log storefront is also home to Gold Rush American Motorcycle and we have a wide selection of parts and accessories for Harley Davidson cycles plus high quality reasonably priced leathers. Everything on our online Buya store is also for sale in our brick and mortar store. If the item you buy online sells in the store, we will apologize and give you a full refund. We will suggest something similar if we have it. All items and accessories included in our listings are shown the photographs. If you have any questions or requests, please ask. If you don't see what you are looking for in the store, you never know... It could be kickin' around here somewhere. We guarantee everything to be as stated in the listing. We stand behind our products. If we miss something, you will get a full or partial refund including shipping costs – your choice. If you decide to return an item because you don't like it, there is a 20% restocking fee and you will be expected to pay the return shipping. World wide international buyers: We always welcome your business. Most Ebay items are shipped through Ebay's global shipping program. We will also ship directly to you. We won't misrepresent item costs or descriptions. We also ask that you do not buy or bid on any items that are not allowed to be imported into your country. If you do, the item will probably be confiscated by your customs department. Then you will lose both the item and the money you paid for it. Stop by online or in person. We'd love to see you and promise you won't be disappointed. Bravo Store Systems Point-of-Sale Operating System Bravo Omni-Commerce solutions offers Brick & Mortar stores the only fully integrated eBay API that seamlessly & effortlessly combines the in-store Point-of-Sale to all eBay commerce selling activities. Click here & find out why eBay stated \"Bravo has best solved Brick & Mortars can sell on eBay\"", "ItemID": "283349464948", "EndTime": "2019-02-25T21:45:03.000Z", "StartTime": "2019-01-22T23:46:15.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Epiphone-SG-G-400-Left-Hand-Cherry-2006-Hard-Case-/283349464948", "ListingType": "FixedPriceItem", "Location": "Kalispell, Montana", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2833494649488080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MzYwWDY0MA==/z/~kIAAOSwIndcR6tD/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/MzYwWDY0MA==/z/3SQAAOSwPDlcR6tD/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/MzYwWDY0MA==/z/m84AAOSwF7lcR6tD/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/MzYwWDY0MA==/z/iA0AAOSwqKNcR6tE/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/NzIwWDU0MA==/z/wBMAAOSwYwxcR6tE/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/NzIwWDU0MA==/z/BTAAAOSw5cZcR6tE/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/NzIwWDU0MA==/z/Iu4AAOSwN5hcR6tF/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/NzIwWDU0MA==/z/4bgAAOSwwkRcR6tF/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/MzI2WDY3Mg==/z/7jIAAOSws~VcR6tF/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/NzIwWDU0MA==/z/RCoAAOSwltxcR6tG/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/NzIwWDU0MA==/z/SJYAAOSwYTtcR6tG/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/NTQwWDcyMA==/z/eccAAOSwKc1cR6tG/$_1.JPG?set_id=2"], "PostalCode": "59901", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mtgoldrush", "FeedbackRatingStar": "Red", "FeedbackScore": 3369, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 315.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 315.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "c***o", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 219}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "CA", "GB", "DK", "RO", "SK", "BG", "CZ", "FI", "HU", "LV", "LT", "MT", "EE", "AU", "GR", "PT", "CY", "SI", "JP", "CN", "SE", "KR", "ID", "TW", "TH", "BE", "FR", "HK", "IE", "NL", "PL", "ES", "IT", "DE", "AT", "BS", "IL", "MX", "NZ", "PH", "SG", "CH", "NO", "SA", "UA", "AE", "QA", "KW", "BH", "HR", "MY", "CL", "CO", "CR", "PA", "TT", "GT", "HN", "JM", "AG", "AW", "BZ", "DM", "GD", "KN", "LC", "MS", "TC", "BB", "BD", "BM", "BN", "BO", "EG", "GF", "GG", "GI", "GP", "IS", "JE", "JO", "KH", "KY", "LI", "LK", "LU", "MC", "MO", "MQ", "MV", "NI", "OM", "PK", "PY", "RE", "UY"], "Site": "US", "TimeLeft": "PT0S", "Title": "Epiphone SG G-400 Left Hand Cherry 2006 with Hard Case", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["G-400"]}, {"Name": "Model", "Value": ["SG"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Color", "Value": ["Red"]}, {"Name": "Model Year", "Value": ["2006"]}, {"Name": "Right-/ Left-Handed", "Value": ["Left-Handed"]}]}, "HitCount": 348, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=48289778", "StoreName": "Gold Rush Pawn~American Motorcycle"}, "Country": "US", "ReturnPolicy": {"Refund": "Money back or replacement (buyer's choice)", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalRefund": "MoneyBackOrReplacement", "InternationalReturnsWithin": "30 Days", "InternationalReturnsAccepted": "ReturnsAccepted", "InternationalShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": true, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}