{"BestOfferEnabled": false, "Description": "This is an Italia Rimini 12 string electric guitar with a Roadrunner hardshell case. It is the best 12 string electric made in the past 20 years and the closest thing to a Rickenbacker that can be had at anything near this price range. It has neck-thru design with chambers above and below it like a Ric, but it is really a hybrid of a Ric and a Firebird 12. It plays a lot like a Firebird 12 in scale and feel, and the minibuckers are obviously a nod to the Firebird as well. The advantage over the Ric, is that if you like the traditional drone/note structure of a 12 string, this is that so you get that awesome chime. Additionally, the full-length headstock is much easier to navigate with restringing and tuning. This Italia is quadruple rare because 1. They made very few 12s in this initial run made in Korea. 2. It is the white pearl version with the beautiful sunburst back and 3. It is the ultra-rare version with mini humbuckers. 4. These did not ship with a hardshell case, and it is brutally hard to find a decent hardshell (and this Roadrunner rules, especially with that emerald green lining). I have played and enjoyed this guitar for the last decade plus but we are in the middle of downsizing all non-essentials and this means selling off a lot of neat stuff (She let me keep one 12 string, a Hagstrom if you're keeping score) so this awesome and rare guitar needs to find a new home. Condition? Well, as Brownsville Station said, “Let me tell ya ' bout it!” Condition-wise I would call it “played, but generally nice condition.” By this I mean there are signs of honest wear, but there are a lot of good playing years left. I always looked at instruments that have play wear as an instrument that was worth playing, and this is definitely the case with this Italia. I always go for vintage guitars, so the fact that I've clearly played this means it's a good instrument. Now I have no idea how you look at guitars as far as condition, playability, etc., so take everything I say with a grain of salt. I'm a life-long musician who has owned 30+ electric 12s through the years (from Hagstrom to Ovation to every 60s MIJ thing you can imagine). I am not a collector, I am not a luthier, just a guy who plugs things in and plays them. That being said, I like the way this guitar plays. It's good in both chords and single notes. The action is at a reasonable level with room on the bridge left to go down if desired and the truss rod functions as it should. It's got the type of neck you just want to play. I've always veered toward more Gibson-y sort of stuff, and this is most definitely that with its nice chunky frets and tune-o-matic bridge. The frets are generally good, there's definitely a little wear in the cowboy chord area (frets two and three) but nothing that is impacting playing and it would be years of pretty heavy playing before this became an issue. Right now there are a set of new D'Addario 10s on it as it seems to really like those. The electronics all function as they should. These are lower impedance minibuckers by Wilkinson so they're not overloaded by the 12 string signal. The electronics have been upgraded with a Switchcraft 1/4” jack and an NOS Sprague orange drop capacitor in addition to all of the solder being touched up with good Kester lead solder. The hardware is all the stock Gotoh hardware including the awesome “I” tailpiece and oil-filled tuners. The tuners may rock the smallest amount, but it is equivalent to any of these “Grover inspired” tuners that I've seen. Aesthetically, it is in good used condition, but it does have knicks and dings on it. There's a a few on the body, one on the headstock, the “tone” knob is missing its circular insert (quick note, there is no pickup selector, so it's volume, volume, master tone. If running the two pickups together, roll off one of the two volumes down to 9), there is some tiny rust on a few fret edges, there was a tiny ding in one of the wings, I already mentioned the honest fret wear, and there is some pretty good belt rash on the back. Nothing terrible, just from playing on stage there's all of those fine scratches you see in the light. I'm just trying to be thorough on this because it's what I'd want to know about when I bought a guitar online. To be clear, all of the issues I am mentioning is reflected in the price already. If you'd like an unplayed guitar, wait for an NOS one at double this price. It really is a nice playing instrument that kills anything under $1000. Oh, the case! This is a hardshell Roadrunner case that fits this awkwardly shaped instrument pretty nicely (it's not a semi-hollow, it's not a true solid body, and it has an extended 12 string headstock, so finding a hardshell case for this was just a miserable experience, but you don't have to go through that experience!). When you pick it up and shake it, it doesn't slide around on the inside and all of the latches function as they should. No idea on the key, but I don't own the key to a single case I own. There are a few scuffs on the outside and the Roadrunner logo is coming off, but in general it's in nice shape with plenty of functionality left. Overall, this is a rare instrument that will scratch that itch for a cool 12 string without breaking the bank. These Korean-made Italias are going to go down in history as true sleeper instruments and this one is the rarest of rare 12s (the Riminis in general are tough to find, and the 12s are just impossible). It's been played, but well-loved, and ready to be played some more. It will ship safely in its hardshell case, with a real guitar box, and with the strings loosened. ***Note that your shipping price includes insurance for the entire value of the guitar should something happen in transit. I am pricing it at a very good price, and considering the absolute rarity of these, I would not wait to purchase as another opportunity may not come along for many years. Don't miss out!***", "ItemID": "283346840925", "EndTime": "2019-01-24T22:48:47.000Z", "StartTime": "2019-01-20T23:17:23.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Italia-Rimini-12-string-electric-guitar-hardshell-case-Neck-thru-Minibuckers-/283346840925", "ListingType": "FixedPriceItem", "Location": "Charleston, Illinois", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/2833468409258080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTAwMFg3NTA=/z/TB4AAOSwe7ZcRQFe/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAwMFg3NTA=/z/S0wAAOSw4ohcRQFh/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAwMFg3NTA=/z/uK0AAOSw1rpcRQFi/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAwMFg3NTA=/z/O38AAOSw-k5cRQFi/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAwMFg3NTA=/z/j4QAAOSwH2RcRQFj/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAwMFg3NTA=/z/E5sAAOSwEp5cRQFk/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAwMFg3NTA=/z/~DsAAOSwxFVcRQFk/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAwMFg3NTA=/z/V64AAOSwZupcRQFl/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzUwWDEwMDA=/z/qnwAAOSwrm5cRQFm/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAwMFg3NTA=/z/l1YAAOSwl1RcRQFn/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAwMFg3NTA=/z/m8MAAOSwRL1cRQFo/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAwMFg3NTA=/z/qFAAAOSwRn1cRQFp/$_12.JPG?set_id=880000500F"], "PostalCode": "61920", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "kwalus_5309", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 257, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 579.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 579.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "t***g", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 321}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Italia Rimini 12 string electric guitar & hardshell case– Neck thru, Minibuckers", "ItemSpecifics": {"NameValueList": [{"Name": "String Configuration", "Value": ["12 String"]}, {"Name": "Brand", "Value": ["Italia"]}]}, "HitCount": 122, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Middle East", "Southeast Asia", "South America", "BM", "GL", "MX", "PM", "RU", "CK", "FJ", "PF", "KI", "MH", "FM", "NR", "NC", "NU", "PW", "PG", "SB", "TO", "TV", "VU", "WF", "WS", "AL", "BY", "BA", "BG", "HR", "CY", "CZ", "EE", "GI", "GR", "GG", "HU", "IE", "IT", "JE", "LV", "LT", "MK", "MT", "MD", "ME", "PT", "RO", "RS", "SK", "SI", "SJ", "UA"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}