{"BestOfferEnabled": true, "Description": "Since purchased a number of years ago, I've had a couple of kids and simply do not have the time or the room for an extensive guitar collection. We're moving 1,500 miles in a few months and we've started working through the stuff in closets, the basement, and just sitting around not getting a lot of use. It's eBay time for this guitar, an amp, and some vintage Sony receivers I've collected over the years. Plays beautifully. Great neck. Comes from the factory very distressed and road worn with bumps and rust. I've photographed a couple dings that were probably caused by myself or original owner. Who knows? I do know they blend right in. This will come with a Fender hard shell case. Also comes with the Shepherd Fairy pack of stickers and stencils if you feel up to customizing this guitar like Joe Strummer. This pack is unused and intact. I will be sure to pack well and double box. Thanks for taking a look. Equal parts tribute and roadworthy rocker.From Fender®'s Artist Series, this Telecaster features an alder body with a maple \"C\" shape neck, rosewood fingerboard and 2 vintage style single-coil Tele® pickups with alnico magnets. Designed in cooperation with the Strummer estate, the Joe Strummer electric guitar has a highly distressed \"road-worn\" treatment that duplicates the original's worn-to-the-wood layers of gray auto primer and flat black spray paint. It also features a \"Revolution Rock\" engraved neckplate and a limited edition art customization kit that includes Strummer-inspired stencils, stickers and graphics by designer Shepard Fairey. Strummer was, of course, the Clash's articulate and fiery co-founder, lyricist, rhythm guitarist and lead singer; he later founded, recorded and toured with the Mescaleros. All his life, he vigorously championed individuality, self-expression and change--tenets often reflected in the constantly altered look of his favorite instrument--his Telecaster (currently on display in the Rock and Roll Hall of Fame and Museum in Cleveland), an otherwise standard '60s-era model with all the original parts and specifications. When Strummer bought it in 1975 for 120, the guitar had a Three-color Sunburst finish. He was having none of that, of course, but his improvised DIY gray and black \"finishes\" deteriorated quickly, giving the Telecaster its distinctive look. Like Strummer's music, the battered electric guitar changed constantly--plastered as it was with stencils, stickers and new paint jobs through the many stages of Strummer's life and career. To celebrate Strummer's fierce sense of individuality, Fender and acclaimed artist Shepard Fairey collaborated on the new guitar's limited edition Joe Strummer Telecaster customization kit, which includes stencils and stickers inspired by the custom designs Strummer decorated many of his instruments with. The kit comes in a classic 12\" album cover featuring graphics by Fairey and photography by Bob Gruen and will accompany the first 1,500 guitars. The legacy of Joe Strummer (1952-2002) continues to live on, grow louder and shake up the establishment with the release of the Joe Strummer Telecaster, modeled after the beat up and battle-hardened '66 Tele® he wielded as leader of \"the only band that matters\"--seminal Brit punk commando unit the Clash. FEATURESBody: AlderNeck: Maple, \"C\" Shape (Gloss Polyurethane Finish)Fingerboard: Rosewood, 7.25\" Radius (184mm)Frets: 21 Vintage Style FretsPickups: 2 Vintage Style Single-Coil Tele® Pickups with Alnico Magnets (Neck & Bridge)Controls: Master Volume, Master TonePickup Switching: 3-Position Blade:Position 1. Bridge PickupPosition 2. Bridge and Neck PickupsPosition 3. Neck PickupBridge: Vintage Style 3-Saddle Strings-Thru-Body Tele BridgeMachine Heads: Fender®/Ping® Vintage Style Tuning MachinesHardware: Distressed ChromePickguard: 3-Ply Mint GreenScale Length: 25.5\" (648 mm)Width at Nut: 1.650\" (42 mm)Unique Features: Revolution Rock Neckplate, Road Worn Finish, Art Customization Kit (First 1500 Units Only)Kit Contains: Joe Strummer 12\" Album Cover, Art Print, Stencil Sheet, Sticker Sheet, Template, Instructions and Bio.Strings: Fender Super 250R, Nickel Plated Steel,Gauges: (.010, .013, .017, .026, .036, .046),p/n 073-0250-006", "ItemID": "192783824847", "EndTime": "2019-01-15T01:53:06.000Z", "StartTime": "2019-01-08T01:53:06.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fender-JOE-STRUMMER-Telecaster-Electric-Guitar-CLASH-Distressed-Road-Worn-Tele-/192783824847", "ListingType": "Chinese", "Location": "Omaha, Nebraska", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1927838248478080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/ODAwWDE2MDA=/z/cg0AAOSws~pcM-2C/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODAwWDEzNzg=/z/A3QAAOSwLgpcM-3t/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODAwWDE2MDA=/z/0GYAAOSwtutcM-2X/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/Njc1WDEzMjI=/z/TSYAAOSwXh9cM-4B/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTA5WDgwMA==/z/55wAAOSwjoFcM-4N/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODAwWDE2MDA=/z/p94AAOSwVNNcM-28/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODAwWDk0NA==/z/zFsAAOSwsDZcM-4y/$_32.JPG?set_id=880000500F"], "PostalCode": "68132", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "bakedalaskantundra", "FeedbackRatingStar": "Blue", "FeedbackScore": 77, "PositiveFeedbackPercent": 100.0}, "BidCount": 10, "ConvertedCurrentPrice": {"Value": 736.26, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 736.26, "CurrencyID": "USD"}, "HighBidder": {"UserID": "t***s", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 228}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Fender JOE STRUMMER Telecaster Electric Guitar  CLASH Distressed Road Worn Tele", "ItemSpecifics": {"NameValueList": [{"Name": "Body Material", "Value": ["Alder"]}, {"Name": "Brand", "Value": ["Fender"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Model", "Value": ["Telecaster Special"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["Mexico"]}, {"Name": "Series", "Value": ["Artist"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Color", "Value": ["Multi-Color"]}]}, "HitCount": 414, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 746.26, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}