{"BestOfferEnabled": false, "Description": "Bought this guitar new in 2014. Never gigged. Totally flawless mint condition. It’s beautiful, man. Eminent Playability and Unlimited Tonal Range The Music Man JPXI BFR 6 gives you the latest evolution in the John Petrucci line of signature guitars. A collaborative effort between John Petrucci and the Music Man R&D team, this solidbody electric sports a combination of top appointments from Petrucci's JPX and BFR signature axes. The JPXI BFR 6 rosewood neck is streamlined to a symmetrical, extra-slim profile with a flatter 20\" radius, the perfect foundation for fast, furious fretwork. Factor in a non-chambered body, mahogany Tone Block, maple top, custom DiMarzio humbuckers, and piezo vibrato bridge, and you've got a formidable shred machine. Grab a Music Man JPXI BFR 6 and dominate. Music Man JPXI BFR 6 Solidbody Electric Guitar at a Glance: Designed for fast, precise playability Cover a wide tonal range Music Man - the pro's choice A collectible Ball Family Reserve instrument Designed for fast, precise playability The Music Man JPXI gives you the ultimate in playability. John Petrucci is a guitar legend, famous for his astonishing technical prowess and his systematic demolition of musical boundaries with Dream Theater and Liquid Tension Experiment. This man knows exactly what he needs in a solidbody electric guitar. Since his first Music Man signature model, John has been working with the company to refine the concept. Continuing the enormous success of the JPX, the JPXI BFR 6 is a superbly balanced instrument, and thanks to its sculpted alder body, it's supremely comfortable - John thinks of his talented hands as being \"average-sized,\" and this is reflected in the extra-slim neck taper - a profile also favored by a broad swath of guitarists. Add to that a premium ebony fingerboard and 24 medium-jumbo stainless-steel frets, and you've got a high-speed, low-drag shredding machine. Cover a wide tonal range The Music Man JPXI BFR 6 makes you a master of the tonal universe. Its lightweight alder body contains a mahogany Tone Block and is topped with maple - a unique tone cocktail that gives you wonderful warmth and resonance you don't expect in a solidbody, along with prodigious sustain. Two DiMarzio humbuckers - a Liquifire (neck) and Crunch Lab (bridge) - serve up a universe of tone that takes you from chimey cleans through a wide range of delectable crunch, all the way to fearsome, face-melting shred. But there's more: a custom piezo floating vibrato bridge lets you engage in vigorous whammy action with absolute tuning stability, while giving you access to a range of gorgeous, nuanced acoustic sounds. Tonally speaking, there's very little this exquisite axe can't do for you. Music Man - the pro's choice Music Man guitars and basses have been staples in the music scene since their introduction in the '70s. In fact, some of the world's best-known guitar players have their own signature Music Man models. Always striving for a better instrument, Music Man introduced the first production active EQ in basses and guitars, unique tuner placement, and much more. Musicians across a wide range of musical genres have played Music Man guitars and basses over the years including Steve Morse, Albert Lee, Tony Levin, John Petrucci, Steve Lukather, Flea, Dave LaRue, John Myung, and countless others. Join the pros and play a world-class Music Man instrument today! A collectible Ball Family Reserve instrument A Ball Family Reserve (BFR) instrument that celebrates Music Man's heritage in guitar craftsmanship with some of the finest figured tonewoods and finishes available, the John Petrucci JPXI BFR 6 is a supreme expression of the luthier's art. It's a superbly balanced instrument, and thanks to its sculpted alder body, it's supremely comfortable and lightweight - perfect for marathon gigs and sessions. This axe gives you the ultimate in playability. John Petrucci is a guitar legend, famous for his astonishing technical prowess and systematic demolition of musical boundaries. This man knows exactly what he needs in a solidbody electric guitar, and since his first Music Man signature model, he has been working with the company to refine the concept. John thinks of his talented hands as being \"average-sized,\" and this is reflected in the slim neck taper - a profile also favored by a broad swath of guitarists. Add to that a premium rosewood fingerboard and 24 high-profile, wide stainless-steel frets, and you've got a high-speed, low-drag shredding machine. Music Man JPXI BFR 6 Solidbody Electric Guitar Features: Lightweight non-chambered alder body with maple top and mahogany Tone Block Limited-edition rosewood neck 20\" fretboard radius and extra-slim neck profile are perfect for fast, precise playing Custom John Petrucci Music Man Piezo floating vibrato bridge gives you acoustic tone too Schaller M6-IND locking tuners for ultra-stable tuning Adjustable truss rod - no component or string removal required 5-bolt neck attachment - perfect alignment with no shifting Sculpted neck joint allows smooth access to higher frets Body cavity and aluminum control cover coated with graphite acrylic resin for superior shielding Hardshell case included Tear it up, with the Music Man JPXI BFR 6!", "ItemID": "183541206629", "EndTime": "2018-11-22T20:46:01.000Z", "StartTime": "2018-11-17T20:46:01.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Ernie-Ball-Music-Man-JPX1-Onyx-Rosewood-Neck-BFR-Electric-Guitar-/183541206629", "ListingType": "Chinese", "Location": "Woodland Hills, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1835412066298080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/CxEAAOSw8R9b8H2r/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/HD4AAOSw4sNb8H2p/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/c~IAAOSwBqZb8H2y/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/XpUAAOSwHF1b8H2t/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/-qEAAOSwN3Nb8H24/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/OyUAAOSwK5Fb8H2w/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/82oAAOSwUP5b8H22/$_12.JPG?set_id=880000500F"], "PostalCode": "91367", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "realsyde", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 147, "PositiveFeedbackPercent": 100.0}, "BidCount": 23, "ConvertedCurrentPrice": {"Value": 1275.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1275.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "d***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 222}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Ernie Ball Music-Man JPX1 Onyx Rosewood Neck BFR Electric Guitar", "ItemSpecifics": {"NameValueList": [{"Name": "Body Material", "Value": ["Rosewood"]}, {"Name": "Brand", "Value": ["Music Man"]}, {"Name": "Model Year", "Value": ["2014"]}, {"Name": "Model", "Value": ["John Petrucci BFR 6"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Onyx"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}]}, "HitCount": 183, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 1300.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}