{"BestOfferEnabled": true, "Description": "Vintage Jackson San Dimas Electric Guitar with CaseMade in USA - CustomYellow 1987-89 based on bolted on plate 4 digit serial number. Seymour Duncan Currently we are moving all of our old guitars that we had at the pawnshop.... we have kept some of the better vintage and classic and demanded in climate controlled storage these past 2 years so we may have a few good ones posted while you see this. The reason I have not done it sooner, well read below. PLEASE READOkay... I'd like to let you know upfront about this used classic strat style vintage guitar. I wish could tell you more specifics about this guitar however, I am not a guitar player, guitar reseller or musician! Furthermore, please be aware that I am not the original owner of the guitar so I don't know the history of parts and such other than its been in my office for a couple years. Finally... when or if I post no reserve auction, understand that I don't play any games like some guitar jockeys that have people manipulating bids.,.more than happy to take a screen shot when auction is completed if you are suspicious. I am trying to let the market determine the value. Buy with confidence! I take many detailed photos so you can make the fairest evaluation of the item's physical condition using your own skilled observation; independent of ours yet subjective, opinion. Make sure to zoom in due to some reflections can be misleading. Ebay only allows 12 photos... Guitar has been tested for the basics such as power and sound...working You should expect to need a set-up by a professional upon receiving... such as a tuned up, tightened, cleaned, and or adjusted to your liking. We will ship carefully, packing well and un-tuning the strings. Guitar setups and strings are not warranted since rough handling, travel/shipping can affect the setup. This is especially so if being shipped through many zones and atmospheric differences. If you are unsure about the condition of any item, or need clarification, you are more than welcome to contact us to request more data or specific photos to satisfy any questions you might have. Our information is at the bottom of the listing in blue. You will receive item exactly as shown in the pictures. Please understand, this listing only contains what is described. Don’t assume it comes with something if not stated in the listing description. If you aren’t certain, send us a note thru eBay messaging system.Stand in photo not included.If an identifying mark, inclusion or defect is visible in the images it is considered disclosed to the buyer.Pay attention to the details, Ebay’s defaulted detail catalog is not always correct. Many times Ebay product catalog does not have the correct photo of the item we have for sale may look different. In addition, I have found many of Ebay defaulted catalogues have certain models, MPN, and other specs wrong from previous listers. Double check to see if it is accurate. Most times the buyer knows more than we do. Please ask if there is something specific you need to know.Purchase of the item represent agreement on the terms and conditions of this ebay listing.This listing is offered and sold as is. Uptown Pawn dba. UptownSalesUSA, a brick and mortar pawnshop located in the heart of the Twin Cities metro area. We are licensed and bonded by the city of Minneapolis and registered with Minnesota Secretary of State since 2002. Check out our feedback and buy with confidence.You can find contact information at the bottom of our Ebay Payment Policy tab in listing. If you have any questions or need to discuss more descriptions, special shipping arrangements, additional photos, or local pick up.61.2 82three, 300.1 ( Cryptic but I got faith you'll figure it out if necessary ) Uptown Pawn dba. UptownSalesUSA makes no express or implied warranties or representations regarding the condition or suitability of the goods and to the extent allowed by law, specifically disclaims any express or implied warranties, including but not limited to any warranty of merchantability or fitness for purpose.We do not offer a warranty on any merchandise: Ebay has a Square Trade program may work. We are not a distributor for any brand. Warranties on the items that I sell may or may not be valid on a non-retail purchase.Indemnity:Buyer shall, at no expense to the Seller, indemnify, defend and hold the Seller harmless against any and all losses, damages and expense (including punitive damages, multiple damages, attorney fees and other costs of defending any action) Seller may incur as a result of any claim made against the seller by any person, including without limitation, Buyer, it's successors, assigns, representatives, agents, employees, insurers, and customers, actually or allegedly arising out of the regarding the transportation, installation or use of the equipment sold hereunder by Seller or out of any products manufactured or sold by Buyer, including, without limitation, any claim which in whole or in part actually or allegedly arises out of (a) Seller's negligent or other wrongful act or omission, (b) danger or default in any equipment sold by Seller to Buyer, (c) infringement by Seller of any patent, copyright, or trade secret relating to any equipment sold by Seller to Buyer.", "ItemID": "192814906722", "EndTime": "2019-02-05T14:04:08.000Z", "StartTime": "2019-02-04T17:52:22.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1988-USA-Jackson-San-Dimas-Strat-RARE-Custom-Yellow-Hard-Case-/192814906722", "ListingType": "FixedPriceItem", "Location": "Minneapolis, Minnesota", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1928149067228080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/YTgAAOSwmrNcWHL9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/X3UAAOSw3GlcWHMF/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU4NlgxMDM3/z/7rQAAOSw7OdcWHOm/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/Z7AAAOSwRzZcWHP4/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/OQMAAOSwwkNcWHMS/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ4NVgxMTg2/z/45QAAOSw66JcWHNK/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQyOFgxMTg2/z/PGEAAOSw1rpcWHMn/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/2JoAAOSwptZcWHNe/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/E50AAOSw5AhcWHNs/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMTk5/z/IygAAOSwzEVcWHI~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/RygAAOSwJXNcWHOL/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/FrYAAOSw~TNcWHPu/$_57.JPG?set_id=8800005007"], "PostalCode": "55408", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "uptownsalesusa", "FeedbackRatingStar": "Red", "FeedbackScore": 3020, "PositiveFeedbackPercent": 99.5}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 975.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 975.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "0***v", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 755}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "1988 USA Jackson San Dimas Strat, RARE Custom Yellow with Hard Case ", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Yellow"]}, {"Name": "Brand", "Value": ["Jackson"]}, {"Name": "Model", "Value": ["San Dimas Strat"]}, {"Name": "Series", "Value": ["Custom"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Material", "Value": ["Custom Yellow"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Features", "Value": ["Seymour Duncan"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["1987-1989"]}, {"Name": "Product Line", "Value": ["Jackson San Dimas"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}, {"Name": "Soundboard Style", "Value": ["Flat Top"]}]}, "HitCount": 114, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1105760823", "StoreName": "Uptown Pawnstars"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "Excellent condition for a 30+ years old! Vintage estimated year 1987-89 based on serial number. If you examine closely you might find minor blemishes but nothing that affects the playability or function of the instrument. Case has signs of travel but still okay.  I take many detailed photos so you can make the fairest evaluation of the item's physical condition using your own skilled observation; independent of ours yet subjective, opinion. Make sure to zoom in due to some reflections can be misleading.Ebay only allows 12 photos...", "QuantitySoldByPickupInStore": 0, "SKU": "61303-1 MAS EXX", "NewBestOffer": false}