{"BestOfferEnabled": false, "Description": "Sterling Musicman SR50 Stingray 6 String Electric Guitar - Black w/Soft Gig Bag Click images to enlarge Description We Are Unlimited-Goods Sterling Musicman SR50 Stingray 6 String Electric Guitar - Black w/Soft Gig Bag​ The StingRay SR50 harkens back to the first, original Fender Music Man guitar design, now reimagined and updated by the Ernie Ball Music Man design team. It features 2 creamy Ernie Ball Music Man spec humbuckers, Vintage Tremolo, and an oversized 4 + 2 headstock with locking tuning machines. VINTAGE STYLING The StingRay SR50 harkens back to the first, original Fender Music Man guitar design, now reimagined and updated by the Ernie Ball Music Man design team. 22 frets, 2 creamy Ernie Ball Music Man spec humbuckers, Vintage Tremolo, and an oversized 4 + 2 headstock with locking tuning machines. Features Body Wood: African Mahogany Neck Wood: Hard Maple Fretboard Wood: Rosewood  Details Scale: 25.5” Nut Width: 42mm Neck Width,12th fret: 52mm Body Wood: African Mahogany Neck Wood: Hard Maple Fretboard Wood: Rosewood Tuning Machines: Locking Hardware: Chrome Neck Joint: 5 Bolt Frets: 22 Fretboard Radius: 12” Pickup Selector: 3 Way Pickups: 2 Ernie Ball Music Man Spec Pickups Bridge: Vintage Tremolo Country of Origin: China DOES NOT INCLUDE TREMOLO BAR Included In This Auction: Musicman SR50 Sterling Stingray 6 String Electric Guitar - Black Road Runner Soft Gig Bag Condition: Guitar is in excellent working and cosmetic condition with some minor scratching on the back and front as well as some minor scratching on the pick guard form previous use and storage. There is a spot on the inside of the case where the stitching hits the guitar head. See pictures for details. Payment We accept & prefer Paypal for all payments All sales are expected to be paid within 4 days otherwise an unpaid case will be opened. No exceptions to payment rules. Shipping We Will Combine Shipping On All Items You Purchase from us. Please wait for invoicing before paying to receive combined shipping. Continental US shipping is quoted in the auction. We no longer will sell or ship overseas or internationally. Shipping & handling is quoted flat rate first class or priority for the continental U.S. Hawaii, Alaska & Puerto Rico is 1.5x quoted price. Larger packages will be assessed according to the current shipping carrier prices. All items selling for over $250.00 will include signature confirmation. Please contact us for a quote on larger items. If you feel that our shipping & handling is too high---PLEASE do not bid. Handling charges are included in the shipping charges. If you see the package has been damaged in shipping, please return before opening!! Terms of Sale We describe each item the best we can. Many items we sell are previously used & will not include anything but the item as pictured. What you see in our photos is what you'll receive. All items are in working condition unless stated otherwise in this listing. We encourage questions to eliminate any misunderstandings. Our return policy is, if you are not satisfied with the product we will refund your purchase price & original shipping. If you are unhappy with your sale, please contact us & we will do our best to fix the problem. Returns are accepted within 30 days of receipt of item. Refunds are given as money back. Return shipping is the responsibility of the buyer. We strictly adhere to Ebay policies About Us Please read all of our terms & conditions carefully! We are Unlimited-Goods. This is our business & if you bid, please intend to buy. All products are described as close as possible as to condition. Many of our items are previously used & will show wear. We do not accept buy it now offers. PLEASE address all questions before bidding. You may contact us through Ebay messages with questions. We are open 10-6 EST Mon-Fri. & will respond to all questions within those times We will only respond to e-mail through Ebay! We take pride in our sales & will strive to make all sales smooth & effortless. We reserve the right to cancel the bid from suspicious or bad history bidders We reserve the right to end any auction early! This is a full time operation. We will answer questions during business hours only. 10-6 EST Monday-Friday If you are unhappy with your sale, please contact us & we will do our best to fix the problem. Returns are accepted within 7 days of receipt of item. Refunds are given as money back. Return shipping is the responsibility of the buyer. Contact Us All questions, problems or concerns should be addressed through eBay. We will respond to eBay Mail ONLY!!! Images sell! Get Supersized Images & Free Image HostingCreate your brand with Auctiva's Customizable Templates. THE simple solution for eBay sellers. Track Page Views WithAuctiva's FREE Counter", "ItemID": "382795464067", "EndTime": "2019-02-26T01:56:36.000Z", "StartTime": "2019-02-19T01:56:36.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Sterling-Musicman-SR50-Stingray-6-String-Electric-Guitar-Black-w-Soft-Gig-Bag-/382795464067", "ListingType": "Chinese", "Location": "Chadds Ford, Pennsylvania", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/3827954640678080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NzIwWDQ3OQ==/z/re0AAOSwW4hca2JW/$_1.JPG?set_id=880000500F"], "PostalCode": "19317", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "unlimited-goods", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 16159, "PositiveFeedbackPercent": 99.7, "TopRatedSeller": true}, "BidCount": 53, "ConvertedCurrentPrice": {"Value": 162.5, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 162.5, "CurrencyID": "USD"}, "HighBidder": {"UserID": "5***f", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 64}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Sterling Musicman SR50 Stingray 6 String Electric Guitar - Black w/Soft Gig Bag", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Sterling by Music Man"]}, {"Name": "MPN", "Value": ["SR50"]}]}, "HitCount": 603, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller"}, "MinimumToBid": {"Value": 165.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "TopRatedListing": true, "GlobalShipping": false, "ConditionDescription": "Guitar is in excellent working and cosmetic condition with some minor scratching on the back and front as well as some minor scratching on the pick guard form previous use and storage. There is a spot on the inside of the case where the stitching hits the guitar head. See pictures for details.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}