{"BestOfferEnabled": false, "Description": "Normal 0 false false false EN-US JA X-NONE For sale is one LTD WA200 Electric Guitar Green Camo. In good working condition with some cosmetic issues. There is some rusting on the pickups/pickup selector. The strings need to be replaced. There are some light scratches, scuffs, dings and discoloration present. Serial number: L0828182. Please take a good look at the pictures. If you have any questions, please feel free to ask! Please Read Before Bidding/Buying! If you have a question about the item, about payment or shipping that is not already answered below, please email us before bidding on the item. We are a business and will respond to messages within 48 hours. It can take up to 72 hours to get a response if a message is sent over the weekend. Shipping Information: We ship within 1 business day of receiving payment! We only ship to PayPal verified addresses and we do not ship to PO boxes. Please do not ask us to change the address after the order has been placed. This is for our protection and yours. For shipping outside of the continental USA, we only use eBay's Global Shipping Program. The item is shipped to KY and then sent to the rest of the world. International customers are responsible for all duties and taxes. Continue to check out in order to calculate costs for shipping the item to your country. Messages regarding eBay's Global Shipping Program should be directed at eBay EXCLUSIVELY. We offer Free Local Pickup! We ship via USPS. The shipping service is subject to change between First Class, Priority Mail, and Media Mail. The tracking number will be provided after shipment has gone out. We may also use FedEx on larger / heavier items. USPS Insurance Coverage & Signature Confirmation Costs: Insurance and signature confirmation fees are already added to the shipping price on items $200 and more. If you would like us to add shipping insurance on items less than $200, please message us before checking out or purchasing the item. We are now required to purchase Signature Confirmations on all items $250.00 or more. This means you will have to sign for your package. Value up to $50 is $1.65. $50.01 to $100 is $2.05. $100.01 to $200 is $2.45. $200.01 to $300 is $4.60. The price per additional $100 of insurance, valued over $300 up to $5,000, is $4.60 plus $0.90 per each $100 or fraction thereof. Payment Information: We accept PayPal only. Please contact us within 48 hours of item being purchased and let us know how and when you will be paying for the item if you have not paid for immediately. If payment has not been received in 4 DAYS, and we have not discussed payment on the item, we begin the dispute process. Feedback: We will leave feedback when feedback is received from buyer. We leave feedback several times a week. Please do not email us asking us to leave you feedback. Returns: We must hear of your intent to return the item within 30 days of the delivery of the item. A legitimate reason for return would be: 1. you received the wrong, 2. item not as described, 3. or the item arrived damaged in which case you need to inform us so that we can open a case with the shipping provider. If you are returning an item because you simply changed your mind or have buyers remorse that is not a legitimate reason for return and is subject to restocking fee and shipping charges both ways. You may not think that it will affect you to lie on the returns but it absolutely will, eBay will restrict or cancel your account if they discover you are abusing the policy. We report every return abuse case. Please make sure your being truthful! All items that do not fall in a legitimate reason for return, will be reported to eBay as Return Abuse! We will refund the buyer the initial price of the item (excluding the shipping cost) via PayPal once the item is received. No returns are available on items shipped outside of the USA. 79646-1 (sx) 11/20", "ItemID": "254065095232", "EndTime": "2019-01-24T00:49:09.000Z", "StartTime": "2019-01-11T16:23:13.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/LTD-WA200-Electric-Guitar-Green-Camo-Christmas-Gift-Idea-/254065095232", "ListingType": "FixedPriceItem", "Location": "Norman, Oklahoma", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2540650952328080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/Q-8AAOSwVMJb9E-J/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/x-sAAOSwcttb9E-j/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/gk4AAOSwAzxb9E-t/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/-pwAAOSwVH9b9E-2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/GXUAAOSwC~Bb9E~J/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/kIUAAOSw5cZb9E~V/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/bTAAAOSw-sVb9FAD/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/gvEAAOSwXitb9E07/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/6G4AAOSw1uVb9FAP/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/HU8AAOSwsqxb9FAY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/DxgAAOSwvhxb9FAi/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/cIYAAOSwF31b9E1M/$_57.JPG?set_id=880000500F"], "PostalCode": "73072", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "bargainquest1", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 10923, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 199.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 199.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "6***s", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1132}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "LTD WA200 Electric Guitar Green Camo Christmas Gift Idea", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["LTD"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Model", "Value": ["WA200"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Color", "Value": ["green camo"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}]}, "HitCount": 60, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=21588069", "StoreName": "bargainquest1"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "ConditionDescription": "In good working condition with some cosmetic issues.  There is some rusting. The strings need to be replaced. There are some light scratches, scuffs, dings and discoloration present.", "QuantitySoldByPickupInStore": 0, "SKU": "79646-1 (sx) 11/20", "NewBestOffer": false}