{"BestOfferEnabled": false, "Description": "--> Schecter Banshee-6 Extreme Electric Guitar (Black Cherry Burst) Used This item is slightly used and has been thoroughly checked out by our experts to make sure it is in perfect working condition. We then re-sealed it in its original packaging with all factory included accessories. This item is guaranteed to be in \"as new\" condition and has virtually no cosmetic imperfections. This item is covered with a one year warranty from Sam Ash. Schecter Banshee-6 Extreme is a double-cutaway shred machine that is ready to take you to the next level. Featuring a contoured mahogany body with a quilted maple top, the Banshee-6 Extreme delivers top shelf quality at a working musicians price. The bolt-on neck is constructed from maple, while a rosewood fingerboard is equipped with 24 extra-jumbo frets that will facilitate effortless string bending. Pearloid & Abalone Vector inlays complete the shredder vibe of this guitar.The Banshee-6 Extreme sports a pair of high output Schecter Diamond Single Coil pickups in the neck and middle positions. A powerful Schecter Diamond Plus humbucker in the bridge position will deliver scorching shredder tones. The control panel includes master volume controls and tone control with push/pull coil tapping for the bridge pickup and a 5-way pickup selector switch, giving you endless tonal possibilities.Rounding out the sleek, black chrome hardware is a set of Schecter tuners . At the other end, the Banshee-6 Extreme is outfitted with a Schecter Custom Hardtail bridge with a String Thru Body design that will help keep your tuning and withstand anything you can dish out. Case not included.Get your Schecter Banshee-6 Extreme Electric Guitar today at the guaranteed lowest price from Sam Ash Direct with our 45-day return and 60-day price protection policy. Shipping Information Your gear will ship out within 2 days of order confirmation. At this time we can not ship PO Boxes, APO and FPO locations. Industry Leading 45-Day Return Policy We stand by the products we sell, and we'll certainly stand by you as well! We truly appreciate your business, and we want you to be 100% happy with your purchase. However, we know that one of the drawbacks of internet shopping is that you can't try something before you buy it. That's where our money-back guarantee comes in. If you are not completely satisfied with an item, for any reason, you can return it within 45 days of the shipping date for a complete refund of the merchandise price.* Have a question about your order? A Sam Ash Customer Service specialist is available to help! Call 800-472-6274, Monday - Saturday, from 10:00AM - 6:00PM EST. Due to the complexity of international shipping, we are unable to accept any returns on international orders. Before making a purchase outside of the United States, please know that products sold by Sam Ash use the standard 120V/60Hz voltage standard. Sam Ash is not responsible for any damage caused by not adhering to the voltage requirements. *All returns must be within 45 days of the date the item was shipped. Please do not accept any shipment if the packaging appears damaged in any way. We strongly suggest that you check your order after receiving it to be sure that it is in proper working order. Returned items must be in resalable condition. Resalable Condition means that the product(s) is exactly in the same condition as you received it. All exchanges must be pre-paid, returned in original packing, complete with blank warranty cards, owner's manual and show no sign of wear or abuse. In the event that the product is not in the same condition as you received it you may be subject to a minimum 15% restocking fee, repair charge or disqualification. Shipping and handling charges are non-refundable. Please call our Customer Service department if you have any questions about returning an item. CDs, DVDs, video tapes, sheet music, books, strings, computer hardware/software, drum heads, harmonicas, mouthpieces, sound cards, microphones, raw speakers, studio furniture, blank CDs/Tapes or Special Orders are not covered by this return policy.", "ItemID": "183695817567", "EndTime": "2019-02-23T03:11:30.000Z", "StartTime": "2019-02-21T00:11:49.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Schecter-Banshee-6-Extreme-Electric-Guitar-Black-Cherry-Burst-Used-/183695817567", "ListingType": "FixedPriceItem", "Location": "Tampa, FL", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1836958175678080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MzcwWDUwMA==/z/6eIAAOSwHKpcbezH/$_1.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "samashdirect", "FeedbackRatingStar": "PurpleShooting", "FeedbackScore": 59073, "PositiveFeedbackPercent": 99.3, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 358.88, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 358.88, "CurrencyID": "USD"}, "HighBidder": {"UserID": "2***l", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 262}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Schecter Banshee-6 Extreme Electric Guitar (Black Cherry Burst) Used", "HitCount": 19, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1111655870", "StoreName": "Sam_Ash_Music_Direct"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "DiscountPriceInfo": {"OriginalRetailPrice": {"Value": 699.0, "CurrencyID": "USD"}, "PricingTreatment": "STP", "SoldOneBay": false, "SoldOffeBay": false}, "ExcludeShipToLocation": ["Alaska/Hawaii", "APO/FPO", "US Protectorates", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "ConditionDescription": "Like New", "QuantitySoldByPickupInStore": 0, "SKU": "S1991XXXX", "NewBestOffer": false}