{"BestOfferEnabled": false, "Description": "Up for sale, a 1967 Fender Coronado II in the original Lake Placid Blue custom color finish in excellent condition and in perfect working order. This guitar is one of the most elegant and visually stunning iterations of this classic Fender model, with a matching custom color headstock, early white pickguard, chrome plated vibrato unit, and aged white multi-ply binding. Weighing a mere 6lbs 10oz, this fully hollow instrument has a bright and clear acoustic voice that translates well through the pair of original DeArmond-made single coil pickups. Clear, warm, and articulate when plugged in, the pickups deliver a wide range of tones, from sinewy twang and sparkle in the bridge position, to more mellow and full-bodied tones at the neck. One of the hallmarks of any DeArmond pickup is their percussive clarity and string to string balance, and this Coronado really exemplifies those tonal qualities. Professionally setup here at Mike & Mike's Guitar Bar, this Coronado plays as well as the day it left the factory, with fresh 10-46 strings, solid intonation, and comfortable action.The one-piece maple neck has a slender C shaped profile with consistent depth as you travel up the fretboard, and the majority of the original gloss nitro lacquer still present, although there is light palm wear central to the profile down near the nut and along the fretboard edges. The Brazilian rosewood fretboard has white binding and pearl block inlays, with original frets that are practically perfect, showing just a touch of wear on the crowns of frets 1-3. A new nut has been installed, measuring 1 5/8\" in width, and on the headstock, the original \"F\" style tuning machines are present and still work as they should. The neck is very straight and plays effortlessly all the way to the last fret with no buzzing or dead spots. The truss rod nut is flush with the neck heel and has required little to no adjustment in the past 50 years.On the body, the chrome hardware is particularly clean, with sparingly little surface patina. This original bridge is the Mustang-style variant with chrome mounting cups, and the original vibrato unit is intact, actuating with the lightest touch and jumping back to the original pitch with ease. This is one of Fender's smoothest and most underrated vibratos, and it comes complete with the original extra long arm made exclusively for this model. In terms of date codes, the neck heel is dated to January of 1967, which is consistent with the serial number on the original \"F\" neck plate.Cosmetically, this guitar is a real stunner, and the Lake Placid Blue has aged appreciably, with a greening that really makes it stand out. The nitro lacquer finish is 100% original with zero touchup or overspray, showing faint vertical lacquer checking, and a few assorted small finish chips on the body as a whole, particularly around the floating bridge, and on the back lower bout edge near the rear strap button. There is light buckle rash central to the back as well, which only penetrates the finish in one tiny localized spot.This Coronado will satisfy collectors and serious players alike, and is a well kept custom color example.The original Victoria Luggage hardshell case with gold interior is included. The case retains its original latches and handle, and the gold foil Victoria Luggage badge is present outside the case pocket. Check out our shop \"Mike & Mike's Guitar Bar,\" and please let us know if we can answer any questions! Shipping in the continental USA will be $80, fully insured and shipped via FedEx Ground. Expedited shipping available for an additional fee at buyer's request. We will happily ship WORLDWIDE, but please contact us for an accurate international shipping quote before bidding or buying, as cost varies by buyer location. International orders will be declared as “merchandise,” and the value of merchandise will be declared as the amount paid. We cannot declare anything as a gift or for a lesser value. No exceptions! The customer is responsible for all taxes and duty, which may be collected upon delivery, as well as any additional charges involved with import. We have all necessary CITES paperwork in-hand to ship rosewood worldwide.We do our best to describe all items with honesty and accuracy, but to be sure, please contact us with any questions or concerns prior to bidding or buying. We require payment within 48 hours of auction end. In the unlikely event of a return, buyer pays all shipping costs. Your positive feedback and five star ratings are very important to us, and we appreciate your communication in resolving any issues!", "ItemID": "153289614084", "EndTime": "2019-02-23T09:08:06.000Z", "StartTime": "2018-12-04T08:50:13.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1967-Fender-Coronado-II-Vintage-Hollowbody-Guitar-Lake-Placid-Blue-w-ohc-/153289614084", "ListingType": "FixedPriceItem", "Location": "Seattle, Washington", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1532896140848080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTE3N1gxNjAw/z/HRIAAOSwsrlcBjwN/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjA0/z/-bsAAOSwLSZcBjwS/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjA4/z/jfkAAOSwsRVcBjwh/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/MAoAAOSw2hxcBjwc/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/4nEAAOSwjTtcBjwe/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/NQ8AAOSw-HRcBjwj/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/NbsAAOSwNphcBjwP/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE4NVgxNjAw/z/ryAAAOSwkelcBjwU/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/lpMAAOSwXHxcBjwW/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/gosAAOSwsGpcBjwa/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/1lUAAOSw8R9cBjwK/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/prUAAOSwCNlcBjwH/$_57.JPG?set_id=8800005007"], "PostalCode": "98117", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mmguitarbar", "FeedbackRatingStar": "Red", "FeedbackScore": 2613, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 3899.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 3899.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "s***o", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 340}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "1967 Fender Coronado II Vintage Hollowbody Guitar Lake Placid Blue w/ohc", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Lake Placid Blue"]}, {"Name": "Brand", "Value": ["Fender"]}, {"Name": "Model", "Value": ["Coronado II"]}, {"Name": "Body Type", "Value": ["Hollow"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["1967"]}]}, "HitCount": 1058, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=269063702", "StoreName": "Mike and Mikes Guitar Bar"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}