{"BestOfferEnabled": false, "Description": "All photos are of the actual item for sale. Used Item In fantastic condition. Very fine and hard to see surface scratches from playing. Case in excellent condition as well. PRS SE Custom 24 Limited Solidbody Electric Guitar / Case - Matteo Blue -1 of 21 - 7.6 lbs - S/N: R17054 Excellent Condition, 1 of 21 Exclusive These guitars were made exclusively for Spotlight Music in Colorado. Only 21 pieces in this color with Ebony Fretboard, Burled Ash Top, Fretboard Binding, and Burled Ash Headstock were produced. With binding on the headstock, neck, body, these features are unique to the PRS SE Custom 24 line and were only available to the aforementioned music store. This SE Custom 24 features a Burled Ash top, Mahogany back, wide thin Maple neck, Ebony fretboard with bird inlays, and a MannMade vibrato bridge. Its versatile sounds come from the owner installed, aftermarket Seymour Duncan pickups paired with a volume, push/pull tone control, and 3-way blade pickup selector. This gorgeous and exotic looking guitar has been taken care of like a child but actually played. They only made 21 of this special limited run...a rare guitar numbers wise. We're not 100% sure if the case is original to this guitar but it does look like a Gator GWE hard case made exclusively for the SE line. The original 85/15 S pickups were replaced with Seymour Duncan JB/Jazz pups and they are included. Specs Top Wood: Maple Top, w/ Burled Ash Veneer Back Wood: Mahogany Number of Frets: 24 Scale Length: 25\" Neck Wood: Maple, 3-Piece Fretboard Wood: Ebony Fretboard Inlays: Birds Neck Shape: Wide Thin Bridge: MannMade Floating Tremolo Tuners: PRS Designed Tuners Hardware Type: Nickle Treble Pickup: Seymour Duncan JB Bass Pickup: Seymour Duncan Jazz Fingerboard Binding: Creme Matching Burled Ash Headstock, w/Binding Includes Everything visible in the main photo Check out my other auction listings! and be sure to add me to your favorites list. CONTACT INFORMATION You can e-mail us with any questions you may have about an item. We are very easy to reach, and we are glad to help. Just click \"Ask a question\" in the questions and answers area below. Please note that we are not in the office after 5:00PM EST on weekdays, or all day Saturdays and Sundays. Questions asked over the weekend will be answered on the following business day. SHIPPING INFORMATION Items are shipped within one business day of payment. To avoid a lost or stolen item, your package may ship \"Signature Required.\" If you have special shipping instructions or would like your item shipped UPS instead of USPS or FedEx, please contact us before you make a purchase. We collect local sales tax here in Indiana. This applies to Indiana residents who we ship to, as well as non-Indiana residents who drive here for local pickups. We also collect sales tax in other states around the country. Please check eBay's tax information on the \"Shipping and payments\" tab above to see if we are collecting tax in your area. PLEASE NOTE Shipping quotes are estimates only. We use eBay’s shipping calculator, which provides estimated shipping charges on listings where “Free Shipping” is not offered. Ebay's FedEx calculator on the item page quotes eBay's discounted FedEx shipping rates, which we honor. At checkout, however, buyers in certain areas will see the calculator attempt to charge the full retail price. FedEx's full retail price is the price you pay if you were to walk into a FedEx retail location. The difference between eBay's discounted rate and this retail price can be as much as 40%. If you estimate shipping with a zip code that is different from the zip code registered to your User ID, eBay’s shipping calculator will make the adjustment at checkout. Additionally, FedEx charges a surcharge for delivery in certain rural areas of the country that does not, for some reason, show up in eBay’s estimate calculator; but it does at checkout (we wish we could control this, but we can’t — we have contacted eBay many times about this issue). FedEx does this based on the +4 extension of your primary 5-digit zip code. For example, eBay’s shipping calculator may quote you one price based on your primary 5-digit zip, and then figure out that your requested street address at checkout places you within the rural surcharge area, changing the shipping price to an alternate amount that was originally quoted. If there is a discrepancy in your shipping cost, please send us a screen shot of the quoted price to you on our item page and we can override the eBay checkout calculation to get you the cheapest rate. RETURN INFORMATION We want you to be completely happy with your purchase. If the item you receive is not as described or has been damaged in shipping, please contact us immediately. We will make every effort to promptly resolve any problem. Your satisfaction is our top priority. We are happy to offer free shipping on some of the items we offer. Please note that if you decide to return something where free shipping was offered, our shipping costs are non-refundable.", "ItemID": "372556201156", "EndTime": "2019-01-11T02:30:30.000Z", "StartTime": "2019-01-04T02:30:30.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/PRS-SE-Custom-24-Limited-Solidbody-Electric-Guitar-Case-Matteo-Blue-1-21-/372556201156", "ListingType": "Chinese", "Location": "Fort Wayne, Indiana", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/3725562011568080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTAyOFgxNjAw/z/hsIAAOSwnjZcLe37/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg1ODE=/z/hiAAAOSwfhlcLe39/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU5OVgxMDQ3/z/aOUAAOSwEGBcLe4A/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU5OVg2MjM=/z/jmoAAOSwzqtcLe4B/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMTc3/z/rDgAAOSwukZcLe4F/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5Mjg=/z/oRsAAOSwMg5cLe4H/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/Njg1WDE2MDA=/z/n2gAAOSwpTBcLe34/$_57.JPG?set_id=8800005007"], "PostalCode": "46818", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jeffsmusicgear", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 14336, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 18, "ConvertedCurrentPrice": {"Value": 841.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 841.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "r***o", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 63}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "PRS SE Custom 24 Limited Solidbody Electric Guitar / Case - Matteo Blue -1 of 21", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Matteo Blue"]}, {"Name": "Brand", "Value": ["PRS"]}, {"Name": "Model", "Value": ["SE Custom 24 MB, Spotlight Music"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Material", "Value": ["Mahogany/Burled Ash"]}, {"Name": "Features", "Value": ["MannMade vibrato"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["Korea, Republic of"]}]}, "HitCount": 722, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=36123540", "StoreName": "jeffsmusicgear"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 851.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "TopRatedListing": true, "GlobalShipping": false, "ConditionDescription": "In fantastic condition. Very fine and hard to see surface scratches from playing. Case in excellent condition as well. Please see the photos above; they are of the actual item for sale.", "QuantitySoldByPickupInStore": 0, "SKU": "ConsignItem", "NewBestOffer": false}