{"BestOfferEnabled": false, "Description": "Powered by Frooition Pro Shop Search 2016 Line 6 Variax Standard Limited Electric Guitar- Amethyst w/Gig Bag - S/S/S Click here to view full size. Full Size ImageClick to close full size. Item Description 2016 Line 6 Variax Standard Limited electric guitar in very good condition with light playwear on the pickguard. There are a few small dings around the edges and headstock. The protective plastic is still on the back covers. Cool Amethyst finish on the flame maple top and headstock with a black pickguard, pickup covers and chrome hardware. The guitar has a nice action and the thin profile maple neck has a great feel. The frets are in excellent condition. The three single coil pickups have good Strat tones and with the modeling features there's hardly anything this guitar can't do. Not only does the guitar emulate the tones of quite a few classic guitars it also has several alternate tuning presets. These were 20th Anniversary models made by Yamaha(hence the \"Y\" serial number) that had a flame Maple cap and custom color finishes. These were made in limited numbers with Limited Edition badging and numbering on the neckplate. The guitar is equipped with a tremolo bridge without the tremolo arm and the stock tuners have been upgraded to Steinberger locking gearless tuners for greater tuning stability. All electronics have been fully tested and are in excellent working condition. Includes nice Line 6 gig bag, battery and battery charger. The tremolo arm is missing and is not included. Serial Number: Y17080274 #153 Weight: 7 lbs. 1 oz OVERVIEW VARIAX LIMITED EDITION AMETHYST Limited Edition Variax Standard Guitar with Custom Amethyst Finish In celebration of their 20th anniversary, Line 6 introduced the Variax® Limited Edition Amethyst guitar. Featuring custom Amethyst finish with a black pickguard and black pickups, each guitar included a “Limited Edition” insignia and custom serialized number plate. Variax Limited Edition Amethyst combined incredible Variax HD technology, addictive playability and unmatched versatility with a striking new look that demands attention. Custom Amethyst finish with black pickguard and black pickups Small production run with \"Limited Edition\" badging and numbered neck plate Lightweight alder body with Graph Tech nut and proprietary tremolo bridge Unmatched range of guitar sounds and alternate tunings via Variax HD modeling With an extremely limited edition production run, this beautiful instrument won’t last long. Get this Variax Limited Edition Amethyst today before it's gone! Line 6 Variax technology and Yamaha craftsmanship. Variax Standard combines legendary Line 6 innovation with renowned Yamaha craftsmanship, forming a versatile modern instrument that shatters the limitations of traditional guitars. Addictively playable with classic looks, Variax Standard gives you exceptional handcrafted quality plus incredible Variax HD technology that puts it in a class of its own. Inspire your playing with a collection of the world's most coveted vintage electrics, classic acoustics and exotic instruments. Switch up your tunings on the fly. You can even go beyond what's physically possible and create the instrument of your dreams with Variax Workbench HD virtual custom shop software.Line 6 innovation meets Yamaha craftsmanshipAccess an entire collection of electric, acoustic and exotic guitarsSwitch between alternate tunings with the turn of a knobCreate any guitar imaginable with Workbench HD softwareLightweight alder body with a flame maple cap and fast maple neck and custom single-coil pickupsUnflinching qualityThanks to the remarkable craftsmen at Yamaha, Variax Standard delivers the rock-solid build youd expect from a high-quality guitar. The lightweight alder S-type body, one-piece thin-finished maple neck, and proprietary tremolo bridge deliver total comfort and playability, while the custom-wound pickups serve up loads of rich tone. Add in our proprietary Variax HD technology, and you get a guitar that goes above and beyond the call of duty.Incredible tone, total versatilityWith the Variax family of guitars, creating your own unique sound has never been easier. Variax HD technology delivers a wide variety of classic guitar models each with exceptional detail, feel and response. Choose from an amazing collection of vintage electrics. Or inspire your playing with rare acoustics and eclectic instruments. You can even layer your modeled sounds with the magnetic pickups. You can also access alternate tunings including Open G, DADGAD, Drop D, or any other custom tuning with the turn of a knob.Create any guitar you can imagineBecome a virtual luthier with the free Variax Workbench HD software. You get complete control over every element of your Variax tone so you can build the guitar of your dreams. Mix and match a wide range of body styles and pickup models to create your own unique instrument. The software takes you far beyond what's possible in the physical realm so you can build virtually any guitar imaginable. FEATURES Handcrafted guitar with lightweight alder body, Flame Maple cap, Limited Edition finish and thin-finish maple neck Custom-designed alnico V single-coil magnetic pickups with rich, punchy sound Custom tremolo bridge with Graph Tech nut and string trees for added tuning stability Tightly integrated Variax HD modeling engine delivers vintage instruments with incredible detail A large collection of electric, acoustic and eclectic guitars 11 alternate tuning modes plus user-definable tunings Imagine doing it all with just one axe. About Us Payment Shipping Terms Returns About UsWe offer a large selection of quality pre-owned musical instruments and equipment from the industries finest manufactures including Akai, Ampeg, Boss, Denon, Digidesign, DigiTech, Epiphone, Fender, Gibson, Gretsch, Guild, Ibanez, Korg, Lexicon, Line 6, Mackie, Mesa Boogie, Marshall, Martin, MusicMan, MXR, Neumann, Peavey, Pioneer, PRS, Roland, Shure, Tascam, Taylor, TC Electronic and Yamaha. New gear arrives daily so check our store often. Lighthouse Sound, Inc. is proud to be an authorized dealer of the following brands of guitar effects pedals, pedal boards, amplifiers and accessories: Bearfoot FX, Bigsby, Cooper Stands, Dunlop, Earthquaker Devices, Ernie Ball, EVH, Fender Accessories, Keeley Electronics, Gretsch Accessories, Ken Smith Strings, Lava Cable, Martin Accessories, Mojo Hand FX, RotoSound, SnaKe Oil Strings, Snark Tuners, Suhr Guitars, Amps, Pedals and Pickups, Voodoo Lab and Wampler Pedals About Us Payment Shipping Terms Returns PaymentWe accept PayPal payments. All major Credit Cards are accepted through PayPal including Master Card, Visa, American Express and Discover. About Us Payment Shipping Terms Returns ShippingLighthouse Sound specializes in prompt, safe shipping. We take great care packaging every item to ensure safe shipment to you. We get your gear to you fast, most orders ship within 1 business day of payment clearance. Tracking information is uploaded to eBay and can be viewed from your eBay account. International customers are responsible for any duties, taxes, brokerage or other fees. Please check with your country's customs office to determine what these additional costs will be. These fees vary from country to country and we have no way to calculate them. About Us Payment Shipping Terms Returns TermsSales Tax - 7 % Ohio Sales Tax will be added to the total amount for all purchases delivered to Ohio. We take pride in our customer service and your satisfaction is very important to us. In the rare event that you have a problem with your item please contact us and we'll be happy to help. While all care is taken, any errors, omissions or variations in the item details are unintentional. About Us Payment Shipping Terms Returns ReturnsWe offer a 14 day return policy. Items must be returned to us within 14 days of the original delivery date. We ask that you please return the product in the original product packaging along with all included materials (manual, warranty card, all accessories) and in the original condition that it was received. Buyer is responsible for return shipping and insurance cost. Refunds will be issued upon return of the item less the original shipping charge and a 15% restocking fee will apply. Helpful Links More Items! This listing is currently undergoing maintenance, we apologize for any inconvenience caused. Powered by SixBit's eCommerce Solution", "ItemID": "233047741060", "EndTime": "2019-01-09T19:34:32.000Z", "StartTime": "2018-12-15T04:17:15.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2016-Line-6-Variax-Standard-Limited-Electric-Guitar-Amethyst-w-Gig-Bag-S-S-S-/233047741060", "ListingType": "FixedPriceItem", "Location": "Salem, Ohio", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2330477410608080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/pgcAAOSwz05cFCO6/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/hLsAAOSw0vJcFCO9/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/GqwAAOSwE~1cFCO~/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/AVsAAOSwEfVcFCPC/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/HBQAAOSwEUdcFCPF/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/xssAAOSw6KxcFCPH/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/OroAAOSwZKJcFCPK/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/xbsAAOSwNphcFCPN/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/ohcAAOSw84ZcFCPT/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/f9QAAOSwI9FcFCPQ/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/bb4AAOSwHGxcFCPY/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/FAQAAOSw~slcFCPV/$_57.JPG?set_id=880000500F"], "PostalCode": "44460", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "lighthouse_sound", "FeedbackRatingStar": "TurquoiseShooting", "FeedbackScore": 33092, "PositiveFeedbackPercent": 99.6, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 999.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 999.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "4***o", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 364}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "CA", "GB", "DK", "RO", "SK", "BG", "CZ", "FI", "HU", "LV", "LT", "MT", "EE", "AU", "GR", "PT", "CY", "SI", "JP", "CN", "SE", "KR", "ID", "TW", "TH", "BE", "FR", "HK", "IE", "NL", "PL", "ES", "IT", "DE", "AT", "BS", "IL", "MX", "NZ", "SG", "CH", "NO", "SA", "UA", "AE", "QA", "KW", "BH", "HR", "MY", "CL", "CO", "CR", "PA", "TT", "GT", "HN", "JM", "BB", "BD", "BM", "BN", "BO", "EG", "GF", "GG", "GI", "GP", "IS", "JE", "JO", "KH", "KY", "LI", "LK", "LU", "MC", "MO", "MQ", "MV", "NI", "OM", "PK", "PY", "RE"], "Site": "US", "TimeLeft": "PT0S", "Title": "2016 Line 6 Variax Standard Limited Electric Guitar- Amethyst w/Gig Bag - S/S/S", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Line 6"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Model", "Value": ["Variax Standard Limited"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Color", "Value": ["Amethyst"]}, {"Name": "Model Year", "Value": ["2016"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["Indonesia"]}, {"Name": "Modifications", "Value": ["Tuners"]}]}, "HitCount": 144, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=22579709", "StoreName": "LHSound"}, "Country": "US", "ReturnPolicy": {"Refund": "Money back or replacement (buyer's choice)", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": true, "ConditionDescription": "2016 Line 6 Variax Standard Limited electric guitar in very good condition with light playwear on the pickguard. There are a few small dings around the edges and headstock. The protective plastic is still on the back covers. Cool Amethyst finish on the flame maple top and headstock with a black pickguard, pickup covers  and chrome hardware. The guitar has a nice action and the thin profile maple neck has a great feel. The frets are in excellent condition. The three single coil pickups have good Strat tones and with the modeling features there's hardly anything this guitar can't do. Not only does the guitar emulate the tones of quite a few classic guitars it also has several alternate tuning presets. These were 20th Anniversary models made by Yamaha(hence the \"Y\" serial number) that had a flame Maple cap and custom color finishes. These were made in limited numbers with Limited Edition badging and numbering on the neckplate. The guitar is equipped with a tremolo bridge without the tremo", "QuantitySoldByPickupInStore": 0, "SKU": "43842", "NewBestOffer": false}