{"BestOfferEnabled": true, "Description": "Up for offering is an Epiphone Les Paul Special 4 String Electric Bass Guitar Flame Maple Trans Black WE LOVE OUR CUSTOMERS and OUR CUSTOMERS LOVE US Attention: If you are not pleased with an item check with us before you leave NEGATIVE FEEDBACK or STARS. We aim to please and if there is a problem we will make it right. You want fast shipping???? You get it here. Check what buyers say about our shipping!!! Hey, If you don't like our prices Change them. Make US an Offer!!! Description We are OFFERING an Epiphone Les Paul Special 4 String Electric Bass Guitar Flame Maple Trans Black This bass is in good condition. The action is low. All electronics work and it has great sound. There are some scratches as shown. There is one scratch about 3 inches long on the front. There is also one ding about the size of a pin head on the front. The rest are minor scratches. This bass has not been abused in our humble opinion. The bass is transparent black and shows the Flame Maple stripes in the light. This is a very attractive guitar. Features: The Les Paul Special Bass gives bass players the incredible sustain that Les Paul guitar players have been enjoying since the early '50s. And what could be cooler than a bass with the classic design of a Les Paul? Epiphone takes bass players seriously and the Les Paul Special Bass brings the classic tone of a Les Paul to bass players everywhere in a stunningly cool trans black gloss finish. The Les Paul Special Bass features a solid Mah body for the terrific sustain and feel that Les Paul players count on night after night. The hand set glued in Mah neck has a 34\" scale with 1.65\" nut. The classic Rosewood fretboard has dot inlays and the head stock features premium Epiphone open gear machine heads and Les Paul's signature on the headstock and truss-rod cover. The power of Les Paul Special Bass comes from 2 strategically placed humbuckers with a flush mounted fully adjustable bridge for rock steady intonation. Please check the pictures loaded to help answer your questions. Thank you for considering our items and visiting our site. We look forward to serving you. Please check out our other items. Remember this if you choose USPS Parcel Select as your shipping method. Although it is less expensive it might be slow and less reliable especially around holidays. If you don't like our price make an offer. We might just take it. This note is for our used items: Although this item is in good condition it is used so do not expect a new item or one in mint condition since the words \"mint\" \"good\" and \"great\" describing an items condition can mean many things to many people. If your item is a used guitar or horn please expect that it might need some type of adjustment or setup to get it to your expected condition. Don't Hesitate, WE TAKE OFFERS. Please check out our other items. You get Lightning Fast Shipping! Check Our Feedback!!!", "ItemID": "253993479839", "EndTime": "2019-01-22T17:02:24.000Z", "StartTime": "2018-11-21T22:20:58.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Epiphone-Les-Paul-Special-4-String-Electric-Bass-Guitar-Flame-Maple-Trans-Black-/253993479839", "ListingType": "FixedPriceItem", "Location": "Shreveport, Louisiana", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2539934798398080_2.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg1Mzg=/z/EM0AAOSwj5BcLUk4/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg1Mzg=/z/p~oAAOSwRF1b9dRc/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgzNjQ=/z/DCoAAOSwwSJb9dRd/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODAwWDYwMg==/z/jccAAOSwrHtcLUk5/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODAwWDU4OA==/z/o-4AAOSwylBb9dRh/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODAwWDgyNA==/z/JDQAAOSwIddb9dRj/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODAwWDc3NQ==/z/-IcAAOSwIkNb9dRk/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODAwWDUwNw==/z/sPoAAOSwqOFb9dRm/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODAwWDU0OQ==/z/vSAAAOSwC45b9dRn/$_57.JPG?set_id=8800005007"], "PostalCode": "71105", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jorbid", "FeedbackRatingStar": "Red", "FeedbackScore": 4578, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 249.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 249.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "2***1", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 5}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Epiphone Les Paul Special 4 String Electric Bass Guitar Flame Maple Trans Black", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "Model", "Value": ["Les Paul Special"]}, {"Name": "Body Type", "Value": ["Solid"]}]}, "HitCount": 507, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=13524218", "StoreName": "We Take Offers"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "In good working condition with some minor flaws as described.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}