{"BestOfferEnabled": true, "Description": "Classic Jazzmaster Style with Modern UpgradesThough never quite as universal as the Stratocaster or Telecaster, the Jazzmaster is an absolute classic Fender in its own right. The Fender Classic Player Jazzmaster Special is a vintage-styled version in the mold of the mid-60s classics complete with hallmark tone switches, soapbar pickups, and floating tremolo system. For the countless players out there who have always longed for a classic Jazzmaster of their own, the Fender Classic Player Jazzmaster Special is a fantastic choice. Classic Jazzmaster ElectronicsApart from its unique body shape, the original Jazzmaster was distinguished by the use of two versatile soapbar pickups and an innovative tone-circuit switch. The Jazzmaster pickup was designed for tonal versatility and clarity using a wider coil than most Fender pickups and magnetic pole-pieces. Though single-coils, Fender Jazzmaster pickups are known for producing a rich, warm tonal character comparable to humbuckers. Ironically, the Jazzmaster was never widely adopted by jazz players, but the distinct tonal flavor given by the pickups and rhythm and lead circuits has made the Jazzmaster a mainstay in genres like surf-rock, grunge, and experimental-rock. Revolutionary Floating TremoloJazzmasters are also known for their distinctive floating tremolo system. This landmark Jazzmaster innovation puts a full range of tremolo tools right in your hand whether elongating a bend at the end of a solo or adding some wavy texture to your strumming pattern. Even with the wild floating tremolo, the Classic Player Jazzmaster Special does a great job staying in-tune thanks largely to the sturdy adjusto-matic bridge. Pedalboard's Best FriendThe Jazzmaster has a reputation as one of the most pedal-friendly guitars ever made, and the Classic Player Jazzmaster Special is no exception. The versatile tone switching tools along with the responsive soapbar pickups strike an ideal configuration to be highlighted by any number of diverse stompboxes. Especially when run through a Fender tube amp, the Classic Player Jazzmaster combines with delay, reverb, fuzz and other pedals as if they are direct extensions of the guitar itself. The Jazzmaster's pedal-friendliness is one of the main reasons noise-rock pioneers like Dinosaur Jr's J Mascis and Sonic Youth's Lee Ranaldo can be counted as, well...Jazzmaster masters. Vintage Fender Style and Feel To round out the timeless appeal of the Classic Players Jazzmaster Special, Fender has outfitted this axe with a full set of stunning vintage features. The tortoise-shell pickguard set against the classic finishes makes a striking appearance as does the vintage headstock and tuners. The neck is made from maple in a comfortable C-shape profile, and capped with a rosewood fingerboard. Combined with the ergonomic back contour on the body, the Classic Players Jazzmaster Special is the kind of guitar that just begs to be played well past your bedtime. Features: - Vintage Jazzmaster design and style - Updated Jazzmaster soapbar pickups - Floating tremolo system with sturdy ajusto-matic bridge - Comfortable C-shaped profile on maple neck - Three-way pickup selector and rhythm/lead tone circuit switch", "ItemID": "312424517968", "EndTime": "2019-01-14T12:10:51.000Z", "StartTime": "2019-01-11T18:40:16.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fender-Classic-Player-Jazzmaster-Special-Pau-Ferro-Fingerboard-fender-case-/312424517968", "ListingType": "FixedPriceItem", "Location": "Pembroke, Georgia", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/3124245179688080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/N7AAAOSwG25cMmzS/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/wXsAAOSwm5xcMmwY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/U0oAAOSwD1pcMmvk/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/6ecAAOSwIqxcMmvF/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/1W8AAOSwy2pcMmuf/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/0G4AAOSwfMlcMmvU/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/6~gAAOSwO7dcMmxP/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/oAgAAOSwWAhcMmxk/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/7YgAAOSwTxJcMmx3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/0IsAAOSwQXlcMmys/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/y9cAAOSws0pcMm0N/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/G8YAAOSwXc9cMm3m/$_57.JPG?set_id=8800005007"], "PostalCode": "31321", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "guitarfinderdealmaker", "FeedbackRatingStar": "Purple", "FeedbackScore": 852, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 599.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 599.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "i***z", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 121}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Fender Classic Player Jazzmaster Special Pau Ferro Fingerboard  with fender case", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "MPN", "Value": ["0141603306"]}, {"Name": "Style 1", "Value": ["Black"]}]}, "HitCount": 157, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "14 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "great condition I would say excellent but it has 1 one inch scratch and a couple of small nickshard to see but you can feel on the curve of the body tried to show in picks. comes with case and tremolo", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}