{"BestOfferEnabled": true, "Description": "2018 Musicman Cutlass BFR Prototype (One of a Kind) w/ OHSC 2018 Musicman Cutlass BFR Prototype (One of a Kind) w/ OHSC This example is probably one of the rarest EBMM Cutlass' that you will ever see. We purchased this guitar directly from EBMM and as the story was told to us, when Music Man decided to offer a BFR version of the cutlass they made three different prototypes. One of them ended up being the model that went into production and another was this guitar. This is the only cutlass with a 2 Tone Sunburst and it is also the only one to have pearl block fretboard markers. This guitar is a stunner in person and it is a total one off that will not be mass produced. It is in mint condition and it includes its original hardshell case.  Born of tradition, class, and decades of refining a tried and true design, the Music Man Cutlass guitar expertly combines vintage sounds with modern playability and craftsmanship. The triple single coil pickup configuration will sound very familiar to fans of one of Leo's initial guitar builds. A snappy and trebly top end, paired with a resonant and punchy bottom help this guitar sit in a mix exactly where it needs to. The best part about this is that you can solo whichever single coil pickup you choose to and you never have to worry about that annoying hum. But make no mistake about it, unlike many \"silent single coil\" pickups out there which are really either 2 coils stacked on each other or 2 coils side by side (ultimately making them very tiny humbuckers, not really single coils) these are true single coils and sound that way. The silent circuit kills the 60cycle hum we all hate so much after the sound has left the pickups. The pickups are genuine single coils and they sound that way!  Ryan Fowler's Guitar Experience is one of Maryland's premier brick and mortar guitar shops. We specialize in unique and hard to find guitars, basses, amplifiers and effect pedals. Please message us with any questions. We will respond to most questions within 24 hours or less! We are an authorized dealer for a number of brands including Paul Reed Smith, Nash, Suhr, Guild, Ibanez, Reverend, East Amplification, Vox, Headrush, Catalinbread, MXR, Electro Harmonix, JHS Pedals, Korg, Earthquaker Devices, Walrus Audio, Strymon, Seagull, Emerson Custom, Mono Bags, One Control, Cordoba, SKB Cases, Alto Professional, Dunlop, Ernie Ball and many, many more! Listing and template services provided by inkFrog", "ItemID": "273677722631", "EndTime": "2019-02-05T04:33:13.000Z", "StartTime": "2019-01-29T20:56:18.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2018-Musicman-Cutlass-BFR-Prototype-One-Kind-w-OHSC-/273677722631", "ListingType": "FixedPriceItem", "Location": "Glen Burnie, Maryland", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2736777226318080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTI4MFgxMDIz/z/uQ4AAOSwWrxcUL3v/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTI4MFgxMDI0/z/E1oAAOSwf95cUL3v/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTI4MFgxMDI0/z/ZKUAAOSwpaVcUL3v/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTI4MFgxMDI0/z/XtEAAOSwyshcUL3v/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTI4MFgxMDI0/z/G5kAAOSwXepcUL3v/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTI4MFgxMDI0/z/z7kAAOSw22pcUL3w/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTI4MFgxMDI0/z/5pAAAOSw411cUL3w/$_12.JPG?set_id=880000500F"], "PostalCode": "21061", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "nbguitar", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 438, "PositiveFeedbackPercent": 99.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 2199.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2199.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "8***8", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 160}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2018 Musicman Cutlass BFR Prototype (One of a Kind) w/ OHSC", "ItemSpecifics": {"NameValueList": [{"Name": "UPC", "Value": ["Does not apply"]}]}, "HitCount": 13, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=64792978", "StoreName": "Ryans Guitar Experience"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "SKU": "EBMMCUT", "NewBestOffer": false}