{"BestOfferEnabled": true, "Description": "Powered by Frooition Pro Shop Search 2005 Fender Stevie Ray Vaughan Stratocaster Electric Guitar Sunburst SRV w/Case Click here to view full size. Full Size ImageClick to close full size. Item Description 2006 Fender Stevie Ray Vaughan Stratocaster in excellent condition with little to no playwear. This guitar has been babied. Beautiful 3-tone sunburst finish on the Alder body with a black engraved SRV pickguard and gold hardware. The guitar has a great action and the special deep oval shaped maple neck with a 12\" radius Pao Ferro fretboard with gorgeous grain patterns, feels great. The Dunlop 6105 jumbo frets are in excellent condition. The Fender Texas Special single-coil pickups have a great SRV tone with good output. The guitar is equipped with a left handed vintage style tremolo and vintage style tuners. Looks, plays and sounds great. Huge fat tone! Includes Fender hard shell case, tremolo arm and all the hang tags. Serial number SZ6004077 Weight 7 lbs 12 oz. The Stevie Ray Vaughan Signature model respectfully replicates Stevie's favorite guitar. Pure Texas blues - Stevie style! Unique features include a special \"oval\" neck shape, Pao Ferro fingerboard, 3 Fender Texas Special single-coil pickups and a gold-plated vintage hardware with left-handed tremolo. Key Features: Body: AlderNeck: MapleFingerboard: Pao Ferro (12 in. Radius/305 mm)Scale Length: 25.5 in. (648 mm)No. of Frets: 21 (Dunlop 6105 Jumbo Frets)Width @ Nut: 1.650 in. (42 mm)Machine Heads: Gold-plated Fender/Gotoh vintage tuning machinesPickups: 3-Texas special single coilsPickup Switching: 5-Position BladeControls: Master Volume, Tone (Neck), Tone (Middle)Pickguard: 3-Ply Black (B/W/B)Bridge: Gold-plated, left-handed \"Original\" vintage tremoloUnique Features: Deep Oval Shape Neck, gold-plated vintage hardware About Us Payment Shipping Terms Returns About UsWe offer a large selection of quality pre-owned musical instruments and equipment from the industries finest manufactures including Akai, Ampeg, Boss, Denon, Digidesign, DigiTech, Epiphone, Fender, Gibson, Gretsch, Guild, Ibanez, Korg, Lexicon, Line 6, Mackie, Mesa Boogie, Marshall, Martin, MusicMan, MXR, Neumann, Peavey, Pioneer, PRS, Roland, Shure, Tascam, Taylor, TC Electronic and Yamaha. New gear arrives daily so check our store often. Lighthouse Sound, Inc. is proud to be an authorized dealer of the following brands of guitar effects pedals, pedal boards, amplifiers and accessories: Bearfoot FX, Bigsby, Cooper Stands, Dunlop, Earthquaker Devices, Ernie Ball, EVH, Fender Accessories, Keeley Electronics, Gretsch Accessories, Ken Smith Strings, Lava Cable, Martin Accessories, Mojo Hand FX, RotoSound, SnaKe Oil Strings, Snark Tuners, Suhr Guitars, Amps, Pedals and Pickups, Voodoo Lab and Wampler Pedals About Us Payment Shipping Terms Returns PaymentWe accept PayPal payments. All major Credit Cards are accepted through PayPal including Master Card, Visa, American Express and Discover. About Us Payment Shipping Terms Returns ShippingLighthouse Sound specializes in prompt, safe shipping. We take great care packaging every item to ensure safe shipment to you. We get your gear to you fast, most orders ship within 1 business day of payment clearance. Tracking information is uploaded to eBay and can be viewed from your eBay account. International customers are responsible for any duties, taxes, brokerage or other fees. Please check with your country's customs office to determine what these additional costs will be. These fees vary from country to country and we have no way to calculate them. About Us Payment Shipping Terms Returns TermsSales Tax - 7 % Ohio Sales Tax will be added to the total amount for all purchases delivered to Ohio. We take pride in our customer service and your satisfaction is very important to us. In the rare event that you have a problem with your item please contact us and we'll be happy to help. While all care is taken, any errors, omissions or variations in the item details are unintentional. About Us Payment Shipping Terms Returns ReturnsWe offer a 14 day return policy. Items must be returned to us within 14 days of the original delivery date. We ask that you please return the product in the original product packaging along with all included materials (manual, warranty card, all accessories) and in the original condition that it was received. Buyer is responsible for return shipping and insurance cost. Refunds will be issued upon return of the item less the original shipping charge and a 15% restocking fee will apply. Helpful Links More Items! This listing is currently undergoing maintenance, we apologize for any inconvenience caused. Powered by SixBit's eCommerce Solution", "ItemID": "233117014806", "EndTime": "2019-02-19T02:02:52.000Z", "StartTime": "2019-02-01T03:30:00.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2005-Fender-Stevie-Ray-Vaughan-Stratocaster-Electric-Guitar-Sunburst-SRV-w-Case-/233117014806", "ListingType": "FixedPriceItem", "Location": "Salem, Ohio", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2331170148068080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/XwUAAOSwTEZcS3yy/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/6IwAAOSw27lcS3y2/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDU5/z/Dg8AAOSwUWtcS3y4/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDU5/z/y74AAOSwvDpcS3y7/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/75QAAOSwuNNcS3y-/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/748AAOSwK9ZcS3zB/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2MFgxNjAw/z/QJMAAOSwMOVcS3zE/$_57.JPG?set_id=880000500F"], "PostalCode": "44460", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "lighthouse_sound", "FeedbackRatingStar": "TurquoiseShooting", "FeedbackScore": 33108, "PositiveFeedbackPercent": 99.6, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1299.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1299.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "r***c", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1465}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "CA", "GB", "DK", "RO", "SK", "BG", "CZ", "FI", "HU", "LV", "LT", "MT", "EE", "AU", "GR", "PT", "CY", "SI", "JP", "CN", "SE", "KR", "ID", "TW", "TH", "BE", "FR", "HK", "IE", "NL", "PL", "ES", "IT", "DE", "AT", "BS", "IL", "MX", "NZ", "SG", "CH", "NO", "SA", "UA", "AE", "QA", "KW", "BH", "HR", "MY", "CO", "PA", "JM", "BB", "BD", "BM", "BN", "BO", "EG", "GF", "GG", "GI", "GP", "IS", "JE", "JO", "KH", "KY", "LI", "LK", "LU", "MC", "MO", "MQ", "MV", "NI", "OM", "PK", "PY", "RE"], "Site": "US", "TimeLeft": "PT0S", "Title": "2005 Fender Stevie Ray Vaughan Stratocaster Electric Guitar Sunburst SRV w/Case", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Model", "Value": ["SRV Stratocaster"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Color", "Value": ["3-Color Sunburst"]}, {"Name": "Model, Series", "Value": ["Stevie Ray Vaughan"]}, {"Name": "Fender Styles", "Value": ["Stratocaster"]}, {"Name": "Hand", "Value": ["Right"]}, {"Name": "Instrument", "Value": ["Electric"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}]}, "HitCount": 262, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=22579709", "StoreName": "LHSound"}, "Country": "US", "ReturnPolicy": {"Refund": "Money back or replacement (buyer's choice)", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": true, "ConditionDescription": "2006 Fender Stevie Ray Vaughan Stratocaster in excellent condition with little to no playwear. This guitar has been babied. Beautiful 3-tone sunburst finish on the Alder body with a black engraved SRV pickguard and gold hardware. The guitar has a great action and the special deep oval shaped maple neck with a 12\" radius Pao Ferro fretboard with gorgeous grain patterns, feels great. The Dunlop 6105 jumbo frets are in excellent condition. The Fender Texas Special single-coil pickups have a great SRV tone with good output. The guitar is equipped with a left handed vintage style tremolo and vintage style tuners. Looks, plays and sounds great. Huge fat tone! \n\nIncludes Fender hard shell case, tremolo arm and all the hang tags. \n\nSerial number SZ6004077 \n\nWeight     7 lbs       12 oz.", "QuantitySoldByPickupInStore": 0, "SKU": "NO SKU BA14", "NewBestOffer": false}