{"BestOfferEnabled": false, "Description": "MIJ, made in japan, Gibson, Lespaul, White, SG, Höfner, Duesenberg, Ibanez, ATELIER Z, ARIA, ESP, Caparison, Killer, COMBAT GUITARS, GUYATONE, Greco, Sugi Guitars, TEISCO, DEVISERA, Nil, Bacchus, VANZANDT, Fernandes, Fender Japan, Fujigen, MOON GUITARS, momose, Yairi Guitar, YAMAHA, TOKAI, Zemaitis, VOX, B, C, Rich, Epiphone, Gibson, Gretsch, Suhr, Schecter, Charvel, Jackson, Dean, Tom Anderson, Fender, Paul Reed Smith, Melancon, Mosrite, Rickenbacker, Robert Benedetto, Washburn, Ibanez, kramer, EDWARDS, Burny, Grassroots, 1985 Greco SS63-55 Deep joint / All Original The Mint Collection JUNKMade in Japan Down from here, Photo is dent and scratches etc.. About scratches that are hard to see. To make it easy to understand the condition of the scratches, I lighted the light strongly. 1985 Greco SS63-55 Deep joint / All Original The Mint Collection JUNKMade in Japan Body Mahogany. Neck Mahogany. Deep joint. Frets 22F. Scale 24.75inch (628mm) Gibson Scale. Nut Width About 1.69 inch (43mm). Pickup SCREAMIN x 2. Control 2 Volume, 2 Tone, 3-Way PU Toggle switch. Bridge Tune O Machic. Stop Tailpiece. Weight About 7.25 Pound ( 3.29 Kg ). This is Used Guitar. There is a crack in the joint between the neck and the body. There are scratches and dents. I was shooting a lot of photos. Please confirm with a photograph. I will display this beautiful Greco as a JUNK. That's really disappointing. The reason is the crack of the joint between the neck and the body. It is not broken, but I think it is a deep crack. Currently, you can normal playing the guitar. However, I judged that repair is necessary. State is All Original. The pickups has been highly evaluated globally \"SCREAMIN\" is installed. Connect to the amplifier, the output sound is comfortable. The neck and the body joint is deep. And, I think the body is 1 piece mahogany. Please look at the picture below. I could not find joint part. If the judgment it was wrong of me, I'm sorry. For you to play comfortably, I recommend to repair. Currently, although normal playing is possible, I think that it is not comfortable. Therefore, I start an auction from $ 10. About guitar play, Current state, the space between the strings and the frets is wide. The Pickups is original installed SCREAMIN. This SCREAMIN Pickup is excellence. And worldwide assessment is high. I feel the good Over drive and Distortion sound. The clean sound is also wonderful. It is cleanliness. I polished with guitar exclusive polish, so it is in a very clean state. I after the finger board cleaning, painted beeswax. The aim is moisturizing and and protection. There is no problem with the Truss rod and it can be adjusted. Remaining the frets are 85% on average. There are partial shallow dents in frets. The Truss rod Wrench is not included. All Original.Note : The Lock nut and the Whammy bar are not original. The GIG BAG inclide. Look at the photos, please verify by yourself! It will be professionally pack. Double air packing. And ships inside a sturdy cardboard box. This electric guitar is USED. Please consider it when bidding. Thank you. Payment I accept PayPal only. Please pay within 3 days after the auction closed. Shipping Worldwide shipping from Japan! EMS / Shipping includes a tracking number. / / / Destination cost Delivery time / / / Asia : $1004 ~ 7daysUS Canada : $1205 ~ 8 daysEurope : $1406 ~ 10 daysOceania : $1205 ~ 8 daysSouth America : $2408 ~ 12 days This item is shipped within 3 business days after payment is confirmed. Terms of Sale International buyers - Please Note: Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer's responsibility. Please check with your country's customs office to determine what these additional costs will be prior to bidding/buying. These charges are normally collected by the delivering freight (shipping) company or when you pick the item up -do not confuse them for additional shipping charges. Please contact us first with 30 working days for any returns, Buyer pays shipping cost from buyer's country to Japan when being returned. In case of return, the shipping cost won't be refunded. We sell various kinds of Electric guitars to international customers. Our goal is to provide the best quality products and service and your satisfaction is the most important to us. Happy bidding!! Thank you !!", "ItemID": "254008118158", "EndTime": "2018-12-09T04:43:39.000Z", "StartTime": "2018-12-02T04:43:39.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1985-Greco-SS63-55-Deep-joint-All-Original-Mint-Collection-MIJ-JUNK-/254008118158", "ListingType": "Chinese", "Location": "Nagoya-shi,Kita-ku, Aichi", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2540081181588080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTU5OVgxNjAw/z/kZgAAOSwZbVcA1b3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/vN8AAOSwcttcA1b~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ5NVgxNjAw/z/JWIAAOSwjTtcA1dh/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE0MlgxNjAw/z/ewEAAOSwPAJcA1cF/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTM4NFgxNjAw/z/TmIAAOSwWAhcA1cS/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMTky/z/pesAAOSwkHxcA1cI/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg2MDM=/z/6X0AAOSwdrdcA1cg/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/fqkAAOSw8BdcA1cw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/FMcAAOSwbKdcA1dA/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/K6MAAOSwpwBcA1c7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTM4OFgxNjAw/z/K90AAOSwLuBcA1dC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/XkAAAOSw2-pcA1dM/$_57.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jguitar-shop", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 369, "PositiveFeedbackPercent": 100.0}, "BidCount": 27, "ConvertedCurrentPrice": {"Value": 230.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 230.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***a", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 351}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Americas", "Europe", "Asia", "AU"], "Site": "US", "TimeLeft": "PT0S", "Title": "1985 Greco SS63-55. Deep joint. All Original. The Mint Collection. MIJ. JUNK.", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Greco"]}, {"Name": "Model Year", "Value": ["1985"]}, {"Name": "Model", "Value": ["SS63-55"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Series", "Value": ["Original"]}, {"Name": "Body Type", "Value": ["Solid"]}]}, "HitCount": 1110, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "JP", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 232.5, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["APO/FPO", "Africa"], "GlobalShipping": false, "ConditionDescription": "This Greco is Junk. This is Used Electric Guitar. The electric guitar when connect to the amplifier, sound output is normal. There are scratches and Dents and crack. I was shooting a lot of photos. Please confirm with a photograph. Please Read the descriptions for details.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}