{"BestOfferEnabled": false, "Description": "Up for grabs is my 2003 Gibson Les Paul tv yellow jr in very nice used 1 owner condition with vintage hardshell case .. This is used and does show some scratches on the pickguard and body but overall extremely nice... The neck is straight and the frets are in excellent condition with awesome playability..Please look at the photos and ask any questions with all sales being final with no returns... Below is a description from a Gibson dealer in 2003 The Classic Les Paul Gets a Double CutEver since its introduction in 1952, the Les Paul has had an impact on both guitar players and on music itself. What started out as Gibson's answer to the introduction of solid body guitars in 1950, turned out to be perhaps the most influential of them all. Here we have a Les Paul with an interesting story. In 1954, Gibson issued a slab-body version of the original Les Paul, calling it the Les Paul Junior. By 1958, the company released a double cutaway slab body Les Paul and dubbed it the Les Paul Special. Essentially, that's what this guitar actually is, though to simplify the catalog, Gibson decided to call it a Les Paul Double Cut Faded. To make it look like an actual 50-year-old guitar, Gibson craftsmen produced a cool \"worn\" finish that makes this look like the real thing, but without the wear and tear (and price tag). It looks, feels and sounds just like the original and is a great value to boot!Gibson Les Paul Faded Double Cut at a Glance:Mahogany body with special Worn Yellow finish1960s slim-taper mahogany neck with rosewood fingerboardTwo vintage single coil P-90 pickupsIt's New, But Looks VintageLook in any book that's been written about Les Paul guitars (and there have been quite a few) and you'll see this guitar most likely shown in its 1955 incarnation, the Les Paul Special. Gibson has simplified the catalog and this guitar is now called the Les Paul Faded DC (for the double cutaway body). With its special \"worn\" finish, you'll swear this is actually a '50s guitar, but when you look closer, you'll notice it doesn't have the usual chips, dings and scratches. What it does have is an amazing vibe. It's about as far away from a Les Paul Standard as you can get and still own a guitar that's in the Les Paul family. This one is in what Gibson calls a Worn Yellow finish. 1960s Style Slim-taper NeckThe first Les Pauls had huge mahogany necks, but by 1960 the neck underwent several modifications until it became what's known as the slim-taper design, which is actually what most of today's players prefer. You can move up and down the neck at blazing speeds, but the rosewood fingerboard still has that warm, classic Les Paul feel, allowing easy access to the upper frets so you can really dig into your solos. It also sounds great when grabbing big fat power chords. The pearloid dots complete the vintage look.Two P-90 Pickups on a Les Paul? You Bet!Historically, the Les Paul has been associated with the dark, punchy tone of the Gibson humbucking pickup with its complex midrange frequencies. The 1955 Les Paul Special had single coil P-90 pickups, and that's what you'll find on the Les Paul Faded DC. The Gibson-designed P-90s, while being a single coil design, have a unique sound all their own, with more bottom end and a crunchier midrange than you normally associate with single coils. Many players actually prefer this sound and it's the perfect compromise when you need a guitar capable of producing plenty of high frequencies, but without getting thin or shrill.Les Paul Faded DC Features:Color: Worn YellowBody: MahoganyNeck: Mahogany with 1960s slim-taper profileFingerboard: Rosewood with pearloid dot inlaysNumber of frets: 22Pickups: Two vintage style P-90 single coilsControls: Two each tone and volume with three-way pickup selector switchMachine heads: White buttonHardware: Chrome platedCase: Black padded gigbagGibson: Don't Mess with a Good ThingGibson guitars have been around for well over a century. When guitarists are looking for an outstanding combination of superb tone and playability along with great looks and gorgeous finishes, the choice for most of those 100 plus years has been Gibson. From their amazing collection of fine acoustics to the electric guitars that literally rewrote music history, Gibson guitars have been on almost every chart-topping album from artists like The Beatles, The Rolling Stones, Cream and Led Zeppelin. These \"first call\" instruments also cross an enormous array of diverse styles, from folk and country to blues and hard rock. With that resume, it's not surprising that so many of Gibson's best-selling instruments have changed little over the decades. Because there's just no sense in messing with a good thing!", "ItemID": "183641246159", "EndTime": "2019-01-21T22:16:05.000Z", "StartTime": "2019-01-17T23:30:20.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-Les-Paul-Special-Double-Cutaway-TV-Yellow-Electric-Guitars-P-90s-/183641246159", "ListingType": "FixedPriceItem", "Location": "Usa", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1836412461598080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/6JkAAOSwIbtcN5Td/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/kd8AAOSw1qhcN5TN/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/xdQAAOSw1jpcN5T3/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/3kUAAOSwd7FcN5Uk/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTI0MlgxNjAw/z/r5oAAOSwaJ9cN5Tt/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/usoAAOSwhrpcN5Ub/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/R2AAAOSw8PJcN5Tk/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/sCMAAOSwAP9cN5T~/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/muIAAOSwWdNcN5UN/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/tigAAOSwfplcN5UW/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/RbMAAOSwR0dcN5TV/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA5NlgxNjAw/z/f0kAAOSw55FcN5UH/$_12.JPG?set_id=880000500F"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "motorsguy7881", "FeedbackRatingStar": "Red", "FeedbackScore": 1446, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1050.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1050.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "u***u", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 2112}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson Les Paul Special Double Cutaway TV Yellow Electric Guitars P-90's", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Product Line", "Value": ["Gibson Les Paul"]}, {"Name": "Model Year", "Value": ["2003"]}, {"Name": "Body Color", "Value": ["Yellow"]}, {"Name": "Features", "Value": ["Cutaway"]}]}, "HitCount": 286, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=88614783", "StoreName": "Guitar Rendezvous"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}