{"BestOfferEnabled": true, "Description": "\"Gibson\" Mint Condition ES 335 OHSC Professionaly Maintained by Luthier Gene Simpson The guitar is in excellent condition. It has a 1999 production date. Made in Nashville. Image of normal wear is in the photos, and a collage of photos point to al marks on the guitar. A copy of the Guitar Center hang tag that identifies the model, color, and inventory number is in the images. Luthier-Gene Simpson of Alanoke Guitars reset the neck for improved playability. Specs: Cherry color, back and sidesNickel hardwareABR-1 bridgeOne piece mahogany neck22-fret rosewood fingerboard with pearloid dot inlays and 1959 rounded neck profileVintage tulip tuners replaced with Grovers (see images)'57 classic humbucking pickups2 volume, 2 tone, and 3-way selector switchBeautiful brown Gibson Custom Shop Hard-Case with vintage hot pink interior in mint condition. 1 of 5 manufactured in the Nashville plant on January 20, 1999 Item will ship ground/home delivery with signature required. Insured. Please ask questions before purchase and please ask questions before considering your purchase since there are no returns on this item. Please review the images and higher resolution is available (email only-too large for ebay message). Company Product Description Like the Les Paul, the ES-335 stands as one of Gibson's all-time most iconic models. The ES-335 is a semi-hollow body guitar, which means that it has a solid block of wood running through its center with hollow wings on either side. This construction style maintains the open tone of a hollow body while helping to reduce feedback. The ES-335 was introduced in 1958 and has remained in production in various forms ever since. This instrument is part of a collection of a life-long musician, who selected each instrument he purchased, to share, play, and enjoy. Recent circumstances require the instruments be sold to a new owner that can care for them. Please view our other listings on this unique collection. Free Shipping, Insured (Buy it Now Only) for continental US ,AK, HI, US territories and EU please request shipping estimate. Please message your questions Manufacturer: See Above Part #: See Above Type: See Above Compatibility: Please check prior to purchasing Please review the policies on your purchase Our eBay sales do not include tech support. What is pictured and described is included. We welcome your questions on specifics. This unit has been tested and is sold as is If you have questions or special requests, please contact us before you make your purchase. Contact To contact us, please use eBay's messaging service. We will only reply through the same (no e-mail). To arrange local pickup, please contact us through eBay's messaging. Please view the images and email any questions This item ships with a tracking number, and buyers may request insurance. Please read the statement that follows Policies & Program Bench Testing of Products Sold Before an item is listed (electronic), it is power tested it if it requires power, and if it is a motherboard it is tested in the system before dismantling, or if it is a peripheral device that we can test on or in a system we do. All devices that require a special device or specialty experience that we do not have our testing begins and ends with power testing. After testing we inspect for physical damage or inconsistencies. If there is any wear outside of the normal of a used item we either mark the item to note its damage or wear in the listing or we scrap it. Serial numbers are recorded by the receiving and testing department, and each item is marked with security seals to discourage tampering or desoldering of components in the classroom. Returns If there is a problem with the item, the full purchase price will be refunded to the buyer within five business days following receipt and inspection of return. Items must be returned in original packaging or similar packing, insured for purchase value. For returned non-defective items, our cost for actual shipping charges will be deducted from the refund, and includes items sold with Free Shipping. (Example: if the item sold for $30 and cost us $10 to ship to you, your refund will be $20.) As-Is / Parts or Repair Items posted as-is are considered parts or repair. DOA Process When a buyer initiates a DOA claim we issue them a RMA number and await the return. When the return arrives the item’s serial number is confirmed. If this is missing or if the seals have been tampered with the warranty is void. We check the item to see if it works and that all the components are in working order. If the item is DOA or not as listed we will exchange the item for one that is working (if we do not have inventory for exchange we will issue a refund. If the item is in working condition we offer to ship the item back (at the buyers expense) or we issue a refund minus a 20% restocking fee.) International Buyers – Please Note: Import duties, taxes, and charges are not included in the item price or shipping cost. These charges are the buyer's responsibility. Please check with your country's customs office to determine what these additional costs will be prior to bidding or buying. Shipping All items are professionally packed to arrive undamaged. International Buyers – Please Note: Import duties, taxes, and charges are not included in the item price or shipping cost. These charges are the buyer's responsibility. Please check with your country's customs office to determine what these additional costs will be prior to bidding or buying. We DO NOT ship to Africa, Armenia, Bahrain, Iraq, Jordan, Kazakhstan, Kuwait, Kyrgyzstan, Lebanon, Oman, Pakistan, Qatar, Russian Federation, Saudi Arabia, Singapore, Turkey, Turkmenistan, United Arab Emirates, Yemen, Andorra, Belarus, Croatia, Republic of Czech Republic, Latvia, Lithuania, Moldova, Montenegro, San Marino, Serbia, Slovakia, Slovenia, Svalbard and Jan Mayen, Ukraine, New Zealand, Niue, Argentina, Brazil, Venezuela.. THE PROCEEDS FROM THE SALE I am the Director of Programs for a registered 501(c)(3) nonprofit and public 170(b)(1)(A)(vi) charity organization, and by special arrangement the donors have given the program an opportunity to replace funds from 2018/2019 reductions in the nonprofits budget. We have 3 programs that require additional funding and all proceeds from the sales are applied to the needs of each program. The students, and community appreciate your support, and donations will be gladly accepted when the program is taken nationally and placed on crowd funding to expand the acquisition and repurposing of the designated obsolete Windows XP laptops, and the production of Senior Therapeutic Gaming Consoles for assisted living facilities. The Mission: In the past 8 years of the programs developed for students, education, business, and their communities, over a thousand computers have been returned to duty that assisted many young people, isolated communities cross the digital-divide to complete or further their education online, The First Vision - Excellence in Education Program: The recovery and refurbishment of obsolete computers donated to the non-profit are ear-marked to provide desktop computers to students that lack the resources to purchase a computer for use in their home, and help them and their families cross the digital divide. Excellence in Education's core value is to inspire students to contribute to their community by volunteering in local organizations, with the belief that their actions will inspire other young people to do the same. The Second Vision - The Cyber Security Warrior Program: The recovery of usable laptops with Windows XP, are deemed obsolete by the manufacturers, and are repurposed for the Cyber Security Warrior Program, and all funds for this program are ear-marked to expand the program by purchasing additional units that will allow expansion of the program to benefit students enrolled in Computer Science, Server Management, and Network Technician classes. The Cyber Security Warrior program is designed to assist students and the country by increasing their knowledge and capabilities with the availability of these laptops, and provide a student with employable skills that will assist them in the pursuit of their career. The Third Vision - Senior Game Therapeutic Consoles: The recovery and refurbishment of obsolete computers components are used to produce a therapeutic and activity based game console for seniors in assisted living. These components are tested and installed in the custom console which is a stand-alone unit with wheelchair access for use. The reduction in cost that the components provide offset the cost of the console housing, and reduces the overall cost. The Senior Game Therapeutic Consoles are designed for an enjoyable activity that assisted living seniors can share with their children and grandchildren by playing a game with them while they are there. The mental activity the games provide exercise the minds of these seniors in the assisted living communities where they reside. The 3 Visions Programs adheres to the principles developed and approved by the Board of Directors for the mission and purpose of the nonprofit and by promoting a cooperative effort among education, students, and community organizations to recognize that students are willing to adhere to a high standard that encourages academic excellence, and volunteerism in their community. How the First Vision Program Works - Excellence in Education: Students are nominated by instructors, professors, and teachers, which the board reviews and approves the distribution of the refurbished computers to the students, in recognition of their citizenship, academic achievement, and attaining the standards of the Excellence in Education program. The First Vision - Excellence in Education provides incentives for elementary, college, and university students to achieve their goals by volunteering on campus or in their community, and excel in their educational goals. The incentive of the program is designed to offer the opportunity to disadvantaged students, because many students could benefit, if they could have access to a computer in their home. Students in Higher Education volunteer their time to refurbish the donated computers, which are certified to return to duty, and offer the opportunity for a student and their family to cross the digital divide. How the Second Vision Program Works - The Cyber Security Warrior: A critical link in the protection of our countries networks and systems is the dependency upon OEM Software Manufacturers to provide \"built-in\" security, and creates a false sense of security which has been revealed by the number of successful attacks on our countries networks. The Problem of Weak Network Security Education has limited programs and courseware available for students entering education, which has made network and server security, a specialized trade that can only be achieved by extending the students time in education to achieve the qualifications that a network or server security specialist requires. Repurpose Obsolete & Reduce Potential Harmful Disposal with the dual-boot laptops that contain 2 pen-test tools and will allow an instructor, professor, or teacher to provide a hands-on experience their students can use to protect the systems they are responsible for. With over 10-million obsolete Windows XP/Windows Vista/7 laptops in the secondary marketplace that can be repurposed to develop a cadre of security trained network-server management technicians that will protect the countries data now and in the future. How the Third Vision Program Works - Senior Game Therapeutic Consoles: The country is experiencing a large demographic growth of the elderly and many experience limited mobility and require assisted living. Lower daily activity and allowing aides to provide services they need, reduces their mental acuity and contributes to a lethargic lifestyle. Everyone Should Have the Opportunity to Enjoy a Game Many of the residents were active and now require stimulation they can use and enjoy while simultaneously exercising and improving their faculties. Assisted Living is a Large Demographic The expected population increase is significant and requires an approach that can be used in communities across the country by engaging students and their districts to contribute to the betterment of the elderly in assisted living. A brief description on our programs is in the images that show each programs brochure, and if you are interested in receiving a full copy of the program brochure, please message and we will gladly send one to you. Track Page Views WithAuctiva's FREE Counter", "ItemID": "323607533940", "EndTime": "2019-01-23T21:27:17.000Z", "StartTime": "2018-12-18T21:25:36.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1959-GIBSON-HISTORIC-COLLECTION-DOT-REISSUE-ES-335-1999-Production-NonProfit-/323607533940", "ListingType": "FixedPriceItem", "Location": "Ivanhoe, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/3236075339408080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/~6YAAOSw4CFYuHbK/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDU2WDEwMDA=/z/kgAAAOSwnlFaY7K~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/T6oAAOSwTM5YuHbR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/Zb0AAOSw32lYuHbc/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/E~sAAOSwax5YuHbi/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/-T8AAOSwCU1YuHbp/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAwMFgxMDAw/z/W9oAAOSwQwZaY7Km/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/FlMAAOSwax5YuHbx/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA3OVgxNjAw/z/VVgAAOSw4A5YuHlU/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIzNlgxNjAw/z/YAUAAOSwWxNYuHlm/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIzNlgxNjAw/z/1OYAAOSwTM5YuHlw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIzNlgxNjAw/z/LMYAAOSw~AVYuHl5/$_57.JPG?set_id=8800005007"], "PostalCode": "93235", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "not4profitinc-computercomponentsparts", "FeedbackRatingStar": "Purple", "FeedbackScore": 578, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 4200.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 4200.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "m***g", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 124}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "1959 GIBSON HISTORIC COLLECTION DOT REISSUE ES-335 (1999 Production) NonProfit", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Type", "Value": ["Semi-Hollow"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["ES 335"]}, {"Name": "Model Year", "Value": ["1999"]}, {"Name": "Items Included", "Value": ["OHSC"]}]}, "HitCount": 128, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1243899905", "StoreName": "not4profitinc-computerparts"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Central America and Caribbean", "Middle East", "Southeast Asia", "South America", "RU", "AF", "AM", "AZ", "BD", "BT", "CN", "GE", "IN", "KZ", "KR", "KG", "MV", "MN", "NP", "PK", "LK", "TJ", "TM", "UZ", "PO Box"], "GlobalShipping": false, "ConditionDescription": "Purchased and placed in collection with Grover heads, please review description and see images", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}