{"BestOfferEnabled": false, "Description": "Check out my other items! Here is a lightly used (generally very clean) 2010 Gibson Les Paul Junior -- Satin Sunburst. Comes with a brand new Gibson padded gig bag. I contacted Gibson Customer Service and the rep informed me that this particular model guitar was made as a dealer exclusive for Guitar Center in 2010 and 2011. Here are the specifications that the rep gave me. Body –Mahogany with satin finish *** the top of the body is FLAT (it is NOT carved).Neck – 1 piece mahogany(60’s slim taper profile) with satin finishPeghead pitch – 17 degreesFingerboard – 22-fret Baked MapleFretwire - 0.090” wide and 0.055” tall nickel/silver alloyFingerboard radius – 12”Inlays – acrylic dotScale length – 24 ¾”Nut width – 1 11/16”Tailpiece – Lightning Bar (wrap around) chrome colorHardware – chromeTuners – Gibson white button -- the backs are marked Gibson DeluxeControls – 1 volume, 1 tone(push/pull coil split)Pickup – 498T Zebra (coil tapped)It has one pickup that is in the bridge (zebra 498T alnico). Coil tap [the lower control (TONE) can be pulled up / pushed down to split give you full output or half output of the humbucker pickup]. NOTE: Coil tapping is when a wire runs off of the pickup windings at a certain point, somewhere short of the full amount. This means you can install a switch (in the case of this guitar the TONE control) to select between a single coil pickup's full output or a lower output, giving you two distinct levels of power from one pickup. The serial number is 135501339hThis guitar was made when Gibson was using the 1st and 5th digits to date their guitars.Built in: 21-dec-2010 (355 days = dec 21) (serial: 1339) NOTE: there are 365 days in a year https://www.guitarinsite.nl/serienummers-gibson_eng.php Made in the USA. SLIM TAPERED NECK The weight is about pounds 7 and 9 ounces. This is a very sweet guitar. Even though is a simple no frills instrument - it has a kool vibe and it feels and sounds great. Overall it is clean - but it is NOT 100% perfect. * The back of the body: There is NO buckle rash. The upper center area of the back of the body has some cloudiness that cannot be wiped off. The lower areas of the back of the body also have some cloudiness that cannot be wiped off. Seems like the cloudiness is just light surface scuffs in the finish. The upper center area has a hardly visible very light vertical scratch or impression (it is about 1 and 1/2 inches long). There are a few extremely light not too short / not too long hair-line surface scratches. And there area few dings here and there. * The front of the body has a few imperfections: tiny, very small, and small dings and short dash like light impressions. * The edges of the body have a few dings. The edges of the body have a few dings a few short dash-like scratches, and a few cloudy spots. * The upper left area of the neck BACK SIDE (around the first fret area) has a small marker point sized chip in the finish and a light short dash-like impression. The back of the neck also has a few tiny and very small dings and short dash-like imperfections here & there. * The area of the back of the neck just below the headstock has a not to light / not too deep scratch or impression in the finish -- maybe it is a little bit in the wood -- and some cloudiness in the finish. This area kind of look like a headstock repair (SEE close up picture). But it is NOT. It is just a coincidence that this scratch / impression is in an area where headstock repairs usually are. I had two guitar techs check it out and both informed me that the headstock was never broken. I am not the original of this guitar that is why I could not say and needed some opinions from people who set-up and deal with guitar in this manner on a daily basis.. * Most areas of the headstock are fine. The lower front right edge area (whereis scallops) has a couple of dings / light impressions. The middle back of the head stock has a light pen pencil point sized impression located in between the B and A tuners. * The strings are not fresh - but they are generally clean. * Most areas of the fretboard is fine. The only area to that has wear or imperfection is at the 6 fret (the areas of the bake-lite maple in between the 5th and 6th fret). This area has not too light / not too deep vertical & horizontal grazing. In other word it is not totally smooth and even. The imperfections do not really stand out (unless you closely examine the fretboard) and they do not affect playability. Probably cause by string pressure or maybe this area was had had to take out residue and needed to be cleaned harder than the other areas of the fretboard. Or who know maybe this is just the way it was made?? * Most of the frets have little wear. The B and G areas of the 1st, 2nd, 3rd, 4th, 5th frets have light impressions (minor grooves). The high E area of the 1st, 2nd, 3rd, 4th, 5th frets have very light markings. * The nut is fine. * The electronics are fine. * The pup mounting ring is generally fine -- it has a few tiny and very small imperfections. * The back plate has a couple of hair-line scratches, a few other scratches, a few very tiny dings, and some cloudiness. * The tuners are fine. * The bridge on mostly clean - some cloudiness & light surface scuffs near where the strings are. * The pickguard has several light surface scratches and some cloudiness. There are also a few light dings and a few not to light to to deep scratches. * The strap buttons are not the original ones. They are black Schaller or Schaller type strap lock style. The black finish has wear / imperfections. If necessary I can either put on aluminum Gibson Strap locks on or I can include NON original Schaller Black Strap locks - just let me know. * Not sure if the knobs are the original ones that were on this guitar. I am only saying this because I have mostly seen this model guitar with black bell knobs. But it look like the know that are on are Gibson (gold / gold reflector type). And actually with the zebra 498T pup and the sunburst body color - these knobs look very shape o this guitar. The knobs are cosmetically fine. The gig bag is fine - it is brand new. The inside of the gig back is white - plush material. Thick padding. Feel free to ask for more information or for more pictures. NOTE: There are some imperfections that can be seen in person that do not appear in the pictures. There may be a few very minor imperfections that I overlooked. There are some imperfections show up in the pictures that are not that visible in person (glares, reflections, dust specks).Shipping Options in USA are USPS Priority or USPS Parcel Select and can be Calculated. I will use UPS or FedEx upon request. For some areas in the USA - I will do my best to assist you in getting a slightly lower shipping / packaging cost than what is calculated. Just message me.Please keep in mind that the s/p cost for a coast to coast shipment will be high for USPS Priority Mail - therefore I recommend that you use USPS Parcel Select Ground. I live in New Jersey. Will Ship World Wide - for countries / areas NOT mentioned below - please contact me for the shipping / packaging cost . Shipping/ Packaging cost to AUSTRALIA is about $139 USD Shipping / Packaging cost to CANADA is about $88 USD Shipping / Packaging cost to Germany, France, Spain, Greece, Italy (and to most European countries) is about $105 USD - please contact me to get exact shipping / packaging cost Shipping / Packaging cost to SOUTH AMERICA is about $118 USD Shipping / Packaging cost to RUSSIA is about $140 USDShipping / Packaging cost to the United Kingdom is about $119 USD Feel free to ask questions Watch out for more music gear and other cool things coming soon!! Comes from pet-free/ smoke-free home THANKS FOR LOOKING & GOOD LUCK!! SERIOUS BIDDERS ONLY SORRY FINAL", "ItemID": "401690007295", "EndTime": "2019-01-20T00:19:37.000Z", "StartTime": "2019-01-19T16:17:31.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/lite-use-2010-Gibson-LES-PAUL-JUNIOR-Satin-Sunburst-498T-coil-tap-new-gig-bag-/401690007295", "ListingType": "FixedPriceItem", "Location": "Perth Amboy, New Jersey", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/4016900072958080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NjQwWDQ4MA==/z/qsIAAOSwZFxb55oL/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDgwWDY0MA==/z/51EAAOSwCMVb55fj/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDgwWDY0MA==/z/kt4AAOSw4WVb55fp/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDgwWDY0MA==/z/zwAAAOSwuJRb55ft/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDgwWDY0MA==/z/bO8AAOSwtmNb55gN/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDgwWDY0MA==/z/uNgAAOSwAThb55gQ/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDgwWDY0MA==/z/cuMAAOSw-ghb55f0/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDgwWDY0MA==/z/~IgAAOSwY8Bb55gq/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDgwWDY0MA==/z/tucAAOSwo3Fb55gT/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDgwWDY0MA==/z/7ykAAOSwfhlb55gB/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDgwWDY0MA==/z/D0gAAOSwucNb55gF/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDgwWDY0MA==/z/DaUAAOSw48Vb55f9/$_1.JPG?set_id=8800005007"], "PostalCode": "08861", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "rubyaaii", "FeedbackRatingStar": "Green", "FeedbackScore": 5660, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 574.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 574.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "y***r", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 38}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "lite use 2010 Gibson LES PAUL JUNIOR Satin Sunburst 498T coil tap + new gig bag", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Body Type", "Value": ["Les Paul"]}, {"Name": "Model", "Value": ["Les Paul Junior"]}, {"Name": "Body Color", "Value": ["satin sunburst"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Material", "Value": ["Mahogany"]}, {"Name": "Model Year", "Value": ["2010"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Features", "Value": ["one pup:  498T alnico, coil tap"]}]}, "HitCount": 23, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=90751303", "StoreName": "rubyaaii"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Overall, this guitar is clean - but it is NOT 100% perfect.  It has  a couple of dings, small impressions, light scratches. The back of the body has NO buckle rash. One area of the fretboard has light surface imperfections. A few area of the frets have light visible wear.  The upper area of he back of the headstock has light impressions that look like not too light  / not too deep scratches and some cloudiness. Specific details are in the description.  The gig bag is fine -  is brand new and the padding is thick..", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}