{"BestOfferEnabled": false, "Description": "Up for bid is a loved and cared for, pre-owned Washburn Electric Guitar, PS500 Paul Stanley Signature model which includes the original Washburn Hardshell Guitar Case. I believe this guitar is from the first production (1998) based on a little research i did online HOWEVER I am not a guitar player, nor musician. Serial Number 981XX512 Unfortunately I know little about the history of the guitar other than we tested, and it functions properly. As far as tuned, and ready to go... We have not done a set up or tuned. I imagine everyone will want to adjust to thier own liking. Guitar may need adjustments when you receive. Model PS-500 ( PS500 )Paul Stanley Signature Model Black GlossyWashburn Hardshell Guitar Case FYI- I am not a guitar player nor musician. We at Uptown Pawn dba. UptownSalesUSA do not claim to be a specialist or experts on guitars - Carvin, however, we will represent everything listed to the best of our abilities by taking photos of actual items and more to qualify our standards. If you consider yourself as a expert or knowledgeable on this Carvin AE185 , we welcome and appreciate any insight or data you may have in order to provide the most accurate listing to our buyers. Please look carefully, feel free to send us a message if you need to know more specifics about this guitar, more photos, or have some insight I could use to assist other potential buyers. You will receive item exactly as shown in the pictures. Please understand, this listing only contains what is described. Don’t assume it comes with something if not stated in the listing description. If you aren’t certain, send us a note thru eBay messaging system. Photographs often disclose condition far better than verbiage as many people have different ideas on what terms may mean. Please zoom in for more specific condition details. If an identifying mark, inclusion or defect is visible in the images it is considered disclosed to the buyer.Pay attention to the details, Ebay’s defaulted detail catalog is not always correct. correct. Many times Ebay product catalog does not have the correct photo of the item we have for sale may look different. In addition, I have found many of Ebay defaulted catalogues have certain models, MPN, and other specs wrong from previous listers. Double check to see if it is accurate. Most times the buyer knows more than we do. Please ask if there is something specific you need to know. Your purchase of the item represent agreement on the terms and conditions of this ebay listing. This listing is offered and sold as is. Uptown Pawn dba. UptownSalesUSA, a brick and mortar pawnshop located in the heart of the Twin Cities metro area. We are licensed and bonded by the city of Minneapolis and registered with Minnesota Secretary of State since 2002. Check out our feedback and buy with confidence.You can find contact information at the bottom of our Ebay Payment Policy tab in listing. If you have any questions or need to discuss more descriptions, special shipping arrangements, additional photos, or local pick up.Uptown Pawn dba. UptownSalesUSA makes no express or implied warranties or representations regarding the condition or suitability of the goods and to the extent allowed by law, specifically disclaims any express or implied warranties, including but not limited to any warranty of merchantability or fitness for purpose.We do not offer a warranty on any merchandise: Ebay has a Square Trade program may work. We are not a distributor for any brand. Warranties on the items that I sell may or may not be valid on a non-retail purchase. Indemnity: Buyer shall, at no expense to the Seller, indemnify, defend and hold the Seller harmless against any and all losses, damages and expense (including punitive damages, multiple damages, attorney fees and other costs of defending any action) Seller may incur as a result of any claim made against the seller by any person, including without limitation, Buyer, it's successors, assigns, representatives, agents, employees, insurers, and customers, actually or allegedly arising out of the regarding the transportation, installation or use of the equipment sold hereunder by Seller or out of any products manufactured or sold by Buyer, including, without limitation, any claim which in whole or in part actually or allegedly arises out of (a) Seller's negligent or other wrongful act or omission, (b) danger or default in any equipment sold by Seller to Buyer, (c) infringement by Seller of any patent, copyright, or trade secret relating to any equipment sold by Seller to Buyer.", "ItemID": "192807623948", "EndTime": "2019-02-04T22:39:08.000Z", "StartTime": "2019-01-28T22:39:08.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Washburn-PS500-Electric-Guitar-Paul-Stanley-Signature-Black-KISS-99-cent-NR-/192807623948", "ListingType": "Chinese", "Location": "Minneapolis, Minnesota", "PaymentMethods": ["PayPal", "CashOnPickup"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1928076239488080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMTk5/z/ED4AAOSwiSVcT4I8/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/ucIAAOSwJXxcT4I-/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDcw/z/u1AAAOSw-elcT4Bu/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/jyAAAOSwfqJcT4AO/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/t7AAAOSwWAhcT4A2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/hLMAAOSwIqxcRd3H/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/~b0AAOSwJiBcRd10/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/7wUAAOSwXFRcRd1s/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/o5QAAOSwqLlcRd17/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/7H8AAOSwMkdcRd14/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/UiMAAOSwcXhcRd1x/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/CecAAOSwqLRcT4FC/$_57.JPG?set_id=8800005007"], "PostalCode": "55408", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "uptownsalesusa", "FeedbackRatingStar": "Red", "FeedbackScore": 3020, "PositiveFeedbackPercent": 99.5}, "BidCount": 26, "ConvertedCurrentPrice": {"Value": 310.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 310.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "n***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 181}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Washburn PS500 Electric Guitar Paul Stanley Signature, Black - KISS  .99 cent NR", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Black"]}, {"Name": "Brand", "Value": ["Washburn"]}, {"Name": "MPN", "Value": ["PS500"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Model", "Value": ["PS500 Paul Stanley"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Model Year", "Value": ["1998"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Product Line", "Value": ["Washburn"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Material", "Value": ["Glossy Black"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Features", "Value": ["Volume Knob"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}]}, "HitCount": 316, "Subtitle": "Washburn Hard Case included .99c Auction No Reserve ! ", "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1105760823", "StoreName": "Uptown Pawnstars"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 315.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "Guitar is is good condition considering it age. Well cared for although there are signs some signs of wear, small scratches and minor scuffs from handling in a professional manner. The original Washburn hard case has wear, many scuffs and tears throughout  vulnerable areas ( corners and such ) Please reference photos in listing and zoom. (Try and look closely, most of what you see are reflections NOT IMPERFECTIONS)", "QuantitySoldByPickupInStore": 0, "SKU": "81057-1 MAS JXX", "NewBestOffer": false}