{"BestOfferEnabled": false, "Description": "All photos are of the actual item for sale. Used Item In very good condition. There are scratches under the B and E string saddles. Schecter C-7 Multiscale SLS Elite Solidbody Electric Guitar - Gloss Natural A cutting edge guitar expertly crafted by Schecter with playability, sound and expressiveness that allows modern players to let the creativity flow! The C-7 MS SLS Elite features a multi-scale design and a 7-ply Maple/Walnut/Padauk neck-thru construction, reinforced with carbon fiber rods for stability and utilizing a spoke-wheel truss rod to facilitate easy adjustment, is mated to a Swamp Ash body with Ivory binding and topped with Flame Maple for boutique looks and tone. Comfort carves in the waist and cutaway as well as an ultra-access carve at the neck joint enable you to explore all 24 X-Jumbo stainless steel frets across the 25.5-27 inch multiscale Ebony fingerboard with absolute freedom, while the Fishman Fluence Modern Ceramic and Modern Alnico humbuckers with individual voice controls deliver crushing power into your rig with unprecedented tonal expressiveness. Topping it all off, Schecter Locking Tuners, a graphite nut, and a Hipshot bridge provide an ultra-stable platform to keep you in tune, and the striking finish combination of a gloss natural top with natural satin back and sides will be sure to distinguish you from the pack. Tech Specs Body: Swamp ash Top: Flamed Maple Neck: Multi 7-ply Maple/Walnut/Padauk neck with Two Carbon Fiber Reinforcement Rods Fretboard: Ebony w Neck thru with ultra access Frets: 24 extra jumbo stainless steel frets Neck Shape: Ultra thin C Radius: 20 inch Fret Scale: 27 – 25.5 inch fanned Truss Rod: Dual action Pickups: Fishman Fluence Modern Controls: Volume(push/pull neck)/Tone(push/pull bridge) 3-way switch controls Bridge: Hipshot 7-string Multiscale Tuners: Schecter locking Nut: Graphite Top: Gloss Natural Back and Sides: Satin natural Includes* Guitar *There could be important accessories not included. We do our best to call out the accessories that should be included that are missing, however, we don't research every item to know with certainty what should be included. Please do this research before bidding and know what you are purchasing. Check out my other auction listings! and be sure to add me to your favorites list. CONTACT INFORMATION You can e-mail us with any questions you may have about an item. We are very easy to reach, and we are glad to help. Just click \"Ask a question\" in the questions and answers area below. Please note that we are not in the office after 5:00PM EST on weekdays, or all day Saturdays and Sundays. Questions asked over the weekend will be answered on the following business day. SHIPPING INFORMATION Items are shipped within one business day of payment. To avoid a lost or stolen item, your package may ship \"Signature Required.\" If you have special shipping instructions or would like your item shipped UPS instead of USPS or FedEx, please contact us before you make a purchase. We collect local sales tax here in Indiana. This applies to Indiana residents who we ship to, as well as non-Indiana residents who drive here for local pickups. We also collect sales tax in other states around the country. Please check eBay's tax information on the \"Shipping and payments\" tab above to see if we are collecting tax in your area. PLEASE NOTE Shipping quotes are estimates only. We use eBay’s shipping calculator, which provides estimated shipping charges on listings where “Free Shipping” is not offered. Ebay's FedEx calculator on the item page quotes eBay's discounted FedEx shipping rates, which we honor. At checkout, however, buyers in certain areas will see the calculator attempt to charge the full retail price. FedEx's full retail price is the price you pay if you were to walk into a FedEx retail location. The difference between eBay's discounted rate and this retail price can be as much as 40%. If you estimate shipping with a zip code that is different from the zip code registered to your User ID, eBay’s shipping calculator will make the adjustment at checkout. Additionally, FedEx charges a surcharge for delivery in certain rural areas of the country that does not, for some reason, show up in eBay’s estimate calculator; but it does at checkout (we wish we could control this, but we can’t — we have contacted eBay many times about this issue). FedEx does this based on the +4 extension of your primary 5-digit zip code. For example, eBay’s shipping calculator may quote you one price based on your primary 5-digit zip, and then figure out that your requested street address at checkout places you within the rural surcharge area, changing the shipping price to an alternate amount that was originally quoted. If there is a discrepancy in your shipping cost, please send us a screen shot of the quoted price to you on our item page and we can override the eBay checkout calculation to get you the cheapest rate. RETURN INFORMATION We want you to be completely happy with your purchase. If the item you receive is not as described or has been damaged in shipping, please contact us immediately. We will make every effort to promptly resolve any problem. Your satisfaction is our top priority. We are happy to offer free shipping on some of the items we offer. Please note that if you decide to return something where free shipping was offered, our shipping costs are non-refundable.", "ItemID": "372606535741", "EndTime": "2019-02-28T02:35:21.000Z", "StartTime": "2019-02-21T02:35:21.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Schecter-C-7-Multiscale-SLS-Elite-Solidbody-Electric-Guitar-Gloss-Natural-/372606535741", "ListingType": "Chinese", "Location": "Fort Wayne, Indiana", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/3726065357418080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg2Mjk=/z/9loAAOSwIVVcbVzn/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMTcy/z/cFkAAOSwcOtcbVzp/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg2MTg=/z/ry0AAOSwf4BcbVzr/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg3OTQ=/z/g6gAAOSwWnhcbVzt/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU5OVg3NTA=/z/iPMAAOSwSk9cbVzu/$_57.JPG?set_id=8800005007"], "PostalCode": "46818", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jeffsmusicgear", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 14549, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 4, "ConvertedCurrentPrice": {"Value": 760.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 760.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "2***r", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 220}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Schecter C-7 Multiscale SLS Elite Solidbody Electric Guitar - Gloss Natural", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Gloss Natural"]}, {"Name": "Brand", "Value": ["Schecter"]}, {"Name": "Model", "Value": ["C-7"]}, {"Name": "Series", "Value": ["Elite"]}, {"Name": "Body Material", "Value": ["Ash / Flamed Maple"]}, {"Name": "Features", "Value": ["Fan-fret"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["2018"]}, {"Name": "String Configuration", "Value": ["7 String"]}, {"Name": "Soundboard Style", "Value": ["Carved top"]}, {"Name": "MPN", "Value": ["1366"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Product Line", "Value": ["Schecter C-7"]}, {"Name": "Country/Region of Manufacture", "Value": ["Korea, Republic of"]}]}, "HitCount": 144, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=36123540", "StoreName": "jeffsmusicgear"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 770.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "TopRatedListing": true, "GlobalShipping": false, "ConditionDescription": "In very good condition. There are scratches under the B and E string saddles. Please see the photos above; they are of the actual item for sale.", "QuantitySoldByPickupInStore": 0, "SKU": "SPC203507d1", "NewBestOffer": false}