{"BestOfferEnabled": true, "Description": "This is a 2018 matte black Schecter Sun Valley Super Shredder in excellent condition. It has some of the usual light playing wear and tear you would expect to find on a very lightly used instrument including some hairline pick-scratches on the pick guard and body, a few small scuffs, and some other very minor blemishes here and there. There’s a small abrasion in the clear satin urethane along the bottom edge (high-E side) of the neck heal about 1\" long by 1/4\" wide that’s purely cosmetic. I’m not sure where it came from because it was there when I bought the guitar several months ago. The only other blemish of note is an extremely tiny pinhead sized blob of matte black body paint at the very top edge of the front forearm contour. It’s most likely some spray gun splatter, and it’s so tiny I actually didn’t notice it until I was taking pictures for this listing. Otherwise the guitar is essentially in near-mint condition. It plays beautifully, and sounds fantastic. I just installed a new set of OEM spec Ernie Ball Hybrid Slinky strings and gave it a full setup. It has nice low action, spot-on intonation, and phenomenal tuning stability. The neck is dead straight, there is zero fret wear, and the electronics and hardware function as-new. I have made a couple of small hardware upgrades on this guitar. I replaced the OEM stamped steel neck screws with some solid stainless steel neck screws. I also installed a fourth tremolo spring to stiffen-up the tremolo a bit. Lastly, I installed a set of aftermarket black Schaller-style strap locks. I’m not sure what brand they are, but I got them from Stratosphere a while back and they work just fine. I will however include the OEM Schecter strap buttons if you would prefer to use those instead. Other than that the guitar is completely stock. I will also include the OEM tremolo arm, the OEM Schecter tool kit, and a fresh Energizer Lithium Ion 9v battery with the sale. The guitar will be carefully packed in the original Schecter carton, and double-boxed for shipping. Please understand that I try my best to capture the condition of the guitar as accurately as possible, but with any used instrument there will always be some minor blemishes that simply don’t show in the photos. All of my photos are taken with a 24mp DSLR camera to provide the highest possible resolution. If you have any questions about condition or anything else please don’t hesitate to ask. I’m always happy to message additional photos if you would like more detailed shots of a specific part of the guitar. Free shipping is to the lower 48 states only. Shipping to Alaska and Hawaii will be charged to the buyer at actual cost. No international bidders please. The guitar will be fully insured and shipped via FedEx Home Delivery, UPS, or USPS. Given the price-point of this item it’s likely the shipper will require a signature at the time of delivery so please plan accordingly. I do my best to ship orders within 24-48 hours as long as payment is received before 8:00PM CST Sunday - Friday. If you place your order on Saturday, your item will be shipped on Monday (unless it's a holiday). Please understand I am not a large EBay retailer, so unfortunately I cannot afford to accept unlimited returns. I do however completely stand-by all of the EBay buyer protections, and I will do everything in my power to ensure you receive the item exactly as described, and you are happy with your purchase. I have lots of 5-star reviews from lots of satisfied buyers, so you can feel confident in your purchase. If you have any questions, or if you need any additional information or photos please don’t hesitate to ask. Thanks for looking! **Reasonable offers considered!**", "ItemID": "173773551547", "EndTime": "2019-02-03T18:03:19.000Z", "StartTime": "2019-02-01T23:50:57.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Schecter-Sun-Valley-Super-Shredder-Electric-Guitar-Matte-Black-/173773551547", "ListingType": "FixedPriceItem", "Location": "Birmingham, Alabama", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1737735515478080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTU0NFg2Njg=/z/5jAAAOSw6CRcVKXb/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTMyNFg2MjY=/z/~nYAAOSwpppcVKXa/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTMxOVg5MzY=/z/GCsAAOSwO-pcVKXe/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTM2M1g5NDQ=/z/BUAAAOSwuHdcVKXf/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODI5WDExMzA=/z/i-AAAOSw4ZVcVKXj/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTI1NFg4OTk=/z/PIcAAOSwh7tcVKXi/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTQ2N1g4ODQ=/z/AZAAAOSwPmBcVKXZ/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/NuIAAOSwMYtcVKXh/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTMzOVg3OTQ=/z/kggAAOSw5pRcVKXk/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5ODI=/z/nHQAAOSwgB5cVKXo/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTUwMlgxNjAw/z/-D0AAOSwnh5cVKXn/$_12.JPG?set_id=880000500F"], "PostalCode": "35205", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "new_orleans_native", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 148, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 489.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 489.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "0***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 14}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Schecter Sun Valley Super Shredder - Electric Guitar (Matte Black)", "ItemSpecifics": {"NameValueList": [{"Name": "Body Material", "Value": ["Mahogany"]}, {"Name": "Brand", "Value": ["Schecter"]}, {"Name": "Model", "Value": ["Sun Valley Super Shredder"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Body Color", "Value": ["Black"]}]}, "HitCount": 92, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}