{"BestOfferEnabled": false, "Description": "This is a like new 2019 Gibson Les Paul Classic Model with 2 awesome sounding Zebra '57 Classic pickups. I am the sole and original owner, having purchased this guitar brand new directly from Sweetwater, which is an authorized Gibson dealer. Original retail price was $2,299, but you can bring her home for much less here. Gibson has been hitting it out of the park with its 2019 guitar line, and this 2019 USA model stands toe to toe with the best instruments in Gibson's long, historic line of iconic guitars. It's just a beautiful, heirloom quality instrument that plays and sounds terrific for just about any style of music - jazz, rock, country - this one has all bases covered. I asked my Sweetwater rep to pick out the lightest and best looking and playing guitar of the whole batch when these came in, and boy did he deliver. This guitar is loud and touch-sensitive, and can go from pristine single coil chime to thick, warm jazz to biting rock and metal and vicious punk snarl - she is simply an extraordinarily versatile axe. I cannot recommend a guitar any more than I do this one - she is an absolute killer! Every knob is a push-pull, controlling coil-split, polarity/out of phase, and pure bypass operations and providing an unbelievable variety of tones. This guitar has been played only by me in my humidity and temperature-controlled basement studio. She is truly pristine - I have reviewed her top to bottom and can't find anything that suggests she has even been played. Please feel free to ask me any questions - I will do my best to answer ASAP. Buyer to prepay via PayPal, and I will ship via UPS Ground within a couple of days, well packed to ensure safe delivery. If you are interested in expedited UPS shipping and are willing to pay my actual cost, I am more than happy to accommodate you - just let me know and we will work it out. I promise a prompt and courteous transaction - please check my feedback and know that I've sold off a small fortune in high-end guitars, and have never once had the slightest bit of negative feedback. Here is the full listing from Sweetwater for this beautiful instrument: Gibson 2019 Les Paul Classic '57 Zebra Sweetwater Exclusive - Heritage Cherry Sunburst The Gibson 2019 Les Paul Classic '57 Zebra Sweetwater Exclusive gives you classic Les Paul sound and looks in a gorgeous instrument with modern weight relief. Two 57 Classic humbuckers with attitude team up with high-performance switching, a classic carved maple top, and a chambered mahogany body to deliver legendary fat, snarling Les Paul tone with epic sustain, chimey reverse-polarity single-coil sounds, and play-all-night comfort. This Les Paul Studio Classic's SlimTaper neck is capped by a silky-smooth rosewood fingerboard with Plek'd frets — an ideal foundation for fleet fingering and comfortable bends. This very special Les Paul Classic is a limited edition and only available at Sweetwater — so you'd better reserve yours now! Legendary tone from 57 Classic humbuckers Tonal excellence is yours when you plug the Gibson 2019 Les Paul Classic '57 Zebra Sweetwater Exclusive into your favorite tube amplifier. Loaded with a pair of 57 Classic Zebra humbucking pickups, each with its own volume and tone controls, you'll be able to dial in chimey country sounds as easily as savagely distorted rock tones. The neck pickup gives you classic, warm hollowbody-style tones for everything from jazz to blues. Flip to the bridge position, and you'll command sounds covering the gamut from bright and clean to raw and mean. Gibson engineered their 57 Classic and 57 Classic Plus humbucker set to capture the warmth, smooth playing dynamics, and overall character of their breakthrough vintage PAF designs. These pickups sport authentic Alnico II magnets and are wound with 42-AWG enamel-coated wire — just like the originals. The coils are wax potted to ward off microphonic squeal, making them perfect for your high-gain excesses. This dynamic duo serves up articulate, warm voicings from the neck position, soaring liquid bridge tones, and a broad range of sweet crunch in between. Additional noise reduction keeps your signal quiet even when you're driving a high-gain rig. Routed through Gibson's high-performance circuit featuring two push/pull volumes which provide coil splitting for single-coil operation, two push/pull tones for polarity and bypass switching, and a 3-way pickup selector toggle switch, the Gibson Les Paul Classic '57 Zebra gives you the tonal mastery to ace any gig or recording session.SlimTaper neck carve and Plek'd frets for optimized playability Comfort and playability were two of Gibson's primary concerns when they were designing the Les Paul Classic '57 Zebra Sweetwater Exclusive. You'll be delighted how this guitar's fast, early-'60s SlimTaper neck profile comfortably fits your hand. For your playing pleasure, the rosewood fingerboard is buffed to silky smoothness and bound so no fret ends impede your dexterity. The frets are dressed to perfection using a Plek Pro machine for optimized playability. Typically reserved for top-dollar custom guitars, this process levels the frets with pinpoint precision, providing you with the most playable fretboard you're likely to own.9-hole weight relief for comfort and sustain Although vintage Les Pauls rocked a solid-mahogany body, they are also infamous for being, shall we say, on the heavy side. The Gibson Les Paul Classic '57 Zebra Sweetwater Exclusive features the classic LP tonewood recipe, but with a twist: a carved maple top over a mahogany body with nine strategically placed chambers. The chambers relieve weight for increased playing comfort while retaining the density needed for the prodigious sustain the Les Paul is famous for. So go ahead and gig all night with this guitar — without having to visit a chiropractor the next day. The Gibson Les Paul Classic '57 Zebra: get it now — only at Sweetwater! Gibson 2019 Les Paul Classic '57 Zebra Sweetwater Exclusive Features: Limited quantities — only available at Sweetwater!Mahogany body with gorgeous figured maple top9-hole weight relief for optimized playing comfortFast 12\"-radius '60s SlimTaper mahogany neckBound rosewood fingerboard with 22 frets and acrylic Trapezoid inlaysPlek'd frets for effortless, precision playabilityHumbucking pickups with Zebra bobbin tops: 57 Classic (neck), 57 Classic + (bridge)Dual push-pull (coil split) volume controlsDual push-pull (pure bypass/polarity) tone controls 3-way toggle pickup selector switchQuality Grover Rotomatic tuners for stable tuningHardshell case included Full Tech Specs: Body Type: Solidbody, 9-hole weight relief Body Shape: Les Paul Left-/Right-handed: Right-handed Number of Strings: 6 Body Material: Mahogany Top Material: Maple Body Finish: Nitrocellulose Lacquer Color: Heritage Cherry Sunburst Neck Material: Mahogany Neck Shape: '60s Slim Taper Radius: 12\" Fingerboard Material: Rosewood Fingerboard Inlay: Acrylic Trapezoids Number of Frets: 22, Low Scale Length: 24.75\" Nut Width: 1.695\" Nut Material: Tektoid Bridge/Tailpiece: Wireless ABR-1 with Aluminum Stopbar Tuners: Grover Rotomatics Neck Pickup: '57 Classic Plus Zebra Humbucker Bridge Pickup: '57 Classic Plus Zebra Humbucker Controls: 2 x volume (push/pull coil-tap), 2 x tone (push/pull pure bypass, phase), 3-way toggle pickup switch Strings: 10s Case Included: Hardshell Case Manufacturer Part Number: LPCS5719HSNH3 Thanks for looking, and good luck - this one is hard for me to part with, but I really need the funds!", "ItemID": "183509994278", "EndTime": "2018-10-30T23:02:20.000Z", "StartTime": "2018-10-30T00:00:00.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-2019-Les-Paul-Classic-Sweetwater-Exclusive-57-Classic-Pickups-Coil-Split-/183509994278", "ListingType": "Chinese", "Location": "Parsippany, New Jersey", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1835099942788080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NzY4WDEwMjQ=/z/vw0AAOSwGmZb13jY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzY4WDEwMjQ=/z/H48AAOSwJ2pb13jT/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzY4WDEwMjQ=/z/TsgAAOSwKO5b13jP/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzY4WDEwMjQ=/z/ojUAAOSwTHtb13jR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzY4WDEwMjQ=/z/smMAAOSwl5Jb13jV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzY4WDEwMjQ=/z/FnoAAOSwbKdb13je/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzY4WDEwMjQ=/z/uU8AAOSw5qdb13ja/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAyNFg3Njg=/z/hCwAAOSw3T5b13jc/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAyNFg3Njg=/z/LUYAAOSw--xb13jh/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAyNFg3Njg=/z/amMAAOSw1KRb13jj/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzY4WDEwMjQ=/z/qbcAAOSwl3xb13jm/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzY4WDEwMjQ=/z/XBIAAOSwc1Zb13jo/$_57.JPG?set_id=8800005007"], "PostalCode": "07054", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "asg618", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 323, "PositiveFeedbackPercent": 100.0}, "BidCount": 2, "ConvertedCurrentPrice": {"Value": 1425.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1425.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "x***1", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 573}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson 2019 Les Paul Classic Sweetwater Exclusive-57 Classic Pickups +Coil Split", "ItemSpecifics": {"NameValueList": [{"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Body Color", "Value": ["Heritage Cherry Sunburst"]}, {"Name": "Model Year", "Value": ["2019"]}]}, "HitCount": 78, "Subtitle": "Original Hardshell Case + Case Candy + All docs", "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 1450.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Excellent, like new", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}