{"BestOfferEnabled": false, "Description": "MIJ, made in japan, Gibson, Lespaul, White, SG, Höfner, Duesenberg, Ibanez, ATELIER Z, ARIA, ESP, Caparison, Killer, COMBAT GUITARS, GUYATONE, Greco, Sugi Guitars, TEISCO, DEVISERA, Nil, Bacchus, VANZANDT, Fernandes, Fender Japan, Fujigen, MOON GUITARS, momose, Yairi Guitar, YAMAHA, TOKAI, Zemaitis, VOX, B, C, Rich, Epiphone, Gibson, Gretsch, Suhr, Schecter, Charvel, Jackson, Dean, Tom Anderson, Fender, Paul Reed Smith, Melancon, Mosrite, Rickenbacker, Robert Benedetto, Washburn, Ibanez, kramer, EDWARDS, Burny, Grassroots, 1977 Westminster EG-400R MATSUMOKU Factory ~ All Original ~ Very Good+ condition.Made in Japan Down from here, Photo is dent and scratches etc.. About scratches that are hard to see. To make it easy to understand the condition of the scratches, I lighted the light strongly. 1977 Westminster EG-400R MATSUMOKU Factory ~ All Original ~ Very Good+ condition.Made in Japan Body Birch. Semi hollow. Neck Maple. Frets 22F. Scale 24.75inch (628mm) Gibson Medium Scale. Nut Width About 1.69 inch (43mm). Pickup Greco Original. Control 2 Volume, 2 Tone, 3-Way PU Toggle switch. It is wired in electronic circuit boards. The Capacitor has been changed to the Orange-Drop. Bridge Tune O Machic. Stop Tailpiece. Bridge Tune O Machic. Stop Tailpiece. Machine Heads Original. Color Sunburst. Weight About 8.38 Pound ( 3.8 Kg ). This is Used Guitar. The Capacitor has been changed to the Orange-Drop. Output jack plate is cracked a bit. There are scratches and dents. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. Westminster is in another Greco brand. When I got it, I felt Aria proII and Greco. That is natural. Because, very old Aria proII and very old Greco made by Matsumoku. It was manufactured in 1977 by MATSUMOKU guitar factory. This guitar is Semi-hollow body. Remove the electric plug, it natural sound is very loud. Old japanese guitar used good wood. It has a beautiful gloss and it looks like luxury furniture. It is bolt on neck, but it is made very polite. About guitar play, Current state, the space between the strings and the frets is standard. This Westminster is Semi Hollow body. Therefore Un pluged sound is very loud. You can feel vibrations transmitted to the body. And, the thickness of the body is 44mm and it is thin. You will be able to move actively on the stage. I feel the good Over drive and Clean sound. I do not recommend to Heavy Metal music. It is cleanliness. I polished with guitar exclusive polish, so it is in a very clean state. I after the finger board cleaning, painted beeswax. The aim is moisturizing and and protection. Current neck condition, very good ! roughly straight ! There is no problem with the Truss rod and it can be adjusted. Remaining the frets are 85% on average. You can play immediately after it is delivered to you. All is working well. It is in a very good condition. The Truss rod Wrench is not included. All Original.Note : The Capacitor has been changed to the Orange-Drop. Look at the photos, please verify by yourself! It will be professionally pack. Double air packing. And ships inside a sturdy cardboard box. This electric guitar is USED. Please consider it when bidding. Thank you. Payment I accept PayPal only. Please pay within 3 days after the auction closed. Shipping Worldwide shipping from Japan! EMS / Shipping includes a tracking number. / / / Destination cost Delivery time / / / Asia : $1004 ~ 7daysUS Canada : $1205 ~ 8 daysEurope : $1406 ~ 10 daysOceania : $1205 ~ 8 daysSouth America : $2408 ~ 12 days This item is shipped within 3 business days after payment is confirmed. Terms of Sale International buyers - Please Note: Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer's responsibility. Please check with your country's customs office to determine what these additional costs will be prior to bidding/buying. These charges are normally collected by the delivering freight (shipping) company or when you pick the item up -do not confuse them for additional shipping charges. Please contact us first with 30 working days for any returns, Buyer pays shipping cost from buyer's country to Japan when being returned. In case of return, the shipping cost won't be refunded. We sell various kinds of Electric guitars to international customers. Our goal is to provide the best quality products and service and your satisfaction is the most important to us. Happy bidding!! Thank you !!", "ItemID": "253948950309", "EndTime": "2018-11-01T04:00:14.000Z", "StartTime": "2018-10-25T04:00:14.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1977-Westminster-EG-400R-MATSUMOKU-All-Original-Made-Japan-/253948950309", "ListingType": "Chinese", "Location": "Nagoya-shi,Kita-ku, Aichi", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/2539489503098080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/OQYAAOSwpw5b0SYy/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/NacAAOSwoW1b0SYw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE2MFgxNjAw/z/t~wAAOSwCgNb0SYn/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/SHIAAOSwhhlb0SYy/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNTk5/z/HS8AAOSwb-Rb0SYj/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/aNMAAOSw5atb0SY7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI5OVgxNjAw/z/-3kAAOSwP6pb0SZB/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/NlwAAOSwE8Vb0SZc/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/sAMAAOSwv6Fb0SZc/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg2MDU=/z/-kwAAOSwSVdb0SY2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/JWYAAOSwjq9b0SZz/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ0OFgxNjAw/z/sbQAAOSwiJhb0SaC/$_57.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jguitar-shop", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 369, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 198.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 198.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "v***v", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 767}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Americas", "Europe", "Asia", "AU"], "Site": "US", "TimeLeft": "PT0S", "Title": "1977 Westminster EG-400R. MATSUMOKU. All Original. Made in Japan.", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Westminster"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Exact Year", "Value": ["1977"]}, {"Name": "Series", "Value": ["Original"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "MPN", "Value": ["J770630"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Body Type", "Value": ["Semi-Hollow"]}, {"Name": "Body Color", "Value": ["Sunburst"]}, {"Name": "Model", "Value": ["EG-400R"]}, {"Name": "Model Year", "Value": ["1977"]}, {"Name": "Modified Item", "Value": ["Yes"]}, {"Name": "Modification Description", "Value": ["The Capacitor has been changed to the Orange-Drop."]}]}, "HitCount": 454, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "JP", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 200.5, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["APO/FPO", "Africa"], "GlobalShipping": false, "ConditionDescription": "Very Good+ Condition. This is Used Electric Guitar. The electric guitar when connect to the amplifier, sound output is normal. There are scratches and Dents. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. Please Read the descriptions for details.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}