{"BestOfferEnabled": false, "Description": "Fernandes Electric Guitar w/ FRT Tremolo System (Black) Condition: Fernandes Electric Guitar w/ FRT Tremolo System (Black) Item appears to be in working order with no abuse damage or broken pieces. Some residue and dust from previous use and storage but no visible damage. Good used condition, with some scuffs and scratches. Headstock has some minor dings and dents. Tuners, nut, neck, fretboard, and bridge are all in good condition. Neck appears to be straight and action is even. New strings will be required, and there is no case included. We do not know the country of origin for this guitar. Please see pictures for damage or details. Has not been extensively tested - please bid accordingly. Includes only what is pictured. Measurements: 34 x 14 x 3 Notes: Please see photos for additional detail and feel free to ask questions. Store: G8 Our customer's satisfaction is our top priority. In the event you experience any problems with your order, please contact us prior to leaving a negative or neutral feedback and we'll be sure to offer a speedy resolution to any issues that may arise. PAYMENTS Paypal is the only method of Payment we accept. No exceptions can be made. Payment must be received within 3 days of the auction's end. This also applies to combined orders. Please note that unpaid item cases are automated to open after 3 days without payment. Once they open, eBay allows an additional 3 days for you to pay, which will close the case with no penalty to your account. SHIPPING We offer combined shipping as long as the items will ship safely together. Auctions must end within 3 days of each other to be eligible for combined shipping. Please hold off on payment until all auctions have ended, then proceed to checkout - the invoice should be automatically adjusted by eBay now. Please do not pay for any items individually if you wish to have them combined - they must be paid at the same time. Any item sold by the Seattle Goodwill is eligible for local pick up at our warehouse. Please note that we are unable to accept cash or credit cards at our location. Your item(s) will be available the day after payment is submitted though PayPal. We are open for pickup from 10 am to 6 pm, Monday through Friday, and 10 am to 3:30 pm on Saturday and Sunday. Items or lots being shipped within flat-rate boxes cannot be combined with other items. Local pick up items must be claimed within 7 days or the item may be refunded / relisted. APO & PO Box addresses will require USPS shipments, as Fed Ex ground will not deliver. If Fed Ex is selected, we may need to invoice for additional shipping costs. INTERNATIONAL BIDDERS We do not ship to the following locations: Africa, South America, Central America, Mexico and Asia (except Japan). Please note that we cannot accept payment from Singapore due to PayPal regulations regarding foreign charity donations. We ship internationally to Europe, United Kingdom, Japan, Australia, New Zealand, and Canada. Customers from New Zealand will need to email prior to bidding to be added to the list of approved bidders. Import duties, taxes and charges are not included in the item price or shipping charge. These charges are the buyer's responsibility. We do not mark merchandise values below value or mark items as \"gifts\", as US and International government regulations prohibit such behavior. APO addresses will require USPS shipments, as Fed Ex ground will not deliver. SEATTLE GOODWILL'S MISSION:Goodwill® provides quality, effective employment training and basic education to individuals experiencing significant barriers to economic opportunity. Donations of quality reusable items from the public are sold in our retail stores and our online eBay store. Net proceeds from the sale of these goods and financial donations from the community make it possible for us to operate our free job training programs. Your donations and purchases help support these important programs and make the community a better place for all of us. Because Jobs Change Lives!To find out more about us and our great job training programs please visit our eBay About Me page. Powered by SixBit's eCommerce Solution", "ItemID": "401673319916", "EndTime": "2019-01-02T19:03:59.000Z", "StartTime": "2018-12-26T19:03:59.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fernandes-Electric-Guitar-w-FRT-Tremolo-System-Black-/401673319916", "ListingType": "Chinese", "Location": "Seattle, Washington", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/4016733199168080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/ODAyWDE2MDA=/z/6~kAAOSw1qhcI9Be/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/vBAAAOSw0TBcI9Bg/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/YV0AAOSwLKhcI9Bi/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/yzwAAOSwl7dcI9Bl/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/bmwAAOSwqkRcI9Bo/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/fTgAAOSw6~pcI9Br/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/KwEAAOSwohVcI9Bu/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/5RMAAOSwtINcI9Bx/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/lh4AAOSwXMxcI9B0/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/CsUAAOSwhhlcI9B2/$_57.JPG?set_id=880000500F"], "PostalCode": "98144", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "seattlegoodwill", "FeedbackRatingStar": "RedShooting", "FeedbackScore": 204666, "PositiveFeedbackPercent": 99.3}, "BidCount": 33, "ConvertedCurrentPrice": {"Value": 116.37, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 116.37, "CurrencyID": "USD"}, "HighBidder": {"UserID": "r***o", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 589}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Fernandes Electric Guitar w/ FRT Tremolo System (Black)", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fernandes"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "Body Material", "Value": ["Acrylic"]}, {"Name": "UPC", "Value": ["Does Not Apply"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}]}, "HitCount": 694, "PrimaryCategoryIDPath": "619:3858:33034", "Charity": {"CharityID": "3662", "CharityName": "Seattle Goodwill", "CharityNumber": 1052, "DonationPercent": 100.0, "Mission": "Through free adult basic education and job training programs, Seattle Goodwill helps individuals build new lives and make positive contributions to their families and community.", "LogoURL": "https://i.ebayimg.com/00/s/MTIwWDQ0NQ==/z/yyYAAOSww9xZCu38/$_1.JPG?set_id=8800005007", "Status": "Valid"}, "Storefront": {"StoreURL": "https://stores.ebay.com/id=57338117", "StoreName": "Seattle Goodwill"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "14 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 118.87, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Central America and Caribbean", "Middle East", "Southeast Asia", "South America", "RU", "BY", "LV", "RS", "SK", "SI", "UA", "BM", "GL", "MX", "PM", "AF", "AM", "AZ", "BD", "BT", "CN", "GE", "IN", "KZ", "KR", "KG", "MV", "MN", "NP", "PK", "LK", "TJ", "TM", "UZ", "AS", "CK", "FJ", "PF", "GU", "KI", "MH", "FM", "NR", "NC", "NU", "PW", "PG", "SB", "TO", "TV", "VU", "WF", "WS"], "GlobalShipping": false, "ConditionDescription": "Previously owned.", "QuantitySoldByPickupInStore": 0, "SKU": "PW/SK", "NewBestOffer": false}