{"BestOfferEnabled": false, "Description": "Powered by Frooition Pro Shop Search 1989 Fender Stratocaster Plus Electric Guitar - Blue Pearl Burst w/ OHSC - USA Click here to view full size. Full Size ImageClick to close full size. Item Description 1989 Fender American Plus Stratocaster Electric Guitar in very good condition. The guitar has some smaller, light dings and scratches on the front. The back and edges also have scratches and dings. (PLEASE SEE PICTURES). Beautiful and not too common Blue Pearl Burst finish with a white pickguard and chrome hardware. The guitar has a nice action and the \"C\" profile one piece maple necks has a great feel. The 87-89 neck profiles had a great degree of variance and this neck is one of the thinner varieties. The fretboard has a 9.5\" radius and is 1.687\" at the nut. The frets are in very good condition with very light grooving under the plain strings in the first position. The 2 Fender Silver Lace Sensor pickups in the neck and middle with a Blue Lace Sensor in the bridge have a good tone and output. The TBX tone circuit lets you get the most of these pickups. The guitar is equipped with a Wilkinson roller nut, locking tuners and Trem-Setter bridge stabilizer(currently the bridge is pulled down to the body). This guitar looks, sounds and plays great. Includes the Fender hard shell case, tremolo arm and strap. Serial Number: E910749 Weight: 8 lbs. 5 oz. About Us Payment Shipping Terms Returns About UsWe offer a large selection of quality pre-owned musical instruments and equipment from the industries finest manufactures including Akai, Ampeg, Boss, Denon, Digidesign, DigiTech, Epiphone, Fender, Gibson, Gretsch, Guild, Ibanez, Korg, Lexicon, Line 6, Mackie, Mesa Boogie, Marshall, Martin, MusicMan, MXR, Neumann, Peavey, Pioneer, PRS, Roland, Shure, Tascam, Taylor, TC Electronic and Yamaha. New gear arrives daily so check our store often. Lighthouse Sound, Inc. is proud to be an authorized dealer of the following brands of guitar effects pedals, pedal boards, amplifiers and accessories: Bearfoot FX, Bigsby, Cooper Stands, Dunlop, Earthquaker Devices, Ernie Ball, EVH, Fender Accessories, Keeley Electronics, Gretsch Accessories, Ken Smith Strings, Lava Cable, Martin Accessories, Mojo Hand FX, RotoSound, SnaKe Oil Strings, Snark Tuners, Suhr Guitars, Amps, Pedals and Pickups, Voodoo Lab and Wampler Pedals About Us Payment Shipping Terms Returns PaymentWe accept PayPal payments. All major Credit Cards are accepted through PayPal including Master Card, Visa, American Express and Discover. About Us Payment Shipping Terms Returns ShippingLighthouse Sound specializes in prompt, safe shipping. We take great care packaging every item to ensure safe shipment to you. We get your gear to you fast, most orders ship within 1 business day of payment clearance. Tracking information is uploaded to eBay and can be viewed from your eBay account. International customers are responsible for any duties, taxes, brokerage or other fees. Please check with your country's customs office to determine what these additional costs will be. These fees vary from country to country and we have no way to calculate them. About Us Payment Shipping Terms Returns TermsSales Tax - 7 % Ohio Sales Tax will be added to the total amount for all purchases delivered to Ohio. We take pride in our customer service and your satisfaction is very important to us. In the rare event that you have a problem with your item please contact us and we'll be happy to help. While all care is taken, any errors, omissions or variations in the item details are unintentional. About Us Payment Shipping Terms Returns ReturnsWe offer a 14 day return policy. Items must be returned to us within 14 days of the original delivery date. We ask that you please return the product in the original product packaging along with all included materials (manual, warranty card, all accessories) and in the original condition that it was received. Buyer is responsible for return shipping and insurance cost. Refunds will be issued upon return of the item less the original shipping charge and a 15% restocking fee will apply. Helpful Links More Items! This listing is currently undergoing maintenance, we apologize for any inconvenience caused. Powered by SixBit's eCommerce Solution", "ItemID": "233073508234", "EndTime": "2019-01-03T22:29:42.000Z", "StartTime": "2018-12-29T17:34:14.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1989-Fender-Stratocaster-Plus-Electric-Guitar-Blue-Pearl-Burst-w-OHSC-USA-/233073508234", "ListingType": "FixedPriceItem", "Location": "Salem, Ohio", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2330735082348080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/zs8AAOSwPg9cC~PM/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/ykkAAOSwnCdcC~PP/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/EjsAAOSwG49cC~Pl/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/L9IAAOSwVP5cC~Pq/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/ekUAAOSwpudcC~PR/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/lqoAAOSwznxcC~PU/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/SSQAAOSwhY9cC~PW/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/uQkAAOSwIddcC~PZ/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/SQwAAOSwe9VcC~Pe/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/K20AAOSwj91cC~Pb/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/xj4AAOSw6dhcC~Pg/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/YvIAAOSwWrxcC~Pi/$_57.JPG?set_id=880000500F"], "PostalCode": "44460", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "lighthouse_sound", "FeedbackRatingStar": "TurquoiseShooting", "FeedbackScore": 33092, "PositiveFeedbackPercent": 99.6, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1099.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1099.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "u***m", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 0}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "CA", "GB", "DK", "RO", "SK", "BG", "CZ", "FI", "HU", "LV", "LT", "MT", "EE", "AU", "GR", "PT", "CY", "SI", "JP", "CN", "SE", "KR", "ID", "TW", "TH", "BE", "FR", "HK", "IE", "NL", "PL", "ES", "IT", "DE", "AT", "BS", "IL", "MX", "NZ", "SG", "CH", "NO", "SA", "UA", "AE", "QA", "KW", "BH", "HR", "MY", "CO", "PA", "JM", "BB", "BD", "BM", "BN", "BO", "EG", "GF", "GG", "GI", "GP", "IS", "JE", "JO", "KH", "KY", "LI", "LK", "LU", "MC", "MO", "MQ", "MV", "NI", "OM", "PK", "PY", "RE"], "Site": "US", "TimeLeft": "PT0S", "Title": "1989 Fender Stratocaster Plus Electric Guitar - Blue Pearl Burst w/ OHSC - USA", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Model", "Value": ["Stratocaster Plus"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Color", "Value": ["Blue Pearl Burst"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Model Year", "Value": ["1989"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}]}, "HitCount": 116, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=22579709", "StoreName": "LHSound"}, "Country": "US", "ReturnPolicy": {"Refund": "Money back or replacement (buyer's choice)", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": true, "QuantitySoldByPickupInStore": 0, "SKU": "43414", "NewBestOffer": false}