{"BestOfferEnabled": false, "Description": "Squier by Fender J Mascis JazzMaster Electric Guitar w/ Fender Hard Case! Squier by Fender Jazz Master Guitar is in VERY GOOD Pre-Owned Cosmetic & Working Condition. Electric Guitar has general wear and tear, but nothing major. We do see minor scratches on the body. Electric Guitar has been tested and is fully functional. It appears to have only been used a Handful of times, and even then VERY Lightly Played!We are including a Fender Hard Case as well.Overall VERY GOOD Condition! (Please See Images for More Info) **If you have any more questions, or would like close up photos do not hesitate to ask! We are more than happy to help (: ** NOTE TO BUYERS!!! Everything shown in the photographs provided is what is included in the auction, unless otherwise stated. If you do not see it, It is NOT included unless otherwise stated in listing description. If you are not sure about something, ASK US! We are more than happy to assist you. PAYMENT REMINDERS:Buyers have 6 days to pay for their item(s) unless otherwise communicated... Unless otherwise communicated between the buyer and the seller; After two days of not receiving payment, a Payment Reminder/Case will be sent to the buyer. Sending a reminder/case DOES NOT HURT YOUR ACCOUNT and/or SCORE. The buyer will then have four additional days to pay for their item(s). If after six days the buyer has not paid for their item(s) or communicated with the buyer for extensions, the transaction will be canceled. HAVING THE ITEM(S) TRANSACTION CANCELLED WITH NO COMMUNICATION CAN HURT YOUR ACCOUNT/SCORE, so PLEASE COMMUNICATE. PLEASE UNDERSTAND THAT THIS IS A WAY TO KEEP ITEMS FLOWING MAKING BUYING AND BIDDING ON ITEMS FAIR FOR ALL OF OUR CUSTOMERS. We understand unexpected situations may come up; Please feel free to communicate with us and we will try our best to work with you. Our goal is to make sure that our customers leave 100% Satisfied. Thank you for your understanding. FOR LOCAL PICK UP PLEASE CONTACT US AT AZUSA PAWN FOR FURTHER INFORMATION REGARDING OUR LOCATION AND HOURS OF OPERATION. We ship ONLY to addresses provided by Ebay & Paypal - Entering a different address at checkout will not get your item shipped - RETURNING OF ACCURATELY DESCRIBED ITEMS:If a listing's information is accurate to the item being purchased (a.k.a. the buyer knew exactly what they were purchasing),the buyer will not receive a refund for their original shipping fees. We offer International Shipping; however, ADDITIONAL CUSTOMS CHARGES MAY APPLY! WE ARE NOT AFFILIATED WITH ANY CUSTOMS OFFICEAND ARE NOT RESPONSIBLE FOR ADDITIONAL CHARGES YOU MAY RECEIVE.WE SUGGEST CONTACTING YOUR LOCAL CUSTOMS OFFICE FOR ADDITIONAL FEES BEFORE PURCHASE. We ONLY ship via USPS Express Mail International UNLESS otherwise stated. This is to protect us as sellers and your purchased items as buyers. With this shipping method, we can track the package not just to customs, but to its final destination as well. The package is then delivered in a timely manner with no confusion of it being lost. - We will NOT write off your item as a Gift / Lower declared value - BATTERIES CAN NO LONGER BE SHIPPED INTERNATIONALLY. IF AN ITEM IS PURCHASED FOR INTERNATIONAL SHIPPING, THE BATTERY/BATTERIES WILL BE REMOVED. WE WILL NOT GIVE ANY PARTIAL REFUNDS FOR BATTERIES NOT BEING INCLUDED.IF YOU WOULD LIKE THE BATTERY/BATTERIES SHIPPING WITHIN THE UNITED STATES, ADDITIONAL SHIPPING FEES MAY APPLY. California Orders are subject to sales tax of 9% We do encourage Local Pickup if you are around the area, Let us know if you are the Auction's highest bidder & you would like to do local pickup. There is a 1 Day handling period on all packages.", "ItemID": "292792733227", "EndTime": "2018-11-02T23:17:33.000Z", "StartTime": "2018-10-28T23:17:33.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Squier-Fender-J-Mascis-JazzMaster-Electric-Guitar-w-Fender-Hard-Case-/292792733227", "ListingType": "Chinese", "Location": "Azusa, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2927927332278080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxNDk3/z/orQAAOSwrGlb1kL-/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/ws0AAOSwzcNb1kME/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/PuQAAOSwAPtb1kMK/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/1xcAAOSwE9pb1kMP/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/-pUAAOSw831b1kMU/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/pL4AAOSwhZ5b1kMZ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/insAAOSwVFJb1kMf/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/aJQAAOSwuMRb1kMk/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/LtYAAOSwRYNb1kMq/$_57.JPG?set_id=8800005007"], "PostalCode": "91702", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "azusapawn1", "FeedbackRatingStar": "Red", "FeedbackScore": 4539, "PositiveFeedbackPercent": 98.7, "TopRatedSeller": true}, "BidCount": 11, "ConvertedCurrentPrice": {"Value": 347.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 347.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "h***a", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 204}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Squier by Fender J Mascis JazzMaster Electric Guitar w/ Fender Hard Case!", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Cream"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Brand", "Value": ["Squier"]}, {"Name": "Model", "Value": ["J Mascis"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Type", "Value": ["Jazz"]}]}, "HitCount": 338, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1066872756", "StoreName": "azusapawn1"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 352.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "SKU": "B135", "NewBestOffer": false}