{"BestOfferEnabled": true, "Description": "48-Hour Risk Free Returns (Stringed Instruments Only)- If you’re not 100% satisfied with your purchase, contact Moore Guitars within 48 hours of receiving and we’ll pay your return shipping and issue a full refund once received! Free Shipping is via FedEx Ground, signature required. Contact Moore Guitars for expedited shipping options and pricing. Authorized dealer for Paul Reed Smith, Mesa Boogie, Breedlove, Taylor, Fender, Ibanez, Reverend, and much more! Moore Guitars has been a destination guitar shop in Southern Indiana for over 40 years! Recently, Moore Guitars has grown into an incredible new retail showroom and has become an international powerhouse with our world class website. In December of 2016, Guitar World Magazine featured Moore Guitars as one of the coolest guitar shops in America. We are proud to be a Top 10 Dealer for Paul Reed Smith Guitars, and have been since we became a dealer in 2013. We are a Breedlove Distinctive Dealer, and have been honored by Mesa Boogie with their Mark of Excellence designation. Our staff is friendly and knowledgeable, and customer service is priority #1. We’re your new favorite guitar shop…but don’t just take our word for it, let us prove it! Disclaimer- Specs and features listed may not always be 100% accurate, but were the best available to us at the time of listing. Questions?Please reach our guitar experts by clicking \"Contact Seller\"Thanks! Pictures Are Of Actual Guitar!Serial Number: EJ20341Color: Vintage White Weight: 7lbsSome surface scratches on the guitar. Plays great! Fender Eric Johnson Thinline Stratocaster USED Bringing to life the vision of one of the most respected guitarists in the world, the Eric Johnson Signature Stratocaster Thinline is the perfect marriage between a semi-hollow body and a traditional Stratocaster. Johnson is famous in guitar circles for questing for his ideal tone—liquid and articulate, it perfectly complements the playing style that earned his place in the modern guitar pantheon. In 2015 he approached us to co-design a lightweight, resonant instrument that combines the tones of his favorite semi-hollowbody guitars and his Stratocaster. Two years later, we hit the formula for tonal nirvana with the Eric Johnson Signature Stratocaster Thinline. Specifications Body Material: Semi-Hollow Alder Body Finish: Gloss Nitrocellulose Lacquer Body Shape: Stratocaster® Neck Material: Maple Neck Finish: Gloss Nitrocellulose Lacquer Neck Shape: Soft \"V\" Scale Length: 25.5\" (648 mm) Fingerboard Material: Maple Fingerboard Radius: 12\" (305 mm) Number of Frets: 21 Fret Size: Medium Jumbo Nut Material: Bone Nut Width: 1.650\" (42 mm) Position Inlays: Black Dots Truss Rod: Vintage-Style Truss Rod Nut: Vintage-Style Slotted Bridge Pickup: Specially Voiced Eric Johnson Single-Coil with Countersunk Mounting Screws Middle Pickup: Specially Voiced Eric Johnson Single-Coil with Countersunk Mounting Screws Neck Pickup: Specially Voiced Eric Johnson Single-Coil with Countersunk Mounting Screws Controls: Master Volume, Tone 1. (Neck Pickup), Tone 2. (Bridge Pickup) Switching: 5-Position Blade: Position 1. Bridge Pickup, Position 2. Bridge and Middle Pickup, Position 3. Middle Pickup, Position 4. Middle and Neck Pickup, Position 5. Neck Pickup Configuration: SSS Bridge: 6-Saddle Vintage-Style Synchronized Tremolo Hardware Finish: Nickel/Chrome Tuning Machines: Vintage-Style Staggered Pickguard: 1-Ply Parchment Control Knobs: Aged White Switch Tip: Aged White Neck Plate: 4-Bolt Strings: Fender® USA, NPS, (.010-.046 Gauges) Legal Notice: Product Prices, Features, Specifications and Availability Are Subject To Change Without Notice Case/Gig Bag: Deluxe Blonde Hardshell with Black Ends (Black Interior)", "ItemID": "183618987341", "EndTime": "2019-01-17T13:53:47.000Z", "StartTime": "2019-01-03T15:27:31.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fender-Eric-Johnson-Thinline-Stratocaster-Vintage-White-W-OHSC-0341-USED-/183618987341", "ListingType": "FixedPriceItem", "Location": "Evansville, Indiana", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1836189873418080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/Gs4AAOSwaiBcLikj/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/HeMAAOSwOWdcLikx/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/L3EAAOSw6IdcLikl/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/69oAAOSwsftcLikv/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/PfQAAOSwt~1cLikn/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/Fw0AAOSwhfRcLiky/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/AC0AAOSwQZdcLikt/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/tokAAOSwt0dcLikr/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/hSEAAOSwFZZcLikp/$_57.JPG?set_id=8800005007"], "PostalCode": "47715", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mooremusicguitars", "FeedbackRatingStar": "Purple", "FeedbackScore": 963, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1499.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1499.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "4***g", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 983}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Fender Eric Johnson Thinline Stratocaster Vintage White W/OHSC 0341 USED", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "Model", "Value": ["Eric Johnson Thinline Stratocaster"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}]}, "HitCount": 109, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1136907122", "StoreName": "Moore Music Guitars"}, "Country": "US", "ReturnPolicy": {"Refund": "Money back or replacement (buyer's choice)", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 0, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}