{"BestOfferEnabled": true, "Description": "CAPCITYOUTLET IBANEZ RG160B RIGHT HANDED ELECTRIC GUITAR FREE SHIPPING Description: ELECTRIC GUITAR: IBANEZ MODEL RG160B, 6 STRING, RIGHT HANDED Details Additional Details for eCommerceNOT APPLICABLE Musical Instrument Condition Rating85% - Good - Item in Good Working Order, but Has Some Visual Imperfections Instrument Appearance90% - Very Good Condition : Basically Clean, might have some deeper scratches, pick wear or missing finish. Nothing real serious, no cracks, or other flaws. Knobs - Tuners - Electronics - Input Jack85% - Guitar shows wear - All original - Scratches and chips maybe present - Controls show normal use and are in working condition - Discoloration maybe present. Musical Instrument CaseNot Included Number of Strings6 STRING Country of ManufactureMade in Korea Body StyleNOT SPECIFED DexterityRight Handed Notes: PLEASE DO VIEW ALL PICTURES LISTED FOR THIS ITEM. THIS COMES WITH EVERYTHING PICTURED; NO MORE, NO LESS. FEEL FREE TO ASK ANY QUESTIONS. Payment PayPal is the ONLY online payment method we accept at this time. Your PayPal account must be a Verified U.S. PayPal Account. We also recommend that you use a Confirmed Ship To Address. Shipping Your item will be shipped within 1 business day(s). After shipping your items will be delivered within 1-10 business days. Terms of Sale Tax applies in: KS About Us If your shipping address is outside of the continental U.S. (i.e. Puerto Rico, Alaska, Hawaii etc.) we may require an additional surcharge or shipping fee in order to process the package. Any and all address discrepancies could cause an order cancellation if we don't receive a response within 24 hours. We have sold great used and new merchandise on eBay since 2001. We have a wide range of merchandise available for every customer, and with the holidays around the corner your loved ones as well!High end automotive tools, digital cameras, video game consoles, rare DVDs, musical instruments from saxes to drum kits, collectibles, and so many other things its impossible to list it all! We take each of these items from our retail locations throughout Kansas to our warehouse and carefully inspect, test, and clean each item before it is photographed. Once photographed and put up on eBay, we wait for a customer to scoop up our excellent deals and then we ship it out from our warehouse. Bravo Store Systems Point-of-Sale Operating System Bravo Omni-Commerce solutions offers Brick & Mortar stores the only fully integrated eBay API that seamlessly & effortlessly combines the in-store Point-of-Sale to all eBay commerce selling activities. Click here & find out why eBay stated \"Bravo has best solved Brick & Mortars can sell on eBay\"", "ItemID": "372578040387", "EndTime": "2019-02-22T22:08:01.000Z", "StartTime": "2019-01-24T20:05:40.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/IBANEZ-RG160B-RIGHT-HANDED-ELECTRIC-GUITAR-FREE-SHIPPING-ST5022062-/372578040387", "ListingType": "FixedPriceItem", "Location": "Hutchinson, Kansas", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/3725780403878080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NDUwWDgwMA==/z/qooAAOSwkHxcShqR/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDQ1MA==/z/a0MAAOSw90NcShqR/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/NDUwWDgwMA==/z/uUkAAOSwH4dcShqR/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/NDUwWDgwMA==/z/0KYAAOSwGplcShqS/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDQ1MA==/z/sucAAOSwYV5cShqS/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/NDUwWDgwMA==/z/IGEAAOSwiwZcShqS/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/NDUwWDgwMA==/z/PV4AAOSws0pcShqS/$_1.JPG?set_id=2"], "PostalCode": "67501", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "capcityoutlet", "FeedbackRatingStar": "TurquoiseShooting", "FeedbackScore": 43038, "PositiveFeedbackPercent": 99.7, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 149.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 149.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "e***e", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 6}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "IBANEZ RG160B RIGHT HANDED ELECTRIC GUITAR FREE SHIPPING (ST5022062)", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Ibanez"]}, {"Name": "Model", "Value": ["RG160B"]}]}, "HitCount": 335, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=27462389", "StoreName": "capcityoutlet"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["RU", "PO Box"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}