{"BestOfferEnabled": true, "Description": "Up for consideration is this Epiphone Bluehawk Deluxe electric guitar. It is pre-owned and does have some cosmetic wear, but it is in good, playing condition. This guitar is regularly inspected by our in-house guitar tech(s). This is a “MIRC” used guitar and is in great, clean condition. Details pulled off of Epiphone's website: \"Body Mahogany with contoured backTop Maple with AAA Flame Maple VeneerNeck MahoganyNeck Shape SlimTaper™ D-shapedJoint Glued-inTruss Rod AdjustableScale 25.5\"Fretboard pearloid \"Diamond\" inlaysRadius 12\"Frets 22 medium jumboBridge Pickup Epiphone P-90T PRO™ Single CoilMiddle Pickup Hum-cancelling “dummy\" coil mounting between pickups inside bodyNeck Pickup Epipohone P-90R PRO™ Single CoilControls -Master Volume-Master Tone with VariTone™ True Bypass6-position Rotary VariTone™ - Position-1: No Effect- Position-2: -5dB at 1875Hz- Position-3: -6dB at 1090Hz- Position-4: -7dB at 650Hz- Position-5: -10dB at 350Hz- Position-6: -14dB at 130HzBridge Nighthawk fully-adjustable and String-Thru bodyNut Width 1.68\"Hardware NickelBinding Body and FingerboardMachine Heads Epiphone \"Deluxe\" 18:1 RatioColor Finishes Midnight Sapphire, Translucent Black, and Wine Red\"Please read the entire item description and examine all of the pictures carefully before buying. If you have any questions, please feel free to ask. For international buyers, we only accept Paypal and the item will be shipped USPS*. Otherwise, we accept Paypal or credit card payment over the phone. Ray’s Midbell Music Mission: Ray’s Midbell Music is a full service school music dealer located in Sioux City, IA. The original company was founded in 1939. We have had a Sioux City location since 1972. Our high feedback rating is a testimonial of our commitment to honesty, integrity and excellent customer service. - NEW instruments come with manufacturer’s warranty. - Most “PRE-OWNED” instruments are sold “AS IS”; meaning that work is probably needed and usually sold in the condition that we received it in. It is our goal to accurately and truthfully describe each item, pointing out all flaws and defects, by providing as many high-quality pictures of each item as possible. However, sometimes things can be inadvertently overlooked. Please read the entire description carefully and review all pictures before bidding. - We also take great pride in our shipping department and strive to make sure that each item is properly and securely packaged. Our daily UPS & USPS pick-up assures you of prompt delivery. - You can buy with confidence knowing that you are dealing with a reputable brick and mortar store with a long history of excellent customer service. *International Buyers – Please Note: Import duties, taxes, and charges are not included in the item price or shipping cost. These charges are the buyer's responsibility. Please check with your country's customs office to determine what these additional costs will be prior to bidding or buying. We ship international items primarily by USPS. If item is too large, for that country’s size restrictions, it will not ship. As stated above, please get a shipping quote to find out if item can be shipped to your location. On international sales a tracking number will always be posted. Often times, once the package clears customs, the tracking number is no longer useful and there is no way of determining the location or delivery status of the package. Because of this, international sales are final upon shipping of the items. We will not change items type or sales amounts on customs forms. Please take this under advisement before bidding. Add a map to your own listings. FREE Trial!", "ItemID": "202287231336", "EndTime": "2019-01-15T17:51:49.000Z", "StartTime": "2018-04-12T22:54:16.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Epiphone-Blueshawk-Deluxe-Electric-Guitar-Midnight-Sapphire-/202287231336", "ListingType": "FixedPriceItem", "Location": "Sioux City, Iowa", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2022872313368080_2.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg2MzU=/z/zlIAAOSwMjpby2kc/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg2Njc=/z/WKQAAOSwqqJby2ke/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDA0/z/vzQAAOSwr~tby2kg/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDgx/z/GU8AAOSw6~Vby2ki/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5OTI=/z/aH8AAOSwj6lby2kk/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5OTY=/z/5ocAAOSwarlby2km/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg1MTY=/z/wJsAAOSwhrFby2kn/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg2MDM=/z/DdwAAOSweopby2kr/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMTYy/z/AEIAAOSwgTRby2kt/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMzg1/z/880AAOSwMn5by2kv/$_1.JPG?set_id=8800005007"], "PostalCode": "51106", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "midbellmusic", "FeedbackRatingStar": "Red", "FeedbackScore": 2368, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 449.95, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 449.95, "CurrencyID": "USD"}, "HighBidder": {"UserID": "4***g", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 826}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Epiphone Blueshawk Deluxe Electric Guitar (Midnight Sapphire)", "ItemSpecifics": {"NameValueList": [{"Name": "Model", "Value": ["Blueshawk Deluxe"]}, {"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}]}, "HitCount": 1114, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=7099494", "StoreName": "Ray&#39;s Mid-Bell Music"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller", "InternationalRefund": "MoneyBack", "InternationalReturnsWithin": "30 Days", "InternationalReturnsAccepted": "ReturnsAccepted", "InternationalShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "TopRatedListing": true, "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}