{"BestOfferEnabled": false, "Description": "Powered by Frooition Pro Shop Search 2018 Gibson Les Paul Faded Electric Guitar - Worn Brown w/ Gig Bag Click here to view full size. Full Size ImageClick to close full size. Item Description 2018 Gibson Les Paul Faded Electric Guitar in very good condition with little to no playwear. Cool looking gloss faded brown finish on the maple top with a black pick guard and nickel hardware. The guitar has a nice action and the slim taper maple neck has a great \"worn in\" feel. The cryogenically treated frets are in excellent condition. The Gibson 490R and 490T pickups have a great tone with more high end and midrange punch than vintage PAF pickups. The guitar is equipped with an tune-o-matic bridge with a stop bar tailpiece and vintage style Gibson Deluxe tuners. Looks, plays and sounds great. Includes a gig bag. Made in the USA. Serial Number: 180005532 Weight: 8 lbs. 1 oz. A Modern Player with an Old Soul The benefits of a modern Gibson guitar and the appeal of a pawn shop prize — both are yours with the Gibson Les Paul Faded. No, this guitar isn't relic'd. Rather, it's built to look and play like a Les Paul that has seen the insides of more than a few bars and clubs. The Les Paul Faded's new-meets-old approach is exemplified in three key features: a SlimTaper maple neck shaped to mimic the natural wear of decades of playing; a weight-relieved mahogany body, which you'll be able and proud to strap on for hours at a time with its low weight and faded gloss finish; and a pair of Gibson 490 pickups that speaks with a golden PAF-like tone, only with more bite and wax potting to reduce squeals. Plek'd for precision playability This Les Paul Faded 2018 feels fast and precise, thanks in large part to Plek processing. Typically reserved for top-dollar custom guitars, this process levels the frets with pinpoint precision, providing you with the most playable fretboard you're likely to own. Each note rings loud and clear, and the fret edges feel smooth as silk. Ultra-modern body is weight relieved for comfort You can't deny two fundamental guitar truths: early Les Pauls were glorious, but they were also heavy. That's the trade-off of strapping a solid slab of mahogany to your body. But Gibson has done something special with the Les Paul Faded's Ultra-modern, weight-relieved body. It retains the chime and resonance of slab Les Pauls at a big reduction in weight. This just means you can enjoy yourself onstage for longer, and drag yourself out of bed earlier, with the Gibson Les Paul Faded. SlimTaper maple neck plays fast and smooth The maple neck on this Faded Les Paul is a breath of fresh air. Its SlimTaper neck profile conforms naturally to the hand, for smooth leads up top and fast licks down low. Whatever your standard neck preference, you'll find something to appreciate about the Les Paul Faded's pre-worn neck, which we agree, does play more like a vintage instrument than a brand-new one. Gibson 490 pickups are a modern take on a 1960s classic English guitarists of the 1960s were looking for a more aggressive sound to push their modern brand of blues, rock, and soul. Gibson responded with its 490 pickup set. These had more bite than Gibson's PAF (\"Patent Applied For\") pickups of the 1950s. The reissue 490T and 490R pay tribute to this turning point in rock history. Their voice is smooth and clearly vintage inspired, yet to our ears has more high-end cut and midrange punch than vintage pickups. They're also wax potted to reduce microphonic feedback, which is a big win with high-gain amp pairings. Gibson Les Paul Faded 2018 Electric Guitar Features: A modern Les Paul with pre-worn charm Ultra-modern mahogany body is weight relieved for longer nights onstage Maple SlimTaper neck is shaped to resemble a vintage instrument Fingerboard delivers classic Les Paul sustain Gibson 490 pickups pay tribute to turning-point tones of the 1960s Decked out with vintage-style keystone tuners and black speed knobs Aluminum Tune-o-matic bridge is lightweight and tonally matched to the guitar Plek'd for precision playability Les Paul Faded 2018 Impressive Feel and Tones, Worn Looks The Les Paul Faded guitar fully embodies the celebrated Les Paul feel and tone in a spirited, worn finish. The mahogany body and maple top complement a pair of genuine PAF-inspired humbucking pickups to deliver the impressive power and sustain made famous by legendary Les Paul guitars. The Les Paul Faded is also extremely comfortable to play thanks to the innovative Ultra-Modern weight relief and Slim Taper neck. Specs Series Gibson Model Year 2018 Body Body Style Les Paul Faded Body Mahogany Top Plain Maple Weight relief Ultra-Modern Binding None Neck Neck Maple Neck profile Slim Taper Nut width 1.695” Scale length 24.75” Number of frets 22 - Medium - Cryogenically Treated Nut Tektoid Inlay Acrylic Dots Binding None Binding Style N/a Hardware Bridge Aluminum Tune-O-Matic Tailpiece Aluminum Stop Bar Knobs Black Speed Knobs Tuners Vintage Style Keystones Plating Nickel Electronics Neck pickup 490R Bridge pickup 490T Controls 2 volumes, 2 tones, 1 toggle switch About Us Payment Shipping Terms Returns About UsWe offer a large selection of quality pre-owned musical instruments and equipment from the industries finest manufactures including Akai, Ampeg, Boss, Denon, Digidesign, DigiTech, Epiphone, Fender, Gibson, Gretsch, Guild, Ibanez, Korg, Lexicon, Line 6, Mackie, Mesa Boogie, Marshall, Martin, MusicMan, MXR, Neumann, Peavey, Pioneer, PRS, Roland, Shure, Tascam, Taylor, TC Electronic and Yamaha. New gear arrives daily so check our store often. Lighthouse Sound, Inc. is proud to be an authorized dealer of the following brands of guitar effects pedals, pedal boards, amplifiers and accessories: Bearfoot FX, Bigsby, Cooper Stands, Dunlop, Earthquaker Devices, Ernie Ball, EVH, Fender Accessories, Keeley Electronics, Gretsch Accessories, Ken Smith Strings, Lava Cable, Martin Accessories, Mojo Hand FX, RotoSound, SnaKe Oil Strings, Snark Tuners, Suhr Guitars, Amps, Pedals and Pickups, Voodoo Lab and Wampler Pedals About Us Payment Shipping Terms Returns PaymentWe accept PayPal payments. All major Credit Cards are accepted through PayPal including Master Card, Visa, American Express and Discover. About Us Payment Shipping Terms Returns ShippingLighthouse Sound specializes in prompt, safe shipping. We take great care packaging every item to ensure safe shipment to you. We get your gear to you fast, most orders ship within 1 business day of payment clearance. Tracking information is uploaded to eBay and can be viewed from your eBay account. International customers are responsible for any duties, taxes, brokerage or other fees. Please check with your country's customs office to determine what these additional costs will be. These fees vary from country to country and we have no way to calculate them. About Us Payment Shipping Terms Returns TermsSales Tax - 7 % Ohio Sales Tax will be added to the total amount for all purchases delivered to Ohio. We take pride in our customer service and your satisfaction is very important to us. In the rare event that you have a problem with your item please contact us and we'll be happy to help. While all care is taken, any errors, omissions or variations in the item details are unintentional. About Us Payment Shipping Terms Returns ReturnsWe offer a 14 day return policy. Items must be returned to us within 14 days of the original delivery date. We ask that you please return the product in the original product packaging along with all included materials (manual, warranty card, all accessories) and in the original condition that it was received. Buyer is responsible for return shipping and insurance cost. Refunds will be issued upon return of the item less the original shipping charge and a 15% restocking fee will apply. Helpful Links More Items! This listing is currently undergoing maintenance, we apologize for any inconvenience caused. Powered by SixBit's eCommerce Solution", "ItemID": "352551329728", "EndTime": "2018-12-26T21:42:53.000Z", "StartTime": "2018-12-22T19:40:25.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2018-Gibson-Les-Paul-Faded-Electric-Guitar-Worn-Brown-w-Gig-Bag-/352551329728", "ListingType": "FixedPriceItem", "Location": "Salem, Ohio", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/3525513297288080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NjQ4WDE2MDA=/z/NtgAAOSw27lcHSve/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzcwWDE1MjU=/z/QFMAAOSwypZcHSvg/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAxOFg5NDE=/z/Z8wAAOSwNe9cHSvj/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyM1g4Njk=/z/J0wAAOSwzThcHSvl/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/~NwAAOSwvfpcHSvn/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/9IUAAOSwztVcHSvq/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/uXoAAOSwX6RcHSvu/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/Q8oAAOSwyPFcHSvw/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/5J0AAOSwV0VcHSv2/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/NiUAAOSwmvpcHSvz/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTU0WDE0MDU=/z/UJEAAOSwMhVcHSv8/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/zVgAAOSwF8FcHSv6/$_57.JPG?set_id=880000500F"], "PostalCode": "44460", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "lighthouse_sound", "FeedbackRatingStar": "TurquoiseShooting", "FeedbackScore": 33092, "PositiveFeedbackPercent": 99.6, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 699.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 699.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "v***v", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 974}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "CA", "GB", "DK", "RO", "SK", "BG", "CZ", "FI", "HU", "LV", "LT", "MT", "EE", "AU", "GR", "PT", "CY", "SI", "JP", "CN", "SE", "KR", "ID", "TW", "TH", "BE", "FR", "HK", "IE", "NL", "PL", "ES", "IT", "DE", "AT", "BS", "IL", "MX", "NZ", "SG", "CH", "NO", "SA", "UA", "AE", "QA", "KW", "BH", "HR", "MY", "CL", "CO", "CR", "PA", "TT", "GT", "HN", "JM", "BB", "BD", "BM", "BN", "BO", "EG", "GF", "GG", "GI", "GP", "IS", "JE", "JO", "KH", "KY", "LI", "LK", "LU", "MC", "MO", "MQ", "MV", "NI", "OM", "PK", "PY", "RE"], "Site": "US", "TimeLeft": "PT0S", "Title": "2018 Gibson Les Paul Faded Electric Guitar - Worn Brown w/ Gig Bag", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Model", "Value": ["Les Paul Faded"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Color", "Value": ["Worn Brown"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Model Year", "Value": ["2018"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}]}, "HitCount": 55, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=22579709", "StoreName": "LHSound"}, "Country": "US", "ReturnPolicy": {"Refund": "Money back or replacement (buyer's choice)", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": true, "ConditionDescription": "2018 Gibson Les Paul Faded Electric Guitar in very good condition with little to no playwear. Cool looking gloss faded brown finish on the maple top with a black pick guard and nickel hardware. The guitar has a nice action and the slim taper maple neck has a great \"worn in\" feel. The cryogenically treated frets are in excellent condition. The Gibson 490R and 490T pickups have a great tone with more high end and midrange punch than vintage PAF pickups. The guitar is equipped with an tune-o-matic bridge with a stop bar tailpiece and vintage style Gibson Deluxe tuners. Looks, plays and sounds great. \n\nIncludes a gig bag. Made in the USA.\n\nSerial Number: 180005532\n\nWeight:    8 lbs.   1 oz.", "QuantitySoldByPickupInStore": 0, "SKU": "43840", "NewBestOffer": false}