{"BestOfferEnabled": false, "Description": "SHIP NOTE ! Figure $32 to Boston, Chicago, Atlanta, $28 to Houston, $23 to Denver, $20 to Las Vegas, Los Angeles. Send your zipcode for a cost quote !! Danelectro Dano Blaster Blue Sparkle Electric Guitar 6 String. Please don't hesitate to ask questions as I'm ignorant of the minutiae of electric guitars and guitar is sold AS IS, no returns. Note: Due to shine there is glare from background items. The finish is quite nice and even. I plugged this guitar into an amp and it tested well to my ear while making all available adjustments to the guitar and the amp. The body is a vibrant blue fading to dark blue toward the edges. It has applied sparkles overall. There is light use wear and one little chip (see last photo). The controls, pickups, bridge, etc appear to be in tight and working condition. There is light wear to the area. Some screws have light rust. The frets and markers on the fretboard appear to be present, tight and intact. The neck on both sides is in great condition with minor use wear. Missing one string. The tuners and head appear present, tight, intact and in great condition. Measures 39\" long x 13.25\" widest point. Weighs 6.5 lbs. Thank you for your interest and best of luck bidding !! ================================================== Pesky legalese is below, and now necessary, due to endless monkey business. Please read it ENTIRELY. Commit it to memory. There'll be a quiz ... =) YOUR RESPONSIBILITY AS A BUYER: Prior to bidding, or upon item receipt, your failure to have read the auction/BIN description, examined the photos, asked questions, understand posted shipping costs, or your countries duties/taxes, is not an adequate reason to request a return or refund, and expect me to pay for return shipping. PHOTOS: Photos are an integral part of this auction. Please peruse them closely. Feel free to request more area-specific, feature-specific images. DISCLAIMER DISCLAIMER DISCLAIMER: I'm not an expert on the majority of my listings. I do my best to research each item, to report on it truthfully and honestly, and to determine its working condition if applicable. It is your responsibility to ask questions and know what you're bidding on before bidding, not after you've received it. RETURNS/DAMAGE/REFUNDS: If I miss something or your item arrives damaged, please contact me with the same courtesy you would expect in return. Bullying and rudeness is not tolerated. I'm easy to work with, but I will be firm and fair. RETURNS/REFUNDS: An item arriving damaged is NOT a reason for RETURN or REFUND. See \"DAMAGES\" below. Your failure of due diligence in researching the item and asking questions in advance means you agree to be responsible for return shipping. Gross misrepresentation on my part means I will refund your purchase price and original shipping cost after I receive the item in the same condition via return mail. Items described by me SOLD AS IS, are absolutely that, no returns. Absolutely no partial or full refunds, so you \"can keep the item\" without SEVERAL CLEAR PHOTOGRAPHIC PROOF of your claims of item issues. Please do not fix, alter, repair the item, then expect a partial or full refund after the fact. This is against eBay and my own policy. DAMAGE: On your behalf I will file any DAMAGE or LOSS insurance claims. If an item arrives damaged, you agree to take several photos of the item and the packaging. These are REQUIRED by Shippers for all Insurance Claims. SHIPPING: I'm happy to combine shipping, just request a quote or invoice. On large or fragile items that require extensive packing materials or a custom created box, I may add a materials charge to the listing. Domestic shipping via USPS or FedEx Ground. International shipping via USPS Expedited, Saver, or Standard Ground Canada. INTERNATIONAL BUYERS: Import duties, taxes, and charges are not included in the item price or shipping cost, and are the buyer's responsibility, as are awareness of import restrictions to your country from the US. Please check with your country's customs office to determine what these additional costs will be prior to bidding or buying. I have NO CONTROL over International shipping costs and shipping companies. What is listed is what your shipping cost is (MINUS taxes/duties) using eBay's Shipping Calculator.", "ItemID": "123509353698", "EndTime": "2018-12-21T17:36:43.000Z", "StartTime": "2018-11-24T23:28:34.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Danelectro-Dano-Blaster-Blue-Sparkle-Electric-Guitar-6-String-SEE-SHIP-NOTE-/123509353698", "ListingType": "FixedPriceItem", "Location": "Santa Rosa, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1235093536988080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg3NDQ=/z/xXEAAOSw0~pb-ddI/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/vGQAAOSwysFb-ddL/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/ktcAAOSwwhxb-ddN/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/uw0AAOSworNb-ddQ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/0i8AAOSw4c5b-ddU/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg3MzY=/z/Fl0AAOSwBZxb-ddV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/PasAAOSwm-Fb-ddY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/VsgAAOSwI01b-dda/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/qoYAAOSwqxdb-ddd/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/Qi4AAOSwPWtb-ddf/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/xaIAAOSw-ghb-ddk/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/SPEAAOSwlLlb-ddi/$_57.JPG?set_id=8800005007"], "PostalCode": "95401", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "dusty.rusty.stuff", "FeedbackRatingStar": "Red", "FeedbackScore": 1717, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 144.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 144.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "b***p", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 0}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Danelectro Dano Blaster Blue Sparkle Electric Guitar 6 String SEE SHIP NOTE !", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Blue"]}, {"Name": "Brand", "Value": ["Danelectro"]}, {"Name": "String Configuration", "Value": ["6 String"]}]}, "HitCount": 482, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=13535610", "StoreName": "my.dusty.rusty.stuff"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}