{"BestOfferEnabled": false, "Description": "MIJ, made in japan, Gibson, Lespaul, White, SG, Höfner, Duesenberg, Ibanez, ATELIER Z, ARIA, ESP, Caparison, Killer, COMBAT GUITARS, GUYATONE, Greco, Sugi Guitars, TEISCO, DEVISERA, Nil, Bacchus, VANZANDT, Fernandes, Fender Japan, Fujigen, MOON GUITARS, momose, Yairi Guitar, YAMAHA, TOKAI, Zemaitis, VOX, B, C, Rich, Epiphone, Gibson, Gretsch, Suhr, Schecter, Charvel, Jackson, Dean, Tom Anderson, Fender, Paul Reed Smith, Melancon, Mosrite, Rickenbacker, Robert Benedetto, Washburn, Ibanez, kramer, EDWARDS, Burny, Grassroots, Late 1980s Tokai SS38 BLK Custom Edition All Original Large Head Very Good++ condition.Made in Japan Down from here, Photo is dent and scratches etc.. About scratches that are hard to see. To make it easy to understand the condition of the scratches, I lighted the light strongly. Late 1980s Tokai SS38 BLK Custom Edition All Original Large Head Very Good++ condition.Made in Japan Body Basswood. Neck Maple. Frets 21F. Scale 25.5inch ( 648mm ). Fender long scale. Nut Width About 1.575 inch (40mm). Pickup Tokai SSS Passive. Control 1 Volume, 2 Tone, 5-Way lever. Bridge Tokai Tremolo std. Color Black. Weight About 9.04 Pound ( 4.1 Kg ). This is Used Guitar. There are scratches and dents. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. Tokai's Les Paul type is very popular in the world. This is Tokai's Stratocaster type. It was manufactured in late 1980s. This is very very old guitar. However, it keep relatively beautiful conditions. The fretboard is particularly beautiful. As a feature of the very old maple fretboard, the clear coating is partially peeled off in many cases. However, there is no peeling of the clear coating on this Tokai maple fretboard. Screws, bolts, bridge, machine heads and other metal parts are shining. If you get this guitar, you will understand that the former owner cherished this guitar. About guitar play, Current state, the space between the strings and the frets is very very narrow. Thanks to that, I feel very easy to play the guitar. If you are hard to play the guitar, please adjust the height of the bridge by the hex wrench. The Pickups is Tokai original SSS Passive. In the late 1980s, heavy metal music was very popular in Japan. It would be a pickup corresponding to that popularity. I feel the good Over drive and Distortion sound. The clean sound is also wonderful. Tokai is Great !! It is cleanliness. I polished with guitar exclusive polish, so it is in a very clean state. I cleaned the Fingerboard with Lemon Oil. Current neck condition, very good ! roughly straight ! There is no problem with the Truss rod and it can be adjusted. Remaining the frets are 50% on average. You can play immediately after it is delivered to you. Guitar playing, is comfortable. All is working well. It is in a very good condition. The Truss rod Wrench is not included. All Original.Note : The hard case key has been lost. Note : The Strap pin has been changed to lock type. GIG BAG Included. Look at the photos, please verify by yourself! It will be professionally pack. Double air packing. And ships inside a sturdy cardboard box. This electric guitar is USED. Please consider it when bidding. Thank you. Payment I accept PayPal only. Please pay within 3 days after the auction closed. Shipping Worldwide shipping from Japan! EMS / Shipping includes a tracking number. / / / Destination cost Delivery time / / / Asia : $1004 ~ 7daysUS Canada : $1205 ~ 8 daysEurope : $1406 ~ 10 daysOceania : $1205 ~ 8 daysSouth America : $2408 ~ 12 days This item is shipped within 3 business days after payment is confirmed. Terms of Sale International buyers - Please Note: Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer's responsibility. Please check with your country's customs office to determine what these additional costs will be prior to bidding/buying. These charges are normally collected by the delivering freight (shipping) company or when you pick the item up -do not confuse them for additional shipping charges. Please contact us first with 30 working days for any returns, Buyer pays shipping cost from buyer's country to Japan when being returned. In case of return, the shipping cost won't be refunded. We sell various kinds of Electric guitars to international customers. Our goal is to provide the best quality products and service and your satisfaction is the most important to us. Happy bidding!! Thank you !!", "ItemID": "253978221904", "EndTime": "2018-11-20T04:17:06.000Z", "StartTime": "2018-11-13T04:17:06.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Late-80s-Tokai-Stratocaster-type-SS38-All-Original-Large-Head-Made-Japan-/253978221904", "ListingType": "Chinese", "Location": "Nagoya-shi,Kita-ku, Aichi", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2539782219048080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/hDUAAOSw6-Nb6j58/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ5NFgxNjAw/z/m4cAAOSwPjhb6j6I/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/QncAAOSwXHxb6j6W/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/ubEAAOSw5oxb6j6e/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE3OVgxNjAw/z/VE4AAOSwG1Jb6j6v/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/CIEAAOSwCXFb6j6q/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/8BIAAOSwenJb6j6-/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/1wIAAOSwIw1b6j69/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE1MFgxNjAw/z/aM0AAOSw3LVb6j7B/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU5OVgxNjAw/z/5LoAAOSwn91b6j7M/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg2NjA=/z/DbsAAOSwXx9b6j7I/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/CVkAAOSwXItb6j7P/$_57.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jguitar-shop", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 369, "PositiveFeedbackPercent": 100.0}, "BidCount": 4, "ConvertedCurrentPrice": {"Value": 215.5, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 215.5, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***y", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1407}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Americas", "Europe", "Asia", "AU"], "Site": "US", "TimeLeft": "PT0S", "Title": "Late 80s Tokai Stratocaster type SS38. All Original. Large Head. Made in Japan.", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Tokai"]}, {"Name": "Model Year", "Value": ["Late 1980"]}, {"Name": "Model", "Value": ["SS38 BLK"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Series", "Value": ["Original"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Black"]}]}, "HitCount": 499, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "JP", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 218.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["APO/FPO", "Africa"], "GlobalShipping": false, "ConditionDescription": "Very Good++ Condition. This is Used Electric Guitar. The electric guitar when connect to the amplifier, sound output is normal. There are scratches and Dents. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. Please Read the descriptions for details.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}