{"BestOfferEnabled": false, "Description": "The Les Paul Traditional 2016 T takes things up a few notches to present one of the nicest pieces in this year' Gibson lineup. If you appreciate a deluxe top and superb pickups, you™ll love this one. It features the same tonewood combination that helped make the Les Paul a legend with the addition of a beautifully carved, solid Grade-AA maple top. The superior top wood lends bite and articulation to the sound while the mahogany body, with traditional weight relief, adds warmth and depth. The neck sports Gibson' traditional nut width with a self-lubricating Graph Tech nut that helps in tuning and lets strings return to pitch following heavy string bends. A pair of Gibson ™57 Classic humbuckers are onboard, powered by alnico magnets and created exactly in the image of the original PAF-style pickups, offering up an inspiring array of authentic Les Paul tones. Chrome hardware includes a tune-o-matic bridge with stopbar tailpiece, and traditional manual tuners that add a vintage note, but with performance that is smooth and efficient. The Les Paul Traditional 2016 T comes ready to play in a traditional brown hardshell case. Key features Preserves the classic Les Paul tone, improves playing comfort, and enhances the guitar's resonance Efficient performance with a vintage look The original Les Paul neck width retains the playing feel that launched a thousand hits Accurate return-to-pitch with heavy string bending - and great sustain - thanks to the dense, self-lubricating nut The classic look and feel you know and love The original Les Paul case style, now with enhanced protection Stylish traditional inlays reflect this iconic guitar's original look Seminal tone and feel, with increased sustain Expert setup makes this handcrafted, American-made guitar ready for immediate action Powered by Alnico magnets and wound with plain enamel-coated wire, these humbuckers capture hallowed PAF-inspired toneFEATURESWeight relief: Traditional weight relief for a lighter overall guitarTuners: Traditional manual tunersNeck width: Traditional neck width of 1-11/16\" at the nutNut: Graph Tech nutNeck heel: Traditional Les Paul neck heelCase: Traditional brown Les Paul hard shell caseInlays: Historic trapezoid fingerboard inlaysFingerboard: Thicker one-piece rosewood fingerboardSetup: Comprehensive hand-finished setupPickups: ™57 Classic humbucking pickups", "ItemID": "123614410696", "EndTime": "2019-01-29T21:59:16.000Z", "StartTime": "2019-01-26T21:59:16.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-Traditional-Les-Paul-/123614410696", "ListingType": "Chinese", "Location": "Las Vegas, Nevada", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1236144106968080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/rqgAAOSw6EpcPOiK/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/0noAAOSwN5hcPOh1/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/gpMAAOSwxrJcPOh4/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/rIEAAOSwU65cPOle/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/qmsAAOSwU65cPOgf/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/EDMAAOSwjthcPOgl/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/~O4AAOSwTxhcPOgi/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/yPUAAOSwprtcPOg-/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/uYsAAOSwNXpcPOgs/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/LZEAAOSwjfBcPOy0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/YGcAAOSwGIZcPOhx/$_57.JPG?set_id=8800005007"], "PostalCode": "89141", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "zebragarage", "FeedbackRatingStar": "Purple", "FeedbackScore": 552, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 1600.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1600.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "d***8", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 503}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson Traditional Les Paul", "ItemSpecifics": {"NameValueList": [{"Name": "Product Line", "Value": ["Gibson Les Paul"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model", "Value": ["Les Paul Traditional"]}, {"Name": "Model Year", "Value": ["2016"]}, {"Name": "Body Material", "Value": ["Mahogany"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}]}, "HitCount": 144, "Subtitle": "2016 Lightburst", "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 1625.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "This guitar never left my house and I very rarely played it. I love it. The sound is extraordinary. I've never had another guitar that sounded so good, and I've had two other Les Pauls. This particular Les Paul has the heaviest, powerful sound of any guitar I've ever had. It's heavy at 10 pounds 6 ounces, and it really makes a huge difference in the sound. Just an awesome guitar, but I need the money. No scratches or scuffs at all. There is one tiny little imperfection at the edge of the access panel that looks like a tiny chip the size of a pinhead. I never noticed it until I took pics of the guitar. I'm not sure if it's a chip or a finish imperfection. I don't think anyone would see it unless it was pointed out. I took a close up of it so you can see. It shows up better in a picture than in person.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}