{"BestOfferEnabled": false, "Description": "I am selling my Epiphone Les Paul Custom 100th Anniversary Outfit - Antique Natural, with OHSC, case candy (les paul anniversary cert, booklet, picks, sticker, etc). It's in WONDERFUL condition, and is an excellent player with very low action, very smooth playing and sounding guitar. I installed a graphtek tusq black nut (the original nut is included with the guitar in the plastic case candy bag), but everything else is original. The pictures I included show there are zero cracks zero cracks at the neck, or heel, etc - nothing. There is a little play wear on the hardware and some general pick scratches and swirls but that is it. The case is the original case it comes with, although there are stickers on it. I decided not to take them off, but you can. This has been babied, but also gigged, over the past year or so. It's used, and shows it, but is in excellent condition. Selling my les pauls (look for my other auctions soon) as I have a pinched nerve and cant do an LP for a 4-5 hour gig anymore - switching to semi-hollow guitars. Sadly... I love my pauls. Below is the description from the website: Celebrate Les Paul's 100th Birthday The limited-edition Epiphone Les Paul Custom 100th Anniversary Outfit solidbody electric guitar celebrates everything that is iconic about the guitar's design and the man who is responsible for the way we play and hear music today. For Les's 100th birthday, Epiphone decided to pull out all the stops, with touches such as 24K gold hardware and truss rod cover. And the two ProBucker humbucking pickups offer PAF and coil-split tones for sonic variety. The Les Paul Custom 100th Anniversary Outfit honors 100 years of a true icon. Epiphone Les Paul Custom 100th Anniversary Outfit Solidbody Electric Guitar at a Glance:About Les PaulBeautiful appointmentsProBuckers About Les Paul Much of what we enjoy about modern music and guitar playing can be traced back to Les Paul. His recording career as a solo artist, and as a duo with Mary Ford, generated multiple hit records. He invented the use of multitrack recording and guitar looping and was an early pioneer in the use of reverb and delay. But his most iconic work was done with the solidbody electric guitar. And the sound of music changed forever when Gibson put the Les Paul into production in the early 1950s. Beautiful appointments The Les Paul Custom 100th Anniversary Outfit is dressed up for a birthday celebration. Its truss rod cover, Tune-o-matic bridge and tailpiece, and Grover Imperial tuners are decked out in 24K gold for a regal look. The headstock and fretboard are inlaid in a combination of abalone and pearloid for an attractive contrast to the flame maple top. And this attractive instrument is capped off with a sparkling Zirconium stone inlaid in the dot of the \"i\" in the Epiphone logo. ProBuckers The two ProBucker humbucking pickups in the Les Paul Custom 100th Anniversary Outfit are designed at Gibson's pickup factory in Nashville, Tennessee. These pickups are re-creations of the classic Gibson PAF pickups that are so sought after. Sweetwater players immediately noticed that they offer the same powerful midrange and crystal-clear top end of great vintage Les Pauls. And push-pull pots allow you to split the coils to access bell-like single-coil tones. Epiphone Les Paul Custom 100th Anniversary Outfit Solidbody Electric Guitar Features:Limited-edition Les Paul to celebrate Les's 100th birthday24K gold hardwareAbalone and pearloid inlaysZirconium \"i\" dot inlayGrover Imperial tunersProBucker humbuckers deliver PAF toneHardshell case included The Ltd. Les Paul Custom 100th Anniversary remembers the man who started it all.~ This guitar always gets me comments and stares from the audience - it's a beautiful guitar. *no returns unless I grossly misrepresented this guitar. The pictures have been taken at the time of the listing, and it is going back into the case ready for shipment. If you simply do not like the guitar, feel free to sell it on ebay, you will get more than what I am asking, I am just looking to sell quicker.", "ItemID": "323595948675", "EndTime": "2018-12-17T06:45:50.000Z", "StartTime": "2018-12-12T20:58:28.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Epiphone-Les-Paul-Custom-100th-Anniversary-Outfit-Antique-Natural-used-great-/323595948675", "ListingType": "FixedPriceItem", "Location": "Winchester, Virginia", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/3235959486758080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/zhIAAOSwIbtcEXO-/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/iFcAAOSwGVFcEXO-/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/~V8AAOSwnKFcEXO-/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/fQQAAOSwUqVcEXPC/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/hFgAAOSwhspcEXPE/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/VHsAAOSw1qhcEXPD/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/zcMAAOSwC9hcEXPC/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/pSIAAOSwAThcEXPC/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/VfsAAOSwlfNcEXPC/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/r94AAOSwnv9cEXPF/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/3hkAAOSwYTtcEXPF/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/4zAAAOSwADxcEXPF/$_32.JPG?set_id=880000500F"], "PostalCode": "22602", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "historiosophy", "FeedbackRatingStar": "Purple", "FeedbackScore": 803, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 550.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 550.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "d***w", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 178}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Epiphone Les Paul Custom 100th Anniversary Outfit - Antique Natural used great!", "ItemSpecifics": {"NameValueList": [{"Name": "Model", "Value": ["Les Paul 100"]}, {"Name": "Body Material", "Value": ["Mahogany"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Brand", "Value": ["Epiphone"]}]}, "HitCount": 99, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}