{"BestOfferEnabled": true, "Description": "If you are looking at this post, you already know what it is. It is the heavier, very, very rare, non chambered and most highly regarded 2004 Gibson Les Paul Standard Limited Edition (1 of 275) in the most beautiful and sought after Manhattan Midnight Blue burst. Pictures honestly don’t do this guitar justice. I’ve had the pleasure to own 6 of these at one point or another and this burst/top is by FAR the nicest I’ve ever come across, but please look at the pictures even though they don’t show how nice the top is. What you don’t know is that this guitar is in excellent condition and it hasn’t been played much. Frets have all the life left. It comes with an excellent condition black HSC. Original pickups, tuners and everything else as well; guitar is all original and not modified in any way. Everyone knows that these early to mid 2000’s were maybe the best years for Gibsons period, and that they don’t make them like this any more. As interesting as that may sound for a 13-year-old guitar, there is NO buckle rash and the back is beautiful just like the rest of the guitar. Other than some pick swirls on the top that can be buffed out to make mirror like and new again, there are no chips, dents, or any blemishes really. It was purchased in 2004, set up, played periodically for a short time, and then put away in its case til now; again, I’ll let the pictures do the talking. Honestly, it is almost impossible coming across this particular Limited Edition Gibson Les Paul Standard from this year in this good of condition and this prominent of a burst/top. It has the 60’s slim neck that is not as slim as these newer slim taper necks, but it is definitely thinner than 50’s necks. It is medium weight, weighing in at about 9lbs. The tone and sustain is simply ridiculous, but I’ll let you be the judge. Unplugged, the strings ring out loudly and endlessly and is well above average and this is the way I determine the quality of my Gibsons. If it sound good unplugged, it’s a keeper, and this one goes beyond that. Plugged in to my Marshall SL5 it is a match made in heaven and being a non chambered model, the tone and sustain is second to none. It has been set up, the frets are polished and it is ready to rock. It is a 15-year-old guitar and it may have a blemish somewhere which is normal for a guitar of this age, but even that is minimal as you can see in the pictures; it does not photograph, nor does it affect playability. The top is absolutely amazing. Honestly, as stated before, here is that rare opportunity to purchase this 15-year-old, excellent condition Limited Edition Gibson Les Paul Standard Limited Edition from a great year at a really, really good price compared to what other people are selling these for when they do appear and in much, much worse condition. Don’t let this one slip away as I know it will not last and I speak from experience. Due to the very attractive price, I know that I will be contacted a lot and with that said, I won’t be able to hold the guitar for anyone; it’ll be first come first serve. Furthermore, I reserve the right to end this sale at any time should my guitar sell locally or on other websites listed. I’ve described this guitar to the best of my ability. Please ask any questions you may have and I’ll try to answer in a timely manner. Flat rate shipping of $85 anywhere in the CONUS.", "ItemID": "273673807424", "EndTime": "2019-02-18T05:11:02.000Z", "StartTime": "2019-01-26T20:29:29.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2004-Gibson-Les-Paul-Standard-LE-Manhattan-Midnight-Blue-1-275-Excellent-/273673807424", "ListingType": "FixedPriceItem", "Location": "San Diego, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2736738074248080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/CS0AAOSw66JcTMIy/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/UYQAAOSwZqlcTMI2/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/MXoAAOSwWN5cTMI4/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/SUcAAOSw1vxcTMI7/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/DZUAAOSwLeFcTMI5/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/7MQAAOSwQZdcTMI9/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/OdkAAOSwakxcTMI-/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/YBMAAOSwPVFcTMJA/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/ShUAAOSwzTJcTMJB/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/c~0AAOSw9JpcTMJD/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/jVwAAOSwxs9cTMJF/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/Lv4AAOSwdwVcTMJG/$_12.JPG?set_id=880000500F"], "PostalCode": "92122", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "us.vejzo", "FeedbackRatingStar": "Blue", "FeedbackScore": 68, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 2390.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2390.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "s***_", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 74}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2004 Gibson Les Paul Standard LE Manhattan Midnight Blue 1 Of 275 Excellent ", "ItemSpecifics": {"NameValueList": [{"Name": "Product Line", "Value": ["Gibson Les Paul"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model Year", "Value": ["2004"]}, {"Name": "Model", "Value": ["Les Paul Standard"]}, {"Name": "Body Color", "Value": ["Blue"]}]}, "HitCount": 317, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}