{"BestOfferEnabled": true, "Description": "1988 Made in Japan Charvel Jackson Model 6 Bound Body & Neck Neck Thru Guitar Husk Project. Pearl White Factory Finish. 24 Fret Neck Scale. Floyd Ready Tremolo. Condition - Frets are in excellent played condition overall. Light signs of playwear. Frets have tons of life left on them. Fretboard is in excellent shape as well. Front headstock is in great condition. Minor chipping on back pointy tip of headstock. 2 tiny dings in finish on back edge of headstock as well. Back of neck play area is in excellent condition. Back of body has a few light dings in finish, very minor. Front body has a few noticeable nicks and dings in finish that are pictured in the listing photos. Tiny nick/scratch mark in finish below tremolo route not pictured in photos. No cracks or chips in tremolo post mounting holes. No nicks or dings in tremolo route. No buckle rash at all. Guitar husk is in overall excellent played condition with the exception of the wear listed above and pictured in the photos. I would give the husk an overall 8 out of 10 for its condition. No modifications done to guitar. No cracks or damage around neck joint area that meets body. No cracks or any damage on guitar. Guitar husk is in good to great used condition overall with the exception of the wear listed above. Neck is straight. Truss rod is fully intact and works fine with no issues. Husk will be carefully packed and wrapped in a sturdy soft case gig bag and shipped in a strong cardboard guitar box. I have shipped these guitar husks all over the world and they have always arrived safe and undamaged. Guitar is being sold as a project because there are no parts included with guitar. Check my feedback rating. Please review all pictures and read entire description before asking any questions that may have been answered in listing and prior to making an offer. Serial Number - C800339 Body Wood - Neck Thru Design with Poplar Wings Finish - Pearl White Weight - 5lbs 10.8oz Scale Length - 24.75\" Guitar stand is not included!!! Please Read Before Bidding on this item!! Payment is due within 72 hours of auction end unless other arrangements are made, if payment is not received in that time, item will be relisted. Guitar will be shipped for an additional fee of 48.00. Shipping and handling to Canada will be 120.00. International shipping to any country outside North America will be 160.00Auction Rules:1. Payment is due within 3 days of auction end unless other arrangements are made.2. If payment is not received in that time, unpaid item case will be open and item will be relisted.3. I will combine shipping, if you win more than one item please wait for me to send you a combined invoice.4. All international shipments are marked as a gift.5. Yes I will ship worldwide, all customs and import taxes are paid for by the buyer not the seller.6. Once package has been shipped, tracking and info is automatically uploaded through ebay.7. If you have a problem with your purchase please contact me first so we can work it out.8. Due to rise in USPS and FedEx Shipping Prices, Shipping and handling is NON NEGOTIABLE. SHIPPING PRICES ARE FIRM. I WILL COMBINE SHIPPING!! 9. If you placed a bid on one of my items by mistake, it is you the Buyers responsibility to retract bid, please do not message me to cancel your bid for you!!10. I will combine shipping, Combined shipping does NOT MEAN I THROW EVERYTHING IN ONE BOX AND YOU ONLY PAY ONE SHIPPING PRICE, IT MEANS I WILL GIVE YOU A DISCOUNT ON SHIPPING AND HANDLING.11. Item for sale is the item pictured in the listing, I DO NOT USE STOCK PHOTOS.12. Please allow 1-2 days for me to respond to any of your questions or concerns. I am a one man team.13. If you have any questions about guitars or what kind of guitar you might think you have and need any info about it, feel free to send me a question. I have baught and sold hundreds of Kramer & Charvel guitars from all time periods.14. Items are shipped to address on file with ebay and paypal, it is the buyers responsibility to change your address if necessary. 15. Tracking info is uploaded automatically through ebay, tracking usually takes 1-2 business days to show any movement, some cases longer.16. I am a one man guitar shop that is run out of my house, no I do not own a music store. This is just a hobby turned small business. So please allow 1-2 days for me to respond to any questions you may have. 17. Buyers with Zero feedback must ask me for permission before bidding on any of my items, your bid and or sale will be cancelled if not asked. Shipping Policy:1. Items are usually shipped within 2-4 business days of receiving payment. Some cases items will ship out the same business of payment received.2. Please ignore the estimated shipping date that ebay gives you, I do not control the packages being shipped through USPS, FedEx or UPS. The estimated delivery date given by United States Postal Service and FedEx might take slightly a little longer than ebay predicts for you.3. Items are shipped via USPS and via FedEx. More expensive cases, necks and bodies will be fully insured of sale price and require a signature.4. Large items with sale price over 250$ will require a signature upon delivery through FedEx Only. Packages shipped through USPS will not require a signature.5. When payment is made, the shipping label is printed directly through ebay. Tracking is automatically uploaded through ebay. Please allow 1-2 business days for tracking to show any movement once package has been dropped off at the local post office/fedex.6. It is you the BUYERS RESPONSIBIITY to change your shipping address if needed before making payment, items are shipped to address on file with ebay and paypal. I cannot be held responsible for packages shipped to the wrong address if you do not make the proper changes before payment is completed.7. Once package is shipped and has left my hands I am not responsible for item handled through the Post Office/FedEx. Some packages may take longer than expected and tracking might not show any movement until item arrives at your local post office. I am willing to help in anyway I can. 8. If for the unexpected reason an item gets damaged during shipment to you, I need to see pictured of outside box and pictures of where item is damaged. Also item must be returned to me in all original packaging materials and original box in order to get a full refund from me. I will open case through the local shipping company and handle the claim from there.9. Items lost or damaged upon delivery, I dot not cover paid import duties or taxes on international shipments.10. Items are professionally packaged. I have shipped thousands of guitar parts all over the world and haven't had a problem yet. Please check my feedback. 11. ALL SHIPPING AND HANDLING CHARGES ARE FIRM AND NON NEGOTIABLE. I WILL COMBINE SHIPPING ON MUTLIPLE ITEMS WON, PLEASE WAIT FOR ME TO SEND YOU A COMBINED INVOICE WITH SHIPPING DISCOUNTED.12. Shipping and handling costs covers my cost of the proper packing materials: (packing tape, bubble peanuts, bubble wrap, boxes and ink for shipping labels printed). 13. I do not and will not lower the price of shipping and handling if you live within California, shipping and handling is still firm and non negotiable. Return Policy:1. I offer a 14 day money back guarantee, if you receive your item and are not happy with it simply return it for a full refund minus shipping and handling costs. 2. BUYER PAYS ALL RETURN SHIPPING COSTS.3. I will charge a 7% restocking fee on all returns, this does not apply to items that are damaged, defected and misrepresented.4. All items must be returned in original unused condition, in order to get a full refund.5. Items must be returned in original packaging and original packing materials must be included or I will charge a 10% restocking fee.6. Please include item number and your user id in the returned package. Please allow 2-4 days for you to receive your refund once tracking shows item has been delivered. 7. Refunds are only given on electronics and pickups if they are not working, or non functional. I will not accept returns on a pickup because you have installed it and don't like the sound of it in your guitar. Pickups and electronics must be returned in original condition unsoldered.Note: I do not give consent or authorization for my photos to be duplicated or used in your own listings. Nor will I ever give consent or authorization. I spend a lot of time taking the right pictures and do not like when other members steal my photos to list an item they purchased from me. This is rude and I do not appreciate it at all.Have a great Rockin Day and thanks for checking out my items!! -", "ItemID": "392242969158", "EndTime": "2019-03-01T19:43:43.000Z", "StartTime": "2019-02-19T14:58:12.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1988-Charvel-Jackson-Model-6-Pearl-White-Bound-Body-Neck-Guitar-Husk-Project-/392242969158", "ListingType": "FixedPriceItem", "Location": "Desert Hot Springs, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/3922429691588080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/epwAAOSwiqBcG4c~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/TvwAAOSwJ3RcG4ds/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/kwsAAOSwiwZcG4ft/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/3OcAAOSwc6ZcG4eR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/bksAAOSwW9NcG4fl/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/M5YAAOSwukZcG4kg/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/rLUAAOSwL-1cG4i1/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/TwgAAOSwTbxcG4i9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/QbkAAOSwDX5cG4jF/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/3nwAAOSwNJJcG4kZ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/XkUAAOSwlLlcG4kN/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/CXMAAOSwwSJcG4bh/$_57.JPG?set_id=8800005007"], "PostalCode": "92240", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "uplanderguitars", "FeedbackRatingStar": "Green", "FeedbackScore": 9073, "PositiveFeedbackPercent": 99.5}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 485.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 485.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "o***.", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 1}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "1988 Charvel Jackson Model 6 Pearl White Bound Body & Neck Guitar Husk Project ", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Pearl White"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Model 6"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Model Year", "Value": ["1987"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Brand", "Value": ["Charvel"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}, {"Name": "Body Type", "Value": ["Solid"]}]}, "HitCount": 872, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1161952553", "StoreName": "Uplander Guitars"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Frets are in excellent played condition overall. Light signs of playwear. Frets have tons of life left on them. Fretboard is in excellent shape as well. Front headstock is in great condition. Minor chipping on back pointy tip of headstock. 2 tiny dings in finish on back edge of headstock as well. Back of neck play area is in excellent condition. Back of body has a few light dings in finish, very minor. Front body has a few noticeable nicks and dings in finish that are pictured in the listing photos. Tiny nick/scratch mark in finish below tremolo route not pictured in photos. No cracks or chips in tremolo post mounting holes. No nicks or dings in tremolo route. No buckle rash at all. Guitar husk is in overall excellent played condition with the exception of the wear listed above and pictured in the photos. I would give the husk an overall 8 out of 10 for its condition. No modifications done to guitar.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}