{"BestOfferEnabled": false, "Description": "Up for sale, a 2017 Collings 360 LTM in near mint condition and in perfect working order. A unique model with a lacquer Doghair finish and Mastery hardware, this Collings is one of the finest USA-made boutique guitars available today, with an eye towards history and exacting standards for tone and modern playability. With an offset body style and Lollar pickups, the 360 is one of the most dynamic and vital models in Collings' electric line. Bridging the gap between the 290 and CL models, the 360 features a solid ash body and flame maple neck, providing a classic Fender-esque tonal baseline with amazing harmonic range and dynamics. Each piece of ash is acclimated and hand-selected for density and acoustic response, and the guitar weighs in at 7lbs 10oz. The Lollar alnico pole piece P90s were designed to deliver the clarity, snap, and sparkle of an \"F\" style single coil pickup, essentially bridging the gap between a traditional P-90 and a Jazzmaster pickup. The setup has been checked by our in-house tech staff here at Mike & Mike's Guitar Bar to ensure ideal intonation and playability.Every aspect of the 360 is dialed in to feel both familiar and elegant, and the neck profile has a round '50s C shape. This neck measures .865\" deep at the first fret and .967\" deep at the 12th fret, providing the ideal handful without being too massive. The rosewood fretboard boasts a 12\" radius with a 24 7/8\" scale length and flawless frets. The nut measures 1 11/16\" in width, and the headstock features a diamond truss rod cover and \"haircut\" headstock shape. The Mastery hardware is the final essential element of the 360, with the Mastery M1 bridge and Offset vibrato tailpiece. The dual saddle Mastery M1 design features brass saddles and self lubricating hard chrome plating which minimizes wear and eliminates heat/tuning issues resulting from string/saddle friction with heavy vibrato use. The vibrato has an effortless response, jumping back to the original pitch with ease and perfect for everything for the subtlest trills to deep dives. The Doghair nitro lacquer gloss finish highlights the prominent grain of the ash, and Collings prides themselves on meticulously hand sanding their finishes between coats. This results in a finish that's between .005 and .007 thousandths of an inch in final thickness, which maximizes the acoustic response of the instrument while providing excellent protection. Cosmetically, we'll conservatively call this guitar \"near mint,\" yet we can't find a mark on it.The original hardshell case and factory paperwork is included. Check out our shop \"Mike & Mike's Guitar Bar,\" and please let us know if we can answer any questions! Shipping in the continental USA will be $70, fully insured and shipped via FedEx Ground. Expedited shipping available for an additional fee at buyer's request. We will happily ship WORLDWIDE, but please contact us for an accurate international shipping quote before bidding or buying, as cost varies by buyer location. International orders will be declared as “merchandise,” and the value of merchandise will be declared as the amount paid. We cannot declare anything as a gift or for a lesser value. No exceptions! The customer is responsible for all taxes and duty, which may be collected upon delivery, as well as any additional charges involved with import. We have all necessary CITES paperwork in-hand to ship rosewood worldwide.We do our best to describe all items with honesty and accuracy, but to be sure, please contact us with any questions or concerns prior to bidding or buying. We require payment within 48 hours of auction end. In the unlikely event of a return, buyer pays all shipping costs. Your positive feedback and five star ratings are very important to us, and we appreciate your communication in resolving any issues!", "ItemID": "163433049184", "EndTime": "2019-01-07T20:50:58.000Z", "StartTime": "2018-12-15T10:49:30.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2017-Collings-360-LTM-Offset-Solidbody-Electric-Guitar-Doghair-Near-Mint-w-ohc-/163433049184", "ListingType": "FixedPriceItem", "Location": "Seattle, Washington", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1634330491848080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/pNcAAOSwTc5cFNOF/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/2Y4AAOSwY0ZcFNOM/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/WF8AAOSwa3lcFNOP/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/P1kAAOSwB19cFNOW/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/h74AAOSwp3dcFNOa/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/-bkAAOSwBqZcFNOd/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/27IAAOSwdgxcFNOf/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/i94AAOSwcttcFNOR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE5MlgxNjAw/z/UpIAAOSwZBRcFNOH/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/q18AAOSwENVcFNOT/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/dBYAAOSwzqtcFNOJ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/eSYAAOSwqKNcFNOY/$_57.JPG?set_id=8800005007"], "PostalCode": "98117", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mmguitarbar", "FeedbackRatingStar": "Red", "FeedbackScore": 2591, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 2599.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2599.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "t***o", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 29}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "2017 Collings 360 LTM Offset Solidbody Electric Guitar Doghair Near Mint w/ohc", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Collings"]}, {"Name": "Model", "Value": ["360 LTM"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Doghair"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Material", "Value": ["Ash"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["2017"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}]}, "HitCount": 257, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=269063702", "StoreName": "Mike and Mikes Guitar Bar"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}