{"BestOfferEnabled": false, "Description": "DescriptionHello, I have been selling with eBay from Japan so I can provide you the best service. This item is sold out everywhere in Japan and very hard to get it!!First come, first served.◆Appearance of the itemPlease check the photos for detailed condition of the product.Orville Les Paul LPS-75? Electric GuitarModel: Orville Les Paul (might be LPS-75)Serial No.: K 038332 (there's serial number sticker behind head)Purchased as new guitar by former owner about 25 years agoNeck: StraightFret: 70% Truss Rod: Unknown (box wrench type)Weight: 4536gThere are scratches, feeling of usage, crack, paint peeling, rust, dents, and dust Crack is seen on the head part (back of head where head and neck connect) (No repair history) There may be bad contact on pickup (From former owner: Electricity was applied for the first time after a long time and there's sign that rear pickup's volume was small at the beginning of playing, but it improved when playing continues) Switching of switches is bad, there's still sound on the Rear even when the volume set to 0 (A situation where 0 to 100 switching can't be performed with rear active. Perhaps switch exchange is necessary) There may chatter appears on the 3rd string when the string lowered, maybe there's a slight scraping in the nut part (Since the string height was originally lowered, it was improved with the string height of 1.5 mm - 2.5 mm) There're pick abrasion on pick guards, belts rubbing scratches on the back side No paint peeling that causing the wood part to show There're sticker marks, color tanning, and dirt on pick guard Deterioration, fading, darkening, color burning, and roughness are seen on each plastic part There's crack on the center part of front rear's pickup mount plastic part Switch knob is missing Former owner said there're repair and parts exchange history once Strap metal fittings may be deteriorated or got exchanged, but the part seems a little gold Metal pickup cover that came with the guitar was removed Switch was exchanged with DIY way No string◆Operation and Status Unknown, No string Please think it needs maintenance◆IncludingsAll you can see on this photo will be included in a set of a package. You can enjoy playing music.★ This product is also available at other EC sites.We will update as soon as possible, but if this product is sold on another EC site before this is sold on eBay, we are very sorry, but we will cancel the transaction on this site.★ I have examined the item(s) and included my observations as accurate as I could in the description above. Please note that some descriptions may be based on my own opinion. Please read it carefully and understand the condition of the item(s) before bidding. PaymentPlease pay within 3 days after the auction closed.ShippingWorldwide shipping from Tokyo. For goods with hard cases we usually pack hard case and contents by cushioning material (usually bubble wrap). There has never been a problem with that shipping method so far. However, if you want a hard case to be included in cardboard, I can ship by that method if you pay additional $10. This applies only to products that originally have hard case.this item is shipped within 1 business days after payment is confirmed.(Sunday and public holidays is not business day)It takes 4-7 days to be delivered with insurance and trucking number.*We can not use EMS(Japan Post) service for some countries in Central Asia (Kazakhstan, Kyrgystan, Tajikistan etc.) If your shipping address is in these areas, please contact us before bidding. ReturnsReturns are accepted ONLY if the item was not the item described.International Buyers - Please Note: * Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer's responsibility. * Please check with your country's customs office to determine what these additional costs will be prior to bidding/buying. * These charges are normally collected by the delivering freight (shipping) company or when you pick the item up - do not confuse them for additional shipping charges. * We do not mark merchandise values below value or mark items as \"gifts\" - US and International government regulations prohibit such behavior. Feedback: Feedback is very important for everyone participating in community. Please kindly leave feedback once you get the package, we will leave same for you. Thanks! If things happened please contact us before you leave feedback, we will offer you a satisfactory result. We are serious seller and will respond asap.", "ItemID": "192731614981", "EndTime": "2019-01-28T07:20:42.000Z", "StartTime": "2018-11-21T07:38:39.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Orville-Les-Paul-LPS-75-Electric-Guitar-Ref-No-1900-/192731614981", "ListingType": "FixedPriceItem", "Location": "Gifu", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1927316149818080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/9TMAAOSwF5Vb9QJG/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/7dAAAOSwylhb9QJz/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/37MAAOSwgNFb9QJZ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/MDYAAOSw9GVb9QJV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/52QAAOSwkfxb9QJQ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/Kz0AAOSwB5lb9QJ2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/aSoAAOSw0vJb9QJd/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/dUkAAOSwZ1hb9QJ5/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/E~YAAOSwVEFb9QJ9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/54QAAOSwkfxb9QKB/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/rxkAAOSwIKNb9QKE/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/4LkAAOSwnh5b9QKN/$_57.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "product-value", "FeedbackRatingStar": "Red", "FeedbackScore": 2438, "PositiveFeedbackPercent": 99.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 467.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 467.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "1***1", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1819}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "Orville Les Paul LPS-75? Electric Guitar Ref No 1900", "HitCount": 1783, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1097028905", "StoreName": "product-value"}, "Country": "JP", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller", "InternationalRefund": "MoneyBack", "InternationalReturnsWithin": "30 Days", "InternationalReturnsAccepted": "ReturnsAccepted", "InternationalShippingCostPaidBy": "Seller"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}