{"BestOfferEnabled": false, "Description": "Up for sale, a 1994 Gibson Nighthawk Standard in exceptional, 100% original condition and in perfect working order. From Gibson's initial offering of this model, the Nighthawk is a perennial favorite with a quintet of very distinct sounds. From the glassy, throaty power of the Firebird pickup in the neck position to the growl and cut of the lead position humbucker, you'd be hard pressed to find more sonic versatility in another Gibson model. The five-way pickup selector switch allows for coil tapped options of both pickups too, with numerous options for great clarity, jangle, and snap. The guitar weighs in at a mere 6lbs 13oz, with a slender mahogany body and highly figured quilt maple top, highlighted by a Transparent Amber gloss lacquer finish. Professionally setup here at Mike & Mike's Guitar Bar, this Gibson is dialed in with 10-46 strings, low action, and spot-on intonation.The mahogany neck has a C shape that is more slender at the nut, yet has greater profile depth and shoulder as you move up the fretboard, filling the palm and fretting easily. The profile measures .800\" deep at the first fret and fills out to .954\" at the 12th fret, and the bound rosewood fretboard features pearl split parallelogram inlays. The stock fretwire retains its full factory height and is fairly wide and flat, playing cleanly up the 25 1/2\" scale. The frets show only light wear on the crowns of frets 1-2, extending beneath the plain strings until fret 5, with virtually no wear further up the fretboard. The headstock retains the original gold Gibson Deluxe tuners which turn smoothly and hold pitch well.All of the electronics work as intended with the versatility of an unconventional (for a Gibson) five-way pickup selector switch. The CTS pots date to the 45th week of 1993 and the solder joints are untouched. A small transparent nearly invisible pickguard has been added on the treble side of the body and shows a few light scuffs. The gold hardware is in great shape overall, showing light wear through the plating on the bass side of the Firebird pickup ring. The bookmatched quilt maple top has consistent deep figuring with no bald spots, and the Transparent Amber finish is warm and inviting, showing only a couple very shallow small nicks on the bass side of the top. There are a few scattered small finish scratches and nicks on the back of the body, but as the photos show, this is a Nighthawk that has seen little use, and the neck profile is flawless.The original brown tolex hardshell case is included, along with a couple pieces of original Gibson advertising for this model. Check out our shop \"Mike & Mike's Guitar Bar,\" and please let us know if we can answer any questions!Shipping in the continental USA will be $70, fully insured and shipped via FedEx Ground. Expedited shipping available for an additional fee at buyer's request. We will happily ship WORLDWIDE, but please contact us for an accurate international shipping quote before bidding or buying, as cost varies by buyer location. International orders will be declared as “merchandise,” and the value of merchandise will be declared as the amount paid. We cannot declare anything as a gift or for a lesser value. No exceptions! The customer is responsible for all taxes and duty, which may be collected upon delivery, as well as any additional charges involved with import. We have all necessary CITES paperwork in-hand to ship rosewood worldwide.We do our best to describe all items with honesty and accuracy, but to be sure, please contact us with any questions or concerns prior to bidding or buying. We require payment within 48 hours of auction end. In the unlikely event of a return, buyer pays all shipping costs. Your positive feedback and five star ratings are very important to us, and we appreciate your communication in resolving any issues!", "ItemID": "173795210061", "EndTime": "2019-02-19T13:36:28.000Z", "StartTime": "2019-02-15T11:42:18.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1994-Gibson-Nighthawk-Standard-Quilt-Maple-Top-Guitar-100-Original-w-ohc-/173795210061", "ListingType": "FixedPriceItem", "Location": "Seattle, Washington", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1737952100618080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/l4QAAOSwPjNcZp9M/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/3PIAAOSwu2tcZp9X/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/KK8AAOSwsnNcZp9a/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/sL4AAOSwdwlcZp9i/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/B9MAAOSwEbxcZp9R/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/c1cAAOSwp~VcZp9q/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/x3MAAOSw4ARcZp9O/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/gDQAAOSwJgBcZp9l/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/8j8AAOSwJItcZp9U/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/TJAAAOSw4AJcZp9f/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/0TsAAOSw5~pcZp9c/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI4MFgxNjAw/z/QY4AAOSwxNBcZp9o/$_57.JPG?set_id=8800005007"], "PostalCode": "98117", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mmguitarbar", "FeedbackRatingStar": "Red", "FeedbackScore": 2613, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1249.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1249.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "4***7", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 91}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "1994 Gibson Nighthawk Standard Quilt Maple Top Guitar 100% Original w/ohc", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model", "Value": ["Nighthawk Standard"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Transluscent Amber"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Material", "Value": ["Maple, Mahogany"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["1994"]}]}, "HitCount": 93, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=269063702", "StoreName": "Mike and Mikes Guitar Bar"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}