{"BestOfferEnabled": false, "Description": "MIJ, made in japan, Gibson, Lespaul, White, SG, Höfner, Duesenberg, Ibanez, ATELIER Z, ARIA, ESP, Caparison, Killer, COMBAT GUITARS, GUYATONE, Greco, Sugi Guitars, TEISCO, DEVISERA, Nil, Bacchus, VANZANDT, Fernandes, Fender Japan, Fujigen, MOON GUITARS, momose, Yairi Guitar, YAMAHA, TOKAI, Zemaitis, VOX, B, C, Rich, Epiphone, Gibson, Gretsch, Suhr, Schecter, Charvel, Jackson, Dean, Tom Anderson, Fender, Paul Reed Smith, Melancon, Mosrite, Rickenbacker, Robert Benedetto, Washburn, Ibanez, kramer, EDWARDS, Burny, Grassroots, 1996 Ibanez S370 SOL Mahogany Thin Body ~ All Original ~Excellent++ ConditionMade in Japan Down from here. Photo is dent and scratches, etc.. About scratches that are hard to see. To make it easy to understand the condition of the scratches, I lighted the light strongly. 1996 Ibanez S370 SOL Mahogany Thin Body ~ All Original ~Excellent++ ConditionMade in Japan Body Mahogany. Neck Maple 1pc, Wizard Shape. Frets 22Frets. Jumbo. Scale 25.5inch ( 648mm ). long scale. Nut Width About 1.69 inch ( 43mm ). Pickup Neck : V1. Middle : S2. Bridge : V2. Control 1 Volume, 1 Tone, 5-Way lever. Bridge Lo TRS by TAKEUCHI Japan. Machine heads GOTOH Japan. Weight About 6.61 Pound ( 3.00 Kg ). This is Used Guitar. The lock nut and the Whammy bar is not original. _But there is no problem. I was shooting a lot of photos. Please confirm with a photograph. It was manufactured in 1996 by Fujigen. PRE-LOVED. This condition is very rare. It kept very beautiful state. Long time, Maybe has not been used. Maybe was sleep in warehouse. Thanks to that, Condition is Excellent ! This is an old guitar made 22 years ago, but I think scratches is few. I have an impression that this guitar is not used much. The evidence is the amount of frets remaining. Frets are Many remain. And, the protective sheet has not peeled off the truss rod cover and the electric cavity plate. Herman Li ( Dragon Force ) using this guitar Model. Perhaps, you will be surprised. Anyway, Ultra-thin body & Neck !! And Ultra-light weight !! The weight is very light, it is about 6.61 Pound !! You can actively action on the stage. About guitar play, Current state, the space between the strings and the frets is very narrow. Frets type is jumbo. And remaining amount of the Frets are many. Overall averaging, the remaining amount is about 95%. Thanks to that, you can play the guitar with a light touch. Recommend to technical guitar players. I think very easy the guitar play. Playability is high. Pickups is very powerful sound. I feel good distortion sound. It is cleanliness. I polished with guitar exclusive polish, so it is in a very clean state. I after the finger board cleaning, painted beeswax. The aim is moisturizing and and protection. Current neck condition, very good ! roughly straight ! There is no problem with the Truss rod and it can be adjusted. Remaining Frets are 95% ! You can play immediately after it is delivered to you. I was set new strings. Regular tuning. ( Inch : 009, 011, 016, 024, 032, 042 ) Guitar playing, is comfortable. All is working well. It is in a very good condition. The Truss rod Wrench is not included. All Original.Note : The lock nut and the Whammy bar is not original. GIG BAG Included. Look at the photos, please verify by yourself! It will be professionally pack. Double air packing. And ships inside a sturdy cardboard box. This electric guitar is USED. Please consider it when bidding. Thank you. Payment I accept PayPal only. Please pay within 3 days after the auction closed. Shipping Worldwide shipping from Japan! EMS / Shipping includes a tracking number. / / / Destination cost Delivery time / / / Asia : $1004 ~ 7daysUS Canada : $1205 ~ 8 daysEurope : $1406 ~ 10 daysOceania : $1205 ~ 8 daysSouth America : $2408 ~ 12 days This item is shipped within 3 business days after payment is confirmed. Terms of Sale International buyers - Please Note: Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer's responsibility. Please check with your country's customs office to determine what these additional costs will be prior to bidding/buying. These charges are normally collected by the delivering freight (shipping) company or when you pick the item up -do not confuse them for additional shipping charges. Please contact us first with 30 working days for any returns, Buyer pays shipping cost from buyer's country to Japan when being returned. In case of return, the shipping cost won't be refunded. We sell various kinds of Japanese products to international customers. Our goal is to provide the best quality products and service and your satisfaction is the most important to us. Happy bidding!! Thank you !!", "ItemID": "253956421613", "EndTime": "2018-11-06T04:00:25.000Z", "StartTime": "2018-10-30T04:00:25.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1996-Ibanez-S370-SOL-Mahogany-Thin-Body-All-Original-Excellent-MIJ-/253956421613", "ListingType": "Chinese", "Location": "Nagoya-shi,Kita-ku, Aichi", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/2539564216138080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/pzQAAOSwhyRb17BJ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/1BgAAOSw5oxb17AV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/~IMAAOSwGmZb17AO/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/7OUAAOSwAWtb17AB/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/zz4AAOSwJuZb17AB/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/ihEAAOSw8sBb16~5/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg2MDk=/z/4nMAAOSwTHtb16~Y/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/GXoAAOSw6Pxb16~r/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/qw8AAOSwwXRb16~1/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/dXIAAOSwctJb17AX/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTUxM1gxNjAw/z/UDEAAOSwjZlb17Al/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/ft4AAOSw9z1b17Ak/$_57.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jguitar-shop", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 369, "PositiveFeedbackPercent": 100.0}, "BidCount": 2, "ConvertedCurrentPrice": {"Value": 303.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 303.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "k***r", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 79}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Americas", "Europe", "Asia", "AU"], "Site": "US", "TimeLeft": "PT0S", "Title": "1996 Ibanez S370 SOL. Mahogany Thin Body. All Original. Excellent. MIJ.", "ItemSpecifics": {"NameValueList": [{"Name": "Body Material", "Value": ["Mahogany"]}, {"Name": "Brand", "Value": ["Ibanez"]}, {"Name": "Model Year", "Value": ["1996"]}, {"Name": "Model", "Value": ["S370 SOL"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Series", "Value": ["Original"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["F604185"]}]}, "HitCount": 514, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "JP", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 308.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["APO/FPO", "Africa"], "GlobalShipping": false, "ConditionDescription": "Excellent++ Condition. This is Used Electric Guitar. The electric guitar when connect to the amplifier, sound output is normal. There are scratches and Dent. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. Please Read the descriptions for details.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}