{"BestOfferEnabled": false, "Description": "HEARTLAND PAWN LAWRENCE 1985 Fender Stratocaster Contemporary Right-Handed Electric Guitar Made in Japan Description: ELECTRIC GUITAR: FENDER MODEL STRATOCASTER CONTEMPORARY, 6 STRING, RIGHT HANDED, CONTEMPORARY STRAT Details Additional Details for eCommerceNA Musical Instrument Condition Rating85% - Good - Item in Good Working Order, but Has Some Visual Imperfections Instrument Appearance90% - Very Good Condition : Basically Clean, might have some deeper scratches, pick wear or missing finish. Nothing real serious, no cracks, or other flaws. Knobs - Tuners - Electronics - Input Jack90% - Guitar shows some wear - All orginal - Input jacks ares shows some scratches- Volume and Tone controls are in good working condition. Musical Instrument CaseNot Included Number of Strings6 STRING Country of ManufactureMade in Japan Body StyleSOLID DexterityRight Handed Notes: This item is guaranteed to work as designed and comes with a fourteen-day money-back guarantee. PLEASE REVIEW PHOTOS for exact cosmetic condition and design details Item will be carefully packaged & shipped fast! TERMS: If you have any questions that were not answered in the description above, feel free to send me a message prior to bidding/purchasing item. Photos are of actual item(s) being shipped unless stock photo present or otherwise stated. If you do not see an item that you believe should be included please send me a message to clarify: if it is not shown in the photos then it is considered not included unless stated otherwise. Thanks for stopping by! Be sure to check out my other listings! Payment PayPal is the ONLY online payment method we accept at this time. Your PayPal account must be a Verified U.S. PayPal Account. We also recommend that you use a Confirmed Ship To Address. Shipping Your item will be shipped within 1-3 business day(s). After shipping your items will be delivered within 1-10 business days. Terms of Sale Tax applies in: KS About Us Heartland Pawnbrokers now with three locations! We might be new to Lawrence, but our team has over 40 years experience in the business! We buy, sell, trade, and loan!We buy and sell all types of electronics including laptops, phones, and tablets. Tools of all shapes and sizes. Purses and shoes. And of course, gold and silver jewelry and even some costume jewelry. Check out all of our listings, I'm sure you'll find something! Things I Buy: Gold, Silver, Bullion, Jewelry, Purses, Shoes, Collectibles, Laptops, Tablets, Cell Phones, Tools, Band Instruments, Guitars, Musical, Sporting Goods, Video Games, Coins, Keyboards, Subwoofers, Kicker, Stereo Bravo Store Systems Point-of-Sale Operating System Bravo Omni-Commerce solutions offers Brick & Mortar stores the only fully integrated eBay API that seamlessly & effortlessly combines the in-store Point-of-Sale to all eBay commerce selling activities. Click here & find out why eBay stated \"Bravo has best solved Brick & Mortars can sell on eBay\"", "ItemID": "312354776875", "EndTime": "2019-02-26T05:18:39.000Z", "StartTime": "2018-12-04T18:09:43.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1985-Fender-Stratocaster-Contemporary-Right-Handed-Electric-Guitar-M-140612101-/312354776875", "ListingType": "FixedPriceItem", "Location": "Lawrence, Kansas", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/3123547768758080_5.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/6FIAAOSwMnZcZyTW/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/aMEAAOSw96FcZyTX/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/D8wAAOSwpsBcZyTX/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/PTMAAOSwHF5cZyTY/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/hNMAAOSwj61cZyTY/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/~~wAAOSwWKpcZyTY/$_1.JPG?set_id=2"], "PostalCode": "66046", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "heartlandmarketplace", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 281, "PositiveFeedbackPercent": 99.6, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 479.85, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 479.85, "CurrencyID": "USD"}, "HighBidder": {"UserID": "0***1", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 170}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "1985 Fender Stratocaster Contemporary Right-Handed Electric Guitar M (140612101)", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "Model", "Value": ["STRATOCASTER CONTEMPORARY"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}]}, "HitCount": 712, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1820179182", "StoreName": "HPJExpress3"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}