{"BestOfferEnabled": false, "Description": "Unbelievable feel and price The SE Zach Myers has enough features to satisfy even the most demanding musicians. The resonance of the semi-hollow body paired with the smooth feel of the satin finish neck will make an immediate impression in your hands. \"I’ve been with PRS for 12 years. This is the best guitar I have ever played,\" – Zach Myers, Shinedown. Zach Myers, lead guitarist of the multi-platinum rock band Shinedown, picked up a PRS Custom 22 at the age of fifteen and announced his first SE signature model in 2010. As a guitarist who has rocked PRS on the stage and teched for several PRS bands, Myers has an intimate understanding of how a guitar should feel and what the build quality should be. After months of design and conversations with PRS’s SE team, Zach and PRS are pleased to introduce an all-new SE Zach Myers. The SE Zach Myers features a chambered mahogany body with maple cap, flame maple veneer and single f-hole that provides smooth mid-range tones with a natural, resonant internal reverb. The 22-fret 24.5 in. scale length wide fat neck boasts a satin finish that gives the guitar a very comfortable, woody, worn-in feel. Additional appointments to the SE Zach Myers signature model include PRS adjustable stoptail bridge, vintage style tuners, and PRS SE 245 pickups paired with two volume and two tone controls and a 3-way toggle pickup switch. Includes gig bag. FEATURESBodyBody shape: Single cutawayBody type: Semi-hollow or chambered bodyBody material: Solid woodTop wood: MapleBody wood: MahoganyBody finish: GlossOrientation: Right handedNeckNeck shape: Wide FatNeck wood: MahoganyJoint: Set-inScale length: 24.5 in.Truss rod: StandardNeck finish: SatinFretboardMaterial: RosewoodRadius: 10 in.Fret size: MediumNumber of frets: 22Inlays: BirdsNut width: 1.687 in. (42.8 mm)PickupsConfiguration: HHNeck: SE 245 BassMiddle: Not applicableBridge: SE 245 TrebleBrand: PRSActive or passive pickups: PassiveSeries or parallel: SeriesPiezo: NoActive EQ: NoSpecial electronics: NoneControlsControl layout: Master volume, tonePickup switch: 3-wayCoil tap or split: NoKill switch: NoHardwareBridge type: FixedBridge design: WraparoundTailpiece: Not applicableTuning machines: Vintage-styleColor: Nickel The MUSIC49 Difference: Music49 is an actual independant guitar shop located in Concord, NC. This is the actual guitar we have in stock, it's not a cover photo from the internet. We have actually played this guitar, and gone over it to check all functionality of the instrument, so it's not sitting on a shelf in a non-climate controlled warehouse.....instead, it's in our shop in the same humidity as the custom guitars we build, and we will go over the guitar again with a \"fine tooth comb\" before we ship it to the customer. If you have any preferences for setup or strings, please contact us before shipping because we have the ability to fine tune any of the aspects of this guitar. If we have not had any specific requests, we do our own inspection to ensure quality, and maintain the Manufacturer's specifications.", "ItemID": "143083540590", "EndTime": "2019-01-17T17:20:49.000Z", "StartTime": "2019-01-07T23:23:46.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/PRS-SE-Zach-Myers-2014-Trampas-Green-/143083540590", "ListingType": "FixedPriceItem", "Location": "Charlotte, North Carolina", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1430835405908080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg2ODA=/z/nRsAAOSwg5FcM9hi/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMTE4/z/i6EAAOSwdrdcM9hu/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg3ODI=/z/e-sAAOSw2zRcM9hg/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg2OTY=/z/CqIAAOSwGBRcM9ho/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDY4/z/gwAAAOSwWAhcM9hr/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/AKcAAOSw0~pcM9hm/$_12.JPG?set_id=880000500F"], "PostalCode": "28269", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "music_49", "FeedbackRatingStar": "Purple", "FeedbackScore": 686, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 550.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 550.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "l***b", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 558}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "PRS SE Zach Myers 2014 Trampas Green", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["PRS"]}, {"Name": "Model Year", "Value": ["2014"]}, {"Name": "Country/Region of Manufacture", "Value": ["Korea, Republic of"]}, {"Name": "Body Type", "Value": ["Semi-Hollow"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}]}, "HitCount": 164, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=127722571", "StoreName": "music 49 Inc"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Great Conditon", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}