{"BestOfferEnabled": false, "Description": "2011 Gibson Les Paul Junior TV Yellow, Custom Pickups, TonePros Bridge, Sperzel Locking Tuners Les Paul Junior The simple, no-nonsense Les Paul Junior has long been a favorite for everything from down and dirty rock and roll, to meanstreet blues, to raw garage punk. With a light all-mahogany, this guitar is totally down to business, while surprisingly versatile. Simple, screaming, superbly playable and undeniably hip, the Les Paul Junior has been a force to be reckoned with since 1954, and it’s still a powerhouse here in the 21st century. Just like the first Junior to roll off the line in Kalamazoo 57 years ago, the Les Paul Junior from Gibson USA is made from choice solid mahogany. An archetypal tonewood used in countless classic Gibson electric guitars, mahogany has a sonic depth and richness that can’t be beat, yet always remains clear and articulate. The guitar’s neck is also made from solid mahogany cut to the superior quarter-sawn orientation, carved to the fast yet comfortable SlimTaper™ profile, and glued into the body with the time-tested mortise & tenon joint that promotes resonance and sustain. It carries a baked maple fingerboard with 22 medium-jumbo frets and a 12-inch radius for easy, choke-free bending. A PLEK-cut Corian nut ensures precise intonation while enhancing sustain, which is further aided by Gibson’s traditional 17-degree back-angled headstock, silkscreened with the gold Gibson logo and “LP Model,” just like the originals. Product Features · Solid Mahogany body with satin finishe · Mahogany neck with SlimTaper™ neck profile · Baked Maple fingerboard with dot inlays · Powerful and versatile pickups · Sperzel locking Tuners This Gibson Les Paul Junior was customized for a TV commercial and video shoot. The guitar and bass were done up in a Honeybee theme. Both instruments were set up by a professional luthier using the best available parts. How does it work? Like a standard Les Paul, with 3-way toggle. The gold mini switch is 3 position, similar to a regular Les Paul. The pickups are a badass toneful single coil paired with an Eric Johnson Custom Humbucker. The pairing is perfectly balanced, and provides the familiar Rhythm/Both/Treble setup on any Gibson, but with a decidedly Gretsch-sounding edge. The both-on position is pure heaven. The EJ Bucker is pure tone, with girth AND edge, again with a bit of a Gretsch flavor, but still anchored in Gibson-land. The TonePros wraparound bridge, TonePros Locking Studs and Sperzel Locking tuners ensure this rock-solid Paul stays in tune, stays calibrated and sounding great! Pickup 1 Dimarzio Eric Johnson Custom Bridge Humbucker DP212 Although Eric Johnson is best known as a Strat® player, he has always played humbucker-equipped guitars as well. After getting a new Gibson® Les Paul® 1959 re-issue, Eric asked us if it could be made to sound like an old Gretsch® Country Gentleman guitar. We said, “No problem!” The pickups we designed are exact replacements for standard, full-size humbuckers. They’re bright and have great presence without sounding thin. When Eric tried them, he said they were almost as clear-sounding as Strat® pickups. He was surprised at how well they sounded with heavy distortion, because no matter how overdriven the sound, it did not become muddy. Gibson® and Les Paul® are registered trademarks of Gibson Guitar Corp., with which DiMarzio, Inc. is not affiliated. Techie Stuff If you look at the DC Resistance specs for these pickups, you will see they're very similar to PAF®-style models. However, their performance is very different in two important areas. They have less power and much more treble response than “vintage”\u009d humbuckers. In fact, treble response is comparable to that of typical single-coils, but since bass response is still very solid, the EJ Custom™ isn't thin-sounding. It's outstanding for chords and finger-picking, and has exceptional definition for soloing, even with extreme amounts of distortion. Wiring 4 Conductor Magnet Alnico 5 Resistance 7.85 Kohm Year of Introduction 2004 Pickup 2 Virtual Vintage Heavy Blues 2 DP409 If you’ve heard the cliché that Alnico 2 means warm, soft sound, prepare to be surprised. This is not a polite pickup, and the closer it’s adjusted to the strings, the more raw it gets. In particular, the Alnico 2 magnetic field opens up all of the attack and definition of the low strings. It’s a hot pickup with a strong attack in the bridge position, and its Alnico 2 magnets allow it to work very well in the neck position as well, for players who want a very warm, round sound. If you want an in-your-face-and-proud-of-it sound, the Virtual Vintage® Heavy Blues 2 is the top pick. The same technology that allowed us to create the pure vintage Strat® sound of the Area 58™ can also be used to design a much heavier pickup. The Virtual Vintage® Heavy Blues 2 has more mids and lows while still possessing outstanding pick attack. This also makes it an excellent pickup for the arpeggios and sweep picking classical metal players prefer, because it does not become muddy even with high gain. Wiring 4 Conductor Magnet Alnico 2 Resistance 8.53 Kohm Year of Introduction 2006 Case: Included hardshell flight case. SKB professional grade TSA-approved Flight Case, w/ Black interior.", "ItemID": "302985703688", "EndTime": "2018-12-16T03:42:03.000Z", "StartTime": "2018-12-06T03:42:03.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2011-Gibson-Les-Paul-Junior-Custom-Pickups-TonePros-Bridge-Sperzel-Lock-Tuners-/302985703688", "ListingType": "Chinese", "Location": "Eastpointe, Michigan", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/3029857036888080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMTEx/z/H90AAOSwmT1cCJhk/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMzQw/z/W80AAOSwLuBcCJhp/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjA4/z/gJwAAOSwzDFcCJhs/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ5MFgxNjAw/z/UJoAAOSw4m9cCJh1/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMzE4/z/yTUAAOSwy2pcCJh7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMTMz/z/R3AAAOSwmvpcCJh-/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY0/z/whYAAOSwF1tcCJiI/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMTQ1/z/QOYAAOSwBMpcCJip/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNDQ5/z/FrcAAOSwkHxcCJjB/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNTg4/z/ghwAAOSwWIJcCJjH/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ3NVgxNjAw/z/d4YAAOSwSs1cCJjM/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNDg5/z/UKUAAOSwiJZcCJjY/$_57.JPG?set_id=8800005007"], "PostalCode": "48021", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "danjo444", "FeedbackRatingStar": "Purple", "FeedbackScore": 709, "PositiveFeedbackPercent": 100.0}, "BidCount": 2, "ConvertedCurrentPrice": {"Value": 499.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 499.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "s***t", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 625}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2011 Gibson Les Paul Junior, Custom Pickups TonePros Bridge, Sperzel Lock Tuners", "ItemSpecifics": {"NameValueList": [{"Name": "Model Year", "Value": ["2011"]}, {"Name": "Model", "Value": ["Les Paul Junior Special"]}, {"Name": "Modified Item", "Value": ["Yes"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Modification Description", "Value": ["Pickups, Tuners, Bridge"]}, {"Name": "Body Color", "Value": ["TV Yellow"]}, {"Name": "Features", "Value": ["Single Cut", "Volume Knob", "With Pickup"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Body Material", "Value": ["Mahogany"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Type", "Value": ["Solid"]}]}, "HitCount": 421, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 504.0, "CurrencyID": "USD"}, "ProductID": {"Value": "78630819", "Type": "Reference"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Good.  A few dings.  No Breaks or Repairs.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}