{"BestOfferEnabled": false, "Description": "Vintage Epiphone ET-270 Electric Guitar, Cherry Burst, All Original, Early 1970's Japan, w/ Case!! Up for sale is a RARE Vintage Epiphone ET-270 Electric Guitar & Case. This guitar was made in the early '70's in the Matsumoku factory in Japan, which was responsible for some of the best electric models of the era. It is in remarkably clean and untouched condition, having only a few very light pick marks on the guard, which places it firmly in near-mint condition, amazing for an instrument from the very early 1970's! Check the pics closely, and you'll agree it looks almost like new. Owned since new by a local elderly gentleman who no longer can play, and it was obviously taken out or used very little over the years, with most of it's life being spent inside it's original chipboard case (included) in his closet. The case is in good shape for a period chipboard, too, other than hardware corrosion and being a bit musty. Don't think these types of cases were ever meant to seriously transport instruments, more for storage or keeping the dust off at home. I'd recommend getting a good hard-shell case for this fine guitar, but I'm including the original chipboard case since they've been together for so many years, and it will afford some protection in shipping anyway. Everything on this guitar is stock ORIGINAL! All knobs, switches, metal tuners, bridge parts/rollers and strap buttons are clean, shiny, and original. This guitar even includes the original tremolo arm (w/ black knob) and tremolo/bridge cover, which are almost always missing!) All electronics and pickups are original and fully operational. It also has the original bass boost circuit and switch which is a real hoot! The pickups are clean and fairly hot, white plastic frames with black inserts, fully adjustable with individual pole pieces. I cleaned the pots and output jack and installed a new set of 9.5's strings so it's ready to go. The nice Rosewood fingerboard, frets, nut and bridge are all in fine condition and it plays great, although you may want to set it up for your personal preferences which is always up to the player. The truss rod is fully functional and the neck is straight. Amazingly, all the metal parts are like new, shiny and rust-free, the beautiful red Cherry-burst lacquer finish on the Fenderesque (basswood?) body is also like new, and the neck & headstock finish is like new and unblemished. There's plenty of room for adjustment (up or down) in the floating bridge saddle, and the neck heel is unshimmed and just like it came from the factory. The neck is a thin, flat \"D\" shape, with 1 9/16\" (40 mm) nut width and very comfortable. This guitar features the 5-piece neck construction made famous by Matsumoku, and the 4 neck mounting screws are tight, with a bone nut, and it's all set off with the nice abalone \"Epiphone\" logo on the headstock and large stylized \"E\" on the pickguard in between the pickups. You may find one or two of these rare guitars here and there but you'll have to look long and hard and/or be very lucky to ever find a cleaner or more unplayed example of this RARE model! It should be in a museum, it's that nice! Most anyone reading this knows what you have here, how this model guitar was made famous by Kurt Cobain - - all that stuff. But, honestly, this is just a great guitar without it's high place in guitar history. Here's your chance to pick up a NEAR-MINT example of this famous vintage guitar - - don't let this one get away! I will ship the guitar with the tremolo arm removed and packed separately inside the chipboard case right beside it, so look for the little package with the arm before discarding the bubble wrap. It will be clearly identified so should be no problem. The strings will also be run down a step or two for shipping. I will wrap the guitar securely inside it's original chipboard case and pack that snuggly inside a shipping box and ship by UPS Ground within 3 business days of receiving your PayPal payment (I accept PayPal only, and will only ship to verified street addresses, no P.O. Boxes). I ship ONLY to the lower 48 US States, sorry. No foreign bidders, please! PLEASE READ LISTING DESCRIPTION CAREFULLY AND ASK QUESTIONS BEFORE YOU BID!! Check out my feedback and bid with confidence!! While I don't accept returns, I do guarantee the guitar to be as described and want you to be satisfied. If there's a problem please contact me first before leaving negative feedback and I'll work it out. I strive for 100% customer satisfaction!! GOOD LUCK BIDDING!!", "ItemID": "254118732328", "EndTime": "2019-02-18T00:19:39.000Z", "StartTime": "2019-02-11T00:19:39.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Vintage-EPIPHONE-ET-270-Cherry-Burst-Electric-Guitar-Japan-All-Original-w-Case-/254118732328", "ListingType": "Chinese", "Location": "Mars Hill, North Carolina", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2541187323288080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/JOYAAOSwVblcXvHZ/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Jy8AAOSw9C5cXvG3/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/TrMAAOSwCtJcXvHO/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/S4YAAOSwXoJcXvHY/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/Iu8AAOSwqctcXvHO/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/tqsAAOSwwmlcXvHG/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/zdoAAOSwaEZcXvHV/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/LNoAAOSwceZcXvHU/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/fO8AAOSw0qdcXvGr/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/gS0AAOSwEP9cXvHV/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/XcsAAOSwWB5cXvHa/$_32.JPG?set_id=880000500F"], "PostalCode": "28754", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "bearwallowtunes", "FeedbackRatingStar": "Purple", "FeedbackScore": 573, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 595.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 595.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "y***_", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 556}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Vintage EPIPHONE ET-270 Cherry Burst Electric Guitar Japan, All Original w/ Case", "ItemSpecifics": {"NameValueList": [{"Name": "Body Material", "Value": ["Basswood"]}, {"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["ET-270"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Cherry Burst"]}]}, "HitCount": 116, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 605.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}