{"BestOfferEnabled": false, "Description": "Powered by Frooition Pro Shop Search 1990 Fender American Stratocaster Ultra Electric Guitar-Sunburst w/Gig Bag Click here to view full size. Full Size ImageClick to close full size. Item Description 1990 Fender American Stratocaster Plus Ultra in very good condition. The front has light pick marks next to the neck pickup, a light scratch next to the middle pickup, a light ding close to the scratch and a finish blemish by the output jack. The blemish appears to be below the finish. The back has a moderate amount of light scratches. Classic Sunburst finish on the lightly figured body with a white pickguard and chrome hardware. The guitar has a nice action and the thin profile maple neck with an ebony fretboard has a very good feel. The medium jumbo frets are in very good condition with only light playwear.The Fender Lace Sensor pickups (blue/gold/red) have a nice tone and good output. The bridge position is a humbucker made from 2 Fender Lace Sensor Reds. This pickup has a lot of output. The electronics are a 5-way toggle switch, TBX tone circuit and a three position(front coil/series/rear coil) switch for the bridge pickup. The guitar is equipped with a roller nut, locking tuners a two point tremolo with solid block saddles and a Trem-setter tremolo stabilizer. This is a really nice looking, sounding and playing guitar.Includes a gig bag and tremolo arm. Serial Number: E972981 Weight: 7 lbs. 12 oz. About Us Payment Shipping Terms Returns About UsWe offer a large selection of quality pre-owned musical instruments and equipment from the industries finest manufactures including Akai, Ampeg, Boss, Denon, Digidesign, DigiTech, Epiphone, Fender, Gibson, Gretsch, Guild, Ibanez, Korg, Lexicon, Line 6, Mackie, Mesa Boogie, Marshall, Martin, MusicMan, MXR, Neumann, Peavey, Pioneer, PRS, Roland, Shure, Tascam, Taylor, TC Electronic and Yamaha. New gear arrives daily so check our store often. Lighthouse Sound, Inc. is proud to be an authorized dealer of the following brands of guitar effects pedals, pedal boards, amplifiers and accessories: Bearfoot FX, Bigsby, Cooper Stands, Dunlop, Earthquaker Devices, Ernie Ball, EVH, Fender Accessories, Keeley Electronics, Gretsch Accessories, Ken Smith Strings, Lava Cable, Martin Accessories, Mojo Hand FX, RotoSound, SnaKe Oil Strings, Snark Tuners, Suhr Guitars, Amps, Pedals and Pickups, Voodoo Lab and Wampler Pedals About Us Payment Shipping Terms Returns PaymentWe accept PayPal payments. All major Credit Cards are accepted through PayPal including Master Card, Visa, American Express and Discover. About Us Payment Shipping Terms Returns ShippingLighthouse Sound specializes in prompt, safe shipping. We take great care packaging every item to ensure safe shipment to you. We get your gear to you fast, most orders ship within 1 business day of payment clearance. Tracking information is uploaded to eBay and can be viewed from your eBay account. International customers are responsible for any duties, taxes, brokerage or other fees. Please check with your country's customs office to determine what these additional costs will be. These fees vary from country to country and we have no way to calculate them. About Us Payment Shipping Terms Returns TermsSales Tax - 7 % Ohio Sales Tax will be added to the total amount for all purchases delivered to Ohio. We take pride in our customer service and your satisfaction is very important to us. In the rare event that you have a problem with your item please contact us and we'll be happy to help. While all care is taken, any errors, omissions or variations in the item details are unintentional. About Us Payment Shipping Terms Returns ReturnsWe offer a 14 day return policy. Items must be returned to us within 14 days of the original delivery date. We ask that you please return the product in the original product packaging along with all included materials (manual, warranty card, all accessories) and in the original condition that it was received. Buyer is responsible for return shipping and insurance cost. Refunds will be issued upon return of the item less the original shipping charge and a 15% restocking fee will apply. Helpful Links More Items! This listing is currently undergoing maintenance, we apologize for any inconvenience caused. Powered by SixBit's eCommerce Solution", "ItemID": "362502097392", "EndTime": "2019-01-03T04:39:25.000Z", "StartTime": "2018-12-05T08:10:08.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1990-Fender-American-Stratocaster-Ultra-Electric-Guitar-Sunburst-w-Gig-Bag-/362502097392", "ListingType": "FixedPriceItem", "Location": "Salem, Ohio", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/3625020973928080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/ODM1WDE1NjA=/z/BD0AAOSwyYRcB4fA/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODk3WDE1MDg=/z/etEAAOSw64xcB4fD/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTUzMFg4NjQ=/z/kEoAAOSwcOZcB4fF/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTU2NVg4NjQ=/z/NGQAAOSwUVFcB4fN/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/tfEAAOSwzZNcB4fP/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/GR0AAOSwC~9cB4fS/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/hz8AAOSwfplcB4fX/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/euoAAOSw64xcB4fU/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDU5/z/a4MAAOSwhnlcB4fI/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDU5/z/HYUAAOSwwTFcB4fL/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/HMYAAOSw3bZcB4fa/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/37sAAOSwWIJcB4fc/$_57.JPG?set_id=880000500F"], "PostalCode": "44460", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "lighthouse_sound", "FeedbackRatingStar": "TurquoiseShooting", "FeedbackScore": 33092, "PositiveFeedbackPercent": 99.6, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1399.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1399.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "l***9", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 337}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "CA", "GB", "DK", "RO", "SK", "BG", "CZ", "FI", "HU", "LV", "LT", "MT", "EE", "AU", "GR", "PT", "CY", "SI", "JP", "CN", "SE", "KR", "ID", "TW", "TH", "BE", "FR", "HK", "IE", "NL", "PL", "ES", "IT", "DE", "AT", "BS", "IL", "MX", "NZ", "SG", "CH", "NO", "SA", "UA", "AE", "QA", "KW", "BH", "HR", "MY", "CO", "PA", "JM", "BB", "BD", "BM", "BN", "BO", "EG", "GF", "GG", "GI", "GP", "IS", "JE", "JO", "KH", "KY", "LI", "LK", "LU", "MC", "MO", "MQ", "MV", "NI", "OM", "PK", "PY", "RE"], "Site": "US", "TimeLeft": "PT0S", "Title": "1990 Fender American Stratocaster Ultra Electric Guitar-Sunburst w/Gig Bag", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Model", "Value": ["Stratocaster Ultra"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Color", "Value": ["Sunburst"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Model Year", "Value": ["1990"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}]}, "HitCount": 248, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=22579709", "StoreName": "LHSound"}, "Country": "US", "ReturnPolicy": {"Refund": "Money back or replacement (buyer's choice)", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": true, "QuantitySoldByPickupInStore": 0, "SKU": "42931", "NewBestOffer": false}