{"BestOfferEnabled": false, "Description": "Powered by Frooition Pro Shop Search 2016 Gibson Non Reverse Firebird Limited Electric Guitar Vintage Copper w/ Gbag Click here to view full size. Full Size ImageClick to close full size. Item Description 2016 Gibson Non-Reverse Firebird Limited electric guitar in very good condition with a light ding on the backt on the rib contour. Very cool Vintage Copper finish on the Mahogany body with a black pick guard and hardware. The guitar has a nice action and the slim taper Mahogany neck with mother of pearl dot inlays has a great feel. The frets are in excellent condition with hardly any wear. The '57 Classic neck and '57 Classic Plus humbuckers with Alnico II magnets have a nice PAF tone with good output. The guitar is equipped with a tune-o-matic bridge, stop bar tailpiece and mini Grover tuners. This is one of 600 made, don't let this one get away! Looks, plays and sounds great. Includes a gig bag. Made in the USA. Serial Number: 160088226 Weight: 7 lbs. 1 oz. The Gibson 2016 Limited Vintage Copper Non-Reverse Firebird brings back the revolutionary design from 1965 with some modern-day upgrades! The 2016 Limited Vintage Copper Non-Reverse Firebird is a recreation of the legendary design that Gibson made famous in 1965, when Gibson redesigned the Firebird and gave it a more streamlined look. The 2016 Limited Edition Firebird captures the essence of this classic while incorporating some modern components to satisfy today’s players. The solid mahogany neck set into a mahogany body, maximizing sustain and resonance. The body also sports a belly contour to enhance player comfort. The neck has been carved into an ultra-slim profile for high velocity soloing, and a 22 fret fingerboard tops it all off. This current edition of the Firebird Non-Reverse has been outfitted with a pair of 57 Classic Humbuckers pickups with Alnico II magnets to deliver those fat tones. A no-nonsense control panel features a 3-way selector switch, along with master volume and a master tone control.The blackened hardware includes a tune-o-matic bridge and stop tailpiece, along with high-quality Mini Grover kidney button tuners for extreme tuning precision. Gibson Limited Firebird Non Reverse Guitar Features Mahogany body and neck Non-Reverse Body Style Classic ‘57 Pickups Vintage Copper Finish 600 Guitars produced Worldwide About Us Payment Shipping Terms Returns About UsWe offer a large selection of quality pre-owned musical instruments and equipment from the industries finest manufactures including Akai, Ampeg, Boss, Denon, Digidesign, DigiTech, Epiphone, Fender, Gibson, Gretsch, Guild, Ibanez, Korg, Lexicon, Line 6, Mackie, Mesa Boogie, Marshall, Martin, MusicMan, MXR, Neumann, Peavey, Pioneer, PRS, Roland, Shure, Tascam, Taylor, TC Electronic and Yamaha. New gear arrives daily so check our store often. Lighthouse Sound, Inc. is proud to be an authorized dealer of the following brands of guitar effects pedals, pedal boards, amplifiers and accessories: Bearfoot FX, Bigsby, Cooper Stands, Dunlop, Earthquaker Devices, Ernie Ball, EVH, Fender Accessories, Keeley Electronics, Gretsch Accessories, Ken Smith Strings, Lava Cable, Martin Accessories, Mojo Hand FX, RotoSound, SnaKe Oil Strings, Snark Tuners, Suhr Guitars, Amps, Pedals and Pickups, Voodoo Lab and Wampler Pedals About Us Payment Shipping Terms Returns PaymentWe accept PayPal payments. All major Credit Cards are accepted through PayPal including Master Card, Visa, American Express and Discover. About Us Payment Shipping Terms Returns ShippingLighthouse Sound specializes in prompt, safe shipping. We take great care packaging every item to ensure safe shipment to you. We get your gear to you fast, most orders ship within 1 business day of payment clearance. Tracking information is uploaded to eBay and can be viewed from your eBay account. International customers are responsible for any duties, taxes, brokerage or other fees. Please check with your country's customs office to determine what these additional costs will be. These fees vary from country to country and we have no way to calculate them. About Us Payment Shipping Terms Returns TermsSales Tax - 7 % Ohio Sales Tax will be added to the total amount for all purchases delivered to Ohio. We take pride in our customer service and your satisfaction is very important to us. In the rare event that you have a problem with your item please contact us and we'll be happy to help. While all care is taken, any errors, omissions or variations in the item details are unintentional. About Us Payment Shipping Terms Returns ReturnsWe offer a 14 day return policy. Items must be returned to us within 14 days of the original delivery date. We ask that you please return the product in the original product packaging along with all included materials (manual, warranty card, all accessories) and in the original condition that it was received. Buyer is responsible for return shipping and insurance cost. Refunds will be issued upon return of the item less the original shipping charge and a 15% restocking fee will apply. Helpful Links More Items! This listing is currently undergoing maintenance, we apologize for any inconvenience caused. Powered by SixBit's eCommerce Solution", "ItemID": "233051048670", "EndTime": "2019-01-02T17:08:27.000Z", "StartTime": "2018-12-17T04:54:26.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2016-Gibson-Non-Reverse-Firebird-Limited-Electric-Guitar-Vintage-Copper-w-Gbag-/233051048670", "ListingType": "FixedPriceItem", "Location": "Salem, Ohio", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2330510486708080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/M5EAAOSw29Jb7dML/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/jDsAAOSwAfVb7dMO/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/TdYAAOSwzhZb7dMR/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/PkAAAOSwNTNb7dMT/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/F5sAAOSwQTRb7dMW/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/Qi8AAOSw7PJb7dMZ/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/3JsAAOSwatBb7dMb/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/4UUAAOSwqxdb7dMe/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/U68AAOSwWSlb7dMj/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/Q3YAAOSwQrVb7dMh/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/5LUAAOSwkHxb7dMp/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/ds4AAOSwNmxb7dMm/$_57.JPG?set_id=880000500F"], "PostalCode": "44460", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "lighthouse_sound", "FeedbackRatingStar": "TurquoiseShooting", "FeedbackScore": 33092, "PositiveFeedbackPercent": 99.6, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 849.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 849.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "i***i", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 61}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "CA", "GB", "DK", "RO", "SK", "BG", "CZ", "FI", "HU", "LV", "LT", "MT", "EE", "AU", "GR", "PT", "CY", "SI", "JP", "CN", "SE", "KR", "ID", "TW", "TH", "BE", "FR", "HK", "IE", "NL", "PL", "ES", "IT", "DE", "AT", "BS", "IL", "MX", "NZ", "SG", "CH", "NO", "SA", "UA", "AE", "QA", "KW", "BH", "HR", "MY", "CL", "CO", "CR", "PA", "TT", "GT", "HN", "JM", "BB", "BD", "BM", "BN", "BO", "EG", "GF", "GG", "GI", "GP", "IS", "JE", "JO", "KH", "KY", "LI", "LK", "LU", "MC", "MO", "MQ", "MV", "NI", "OM", "PK", "PY", "RE"], "Site": "US", "TimeLeft": "PT0S", "Title": "2016 Gibson Non Reverse Firebird Limited Electric Guitar Vintage Copper w/ Gbag", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Model", "Value": ["Non Reverse Firebird Ltd."]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Color", "Value": ["Vintage Copper"]}, {"Name": "Model Year", "Value": ["2016"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Gibson Styles", "Value": ["Firebird"]}, {"Name": "Model, Series", "Value": ["Limited"]}, {"Name": "Type", "Value": ["Electric Guitar"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}]}, "HitCount": 359, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=22579709", "StoreName": "LHSound"}, "Country": "US", "ReturnPolicy": {"Refund": "Money back or replacement (buyer's choice)", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": true, "ConditionDescription": "2016 Gibson Non-Reverse Firebird Limited electric guitar in very good condition with a light ding on the back on the rib contour. Very cool Vintage Copper finish on the Mahogany body with a black pick guard and hardware. The guitar has a nice action and the slim taper Mahogany neck with mother of pearl dot inlays has a great feel. The frets are in excellent condition with hardly any wear. The '57 Classic neck and '57 Classic Plus humbuckers with Alnico II magnets have a nice PAF tone with good output. The guitar is equipped with a tune-o-matic bridge, stop bar tailpiece and mini Grover tuners. This is one of 600 made, don't let this one get away! Looks, plays and sounds great. \n\nIncludes a gig bag. Made in the USA.\n\nSerial Number: 160088226\n\nWeight:    7 lbs.  1 oz.", "QuantitySoldByPickupInStore": 0, "SKU": "43807", "NewBestOffer": false}