{"BestOfferEnabled": false, "Description": "DJ GEAR INSTRUMENT GEAR LIVE SOUND RECORDING MICROPHONES HEADPHONES ACCESSORIES SOFTWARE LIGHTING BUNDLES Authorized Dealer - Full Warranty Jackson JS Series RR Minion Jackson JS1X Metallic Blue Burst - Used 2/3 Scale Electric Guitar - Used - Description Spotlight-stealing looks and giant sound in a small package! With its 2/3-scale (22.5&rdquo;), the JS Series RR Minion JS1X is perfect for little shredders or grownup road dogs who need an easy-traveling instrument jam-packed with the features they love. The RR Minion JS1X offers a poplar body, speedy bolt-on maple neck with graphite reinforcement rods and a 12&rdquo;-radius amaranth fingerboard with 24 jumbo frets and sharkfin inlays. Other features include an angled neck plate and rear-angled headstock for even tension (reducing playing fatigue), dual Jackson high-output humbucking pickups with three-way blade switching, string-through-body hardtail bridge and jet black hardware, including a classic Strat-style jack plate and Jackson die-cast tuners. 22.5\" Short Scale Length At 22.5\" scale length, this shorter scale guitar is ideal for little shredders or grownup road dogs who need an easy-traveling instrument. Jackson High-Output Humbucking Pickups These Jackson high-output humbucking pickups are painstakingly voiced for full, rich tone while providing maximum overdrive and sustain. Features/Specs General Series : JS Color : Metallic Blue Burst Number Of Strings : 6 Orientation : Right-Hand Body Body Finish : Satin Body Shape : Rhoads Body Material : Poplar Miscellaneous Strings : NPS, .009-.042 Gauges Neck Neck Construction : 1-Piece Maple Neck Finish : Satin Scale Length : 22.5\" (572 mm) Fingerboard Radius : 12\" (305 mm) Fingerboard Material : Amaranth Number Of Frets : 24 Fret Size : Jumbo Nut Width : 1.625\" (41.3 mm) Position Inlays : Pearloid Sharkfin Truss Rod Nut : Truss Rod Adjustment at Nut Headstock : Jackson Pointed 6-In-Line Neck Plate : 4-Bolt (recessed screws) Hardware Bridge : 6-Saddle String-Through-Body Hardtail With Block Saddles Hardware Finish : Black : Tuning Machines : Jackson Sealed Die-Cast Pickguard : None Control Knobs : Black Dome Style Electronics Bridge Pickup : Jackson High-Output Humbucking Neck Pickup : Jackson High-Output Humbucking Controls : Volume, Tone Pickup Switching : 3-Position Blade: Position 1. Bridge Pickup, Position 2. Bridge and Neck Pickups, Position 3. Neck Pickup We are authorized dealers for all these brands. Click a logo to see our listings. We collect NYS Sales Tax for items shipping within New York. Local duties, taxes and fees out of the USA are not included in the sale price or ship charge. Proaudiostar is not responsible for any taxes outside of NY and or the USA. If an item is refused by the buyer, ship costs to and from the destination in which the item was shipped to are not refunded. Please note the cost of return shipping is usually double of what the original ship cost. Shipping is not free to HI, AK, and PR. FREE SHIPPING ONLY TO THE LOWER 48 STATES. We provide free shipping to the contiguous 48 United States, on most items. Shipping fees to ALL OTHER LOCATIONS will be calculated individually and added to customer invoices. Local duties, taxes and charges are not included in the sale price or ship charges. ProAudioStar is not responsible for any taxes outside of NY and or the USA. In the event that the customer refuses a shipment, all shipping costs to and from the country or State in which the item was shipped to are not refunded. Please note, in some cases return shipping can cost as much as double the original ship cost. We operate a 30-day return period. Items must be returned with all original packaging as well as all included items. Items that are not returned in original, resalable condition are subject to a 15% restocking fee. We charge a 15% restocking fee on returned items only if the item is clearly used and or the packaging is tarnished. A 10% re-stock is more likely if the unit comes back in mint condition. The ship cost we paid to ship your item will be deducted as well. In some cases restock fees and ship costs can be applied as a store credit. We will exchange a defective unit for the same unit within the 30-day period. After that period, you will have to work directly with the manufacturer for warranty service. Items that can not be returned include: software, units with contents or packaging that is damaged/missing, and items that are considered for personal use (such as earphones, headphones, microphones, instrument mouthpieces, harmonicas or other items that you wouldn't want to purchase if someone else had previously used them). Also, Items which we do not normally stock (i.e. \"Special Orders\", discontinued products, close-outs, used products, etc.) are non-returnable. We strongly suggest that you check your order after receiving it to be sure that it is in proper working order. Please contact us for a Return Authorization before returning any items.", "ItemID": "292884276891", "EndTime": "2019-01-20T23:59:02.000Z", "StartTime": "2018-12-21T23:25:34.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Jackson-JS-Series-RR-Minion-Jackson-JS1X-Metallic-Blue-Burst-2-3-Scale-Guitar-/292884276891", "ListingType": "FixedPriceItem", "Location": "Winchester, Virginia", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2928842768918080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/OTg0WDEyMTU=/z/WBEAAOSw-V1cHXad/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTg0WDEyMTU=/z/MYYAAOSwC~9cHXac/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTg0WDEyMTU=/z/P-oAAOSw87JcHXac/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTg0WDEyMTU=/z/tUAAAOSwzFhcHXac/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTg0WDEyMTU=/z/ayAAAOSw-QxcHXac/$_1.JPG?set_id=880000500F"], "PostalCode": "22601", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 2, "Seller": {"UserID": "proaudiostar", "FeedbackRatingStar": "RedShooting", "FeedbackScore": 211095, "PositiveFeedbackPercent": 98.8, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 129.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 129.99, "CurrencyID": "USD"}, "ListingStatus": "Completed", "QuantitySold": 2, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Jackson JS Series RR Minion Jackson JS1X Metallic Blue Burst 2/3 Scale Guitar -", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["ESP"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}]}, "HitCount": 534, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=336450849", "StoreName": "proaudiostar"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "DiscountPriceInfo": {"OriginalRetailPrice": {"Value": 169.99, "CurrencyID": "USD"}, "PricingTreatment": "STP", "SoldOneBay": false, "SoldOffeBay": false}, "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "BR"], "GlobalShipping": false, "ConditionDescription": "Used", "QuantitySoldByPickupInStore": 0, "SKU": "JAK-29133345-27-B", "NewBestOffer": false}