{"BestOfferEnabled": true, "Description": "Vintage 1985 Aria Pro II RS Wildcat Electric Guitar - Matsumoku Japan - Rare Black on Black Finish - Excellent Please make your offer before the auction endsThe elegant lead model in Aria's RS Series Produced in 1985 - at the peak of the Aria-Matsumoku collaboration Rare Black on Black finish - including black signed tunersAsh bodyMaple neck with rosewood fretboard22 regular frets, hand finished edgesModerate curvature, butter smooth neckGraphite nutAria/Maxon Hot Rails I pickups - two single rails and one humbucker double railTone and volume controls, humbucker coil tap in the tone controlFive-position pickup selector (seven tones total)Aria ACT-2 floating tremolo bridgeSigned black MHG machine heads Finish: Black on Black (\"BK\")Hardware: BlackYear: 1985Plant: MatsumokuCountry: Japan A very special guitar from the late production runs of the Wildcat series, built at the Matsumoku factory, featuring Hot Rails I pickups (earlier Wildcats had traditional pole single coils) - reminiscent of the Knight Warrior, but with a simpler and lighter ACT-2 bridge, and a gentler tone. The guitar plays and sounds great, and is in excellent condition. The sustain and intonation are everything you would expect from a true vintage hand-finished instrument. The finish is very well preserved and shiny, with a few light traces of use and faint marks that do not detract from presentation or sound. The neck is straight, the frets have practically no wear. The rare black hardware works fine. The ACT-2 floating tremolo accepts a 6 mm threaded tremolo arm, which is included. All in all, a great addition to your guitar rack or your collection. It is hard to believe this instrument is over 30 years old. I verify my guitars against available Aria catalogs and corroborated information from collectors. Please be aware of the many built-from-parts and look-alike guitars, as well as unauthorized restorations. This is not one of them. Please also do not confuse the Wildcat and the Bobcat lines with the Cat and the Straycat lines that are often offered online. The Straycats and just Cats were hardwood and plywood guitars that were manufactured partially in Korea after the Matsumoku plant went bankrupt in early 1986. My instruments are kept in a climate controlled, smoke-free and dust-free environment. They are regularly maintained and never taken to gigs. Any signs of prior use come from previous owners and are carefully documented. Please take a look at the included high-resolution photos and feel free to ask any questions prior to bidding or purchase. The guitar is sold as-is with no returns. It will be packaged safely and shipped promptly with full insurance and tracking. Thanks, and good luck! This auction description and images are Copyright (C) by travellight at cyberalia com. All rights reserved. Unauthorized duplication of these materials is prohibited.", "ItemID": "233056865651", "EndTime": "2019-02-28T04:49:04.000Z", "StartTime": "2018-12-19T20:43:45.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Vintage-1985-Aria-Pro-II-RS-Wildcat-Black-Strat-Electric-Guitar-Matsumoku-Japan-/233056865651", "ListingType": "FixedPriceItem", "Location": "Silver Spring, Maryland", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2330568656518080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg4OTY=/z/9eoAAOSwZtRcGqyS/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg4OTY=/z/XysAAOSwQwFcGqyV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg4OTY=/z/ZjYAAOSwVP5cGqyY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg4OTY=/z/9uMAAOSw0YlcGqyb/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg4OTY=/z/QlwAAOSw76lcGqyd/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg4OTY=/z/1MwAAOSwztVcGqyg/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg4OTY=/z/hsgAAOSwP8dcGqyj/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg4OTY=/z/vJ4AAOSwUm5cGqyl/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg4OTY=/z/nU8AAOSwTSlcGqyo/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg4OTY=/z/fHMAAOSwQ5pcGqyr/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg4OTY=/z/p6wAAOSwjrFcGqyu/$_57.JPG?set_id=8800005007"], "PostalCode": "20910", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "travellight", "FeedbackRatingStar": "Purple", "FeedbackScore": 859, "PositiveFeedbackPercent": 99.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 525.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 525.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "d***l", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 126}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Vintage 1985 Aria Pro II RS Wildcat Black Strat Electric Guitar Matsumoku Japan", "HitCount": 306, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "Oceania", "Southeast Asia", "South America", "BM", "GL", "MX", "PM"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}