{"BestOfferEnabled": false, "Description": "Gibson Custom Shop Dickey Betts SG VOS 167 of 250 Limited Run Collectible Rare This is Gibson Custom Dickey Betts SG VOS. Only 250 Dickey Betts SG was made and this one is #167. The guitar is in mint condition except for original relic. It includes original Gibson hardshell case and case candy. I ONLY SHIP TO LOWER 48 CONTINENTAL STATES; If you require shipment outside the US, please do not bid on this item. *Thank you. Please do not hesitate to contact us for more information. Demo Video Dickey Betts SG One of the most storied guitars in rock and roll history, the 1961/62 Gibson SG Standard given to Duane Allman by Dickey Betts during their playing days together, is an instrument of near-mythic proportions. Betts gifted Allman an SG so he didn’t have to wait while Duane re-tuned. Instead Allman could switch between the 1961/62 Gibson SG Standard and one of his Les Pauls. This guitar has long been feted as an iconic road warrior, and a classic tone machine. Now Gibson Custom has recreated this living slice of rock history in extremely limited numbers as the Dickey Betts “From One Brother to Another” SG. Produced in extremely limited numbers, with 75 examples hand-aged by Gibson Custom and signed by Betts, and another 250 featuring Gibson Custom's VOS (Vintage Original Spec) finish process and appointments, this model is an exacting reproduction of a stand-out SG from a golden age of guitar production. It offers the sublime tone and playing feel that these guitars are known for, with the looks of a hard-working legend. The body of the Dickey Betts “From One Brother to Another” SG is constructed from one piece of genuine mahogany, carved to the historically accurate early ’60s SG shape with dual asymmetrical horns and beveled edges. A deep-set glued-in neck is carved from one piece of superior quarter-sawn mahogany and topped with a rosewood fingerboard with 22 “banjo frets” like the original. All examples are finished in genuine hand-sprayed nitrocellulose lacquer in Vintage Red; 75 of these will be meticulously hand aged to match the look of the original guitar, while a further 250 will be treated to Gibson Custom’s acclaimed VOS process, which exhibits the look of a gently aged and faded instrument. Details of the hand aging include the extreme fading and minor wear on the top of the SG, the ageing of all hardware and plastics, and considerable wear to the back of the neck, with minor dings and large patches of finish missing do to the heavy playing time this guitar experienced. All in all, the Dickey Betts “From One Brother to Another” SG accurately embodies the look and feel of the original 1961/62 SG given to Allman by Betts. SG Standards of the early ’60s carried some of the finest Gibson humbucking pickups ever made, units in transition between the “Patent Applied For” and “Patent Number” eras. To capture this superlative tone, Gibson Custom loads the Dickey Betts “From One Brother To Another” SG with a pair of Custom Buckers with aged nickel covers, wound and constructed to precise PAF specs, with rare Alnico III magnets and slightly mismatched and unpotted coils, two of the secrets to the articulate and slightly edgy tone for which great PAF and Patent No. pickups are famous. The guitar carries a genuine Nylon 6/6 nut, with slots cut on Gibson’s PLEK for optimum precision, which are matched by nylon saddles in the ABR-1 Tune-o-matic bridge. To mirror a popular modification of the time, as performed on the original guitar, this SG carries a stopbar tailpiece in place of the Lyre vibrola, an upgrade undertaken to improve sustain and stability, while a set of enclosed metal-button nickel tuners represent another common modification. All in all, this exclusive guitar presents a miraculous means of getting a realistic slice of Allman Brothers tone and history into your hands—but numbers are extremely limited, so check out the Dickey Betts “From One Brother to Another” SG at your authorized Gibson dealer today. Each guitar includes a Gibson hardshell case; 75 hand-aged examples include a leather Certificate of Authenticity signed by Dickey Betts and a collage poster of the original guitar signed by the Custom Shop. The remaining 250 VOS examples include a Certificate of Authenticity and collage poster. All are covered by Gibson’s Limited Lifetime Warranty and 24/7/365 Customer Service. Specification Body Species : MahoganyAdhesive : Franklin Titebond 50 Neck Species : MahoganyProfile : Dickey Betts ProfileTruss Rod : Traditional AdjustableJoint Angle : 5° (+/- 15 seconds)Adhesive : Franklin Titebond 50 Neck Fit Joint : Mortise & TenonAdhesive : Franklin Titebond 50Joint Angle Tolerance : +/- .005\" Fingerboard Species : RosewoodFrets : 22Binding : CreamRadius : 12\"Nut/E.O.B : 1.687\"/2.062\"Inlays : Aged Acrylic TrapezoidOther : Banjo Fret Wire/Tortoise Side Dots Nut Materia : CorianWidth : 1.695Slots : Gibson PLEK System Headstock Logo : Mother of Pearl \"Gibson\" Logo with Holly VeneerTruss Rod Cover : Black Vintage Antique Bell Tuners Model : Classic StylePlating : ChromeTuning Ratio : 12:1 Bridge Type : ABR-1 Bridge with Plastic SaddlesPlating : Nickel Tailpiece Type : Add-on Wraparound TailpiecePlating : Nickel Hardware Knobs : Black Top Hat with Chrome Inserts and Dial PointersPickguard : Black '61 Style with 5-Ply Cream BindingPickup Covers : BlackToggle Switch Washer : Black with Gold SilkscreenControl Plate Cover : Black AcrylicStrings : .010 - .046, Genuine Gibson stringsStrap Buttons : Aluminum Pickups Neck Position : Custom Bucker (Alnico III)Bridge Position : Custom Bucker (Alnico III) Electronics Potentiometers : 2 Volume Controls, 2 Tone ControlsCoil Wiring : Machine WoundToggle Switch : Three-way Switchcraft with Gretch Toggle CapOutput Jack : Traditional 1/4\" Finish Sealer : NitrocelluloseProcess : 1-1.5 mils Case Type : Custom HardshellCase Exterior : BlackCase Interior : Plush Lining Accessories Certificate of AuthenticityCollage Poster of the Original Instrument · Shipping · This item will be packed properly and tracking number will be provided when the guitar ships, which should require no more than 48 hours; this item will require receipt signature. I ONLY SHIP TO LOWER 48 CONTINENTAL STATES; If you require shipment outside the Continental US, please do not bid on this item. *Thank you Normal 0 false false false EN-US JA X-NONE", "ItemID": "183645522605", "EndTime": "2019-01-28T01:00:50.000Z", "StartTime": "2019-01-21T01:00:50.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-Custom-Shop-Dickey-Betts-SG-/183645522605", "ListingType": "Chinese", "Location": "Jacksonville, Florida", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1836455226058080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/9k0AAOSws~pcRPL7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/o0YAAOSwqLlcRPMU/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/kCYAAOSw5pRcRPNY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/ZCoAAOSwukZcRPNh/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/w-sAAOSwW~FcRPNm/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/r2YAAOSwlt9cRPNs/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/3JAAAOSwSONcRPNx/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/pPMAAOSw10VcRPN4/$_57.JPG?set_id=8800005007"], "PostalCode": "32257", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "fivestringblues", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 212, "PositiveFeedbackPercent": 100.0}, "BidCount": 3, "ConvertedCurrentPrice": {"Value": 4150.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 4150.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "n***o", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 482}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson Custom Shop Dickey Betts SG", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}]}, "HitCount": 213, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 4200.0, "CurrencyID": "USD"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "From One Brother To Another! ~ Perfect Condition!", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}