{"BestOfferEnabled": true, "Description": "2013 Gibson 1959 59 VOS ES 330 Vintage Sunburst. From the Original VOS run. There's some crazing at the frets but otherwise in excellent plus condition.  One piece top, back and fretboard with mother of pearl inlays and great 59 neck. These P90s are incredible.  George Benson flatwound strings. Please contact me with any questions. Thank you. Experience the Richness and Depth of This Classic Hollowbody Play a few licks on the Gibson Custom ES-330, and you'll be transported to a time when hollowbody electric guitars were king. It's a pure '50s experience all the way through, from the 3-ply maple and poplar body and the mahogany neck with a maple spline, to the smoothly-rounded feel of the creme binding along the hand-selected dark rosewood fretboard. You'll hear enough to fall in love with the ES-330 just by playing it acoustically. But plug into your favorite tube amp, dial in the dual P-90 single-coil pickups, and you'll be conjuring everything from mellow, vibrant jazz tones through to the sound of a rock 'n' roll revolution. The ES-330 became an icon of modern music because of its effortless playability and complete tonal versatility, and you can have it too with the Gibson Custom ES-330 hollowbody electric guitar. Gibson Custom ES-330 Hollowbody Electric Guitar at a Glance: Built to '50s-correct specs Hollowbody plus two P-90s equals tonal freedom Amazingly smooth playability, with Plek precision Built to '50s-correct specs Gibson Custom wanted to re-create the experience of playing a classic Gibson ES from the '50s, and built the ES-330 to exacting vintage specs. The single-chamber body has a 3-ply maple/poplar/maple top and back, and creates a lively and vibrant sound with incredible sustain. the mahogany neck has a maple spline, enhancing the strength and preventing twisting or warping. And the P-90 pickups sport black plastic covers, standard on early ES models before switching to nickel covers. Hollowbody plus two P-90s equals tonal freedom Both acoustically and plugged in, the Gibson Custom ES-330 absolutely sings. The fully-hollowbody allows harmonics and overtones to develop beautifully, and the sweet tone is only enhanced by the impressive sustain. Dual P-90 single-coil pickups, each with their own volume and tone controls, allow you to explore a very wide tonal range. This ES-330 packs underwound pickups for a vintage sound that can cover everything from jazz and R&B to country rock and blues. Amazingly smooth playability, with Plek precision Countless guitarists over the decades have loved their ES-330 for its \"just right\" feel and response. The thinline body style is comfortable to wear and play while still giving you true hollowbody sweetness and depth. Rounded fingerboard binding further enhances the feel of the well-balanced mahogany neck. And Gibson Custom's Plek Pro fret-optimization process ensures precision intonation and incredibly smooth action, for the feel of an instrument that's been broken in and well maintained since the late '50s. Play it fast or strum it slow, play it unplugged or crank up your tube amp - the ES-330 will respond beautifully no matter how you play it. Gibson Custom ES-330 Hollowbody Electric Guitar Features: Recreation of the classic late '50s ES-330 hollowbody electric guitar, built to '50s-correct specs Color: Vintage Burst Outstanding hollowbody tone from the 3-ply maple/poplar/maple top and back Mahogany neck, with a maple spline - accurate to vintage specs, and enhances the neck's strength an resistance to twisting or warping Underwound P-90s have a wonderfully vintage tone with exceptional sonic versatility Hand-selected dark rosewood fingerboard plays very smoothly, thanks to the rounded cream binding Plek Pro fret treatment ensures ultra-precise setup, intonation, and action Comes with a Custom Shop hardshell case, a Custom Care Kit, and a Certificate of Authenticity Bask in the lucid sound of Gibson Custom's ES-330 hollowbody electric guitar! FOR SALE ELSEWHERE. LISTING WILL BE REMOVED IF SOLD BEFORE AUCTIONS END. THANK YOU!", "ItemID": "264212130218", "EndTime": "2019-02-25T14:09:59.000Z", "StartTime": "2019-02-24T14:09:59.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-Custom-Shop-1959-59-REISSUE-VOS-ES-330-Casino-ES30VBNH1-w-P90s-COA-/264212130218", "ListingType": "Chinese", "Location": "Pittsfield, Massachusetts", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2642121302188080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/oe8AAOSwcOtcXCl8/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFg4OTk=/z/HxkAAOSwuAVcXMaA/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/mVgAAOSwyUpcXCmI/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/eawAAOSwWnhcXMYk/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/SaMAAOSwFpVcXMXr/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/ViwAAOSwJgBcXCl~/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/Qg4AAOSwkiZcXMXs/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/7yUAAOSwulFcXCmM/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/2PsAAOSwUMhcXCmP/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/xQgAAOSwbmFcXCmX/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/hQoAAOSw5LRcXCmg/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTU5OVgxMTc0/z/2o0AAOSwfwFcXCp3/$_12.JPG?set_id=880000500F"], "PostalCode": "01201", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "gsturzpainting413", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 338, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 1999.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1999.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "v***l", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 192}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson Custom Shop 1959 59 REISSUE VOS ES 330 Casino ES30VBNH1 w P90s & COA", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Product Line", "Value": ["Gibson ES"]}, {"Name": "Model Year", "Value": ["2019"]}, {"Name": "Model", "Value": ["ES-330"]}, {"Name": "Exact Year", "Value": ["2013"]}, {"Name": "Series", "Value": ["Vintage"]}]}, "HitCount": 127, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 2024.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}