{"BestOfferEnabled": true, "Description": "Hello everyone! Honestly, today you are in for a treat! If you are looking at this post, you already know what it is. It is the light, chambered and most highly regarded 2010 Gibson Les Paul Standard PLUS in the most beautiful and sought after cherry sunburst finish and it weighs only about 7.5/8lbs. As you can see, the top is gorgeous and the guitar is in great, pretty much immaculate condition. The original frets show almost no wear, but I’ll let the pictures do the talking. Like mentioned before, the top is beautiful. Guitar has NO buckle rash and is just pretty perfect overall. It comes with the OHSC that is brand new and was never used and every single piece of paperwork that came with the purchase. It is a 8/9-year-old guitar and it may have a blemish somewhere, but it is not photographable nor does it affect playability in any way. Everyone knows that these chambered are killer guitars and very underrated. New, this guitar cost $2700 and from me now, you can get it for much, much cheaper. As you can see in the pictures, frets have all the life left as the guitar was used as a rhythm guitar only and was not soloed on at all, which is why original frets show very little wear. Guitar was only really used for a very short time and very gently and that’s about it; that’s why the great condition. Like mentioned earlier, it is a lightweight weighing in at about 7.5/8lbs. The tone and sustain is simply ridiculous, but I’ll let you be the judge. Unplugged, the strings ring out loudly and endlessly and is well above average and this is the way I determine the quality of my Gibsons. If it sounds good unplugged, it’s a keeper, and this one goes beyond that. Plugged in to my Marshall SL5 it is a match made in heaven and the tone and sustain is second to none. It has been set up, the frets are great and it is ready to rock. Honestly, here is that rare opportunity to purchase a beautiful, excellent condition Gibson Standard with a killer top at a really, really good price compared to what other people are selling these for when they do appear and in much, much worse condition. Don’t let this one slip away as I know it will not last and I speak from experience. This model did not come with the pickguard installed, so there are no ugly holes or damage from pickguard installation. The pickups have been upgraded to Seymour Duncan 40th Anniversary JB/Jazz pick up set 2 wire and the originals are not included, but these upgraded SD pickups are leaps and bounds better than the stock Gibson ones. The guitar is equipped with RS Guitar works vintage wiring giving it that ‘59 sound, look and feel, but, the original Gibson circuit is included as well as you can see in the pictures. The bridge and stop bar/tailpiece was also replaced with the Faber ABR 1 for that ‘59 mojo and it is much better than the stock Gibson hardware, at least in my opinion. Due to the very attractive price and the great condition of this guitar, as well as original tuners and purchase paperwork included in the sale, I know that I will be contacted a lot and with that said, I won’t be able to hold the guitar for anyone; it’ll be first come first serve. Furthermore, I reserve the right to end this sale at any time should my guitar sell locally or on other websites listed. I’ve described this guitar to the best of my ability. Please ask any questions you may have and I’ll try to answer in a timely manner. Flat rate shipping of $85 anywhere in the CONUS.", "ItemID": "273659943231", "EndTime": "2019-01-19T02:56:16.000Z", "StartTime": "2019-01-16T19:10:36.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2010-Gibson-Les-Paul-Standard-PLUS-Cherry-Sunburst-OHSC-2-pups-60-s-EXCLNT-COND-/273659943231", "ListingType": "FixedPriceItem", "Location": "San Diego, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2736599432318080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/KEsAAOSwGsdbmLh0/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/7EYAAOSwy6lbmLh0/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/u7IAAOSwtBZbvFv5/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/lmcAAOSwVE9bvFv5/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/wbcAAOSwCf9bmLh1/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/SWMAAOSwSSNbmLh3/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/Z0gAAOSwyXFbmLh2/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/ESMAAOSwkHJbmLh1/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/NyEAAOSwjexbmLh2/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/2nEAAOSwvkZbmLh0/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/A6AAAOSwAnlbmLh3/$_12.JPG?set_id=880000500F"], "PostalCode": "92122", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "us.vejzo", "FeedbackRatingStar": "Blue", "FeedbackScore": 65, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1890.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1890.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "y***-", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 61}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2010 Gibson Les Paul Standard PLUS Cherry Sunburst OHSC 2 pups 60’s EXCLNT COND", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Product Line", "Value": ["Gibson Les Paul"]}, {"Name": "Model Year", "Value": ["2010"]}, {"Name": "Model", "Value": ["Les Paul Standard"]}]}, "HitCount": 68, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}