{"BestOfferEnabled": false, "Description": "DescriptionHello, I have been selling with eBay from Japan so I can provide you the best service. This item is sold out everywhere in Japan and very hard to get it!!First come, first served.Appearance of the itemPlease check the photos for detailed condition of the product.Excellent YAMAHA Japan SG2500 Through Neck Wine Red Electric GuitarManufacturer: YAMAHAModel Number: SG2500Serial No.: 110064Made in JapanColor: Red Wine Top Material: Maple Back Material: Mahogany Neck Material: Maple + Mahogany, through neck Ebony finger boardNeck:StraightFret: 80%Trussrod: Unknown Rod: tightened, maybe only 45 degrees left or not turning anymoreBody weight: 4284 gThis has scratch marks, paint peeling, dents, dust, rust, and feeling of usageSome dents are seen on sides of body and neck Produced by Yamaha only for a short period (from 1983 to 1985) From the model number it was a grade located between the 2000 and 3000 With bridge buried in sustain plate Peg: Goto 's Magnum Rock PU are both exchanged to DiMarzio Yamaha peculiar white turbidity has come out Compatibility with DiMarzio is also good, the sound is good With genuine hard caseOperation and Status NormalIncludings All you can see on this photo will be in a set of a package. You can enjoy playing music.★ This product is also available at other EC sites.We will update as soon as possible, but if this product is sold on another EC site before this is sold on eBay, we are very sorry, but we will cancel the transaction on this site.★ I have examined the item(s) and my observations as accurate as I could in the description above. Please note that some descriptions may be based on my own opinion. Please read it carefully and understand the condition of the item(s) before bidding. PaymentPlease pay within 3 days after the auction closed.ShippingWorldwide shipping from Tokyo. For goods with hard cases we usually pack hard case and contents by cushioning material (usually bubble wrap). There has never been a problem with that shipping method so far. However, if you want a hard case to be in cardboard, I can ship by that method if you pay additional $10. This applies only to products that originally have hard case.this item is shipped within 1 business days after payment is confirmed.(Sunday and public holidays is not business day)It takes 4-7 days to be delivered with insurance and trucking number.*We can not use EMS(Japan Post) service for some countries in Central Asia (Kazakhstan, Kyrgystan, Tajikistan etc.) If your shipping address is in these areas, please contact us before bidding.ReturnsReturns are accepted ONLY if the item was not the item described.International Buyers - PleaseShipping We will ship by EMS with insurance and trucking number and ship the item within 5 business days. Then it takes 5-9 days to arrives. *We can not use EMS service for some countries in Central Asia. If your shipping address is in these areas, please contact us before bidding. PaymentWe accept Paypal or Bank wire. Please pay within 3 days after the auction closed.International BuyersImport duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer's responsibility. Please check with your country's customs office to determine what these additional costs will be prior to bidding/buying. We do not mark merchandise values below value or mark items as \"gifts\" - US and International government regulations prohibit such behavior.ReturnCustomer service and satisfaction are very important to us. Returns are accepted ONLY if the item was not the item described. I have an unconditional return policy if nortified within 30 days of the receipt of the item. All returned items must be the original condition. All return request must be made within 30 days of the receipt of the item. Please contact me first for return before you ship it back to me. The postage of the returned goods is a buyer burden.Thank you for coming.!! Don't hesitate to ask me any questions. ★ If you find any issue with this transaction, please contact me first . I will try my best to resolve the issue. ★This product is also available at real shop sites.We will update as soon as possible, but if this product is sold on real shop before this is sold on eBay, we are very sorry, but we will cancel the transaction on this site. ★ I have examined the item(s) and included my observations as accurate as I could in the description above. Please note that some descriptions may be based on my own opinion. Please read it carefully and understand the condition of the item(s) before bidding.", "ItemID": "323558374410", "EndTime": "2019-02-21T15:36:00.000Z", "StartTime": "2018-11-19T08:26:16.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Excellent-YAMAHA-Japan-SG2500-Through-Neck-Wine-Red-Electric-Guitar-/323558374410", "ListingType": "FixedPriceItem", "Location": "Tokyo", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/3235583744108080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/1LsAAOSwzyBblfCi/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/nYIAAOSwTuhblfDO/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/C9cAAOSwdIlblfCw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/7gwAAOSwmaVblfDe/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/UjIAAOSwYwFblfDZ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/Au8AAOSwBP9blfDT/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/AxYAAOSwUVBblfCz/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/298AAOSwKqlblfC3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/7dYAAOSwmaVblfC8/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/h8UAAOSwx5hblfDA/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/A0sAAOSw0VZblfDD/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/CVYAAOSwf2pblfDJ/$_57.JPG?set_id=8800005007"], "PostalCode": "95125", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "japanproduct", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 494, "PositiveFeedbackPercent": 97.8}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1297.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1297.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "r***o", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 2}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "Excellent YAMAHA Japan SG2500 Through Neck Wine Red Electric Guitar", "HitCount": 147, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1174170278", "StoreName": "be-seen15"}, "Country": "JP", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalRefund": "MoneyBack", "InternationalReturnsWithin": "30 Days", "InternationalReturnsAccepted": "ReturnsAccepted", "InternationalShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 5, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["APO/FPO", "US Protectorates", "Africa", "South America", "DE", "AI", "AG", "AW", "VG", "KN", "LC", "TC", "VI", "KH", "LA", "MO", "BM", "GL", "MX", "PM", "BH", "IQ", "JO", "KW", "YE", "AF", "AM", "BD", "BT", "IN", "JP", "KZ", "PK", "TJ", "TM", "UZ", "AS", "CK", "FJ", "PF", "GU", "KI", "MH", "FM", "NR", "NC", "NU", "PW", "SB", "TV", "VU", "WF", "WS"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}