{"BestOfferEnabled": false, "Description": "Here we have a well preserved vintage Burns Baldwin model 706 electric guitar. It is in remarkable condition for a 50+ year old instrument. the finish is intact but has some light checking starting in the finish. Truss rod adjustment works, neck is straight and frets are original and don't appear to have been ever leveled ect. Back neck plate says this was made in England, which means it was made at the Burns factory & not in Italy which may semi hollow Baldwins were. It also is the rarer non tremolo version. The action is nice and low and this stays in tune well, neck has a nice profile feel and has a great unplugged tone. The only issues I can find with this are the strap buttons may not be original, the binding at the bottom is coming loose (about half inch each side) which I'm leaving as is, the finish near the top of the neck heel is cracking (pics are posted of the binding and the neck heel areas) the input jack is a little loose, and the electronics have issues. all 4 pots are scratchy & need to be cleaned. The bridge pickup works fine but the neck one....sometimes it works fine, sometimes it seems like it has weak power, sometimes its quiet. I'm not sure if its being caused by the dirty pots, a short in the pickup wire, the 3 way switch, but I do not want to open this up and risk messing anything up (ever try to take apart the electronics on a semi hollow guitar by yourself then try to re install everything right ? I did...failed) nor do I have the time or desire to take it to a shop. This has sat in storage since approx 1998 & I recently dug it out. When I put it into storage it worked fine & had no finish checking so I'm assuming it could be oxidation on pots/switches/wires that's causing these issues. Because of the age and issues of this guitar it is going to be sold AS IS, so ask any questions before bidding & I will answer as truthfully and best I can. I will ship this with the neck removed from the body as I don't have a full sized box plus it will help keep your shipping costs lower :-) Any questions ask before bidding check the pictures carefully. NO REFUNDS unless item is damaged in shipping and you pay insurance. Payment must be received within 3 days of the end of auction or I will relist and file non paying bidder report. Shipping is $45.50 USA Insurance is $4 extra and is not mandatory but I suggest you purchase it in case your item is damaged or lost in shipping. Paypal preferred payment method. I ship within 36 hours of payment first class mail or priority mail. Allow up to 2 weeks for item to arrive as sometimes mail is slow or held up due to bad weather, but most items arrive within 1 week or less. USA bidders only! I will pack this up very strong and securely before shipping so it shouldn't arrive damaged. Thanks for checking out my auction !", "ItemID": "264013458939", "EndTime": "2018-11-08T22:04:53.000Z", "StartTime": "2018-10-29T22:04:53.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Burns-Baldwin-Model-706-Electric-Guitar-ES-Style-1967-UK-Made-Vintage-Rare-/264013458939", "ListingType": "Chinese", "Location": "Summit-Argo, Illinois", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2640134589398080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NTQwWDk2MA==/z/SKIAAOSwj2RbJDq5/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTI4WDk2MA==/z/51YAAOSwpmNbJDq7/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTI4WDk2MA==/z/IwUAAOSw6CJbJDq9/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTI4WDk2MA==/z/SCoAAOSwi0RbJDq~/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTI4WDk2MA==/z/qZIAAOSwDZ1bJDrB/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTQwWDk2MA==/z/otQAAOSwdGhbJDrD/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTQwWDk2MA==/z/GK4AAOSwHvpbJDrF/$_1.JPG?set_id=8800005007"], "PostalCode": "60501", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "superwurm1965", "FeedbackRatingStar": "Red", "FeedbackScore": 1341, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 799.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 799.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "r***r", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 4}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "Burns Baldwin Model 706 Electric Guitar ES Style 1967 UK Made Vintage Rare !", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Red"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Country/Region of Manufacture", "Value": ["United Kingdom"]}, {"Name": "Brand", "Value": ["Baldwin"]}, {"Name": "Body Type", "Value": ["Semi-Hollow"]}]}, "HitCount": 53, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 809.99, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "Has minor finish checking and minor electronic issues otherwise in excellent condition for a 50+ year old instrument.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}