{"BestOfferEnabled": false, "Description": "This is an extremely fun top quality guitar. It's in excellent condition with a few minor scratches and dings. If you ever wanted a Les Paul you could completely shred on this is it. Absolutely beautiful guitar. This guitar sounds absolutely fantastic and a push pull coil split on the tone knob really ups its versatility. The cavity cover on the back was swapped with a cover displaying marijuana because the serial number ends in 420. The original cavity cover for the toggle switch is included. It comes with a Gibson USA logo hard shell case. The case shows a lot of wear on the outside and has a broken lock. However all the latches are good and it works perfectly. Nice on the inside. USA shipping only. I copied the following from the 2008 Gibson archive presenting this guitar: Carrying all the elegant styling, fluid body lines, and rocking attitude of a classic Les Paul Standard from the golden era of 1958 to ’60, the Les Paul Axcess reveals a handful of upgrades upon closer examination—all modifications made in the name of maximum playability and versatility. The most noticeable addition is the Floyd Rose tailpiece, a unit optimized for anything from subtle vibrato wobbles to dramatic, rumbling divebombs. Adding a Floyd Rose to a Les Paul in the past was always a major headache, and could seriously damage the stability of the instrument if not done right. On the Les Paul Axcess the vibrato is installed right at the Gibson Custom Shop as part of the manufacturing process, so this potent piece of high-performance hardware interacts seamlessly with the design of the guitar. Partnered with an R4 locking nut, it also guarantees outstanding tuning stability and return-to-pitch accuracy.Take the instrument in hand and run your fingers up the neck, however, and you’ll encounter the clever structural alteration that gives this new model its name: while the Axcess sports what looks from the front to be a traditional Les Paul neck joint, the neck heel and portions of the back and neck joint at the upper cutaway have been contoured to provide a “heelless” feel and an unimpeded reach right up to the 22nd fret. No more stretching against the traditional neck heel to achieve the upper-fret access that your lead style demands—the Axcess gives you that legendary Les Paul playability all the way up the neck, and welcomes you to take it right over the top. To further enhance playing comfort, this smoothly carved neck joint is joined by a “belly scarf” (aka ribcage contour) that allows the body of the guitar to hug closely to your own body in the playing position without digging in. Add to these contours the Les Paul Axcess’s slightly thinner body, made from weight-relieved mahogany (with carved maple top), and you’ve also got an instrument that is refreshingly light, and a pure joy to play either strapped on or seated.Les Paul Axcess StandardAs the Gibson Custom Shop Operations Manager Michael McGuire puts it, “Everything about this Les Paul has been designed to make it a player’s ‘player’s guitar’. From the easy access to its upper range, to the comfortable belly scarf, to the Floyd Rose vibrato, this instrument was made to give you optimum performance.” And of course, being a product of the Gibson Custom Shop, the Les Paul Axcess is built to the highest standards attainable in today’s market, which includes a final set-up and fret dressing by the computer-controlled PLEK System.Beyond all these significant considerations for playing feel, the Les Paul Axcess Standard is also geared toward optimum tone, as you’d expect from any Custom Shop creation. Exposed-coil BurstBucker 1 and BurstBucker 2 pickups in the neck and bridge positions—the most accurate reproduction vintage-PAF-style humbuckers Gibson has ever offered—yield everything from warm, fluid vocal tones to fat, sweet growl, while an added push/pull switch on the treble Tone knob provides coil splitting for accurate single-coil tones. The combination excels at everything from singing classic rock lead tones, to contemporary crunch, to extremes of twang and jangle. Even the pure-nickel wound .010 Gibson Vintage Strings it ships with contribute toward its rich, textured voice. Other specifications and appointments befitting this new model’s pedigree include:- One-piece mahogany neck with fast, rounded profile- 24 3/4\" scale length with 1 11/16\" nut width - 22-fret rosewood fingerboard- Kluson tuners- Single-ply cream binding on body top- Pearloid trapezoid fingerboard inlays- Carved maple top with nitrocellulose lacquer finish in Iced Tea Burst or Gun Metal Gray", "ItemID": "153373740556", "EndTime": "2019-02-18T03:55:33.000Z", "StartTime": "2019-02-11T03:55:33.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-Custom-Shop-Les-Paul-Axcess-420-Iced-Tea-Burst-Floyd-Rose-2008-Hard-Case-/153373740556", "ListingType": "Chinese", "Location": "Dandridge, Tennessee", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1533737405568080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxNTc3/z/rfkAAOSwIO9cYN~r/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTE5MVg3MzQ=/z/iuYAAOSwOAJcYODV/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFg3NDY=/z/4e4AAOSwXoJcYOEv/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTU5OVgxNTU2/z/SH0AAOSwpYpcYOHa/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/2JYAAOSwAWNcYOIZ/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/KZMAAOSwvtBcYOLl/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFg3NjY=/z/ivEAAOSwcFJcYORn/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTE5MFg3MzU=/z/WS0AAOSwHQdcYOQr/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/fAQAAOSwgX9cYONv/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/kIkAAOSwxS9cYOOG/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/vXQAAOSw8AlcYOPX/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTQxOVgxNjAw/z/E8IAAOSwsq1cYOQE/$_12.JPG?set_id=880000500F"], "PostalCode": "37725", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "farsgull", "FeedbackRatingStar": "Yellow", "FeedbackScore": 15, "PositiveFeedbackPercent": 100.0}, "BidCount": 4, "ConvertedCurrentPrice": {"Value": 2520.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2520.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***a", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 129}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson Custom Shop Les Paul Axcess 420 Iced Tea Burst Floyd Rose 2008 +Hard Case", "ItemSpecifics": {"NameValueList": [{"Name": "Product Line", "Value": ["Gibson Les Paul"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model Year", "Value": ["2008"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Les Paul Axcess"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Iced Tea Burst"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}]}, "HitCount": 424, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 2570.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}