{"BestOfferEnabled": false, "Description": "Your satisfaction is our number one goal. Keep in mind that we offer hassle-free returns if needed. If you have any questions or problems, please contact us. Please Note: All included items are shown in the pictures Jackson Pro Series Monarkh SC Electric Guitar Charcoal Ash Right Handed 232142405 Features: Body Body shape: Single cutaway Body type: Solid body Body material: Solid wood Top wood: Maple Body wood: Mahogany Body finish: Satin Orientation: Right handed Neck Neck shape: Not specified Neck wood: Maple Joint: Set-in Scale length: 24.75 in. Truss rod: 2-way adjustable Neck finish: Oiled Fretboard Material: Ebony Radius: Compound Fret size: Jumbo Number of frets: 22 Inlays: Pearloid ghostfin Nut width: 1.62 in. (41.3 mm) Pickups Configuration: HH Neck: Blackout Middle: Bridge: Blackout Brand: Seymour Duncan Active or passive pickups: Active Series or parallel: Series Piezo: No Active EQ: No Special electronics: Controls Control layout: Master volume, tone Pickup switch: 3-way Coil tap or split: Kill switch: No Hardware Bridge type: Fixed Bridge design: Tune-o-matic Tailpiece: Anchored Tuning machines: Die-cast Locking Color: Black What's included: Jackson Pro Series Monarkh SC Electric Guitar Charcoal Ash Right Handed Condition: Guitar is previously owned. Physical condition is excellent, its never been played. 232142405 Payment & Checkout Checkout: After the auction has ended please click the checkout button to proceed with your payment. Payments: Payments must be received within 3 days. Unpaid cases will automatically be open by eBay 7 days after purchase. Taxes: Sales tax is charged for items shipped to: MN*(6.875%), WI*(5.0%) All Emails and Invoices will be sent to your registered eBay Email Address. If you are not receiving our emails please check your email spam filters. Shipping We Ship to confirmed addresses only! Make any changes to your address before paying. All items will be shipped to your confirmed billing address! Shipping Carriers: SurePost, UPS & USPS 1-6 Day. We choose the shipping carrier at our discretion. Local Pickups: Please contact us for local pickup information. Product Guarantee We offer a 30 Day Money Back Guarantee unless noted \"As Is\" or \"For Parts or Not Working\". We do not offer returns on international orders. We do our very best to accurately describe our items, however If you have any problems please contact us right away. Frequently Asked Questions What are your operating hours? M-F 9:00am - 5:00PM Central Standard Time Do you ship internationally? We ship internationally on select items. What is the history of the item? Most of our items are used and we do not know the history. We test them and picture their current condition. What's Included? 99% of the time If it's pictured it's included. Please also read \"What's included\" How long do I have to make payment? You have 3 days to make payment. Prestalia e-commerce solutions. Protect Your Product With a Consumer Priority Service Warranty", "ItemID": "372327078380", "EndTime": "2018-12-30T00:50:11.000Z", "StartTime": "2018-06-06T20:49:56.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Jackson-Pro-Series-Monarkh-SC-Electric-Guitar-Charcoal-Ash-Right-Handed-/372327078380", "ListingType": "FixedPriceItem", "Location": "Burnsville, Minnesota", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/3723270783808080_2.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTEwMFgxMTAw/z/11IAAOSw7tRbGEj7/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTEwMFgxMTAw/z/UZYAAOSwZ~hbGEj7/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTEwMFgxMTAw/z/GL0AAOSwt5VbGEj7/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTEwMFgxMTAw/z/BroAAOSwPDdbGEj7/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTEwMFgxMTAw/z/u6EAAOSwrptbGEj7/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTEwMFgxMTAw/z/pZcAAOSwfp9bGEj7/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTEwMFgxMTAw/z/1N0AAOSwj2RbGEj7/$_1.JPG?set_id=880000500F"], "PostalCode": "55337", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "epawnamerica", "FeedbackRatingStar": "RedShooting", "FeedbackScore": 150873, "PositiveFeedbackPercent": 99.5, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 521.19, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 521.19, "CurrencyID": "USD"}, "HighBidder": {"UserID": "n***r", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 1}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Jackson Pro Series Monarkh SC Electric Guitar Charcoal Ash Right Handed", "ItemSpecifics": {"NameValueList": [{"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Pro Series Monarkh SC"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Brand", "Value": ["Jackson"]}]}, "HitCount": 502, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=16525387", "StoreName": "ePawnAmerica"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "APO/FPO", "US Protectorates", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "TopRatedListing": true, "GlobalShipping": false, "ConditionDescription": "Guitar is previously owned. Physical condition is excellent, its never been played.", "QuantitySoldByPickupInStore": 0, "SKU": "ebay-861711", "NewBestOffer": false}