{"BestOfferEnabled": false, "Description": "For the coolest guitars on eBay Be sure to visit the Guitars and Audio Stuff eBay Sales and Auctions You are bidding on a used 2002 Fender Standard Stratocaster Made in Mexico This is a 2002 Fender Stratocaster Made in Mexico. It features an alder body and a bolt-on maple neck with a 25.5\" scale 9.5\" radius rosewood fingerboard with 21 frets and white dot position markers. The guitar has an Agave Blue finish. The guitar's electronics consist of 3 standard Fender single coil pickups controlled by a 5 way selector switch and a master volume and a tone control each for the neck and middle pickups. The guitar has the original Fender brand tuners and the tremolo bridge is a vintage style synchronized 6 screw Fender tremolo system with stamped bridge pieces. The hardware has a chrome finish. This guitar has some scratches and dings in the finish coat on the front and top edge of the body. There is one crack in the finish in the area of the neck joint. The original Fender sticker and protective plastic is till on the rear tremolo cover although it is worn from age. There is no wear to the frets or the fingerboard. The neck has no warps or twists and the truss rod can adjust the relief to your preference. The electronics are all working and quiet. This guitar is loaded with the classic Stratocaster tones. A Fender gigbag is included. Don't miss out. This item is used and sold as is. California residents add 7.75% state sales tax. Winning bidder pays for Fed Ex Ground Shipping delivery time 2 to 6 days Local pickup is available if you're in the Riverside, California area Because of CITES treaty restrictions on rosewood we cannot ship this item out of the United States THE FINE PRINT: * PLEASE READ CAREFULLY!* New ebayers with 0 feedback are invited to bid but please contact me before bidding to let me know what payment method you will use. All items will be insured in the amount of the winning bid when shipped. I will not end the auction early Please don't ask. Item is sold as-is with no warranty or approval period implied or stated. If a transferable warranty exists, it is up to the high bidder to take the necessary steps to implement it. If the item is not paid for within 72 hours of the end the auction results will be canceled and the item will be relisted. Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer’s responsibility. Please check with your country’s customs office to determine what these additional costs will be prior to bidding/buying. These charges are normally collected by the delivering freight (shipping) company or when you pick the item up – do not confuse them for additional shipping charges. We do not mark merchandise values below value or mark items as ‘gifts’ - US and International government regulations prohibit such behavior. I will not undervalue the item to help you avoid Customs Fees. The USPS considers it a crime. Please don't ask. Once the item has left the United States I have no control over how it is handled or where it is sent. The Postal Service can only confirm that it has left the US. The buyer will need to contact their local Customs Agency or Postal Service if an item does not arrive with in the specified time. I will provide the buyer with the Customs Form Number and the Insurance Number if applicable. Sorry, no C.O.D.s. * NO TRADES!* I reserve the right to decline sale to bidders with excessive or unexplained negative feedback. Seller cannot be held responsible for loss or damage incurred during shipment or denied claims. I have a LOT of experience shipping, and always pack well. However once it leaves my shipping department I have no control over how it is treated. I will do all I can to help you resolve any situations that arise as a result of shipping problems. Positive feedback will be left upon receipt of same Thanks for looking and good luck.", "ItemID": "362558764157", "EndTime": "2019-02-18T23:45:12.000Z", "StartTime": "2019-02-15T23:45:12.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2002-Fender-Standard-Stratocaster-MIM-Agave-Blue-Strat-/362558764157", "ListingType": "Chinese", "Location": "Norco, California", "PaymentMethods": ["PayPal", "VisaMC", "CashOnPickup"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/3625587641578080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MzIyWDgwMA==/z/LsoAAOSweTlcZ0s5/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MjY0WDgwMA==/z/y-kAAOSwKmhcZ0s6/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTc3WDgwMA==/z/52AAAOSwb~5cZ0s8/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/Mzc5WDgwMA==/z/w04AAOSwp-ZcZ0tA/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjYzWDgwMA==/z/0AgAAOSwu2tcZ0tC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/Mzg2WDgwMA==/z/Li4AAOSwo8NcZ0tE/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzM1WDgwMA==/z/YH8AAOSwW75cZ0t7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTQwWDgwMA==/z/Fn8AAOSwvSNcZ0t9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjMxWDgwMA==/z/U9oAAOSwaP5cZ0t~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/Mzg1WDgwMA==/z/yUgAAOSwVblcZ0uD/$_57.JPG?set_id=8800005007"], "PostalCode": "92860", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "guitaudio", "FeedbackRatingStar": "Red", "FeedbackScore": 2183, "PositiveFeedbackPercent": 100.0}, "BidCount": 11, "ConvertedCurrentPrice": {"Value": 465.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 465.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "6***s", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 65}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2002 Fender Standard Stratocaster MIM Agave Blue Strat", "ItemSpecifics": {"NameValueList": [{"Name": "Size", "Value": ["Standard"]}, {"Name": "Body Color", "Value": ["Blue"]}, {"Name": "Brand", "Value": ["Fender"]}, {"Name": "Model Year", "Value": ["2002"]}, {"Name": "Series", "Value": ["Standard"]}, {"Name": "Body Material", "Value": ["Alder"]}]}, "HitCount": 525, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=596584", "StoreName": "Guitars And Audio Stuff"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 470.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Central America and Caribbean", "Europe", "Oceania", "Southeast Asia", "South America", "RU", "AF", "AM", "AZ", "BD", "BT", "CN", "GE", "IN", "JP", "KZ", "KR", "KG", "MV", "MN", "NP", "PK", "LK", "TJ", "TM", "UZ"], "GlobalShipping": false, "ConditionDescription": "Please see full description and pictures below.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}