{"BestOfferEnabled": true, "Description": "Ibanez RG950QM Solidbody Electric Guitar at a Glance:A trio of DiMarzio pickups gives you massive tonal rangeYour fingers will fly on this super-fast Wizard Premium neckEdge Zero II bridge gives you solid performance and stabilityIbanez's legendary RG Series rocks with qualityA trio of DiMarzio pickups gives you massive tonal rangeThe RG's dual-humbucker configuration has been a long-time favorite among tone-seeking shredders, which led to the pair of DiMarzio IBZ pickups installed in the RG950QM. But what really rocks is the inclusion of a DiMarzio single-coil in the middle position and a 5-way blade to control it all. This arrangement serves up a tonefest that gives you everything from chimey cleans to searing hot shred - and all points in between. If you're after serious tone - and lots of it, the Ibanez RG950QM is your kind of axe.Your fingers will fly on this super-fast Wizard Premium neckOne of Ibanez's fastest necks to date, the 3-piece maple Wizard Premium neck on the RG950QM is an absolute pleasure to play. This slim and super-comfortable neck lets you pull off lighting-fast runs and arpeggios with ease, but still gives you the substance you need for fretting chords. From the first time you put your hands on the RG950QM's Wizard Premium neck, you'll know you've got a guitar that was built with performance in mind.Edge Zero II bridge gives you solid performance and stabilityThe RG950QM's Edge Zero II bridge with Zero Point System was designed by Ibanez to give you the fast vibrato response and snap you need to pull off sharp bends and flutters. The extreme stability of this knife-edge-style trem's stud lock function is also one of the many reasons its a favorite among many of today's top shredders. If you're looking for a guitar that can stand up to long playing sessions without losing its tuning, you're going to adore the Ibanez RG950QM!Ibanez's legendary RG Series rocks with qualityIbanez's RG Series is filled with top instruments - all featuring the famous RG body style, with excellent components through and through. For example, the Edge Zero II trem bridge offers up an advanced design (complete with Ibanez's ZPS3Fe spring design), for serous stability during even the most aggressive divebombing runs.Ibanez RG950QM Solidbody Electric Guitar Features:Basswood body capped with a luscious quilted maple top5-piece maple/walnut Wizard Premium neckRosewood fretboard with jumbo frets, and ofset dot inlaysDiMarzio IBZ pickups: two humbuckers and one single-coil; 5-way bladeEdge Zero II trem bridge with ZPS3Fe spring systemPick Guard has some minor peeling, otherwise hardly ever played and in excellent condition. Steal at this price. Comes with gig bag.", "ItemID": "143042167128", "EndTime": "2019-01-03T18:00:33.000Z", "StartTime": "2018-12-06T19:24:30.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Ibanez-Premium-RG950QM-Cobalt-Blue-Surge-2012-/143042167128", "ListingType": "FixedPriceItem", "Location": "Rochester, New York", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1430421671288080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg4MTc=/z/zSUAAOSwS4VcCXZF/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/VfIAAOSwXwFcCXZL/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/CRQAAOSwO-pcCXZU/$_32.JPG?set_id=880000500F"], "PostalCode": "14620", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "patricgillma-0", "FeedbackRatingStar": "None", "FeedbackScore": 5, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 500.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 500.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "p***b", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 68}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Ibanez Premium RG950QM - Cobalt Blue Surge (2012)", "ItemSpecifics": {"NameValueList": [{"Name": "Product Line", "Value": ["Ibanez RG"]}, {"Name": "Brand", "Value": ["Ibanez"]}, {"Name": "Model Year", "Value": ["2012"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["RG950QM"]}, {"Name": "Country/Region of Manufacture", "Value": ["Indonesia"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "MPN", "Value": ["K0053C"]}, {"Name": "Body Color", "Value": ["Blue"]}]}, "HitCount": 243, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}