{"BestOfferEnabled": false, "Description": "Epiphone Les Paul Right-Handed 6-String Electric Guitar LP100 Cherry Sunburst This item comes to us in previously owned condition. NON-PAYING BIDDERS WILL BE REPORTED TO EBAY. ONLY BID IF YOU CAN PAY!!! Free Shipping to the US 48!!! No Reserve - Auction Only - No \"Buy It Now\" Offered - No Local Pick Up ALWAYS READ OUR INSPECTION REPORTS PRIOR TO BIDDING!!! Inspection Report: Up for auction is a Epiphone Les Paul Right-Handed 6-String Electric Guitar LP100 Cherry Sunburst. Item is in previously owned condition. It has been tested and the electronics work properly. The guitar shows normal signs of use including scuffs, scratches, swirling, pick rash, indents and dings, as pictured. The metal of the bridge and the tuning pegs have lost their luster, but are still in good working condition. This Les Paul has nice action and a great classic sound. Auction includes: Epiphone LP100 Les Paul Electric Guitar, ONLY. As shown. CASE IS NOT INCLUDED. Also, please note that I am not a musician nor an expert, I do not play the guitar, so there may be issues I am unaware of. Instruments might need to be tuned and/or adjusted by a professional; all our instruments are previously owned and used. Feel free to ask any questions and I will be happy to answer them as best I can. Thanks for looking and good luck bidding. Item is in previously owned condition. It has been tested and the electronics work properly. The guitar shows normal signs of use including scuffs, scratches, swirling, pick rash, indents and dings, as pictured. The metal of the bridge and the tuning pegs have lost their luster, but are still in good working condition. This Les Paul has nice action and a great classic sound. Auction includes: Epiphone LP100 Les Paul Electric Guitar, ONLY. Nothing else. CASE IS NOT INCLUDED. What is shown is the actual item that you will be receiving and only what is pictured is included. If it's not pictured, it's not included. You Are Invited to Click Here to View Our other eBay Auctions! SALES TAX: As of October 1, 2018 we are required by law to collect 6% Sales Tax from orders that ship to buyers within the state of Maryland. There are other states that eBay will automatically charge tax on orders - these states include: Minnesota, Washington, Iowa, Connecticut, New Jersey, Alabama, Oklahoma, and Pennsylvania. We have no say in the collection of these taxes and we do not benefit from this. International Buyers Please Note:We only ship to countries included in eBay's global shipping program. We reserve the right to cancel any international sale. Under no circumstances will we provide false information on a customs form. Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer's responsibility. Please check with your country's customs office to determine what these additional costs will be prior to bidding/buying. We cannot be responsible for transit times through customs. BUYERS BID WITH CONFIDENCE: We strive for customer satisfaction, if you encounter any problems with your purchase just contact us and we will be happy to work with you to resolve any issues! PLEASE READ THE AUCTION DESCRIPTION CAREFULLY. Usually this will tell you if the item has been tested or if the item has any defects. We do occasionally sell items that we are not familiar with, including specialty tools and high end electronic equipment. We are not experts on everything and therefore cannot properly test items we don't have a good working knowledge of. Please pay attention to the auction description to find out what is included in the auction. If it is not listed as being included, then it is not included in the auction. PLEASE ASK QUESTIONS BEFORE YOU BID if you are not sure what is included or if an item has been tested. We stand by our descriptions and if that description is incorrect, we will try to work something out. Sometimes things happen that are beyond the buyers and sellers control and we are happy to work with the buyer whenever these things happen. Above all else, we want you to be happy with your purchase. Please contact us before opening a case if there are any issues after purchase or if a problem arises. Please note that we do not issue partial refunds, particularly if you are no longer in possession of the item or have had the item repaired/modified prior to contacting us. BID CANCELLATIONS Buyer is responsible for their own bid/auction cancellations, should they deem a cancellation necessary. Buyers assume all responsibility for their own account security and any bidding that takes place via their account - this includes bidding by your minor children and other family members. If you suspect unauthorized activity on your account - please contact eBay immediately. RETURNS: 30 Day domestic returns accepted if we misrepresent the item in our description or title. BUYER PAYS RETURN SHIPPING COSTS for items returned for any other reason. Prompt refund via PayPal when Same Item Is Returned in SAME CONDITION. Please contact seller before return. No Returns accepted after 30 Days. SHIPPING: Items will be shipped via USPS Priority Mail or FedEx Ground depending on item and buyer location. Please note that your item might be shipped FedEx regardless of what eBay's invoice says as FedEx is not an option to choose from. Payments received after 4:00pm will ship the next business day. SHIPPING ADDRESS: It is the buyer's responsibility to make sure that their verified shipping address is correct prior to the end of the auction, as this is the only address we will ship to.", "ItemID": "372601500768", "EndTime": "2019-02-20T16:16:53.000Z", "StartTime": "2019-02-15T16:16:53.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Epiphone-Les-Paul-Right-Handed-6-String-Electric-Guitar-LP100-Cherry-Sunburst-/372601500768", "ListingType": "Chinese", "Location": "Salisbury, Maryland", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/3726015007688080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NTY2WDE2MDA=/z/5NMAAOSwJ5dcXzZw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE1NVgxNjAw/z/7GoAAOSwiuRcXzZz/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAyM1gxNjAw/z/bBYAAOSwpCFcXzZ8/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTQxWDE2MDA=/z/KtEAAOSwl7pcXzaG/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE2NlgxNjAw/z/yFQAAOSw~LpcXzaM/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzAyWDE2MDA=/z/7MQAAOSwPEhcXzaB/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MzY4WDE2MDA=/z/3X0AAOSwnM1cXzZ0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTU2WDE2MDA=/z/JlUAAOSwh5ZcXzZ4/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MjU2WDE2MDA=/z/-f0AAOSwoW1cXzZ~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjUz/z/uYcAAOSwqaNcXzaE/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MzQ2WDE2MDA=/z/xuYAAOSwDXxcXzaN/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAzOVgxNjAw/z/iDsAAOSwnI9cXzaP/$_57.JPG?set_id=8800005007"], "PostalCode": "21804", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "krazylouie", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 13682, "PositiveFeedbackPercent": 99.8}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 185.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 185.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "b***7", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 0}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Epiphone Les Paul Right-Handed 6-String Electric Guitar LP100 Cherry Sunburst", "ItemSpecifics": {"NameValueList": [{"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "Model", "Value": ["Les Paul 100"]}, {"Name": "MPN", "Value": ["LP100"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Size", "Value": ["Full Size"]}]}, "HitCount": 194, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1735130", "StoreName": "Crazy Louie&#39;s Pawn Shop"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 187.5, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "Africa", "Europe", "Middle East", "RU", "TW", "AF", "KZ", "PK", "LK", "UZ", "AU", "PO Box"], "GlobalShipping": false, "ConditionDescription": "Item is in previously owned condition.  It has been tested and the electronics work properly.  The guitar shows normal signs of use including scuffs, scratches, swirling, pick rash, indents and dings, as pictured.  The metal of the bridge and the tuning pegs have lost their luster, but are still in good working condition.  This Les Paul has nice action and a great classic sound.  Auction includes: Epiphone LP100 Les Paul Electric Guitar, ONLY.  As shown.  CASE IS NOT INCLUDED.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}