{"BestOfferEnabled": false, "Description": "At top 40 guitarsour customers satisfaction is our first concern.All of out items have a 14 day return policy.If after 14 days you are not completely satisfiedwith your purchase, please return it for a full refund....Peace be with you... *all returned items must be in the same condition theywere at the time of sale. All original packing must be included. # Up for Sale is a 2018 Gretsch G5422G-12 Electromatic! 12-String Hollow Body! Made In Korea! This is really cool. You are looking at a 2018 Gretsch G5422G-12 Electromatic Hollowbody Double-Cut 12-String. Like a ’60s invasion, the G5422G-12 serves up full hollow-body build and the true Filter’Tron™ voice for that classically lush 12-string chime and jangle. Like all Electromatic guitars, it delivers the fearless and electrifying authenticity that has set Gretsch apart as the quintessential rock ‘n’ roll guitars from the very beginning. It’s the sound of honor itself—play proud. From The Web:Distinctive Gretsch 12-string Tone Incredibly affordable, yet laden with professional features, the G5422G-12 Electromatic 12-string hollowbody boasts vintage-voiced Gretsch \"Black Top\" humbucking pickups, an Adjusto-matic bridge, and gold-plated die-cast tuners. This is your chance to get the classic 12-string tones of the '60s with the great feel of a Gretsch hollowbody. You'll have no problem conjuring the jangly tone you're after with Gretsch's ultra-stylish G5422G-12 Electromatic 12-string hollowbody electric guitar. Introducing the \"Black Top\" humbucking pickups Gretsch uncovered a set of Baldwin-era Filter'Tron pickups with incredible punch and twang - perfect for the G5422G-12 Electromatic 12-string hollowbody. They reverse engineered those special pickups to create the \"Black Top\" Filter'Tron humbucking pickups. These humbucking pickups offer the distinctive Gretsch top-end clarity that is necessary for single-note or chordal electric 12-string playing, while still having enough low end to ensure your sound is never thin or shrill. Exceptional sonic flexibility It's easy to stereotype the Gretsch G5422G-12 Electromatic 12-string hollowbody until you play it, and then you realize you can pull off a lot of tonal tricks with it. Volume controls for each pickup let you create a perfect balance between warmth, bite, and brilliance when both pickups are engaged. The master tone control lets you fine-tune your sound once you've got the pickups dialed in. And of course you'll get sweet tone from the neck and bridge pickups individually. The classic jangle of a 12-string electric guitar The Gretsch G5422G-12 Electromatic 12-string hollowbody electric guitar captures the classic jangly 12-string sound of the 1960s. Brought into popularity by guitarists like Roger McGuinn of the Byrds and Mike Nesmith of the Monkees, the double-cutaway 12-string electric has been a staple tone in guitarists' arsenal ever since the flower-power generation first adopted it. Gretsch guitars such as the G5422G-12 have been sought-after for their chimey and jangly tones that only they can provide. Gretsch G5422G-12 Electromatic 12-string Hollowbody Guitar at a Glance:Double-cutaway hollowbody 12-string electric guitar Laminated maple top, back, and sides add snap and definition to your sound \"Black Top\" Filter'Tron humbucking pickups deliver exceptional punch and twang 12-string design delivers chorus-type tones and droning techniques Binding on fingerboard and soundholes adds class and distinction Tech Specs Body Type: Hollowbody Body Shape: Doublecut Left-/Right-handed: Right-handed Number of Strings: 12 Body Material: 5-ply Maple Top Material: 5-ply Arched Maple Body Finish: Gloss Urethane Color: Walnut Stain Neck Material: Maple, Set Neck Shape: U profile Radius: 12\" Fingerboard Material: Rosewood Fingerboard Inlay: Pearloid Hump-Block inlays Number of Frets: 22, Medium Jumbo Scale Length: 25.5\" Nut Width: 1.6875\" Nut Material: Tusq XL Bridge/Tailpiece: Rosewood-Based Adjusto-Matic Bridge,\"G\" Cutout Tailpiece Tuners: Vintage Style Open-Back Neck Pickup: Black Top Filter'Tron Humbucker Bridge Pickup: Black Top Filter'Tron Humbucker Controls: Master volume, master tone, neck volume, bridge volume, 3-way toggle pickup switch Our luthier did a complete setup. Brand new strings were installed. Gig ready on Arrival! Nut Width: 1.77\" Weight: 7.15 lbs. Case is NOT Included Cosmetics: Excellent Condition. Pristine. Neck, Fretboard and Headstock in great shape. Dripping with \"Mojo\" It is used. Not perfect. Look at the pictures closely. They will tell the story. We are here to help! Top 40 guitars is a Veteran owned business.", "ItemID": "132947350902", "EndTime": "2019-02-18T02:05:30.000Z", "StartTime": "2019-02-11T02:05:30.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2018-Gretsch-G5422G-12-Electromatic-Hollowbody-Double-Cut-12-String-NO-RESERVE-/132947350902", "ListingType": "Chinese", "Location": "Santee, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1329473509028080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTE5OVg5NDA=/z/B0MAAOSwsqxcLqqU/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTM2WDgwNA==/z/Ph0AAOSwwfFcLqt1/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTMyN1g4MTc=/z/HFUAAOSwD8BcLqvS/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI4N1g5Mjc=/z/FMgAAOSwEqVcLqxM/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTMxWDQ3MA==/z/yccAAOSwHOZcLqzo/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAzMlg2MTA=/z/El8AAOSw2hxcLqyg/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI3MFg3NDc=/z/9doAAOSwwDJcLq1b/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAzN1g3MTY=/z/mi8AAOSw8R9cLq0n/$_57.JPG?set_id=8800005007"], "PostalCode": "92071", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "top40powertrio", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 13259, "PositiveFeedbackPercent": 99.7}, "BidCount": 31, "ConvertedCurrentPrice": {"Value": 760.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 760.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "u***u", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 33}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2018 Gretsch G5422G-12 Electromatic Hollowbody Double-Cut 12-String! NO RESERVE!", "ItemSpecifics": {"NameValueList": [{"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "String Configuration", "Value": ["12 String"]}, {"Name": "Country/Region of Manufacture", "Value": ["Korea, Republic of"]}, {"Name": "Model Year", "Value": ["2018"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Brand", "Value": ["Gretsch"]}, {"Name": "Body Type", "Value": ["Hollow Body"]}, {"Name": "Body Color", "Value": ["Gloss Black"]}, {"Name": "Model", "Value": ["G5422G-12 Electromatic 12-String"]}]}, "HitCount": 278, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=47416021", "StoreName": "Top 40 Guitars"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 770.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "2018 Gretsch G5422G-12 Electromatic Hollowbody Double-Cut 12-String Electric Guitar, Excellent Condition, See ad below for Full Description", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}