{"BestOfferEnabled": true, "Description": "This is a Limited Edition 2018 Fender 60th Anniversary Triple Jazzmaster in Daphne Blue and a Rosewood fretboard. It's in mint condition with the all of the original hang tags, case candy, tools, 60th Anniversary G&G hard case and protective plastic still on the pickguard.  This is a truly unique and highly versatile re-imagination of the Jazzmaster with it's triple humbuckers and FilterTron covers. It also has a toggle switch that allows you to take the middle pickup out in the middle (3rd position) if you prefer to run the bridge and neck pickup in parallel more like a traditional Jazzmaster. For the most part its stock but with a handful of choice and tasteful upgrades I added to take this re-imagination to the next level.  Please read further for more details: Weight is around 8.4 lbs Many of these vintage style \"Offsets\" from Fender sit on a great foundation, but I'm really surprised how they sell any of them because they're setup so horribly from the factory and buzz like crazy with anything less than a set of 12s. Even many of the American made offsets have this same problem because of the same original location of the tremolo (further back), vintage style floating bridge and the lack of break angle on them. This on top of some mediocre hardware and electronics choices from the factory, I decided I would overhaul many of these issues so you can enjoy this guitar with a set of 10s and not have to string it up with bridge cables or use one of those Buzz Stops that not only changes the look of the guitar but the feel and tone as well.  -Revised 2018 American Professional Jazzmaster narrow spacing 9.5\" radius bridge with Mustang style saddles ($80 upgrade). This is the current updated version of the American Professional bridge that has the modern 2-1/16\" (52mm) string spacing that brings the strings further away from the fretboard edge and a lot more comfortable to play. The original version of the Amerian Professional bridge it came with had the vintage 2-3/16” (56mm) spacing and is an odd choice for a modern re-imagination of an instrument. Fender quietly made this update over the last couple months and essentially makes this a lot more like a Staytrem bridge, which is no longer available outside of the UK (same spacing as the Mastery bridge too). So now there's no need for a Staytrem or Mastery bridge upgrade if you prefer that modern spacing. Like the original, it still has the Mustang style saddles and tighter threading screw posts so it doesn't sink down overtime when you play -Treble bleed circuit (.001uf cap and 1/4w 150k resistor in parallel) to allow the highs to remain when you turn the volume pot down and not get muddy.  -Orange Drop .022uf tone cap The ground from the bridge thimble also was not grounded directly to any of the control pots but just positioned to touch the pickguard shielding so I soldered a proper wire from this to the volume pot to ensure a solid connection and ground -Fender/Schaller strap locks and buttons (locks inside case compartment) -Kluson Supreme 18:1 Staggered tuners ($50 upgrade). These are the best vintage style Kluson replacement tuners out right now and still retain that same classic look, but with a much finer tuning adjustment over the stock 14:1 tuners and also a better break angle over the nut on the D and G strings for better sustain. Not to mention these are genuine Klusons while the stock ones are not -StewMac 0.5 degree full wood neck pocket shim. This is one of the main reasons why these guitars are never setup right from the factory and buzz like crazy and don't sustain with lighter gauge strings. This allows the bridge height to move up and increase the break angle after the bridge and give you enough tension to use lighter gauge strings without having to use a Buzz Stop or heavier strings while still retaining that classic Jazzmaster feel. The problem with using a Buzz Stop is that it increases the string tension so much that it starts to feel and sound more like a Strat or Tele and that more loose Jazzmaster magic is gone I also wanted to mention that the 60th Anniversary commemorative neck plate is lightweight aluminum and is 1/4 the weight of your standard steel neck plate (about 0.5 oz vs 2 oz) On top of these upgrades, it has also been cleaned, polished, oiled and conditioned the rosewood fretboard and fully setup with brand new D'Addario EXL110 (10-46) strings with enough relief in the neck balanced for both lead and rhythm and a light touch (5/64\" string height on both the low and high E strings). The saddles have been perfectly intonated and the bridge already has the 9.5\" fretboard radius. The nut slots have been cleaned and filed for optimal contact and take off points for better sustain. The neck, middle and bridge pickup heights are adjusted to 5/64\" on the bass side and 4/64\" on the treble side.  I fully stand by the work and believe this guitar is going to feel and play better than any other 60th Anniversary Triple Jazzmaster you're going to pull off the shelf new at the store. A brand new model is going to cost $1999 from the dealer without all the upgraded hardware, labor and attention to detail in the setup. That's a lot of money to spend when the guitar still clearly needs work. Why not just be done with it, have all the upgrades already completed and come out ahead with a better feeling, playing and sounding guitar? :)  Some more details from Guitar Center's page on the model: Sixty years ago, Leo Fender introduced the Fender Jazzmaster as the top-of-the-line electric guitar; later the sound and easily modifiable style attracted counterculture players who rarely hesitated to personalize their instruments. A modern, triple-pickup take on this hip, classic instrument, the 60th Anniversary Triple Jazzmaster is an homage to the mod ethos that permeates the cult of the Jazzmaster. It’s fierce, it’s inspiring and it’s uniquely Fender.\u2028\u2028Designed and voiced specifically for the Triple Jazzmaster by pickup guru Tim Shaw, this calibrated pickup set sports sleek chrome Filter’Tron covers. The throaty, powerful-sounding bridge pickup is matched to chiming neck and middle pickups for flexible sound. It wouldn’t be a Jazzmaster without some electronic twists, and this model features a standard 5-way pickup switch with traditional Strat layout and a special 2-way toggle switch. This extra switch uses position 3 on the pickup selector to activate the neck and bridge pickups in tandem. \u2028\u2028The “‘60s Oval C”-shaped neck bears a 9.5”-radius fingerboard with 21 narrow-tall frets for easy playability. Other authentic touches that grace the Triple Jazzmaster include a Jazzmaster tremolo bridge with lock button, screw-in arm and brass Mustang saddles, Pure Vintage single-line “Fender Deluxe” tuning machines, dual-wing string tree and 4-bolt vintage style neck plate engraved with a “60th Anniversary” logo. \u2028\u2028Produced in limited quantities for 2018, the 60th Anniversary Triple Jazzmaster combines authentic looks, uniquely flexible wiring and brand-new humbucking pickups from Tim Shaw for a guitar that’s ready to rip it up on stage and off. Includes hardshell case. Features Body Body shape: Double cutaway Body type: Solid body Body material: Solid wood Top wood: Not applicable Body wood: Alder Body finish: Gloss Nitrocellulose Orientation: Right handed Neck Neck shape: '60s Oval C Neck wood: Maple Joint: Bolt-on Scale length: 25.5 in. Truss rod: Standard Neck finish: Gloss Nitrocellulose Fretboard Material: Rosewood Radius: 9.5 in. Fret size: Narrow tall Number of frets: 21 Inlays: Dot Nut width: 1.687 in. (42.8 mm) bone Pickups Configuration: HHH Neck: Custom humbucking with Filter'Tron covers Middle: Custom humbucking with Filter'Tron covers Bridge: Custom humbucking with Filter'Tron covers Brand: Fender Active or passive pickups: Passive Series or parallel: Series Piezo: No Active EQ: No Special electronics: None Controls Control layout: Master volume, tone Pickup switch: 5-way Coil tap or split: No Kill switch: No Hardware Bridge type: Tremolo/Vibrato Bridge design: Jazzmaster/Jaguar bridge with vintage-style floating tremolo with tremolo lock button and screw-in tremolo arm Tailpiece: Not applicable Tuning machines: Pure Vintage Single Line “Fender Deluxe” Color: Nickel/chrome Other Number of strings: 6-string Special features: Electronics Case: Hardshell case Accessories: None Country of origin: United States", "ItemID": "302996209959", "EndTime": "2018-12-23T18:36:57.000Z", "StartTime": "2018-12-14T09:08:13.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2018-Fender-USA-60th-Anniversary-Triple-Jazzmaster-Daphne-Blue-Rosewood-UPGRADES-/302996209959", "ListingType": "FixedPriceItem", "Location": "Washington, District Of Columbia", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/3029962099598080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/OTE0WDE2MDA=/z/GeQAAOSwHSdcE3Ia/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/~QcAAOSwEp5cE3Lv/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/X18AAOSw7wFcE3Lm/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/UjgAAOSwpwBcE3Lb/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/t3cAAOSwLgpcE3Ik/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/mZcAAOSw6jJcE3LV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/m7YAAOSwfTlcE3LM/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/5CYAAOSwQ9lcE3LG/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/Xy4AAOSw7wFcE3K7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/DqIAAOSwtFxcE3K0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/2OMAAOSwGq5cE3Ks/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjQ3WDE2MDA=/z/zqAAAOSwF5hcE3JY/$_57.JPG?set_id=8800005007"], "PostalCode": "20001", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "radar-music", "FeedbackRatingStar": "Red", "FeedbackScore": 2003, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1649.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1649.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "c***6", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1318}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2018 Fender USA 60th Anniversary Triple Jazzmaster Daphne Blue Rosewood UPGRADES", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "Model Year", "Value": ["2018"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Body Color", "Value": ["Daphne Blue"]}]}, "HitCount": 93, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}