{"BestOfferEnabled": true, "Description": "DJ GEAR INSTRUMENT GEAR LIVE SOUND RECORDING MICROPHONES HEADPHONES ACCESSORIES SOFTWARE LIGHTING BUNDLES Authorized Dealer Godin Guitars xtSA Synth Access 3 Voice Electric Guitar Dark - Trans Black Flame - Used Electric Custom Guitar Dark in Trans Black Flame with Synth Access - Customer Return - Description A jack-of-all-trades, and master of all of them, the xtSA&rsquo;s incredible sound power begins with three distinct voices: electric guitar, acoustic guitar and synth controller. The xtSA delivers big time electric sounds via the Godin humbucker-single-humbucker pickup configuration and thanks to a special 5-way switch setup extra meaty humbucker tones co-exist with glassy split-coil sounds in the second and forth position. Turn down the electric output and raise the volume on the RMC transducer saddles and the xtSA becomes an incredibly authentic-sounding &lsquo;acoustic&rsquo; guitar. The acoustic voice of the xtSA is enhanced by an onboard preamp with a three-way graphic EQ. The two outputs are set up so that the electric and acoustic voices can be blended in the guitar using a single patch cord or at the amp/mixer using both outputs. The icing on the xtSA cake comes in the form of its synth tracking, which simply put, is the best in the business. As with all of Godin synth-ready instruments, a built-in 13-pin connector provides direct access to all Roland GR-Series synths as well as most other 13-pin devices. All of this sound power would be a lot less interesting if the guitar didn&rsquo;t feel great and great is exactly how the xtSA feels thanks to the same 25½&rdquo; scale, mahogany neck used on the Godin flagship LGX-SA guitar. The ebony fingerboard is shaped with Godin&rsquo;s ergocut technique and equipped with medium jumbo frets. Features/Specs - Body - Silver Leaf Maple center with Poplar wings- Fingerboard - Ebony- Neck - mahogany- Scale - 25½\" - Electronics - Godin humbucker-single-humbucker, tremolo bridge with RMC transducers, custom pre-amp with 3 band EQ for acoustic sound- 3 outputs - electric, acoustic/mix, 13-pin for Roland GR synths & most other 13-pin devices- Color : Trans Black HG We are authorized dealers for all these brands. Click a logo to see our listings. We collect NYS Sales Tax for items shipping within New York. Local duties, taxes and fees out of the USA are not included in the sale price or ship charge. Proaudiostar is not responsible for any taxes outside of NY and or the USA. If an item is refused by the buyer, ship costs to and from the destination in which the item was shipped to are not refunded. Please note the cost of return shipping is usually double of what the original ship cost. Shipping is not free to HI, AK, and PR. FREE SHIPPING ONLY TO THE LOWER 48 STATES. We provide free shipping to the contiguous 48 United States, on most items. Shipping fees to ALL OTHER LOCATIONS will be calculated individually and added to customer invoices. Local duties, taxes and charges are not included in the sale price or ship charges. ProAudioStar is not responsible for any taxes outside of NY and or the USA. In the event that the customer refuses a shipment, all shipping costs to and from the country or State in which the item was shipped to are not refunded. Please note, in some cases return shipping can cost as much as double the original ship cost. We operate a 30-day return period. Items must be returned with all original packaging as well as all included items. Items that are not returned in original, resalable condition are subject to a 15% restocking fee. We charge a 15% restocking fee on returned items only if the item is clearly used and or the packaging is tarnished. A 10% re-stock is more likely if the unit comes back in mint condition. The ship cost we paid to ship your item will be deducted as well. In some cases restock fees and ship costs can be applied as a store credit. We will exchange a defective unit for the same unit within the 30-day period. After that period, you will have to work directly with the manufacturer for warranty service. Items that can not be returned include: software, units with contents or packaging that is damaged/missing, and items that are considered for personal use (such as earphones, headphones, microphones, instrument mouthpieces, harmonicas or other items that you wouldn't want to purchase if someone else had previously used them). Also, Items which we do not normally stock (i.e. \"Special Orders\", discontinued products, close-outs, used products, etc.) are non-returnable. We strongly suggest that you check your order after receiving it to be sure that it is in proper working order. Please contact us for a Return Authorization before returning any items.", "ItemID": "292901383695", "EndTime": "2019-01-24T17:57:48.000Z", "StartTime": "2019-01-03T16:14:46.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Godin-Guitars-xtSA-Synth-Access-3-Voice-Electric-Guitar-Dark-Trans-Black-Flame-/292901383695", "ListingType": "FixedPriceItem", "Location": "Winchester, Virginia", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2929013836958080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/OTg0WDEyMTU=/z/1I4AAOSwsBtaHuTC/$_1.JPG?set_id=880000500F"], "PostalCode": "22601", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 2, "Seller": {"UserID": "proaudiostar", "FeedbackRatingStar": "RedShooting", "FeedbackScore": 211095, "PositiveFeedbackPercent": 98.8, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 769.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 769.99, "CurrencyID": "USD"}, "ListingStatus": "Completed", "QuantitySold": 2, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Godin Guitars xtSA Synth Access 3 Voice Electric Guitar Dark - Trans Black Flame", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Godin"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "UPC", "Value": ["Does Not Apply"]}]}, "HitCount": 416, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=336450849", "StoreName": "proaudiostar"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "DiscountPriceInfo": {"OriginalRetailPrice": {"Value": 1095.0, "CurrencyID": "USD"}, "PricingTreatment": "STP", "SoldOneBay": false, "SoldOffeBay": false}, "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "BR"], "GlobalShipping": false, "ConditionDescription": "Customer Return", "QuantitySoldByPickupInStore": 0, "SKU": "GDN-25503-B", "NewBestOffer": false}