{"BestOfferEnabled": false, "Description": "Gibson 2017 SG Standard T Electric Guitar with Case - Pelham Blue MINT. This is lightly used and has been in my home studio for a few months. Specs are below - this is a great guitar at a good price. Gibson 2017 SG Standard T Electric Guitar Features Limited Edition Exclusive Run Pelham Blue finish available at American Musical Supply! Aluminum Tune-o-Matic bridge with steel thumbweels Aluminum Stop Bar with steel post Pickups perfectly matched to the spirit of their historic models and classic Gibson controls Rolled binding over the frets Polished 0.55 frets on top of our original 1.695” neck width and original Gibson Les Paul heel Hand-selected and book matched solid maple top with historic flame grades Historic plastics, knobs, hardware, truss rod cover and acrylic inlays Historic Switchcraft toggle switch and multi-contact gold-plated jack Body Design The instantly recognizable and often-copied asymmetrical double-horned body provides complete access to the upper frets. The sleek and lightweight body is constructed of mahogany with a hand-selected, book-matched solid maple top and is coated in hi-gloss nitrocellulose lacquer. The small teardrop pickguard is a very nice throwback to the early '60s SG Standard. Slim-taper Neck Profile Known for easy playability, this super-fast neck joins the body at the 21st fret, providing effortless upper-fret access. The scale length measures 24.75\" and the thicker rosewood fingerboard comes adorned with white acrylic trapezoid inlays and beautiful rolled white binding. The headstock is angled at 17 degrees and features mother-of-pearl ‘Gibson’ and holly (crown) inlays. Electronics Powered by a Classic ’57 humbucker in the neck position and a ’57+ at the bridge, you’ll experience tone reminiscent of the revered PAF era pickups. Under the chrome covers you’ll find Alnico II magnets for authentic vintage ‘color’. Pickups are selected via a Switchcraft toggle switch leading to a multi-contact gold-plated output jack. Hardware From the chrome-covered aluminum stop tailpiece and classic Tune-o-matic bridge, to the 14:01 ratio locking Grover “kidney button” tuners, The SG Standard’s hardware provides timeless style with tried-and-true performance and durability. Case The 2017 LE Exclusive SG Standard ships complete with a classic Gibson hard shell case.", "ItemID": "132940046534", "EndTime": "2019-02-05T08:22:25.000Z", "StartTime": "2019-02-03T17:08:22.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-2017-SG-Standard-T-Electric-Guitar-Case-Pelham-Blue-MINT-/132940046534", "ListingType": "Chinese", "Location": "Morris Plains, New Jersey", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1329400465348080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/RZIAAOSw259cVx-s/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjIwWDYyMA==/z/KvoAAOSw1T1cVx-u/$_32.JPG?set_id=880000500F"], "PostalCode": "07950", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "reneev4", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 448, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 1200.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1200.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "v***j", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 35}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson 2017 SG Standard T Electric Guitar with Case - Pelham Blue MINT", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Product Line", "Value": ["Gibson SG"]}, {"Name": "Model Year", "Value": ["2017"]}, {"Name": "Model", "Value": ["SG Standard"]}, {"Name": "Body Color", "Value": ["Blue"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}]}, "HitCount": 150, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 1225.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}