{"BestOfferEnabled": false, "Description": "Parker Fly Natural Mahogany Pre-Refined Guitar with Hard Shell Case, stereo cable and tremolo bar. This guitar plays like a dream! Natural Mahogany front finish with vibrato bar and tailpiece. Vibrato bridge has a 09 spring installed from factory. Unit has three pickup option with battery operated Piezo on the bridge for amazing acoustic guitar sounds. Total tonal functionality with this unit. Guitar has light scratches on its back laquer backside and a few nicks on the front panel. Head stock has end ding that has been touched up with laquer. No major issues with body or neck and is very solid for its age. Has toured the world and has been well maintained. Most amazing part about these cool guitars is they weigh less than 5 pounds and are so easy to play. No reserve auction priced for market value, Good luck bidding, Will ship Fedex Ground fully insured or can be picked up in person. We are 3 hours from Chicago and 1.5 hours from Dayton, Cincinnati and Louisville. Historical background: The first Fly guitar ever left the original factory in Wilmington, MA in 1993. Already in 1999 the pickups, custom DiMarzio \"GEN1\", were changed to the GEN2 version (also by DiMarzio). In the mid nineties, GEN1 pickups were criticized for having a much too \"hi-fi tone\". Lately the GEN1 pickups have gained more attention and are now categorized the real deal for a Fly by many people. In 2003 some more aspects of this guitar were changed: The layout was reduced from four knobs to three, as well as the entire electronics were exchanged for a cheaper version that was used on the Nightfly exclusively until then. Also parts of the hardware have been replaced for cheaper ones, making the production more cost effective. Differences between the pre refined and refined Parker Fly are explained. Parker Fly electronics - some technical details: The Parker Fly is has quite complex electronics installed. The heart of the pre refined electronics is the Fishman Board (it reads „Fly 1 REV 1 FISHMAN“). All connections to pots and switches are done by ribbon cables). Swerving from the use of conventional wiring was another important aspect for Ken Parker in creating a very modern instrument. The ribbon cables work very fine but have one disadvantage: They are quite fragile, torn very easily and almost impossible to replace, as there aren‘t any spare parts available. If your Fly has this issue you can either convert the wiring to a or ask members of the who have done this conversion if they would sell you their (intact) ribbon cables. My and I didn‘t want to change its original state. The problem has been caused by the battery clip cable that was wound around the ribbon cable. I would have never identified this as a trouble maker. But every time I changed the battery, I tore a little of the ribbon tape py pulling the battery cable. And at some point the switch for the piezo pickups didn‘t do its job anymore. I tried to repair the tape: Soldering didn‘t seem to be an option for me as the ribbon is so fragile. Also I didn‘t manage to short cut the broken parts with conductive silver coating (the conductive paths are so near to each other, so the the coating always touched the next path no matter how careful I covered it with tape). In the end it took me more than two years to find someone willing to sell me an unharmed set of ribbon cables that I installed. Of course I led the battery cable that was wound around the ribbon cable in the Parker factory the direct way this time. So there won‘t be any ribbon cable problems in future anymore!", "ItemID": "401660526535", "EndTime": "2018-12-24T16:49:33.000Z", "StartTime": "2018-12-17T16:49:33.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Parker-Fly-Natural-Mahogany-Pre-Refined-Hard-Shell-Case-/401660526535", "ListingType": "Chinese", "Location": "Indianapolis, Indiana", "PaymentMethods": ["PayPal", "VisaMC", "Discover", "AmEx"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/4016605265358080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NDgwWDY0MA==/z/p~wAAOSwPuRcF8-L/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDgwWDY0MA==/z/XnoAAOSwHOZcF8-Q/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDgwWDY0MA==/z/c~oAAOSwvERcF8-Y/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDgwWDY0MA==/z/dBAAAOSwPVFcF8-f/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDgwWDY0MA==/z/-uAAAOSwrQxcF9Ax/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDgwWDY0MA==/z/egwAAOSwk4RcF8-y/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDgwWDY0MA==/z/RBgAAOSw8MxcF8-6/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDgwWDY0MA==/z/J70AAOSwcVpcF8~A/$_57.JPG?set_id=8800005007"], "PostalCode": "46236", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "audiodude", "FeedbackRatingStar": "Red", "FeedbackScore": 2682, "PositiveFeedbackPercent": 100.0}, "BidCount": 4, "ConvertedCurrentPrice": {"Value": 1425.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1425.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "e***l", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 0}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Parker Fly Natural Mahogany Pre-Refined with Hard Shell Case", "HitCount": 327, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 1450.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}