{"BestOfferEnabled": false, "Description": "For sale we have a Schecter Hellraiser C-8 Special 8 string Electric Guitar. Lightly usedNo caseActive EMG PickupsFully tested and functional Questions? Please ask for Mark Music Go Round® named a \"Top 100 Dealer\" at NAMM 2011-2018!(National Association of Musical Merchants) We are very honored to be recognized by our peers as a leader in our industry.Thank you...and most of all thanks to our customers who help us to find you COOL USED GEAR! Payment & Shipping ExpectationsIf 'buy it now' is not used payment is required within 48 hours of auction close.We ship within 5 business days after receiving payment.Signature Confirmation is required on all packages.Tracking will be provided by UPS and USPS for all shipments.We do not ship to PO Boxes - please adjust your eBay/PayPal physical address before buying.Minnesota bidders will be charged 7.125% sales tax.If product is damaged, buyer must keep all packaging for claim to be made and processed. Please contact us within 48 hours if damage has occurred and KEEP ALL PACKING MATERIALS!! We cannot file a claim without original packing materials, if you throw them out, you are stuck with the item, as is. Claims can take quite a bit of time so please be patient with us, we are at the mercy of the shipping company. We try and work toward the resolution of any issues that may come up. Please don't hesitate to call or email us immediately if there is a problem.Please note: If there is a shipping insurance claim that is opened to please allow 2-6 weeks for a refund. Filing a claim through PayPal and eBay freezes the transaction and makes it much more difficult to resolve any issues, please contact us prior to opening a claim.International Buyers – Please Note:Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer’s responsibility.We do not mark merchandise values below value or mark items as ‘gifts’.Your country may have shipping size restrictions and we may not be able to ship to your location.Customer Service and General TermsWe do our absolute best to describe our items accurately so you know what you're getting! Please, if you have any problems with your purchase or feel that we did not perform at a 5 star level, please contact us prior to leaving feedback and we'll do our best to help.If you're new to eBay (5 Feedback or Less) please contact us before bidding/buyingIf you have any concerns with your purchase, contact us within 48 hoursItems are non-returnable and not warrantiedPlease contact us with questionsE-Commerce Sales and Use TaxYour E-commerce purchase may be subject to state and/or local sales and use tax reporting and remittance. Please consult your state’s sales and use tax requirements for your potential sales or use tax obligations for this e-commerce purchase.Music Go Round is not required to, and does not, collect Washington sales or use tax. Under Washington law, purchases are not tax-exempt merely because a seller is not required to collect Washington’s tax. Washington law requires Washington purchasers to review untaxed purchases and, if any tax is owed, file a Washington use tax return and pay any tax due. Visit dor.wa.gov/consumerusetax for more information.Pennsylvania sales tax was not collected on this sale. Therefore, you may be required to remit use tax directly to the Commonwealth on your purchase if the items are subject to Pennsylvania sales tax. Please visit the link below to learn more about your use tax obligations under Pennsylvania law. https://www.revenue.pa.gov/GeneralTaxInformation/Tax%20Types%20and%20Information/SUT/UseTax/Pages/default.aspx", "ItemID": "113657025918", "EndTime": "2019-02-25T22:20:16.000Z", "StartTime": "2019-02-20T21:44:14.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Schecter-Hellraiser-C-8-Special-8-string-Electric-Guitar-/113657025918", "ListingType": "FixedPriceItem", "Location": "Burnsville, Minnesota", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1136570259188080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NTk3WDgwMA==/z/ca0AAOSwTmpcbclp/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTk3WDgwMA==/z/kGcAAOSw04Zcbclq/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTk3WDgwMA==/z/ca8AAOSwTmpcbclr/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTk3WDgwMA==/z/OjAAAOSwLtBcbclr/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTk3WDgwMA==/z/a90AAOSweedcbcls/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTk3WDgwMA==/z/gnsAAOSwYkJcbclt/$_57.JPG?set_id=8800005007"], "PostalCode": "55337", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "music_go_round_burnsville_mn", "FeedbackRatingStar": "Red", "FeedbackScore": 2915, "PositiveFeedbackPercent": 98.7}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 399.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 399.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "6***c", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 310}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Schecter Hellraiser C-8 Special 8 string Electric Guitar", "ItemSpecifics": {"NameValueList": [{"Name": "String Configuration", "Value": ["8 String"]}, {"Name": "Brand", "Value": ["Schecter"]}, {"Name": "Model", "Value": ["Hellraiser C-8 Special"]}]}, "HitCount": 23, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=136978540", "StoreName": "musicgoroundburnsville"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Fully Tested and Functional. Lightly used. No Case.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}