{"BestOfferEnabled": true, "Description": "HEARTLAND PAWN OLATHE IBANEZ 7-String Electric Guitar RG7421 Alpine White Gold Hardware Hipshot Tuners Description: ELECTRIC GUITAR: IBANEZ MODEL RG7421, 7 STRING, RIGHT HANDED, MADE IN INDONESIA, 2014 Details Additional Details for eCommerceHIPSHOT GOLD TUNERS AND HARDWARE Musical Instrument Condition Rating98% - Excellent - Like New - Rarely Used Instrument Appearance95% - Excellent Condition : Very Clean, might have some minor wear, dings, scratches, or finish cracks, but otherwise very close to new condition. Knobs - Tuners - Electronics - Input Jack95% - Guitar is like new - Very little wear - All original Musical Instrument CaseNot Included Number of Strings7 STRING Country of ManufactureOTHER COUNTRY Body StyleSOLID DexterityRight Handed Notes: The RG7421 has a basswood body bolted to a maple Wizard II-7 neck with a 24-fret rosewood fingerboard with white dot position markers. This particular Ibanez accompanies custom gold hardware and gold Hipshot tuners! It is in great condition! The guitar is missing hardware for the straps and there is a small chip in the finish on the front of the body (see photos)! Otherwise, this RG7421 is in fantastic condition and like new! Little play/pick wear! Condition: This item is Pre-owned and shows signs of previous use such as cosmetic wear and dust. Please closely examine photos for exact cosmetic condition and listing contents. Good overall condition! If you have any questions that were not answered in the description above, feel free to send me a message prior to bidding/purchasing item. Photos are of actual item(s) being shipped. If you do not see an item that you believe should be included please send me a message to clarify: if it is not shown in the photos then it is considered not included unless stated otherwise Thanks for stopping by! Be sure to check out my other listings! Payment PayPal is the ONLY online payment method we accept at this time. Your PayPal account must be a Verified U.S. PayPal Account. We also recommend that you use a Confirmed Ship To Address. Shipping Your item will be shipped within 1-2 business day(s). After shipping your items will be delivered within 1-10 business days. Terms of Sale Tax applies in: KS About Us Heartland opened for business in 2010 with two brick-and-mortar locations- one in Olathe, KS and one in Overland Park, KS! We sell all types of electronics - laptops, tablets, Apple products, & cell phones.We sell all video game systems from the vintage to the latest.Bar lights, collectibles, coins, jewelry, car audio. We buy and sell pretty much anything! Whatever works best for our customer. Our goal is to do what's right for the customer first. With friendly staff and several bi-lingual associates, we provide top quality service. Everything we do is focused around our customer. People are amazed every day when they wander in to check out our store on-line or local. Clean, friendly, safe, and comfortable. Stop in today or any day! Things I Buy: Musical Instruments, Guitars, Televisions, Car Audio/Video, Jewelry, Gold, Power Tools, Vintage Video Games, Bar Lights, Coins Bravo Store Systems Point-of-Sale Operating System Bravo Omni-Commerce solutions offers Brick & Mortar stores the only fully integrated eBay API that seamlessly & effortlessly combines the in-store Point-of-Sale to all eBay commerce selling activities. Click here & find out why eBay stated \"Bravo has best solved Brick & Mortars can sell on eBay\"", "ItemID": "352586971542", "EndTime": "2019-02-27T15:40:28.000Z", "StartTime": "2019-02-05T15:15:57.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/IBANEZ-7-String-Electric-Guitar-RG7421-Alpine-White-Gold-Hardware-Hi-HE1013334-/352586971542", "ListingType": "FixedPriceItem", "Location": "Olathe, Kansas", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/3525869715428080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/ODAwWDgwMA==/z/TtkAAOSwUP5cWaim/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDgwMA==/z/HUoAAOSwMpFcWain/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDgwMA==/z/j1UAAOSwHphcWain/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDgwMA==/z/KekAAOSw3ltcWaio/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDgwMA==/z/Pt4AAOSwbKVcWaio/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDgwMA==/z/fscAAOSwm~1cWaio/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDgwMA==/z/mvEAAOSwozNcWaip/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDgwMA==/z/xIUAAOSworNcWaip/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDgwMA==/z/d1IAAOSwYwZcWaiq/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDgwMA==/z/3HIAAOSwfqJcWaiq/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDgwMA==/z/fUIAAOSw-hZcWaiq/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDgwMA==/z/ZGoAAOSwf1xcWair/$_1.JPG?set_id=2"], "PostalCode": "66061", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "hpjexpress", "FeedbackRatingStar": "Green", "FeedbackScore": 8973, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 549.85, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 549.85, "CurrencyID": "USD"}, "HighBidder": {"UserID": "b***o", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 5}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "IBANEZ 7-String Electric Guitar RG7421 Alpine White Gold Hardware Hi (HE1013334)", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Ibanez"]}, {"Name": "Model", "Value": ["RG7421"]}]}, "HitCount": 415, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1002061809", "StoreName": "HPJexpress"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "Oceania", "Southeast Asia", "South America", "BM", "GL", "MX", "PM", "PO Box"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}