{"BestOfferEnabled": true, "Description": "1976 GRECO SUPER SOUNDS STRATOCASTER, MIJ, Matsumoku, Japan Vintage large headstock, whammy bar, 3 Tone Sunburst, maple neck, Matsumoku DETAILS: Pickups: The pickups sound great. Nice, vintage strat tones. Electronics: Original 3-W switch, works in all positions. The input jack hums if you bump it, but otherwise all electronics work fine. Check out the tank-like switch in the pics. They don't make them like that anymore. Neck: is flat, with the perfect amount (a tiny bit) of relief. If you capo the first fret and put your finger on the last fret of the low E string, there is just a little bit of space between the 8th fret wire and the low E string. Truss Rod: fine. The hex nut on the heel is in great shape. I turned it 1/4 turn to the left, nice and smooth, then gently went back to the right into the original position. Tuners: they all work fine. They are not loose where they connect to the headstock. When you turn them they feel smooth, but if there are no strings attached, the posts where the string wraps around has a little play. Neck: Maple. Flat. Really feels good. No rough spots anywhere along the edges. Frets: Vintage style. There is enough frets left to play, but there are wear spots. Slides are nice and easy. Action/playability: This guitar plays pretty well right now, but it needs fresh strings and a set up. The low and high e strings are right around 2.75mm at the 12th fret. Setup: I don't do setups, especially prior to shipping internationally. But this guitar would play even better after a pro setup. Want to see more of this guitar? CLICK HERE FOR A TON OF PICS Comments and Observations: In my totally biased opinon, it's beautiful. Yes, she has some nicks, dents and scratches from years of use, but the nice three-tone sunburst and the maple neck are gorgeous. She exudes MIJ Strat mojo! Original whammy / tremolo bar included. It's a solid, heavy instrument, and plays well. The 3-way switch is original. Everything appears to be original except for the pickup covers. It's missing one pick guard screw. SHIPPING Shipping via EMS from Japan to North America is $115 **Unfortunately, I do not ship to Germany.** Please ask for a quote for shipping to Europe (not Germany) and other countries. Please pay via PayPal. Please note that: import duties, taxes and any other charges are not included in the item price, and shipping charges are the buyer’s responsibility. Please find out what any other customs type charges will be before bidding. This is a vintage guitar over 30 years old and is sold \"AS IS.\" I've done my best to describe every flaw but I cannot catalog every ding and potential issue. This guitar is for collectors and experienced players used to older instruments. This guitar is not a good first guitar, especially for younger players. The buyer may need to have a professional set-up or repair on this instrument to make it play to its full potential. Any repair costs after the sale are the buyer's responsibility. Questions? Please email me and I'll answer any question you've got. If you have a ton of questions I can even set up a skype call and answer any question you have. Need another picture from a different angle? Send me an email. I've tried to describe this guitar as completely and transparently as possible so you will not be disappointed when it arrives at your door.", "ItemID": "113669204699", "EndTime": "2019-03-01T12:28:57.000Z", "StartTime": "2019-03-01T12:18:42.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1976-Greco-Super-Sounds-Stratocaster-Matsumoku-Made-Japan-/113669204699", "ListingType": "FixedPriceItem", "Location": "Munakata", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1136692046998080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg4MDM=/z/7WcAAOSwRDJcJwGl/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/hBIAAOSwJ9dcJwIq/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/7YYAAOSwUlFcJwI3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/NxQAAOSwi7VcJwIK/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/UbsAAOSwhexcJwIf/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/-R0AAOSwjlVcJwKq/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/D0wAAOSwNTNcJwKe/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/HyQAAOSwa55cJwLg/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/YEoAAOSw5wJcJwLl/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/7jkAAOSwRDJcJwLp/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/i~4AAOSwsqxcJwLu/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/UCcAAOSwiOZcJwMU/$_57.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "retrogamerjapan", "FeedbackRatingStar": "Yellow", "FeedbackScore": 42, "PositiveFeedbackPercent": 0.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 357.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 357.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***0", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 2196}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "1976 Greco Super Sounds Stratocaster, Matsumoku, Made in Japan", "ItemSpecifics": {"NameValueList": [{"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Brand", "Value": ["Greco"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Model", "Value": ["Super Sounds"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["3 Tone Sunburst"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Exact Year", "Value": ["1976"]}, {"Name": "Model Year", "Value": ["1976"]}]}, "HitCount": 4, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "JP", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Central America and Caribbean", "Middle East", "DE"], "GlobalShipping": false, "ConditionDescription": "Plays fine, looks great.  All original.  See details in description.  View a ton of pics via the link in desc.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}