{"BestOfferEnabled": false, "Description": "Up for sale, a 1962 Gretsch 6117 Double Anniversary in collector-grade condition, complete with the original hangtags, case candy, and hardshell case. As complete as any vintage Gretsch can be, this Anniversary includes the polish cloth (still in the original plastic), optional accessory vibrato unit, Gretsch branded strap, OK card, Space Control bridge leaflet, HiLo'Tron pickup advert, and the original certificate, which has the original matching serial number (also present on the original envelope for the cert). Fully hollow and featuring an early pair of Gretsch's Hilo'Tron single coil pickups, this guitar balances snap, twang, and jangle with the smooth attack and warmth of the maple body construction. The light bracing inside the body gives the instrument a lively, crisp acoustic tone, which translates well through the pickups, delivering a clarity and midrange character that sounds distinctly \"Gretsch.\" The guitar weighs in at 7lbs 5oz. We've professionally setup this Double Anniversary here at our shop, Mike & Mike's Guitar Bar, and the instrument has been dialed in with low action and 11-50 roundwound strings.The maple neck has a medium C shaped profile with slight shoulders which gains a bit more depth and roundness as you travel up the fretboard, measuring .856\" deep at the first fret and filling out to 1.004\" at the 10th fret where the profile begins to transition into the neck heel. The Brazilian rosewood fretboard has pearl thumbnail inlay and original frets which show zero wear with perfectly rounded crowns. The original nut has a full 1 3/4\" width, perfect for easy chording and accurate lead lines without feeling cramped. On the headstock, the original open-back Waverly tuning machines are intact and turn very smoothly, holding pitch as they should with near flawless chrome plating.All of the original electronics are intact, with the Hilo'Trons wired to individual Volume controls on the treble side lower bout and a Master Volume on the treble side body horn. A three-way tone switch (bypassed in the middle) and three-way pickup selector switch round out the controls, and the tone switch engages some dark and thick sounding tone caps that really punch up the sound of the single coil pickups. The silkscreening on the pickup covers is almost completely intact and a testament to the very light use this guitar has seen over the decades, as this silkscreening is quite slight and has worn away on the vast majority of vintage examples. The stock chrome hardware is in fantastic shape, with a clean \"G\" trapeze tailpiece, original knobs, and stock \"Space Control\" bridge that allows you to adjust the string spacing on the fly if desired. The neck has been freshly reset, so the bridge has ample height for adjustment at both thumbwheels, and the action is low and comfortable in every register. The top has a consistent arch as well.Cosmetically, this Gretsch boasts a vibrant and 100% original three-tone sunburst finish. Perhaps most importantly, the binding is completely original and intact, with the only wear of note being on the heel cap and on the inside edge of the cutaway. The binding is still stable in this area and a couple small binding splits on the neck have been reglued for a smooth playing experience up the neck. The instrument is near mint, with a few tiny pinhead sized nicks on the guitar as a whole, a few scattered light finish scratches on the back and a couple tiny nicks on the top edges of the headstock. This Gretsch is simply as clean and complete as they come, professionally setup and sure to satisfy serious collectors.The original silver speckled hardshell case is intact and also particularly clean with all working latches intact and the Gretsch badge on the exterior. The guitar comes with every bit of case candy imaginable as well as the hangtags and original certificate. Check out our shop \"Mike & Mike's Guitar Bar,\" and please let us know if we can answer any questions!Shipping in the continental USA will be $80, fully insured and shipped via FedEx Ground. Expedited shipping available for an additional fee at buyer's request. We will happily ship WORLDWIDE, but please contact us for an accurate international shipping quote before bidding or buying, as cost varies by buyer location. International orders will be declared as “merchandise,” and the value of merchandise will be declared as the amount paid. We cannot declare anything as a gift or for a lesser value. No exceptions! The customer is responsible for all taxes and duty, which may be collected upon delivery, as well as any additional charges involved with import. We have all necessary CITES paperwork in-hand to ship rosewood worldwide.We do our best to describe all items with honesty and accuracy, but to be sure, please contact us with any questions or concerns prior to bidding or buying. We require payment within 48 hours of auction end. In the unlikely event of a return, buyer pays all shipping costs. Your positive feedback and five star ratings are very important to us, and we appreciate your communication in resolving any issues!", "ItemID": "163561015049", "EndTime": "2019-02-24T18:46:19.000Z", "StartTime": "2019-02-23T08:58:55.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1962-Gretsch-Double-Anniversary-6117-Vintage-Guitar-Collector-Grade-w-Hangtags-/163561015049", "ListingType": "FixedPriceItem", "Location": "Seattle, Washington", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1635610150498080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/EoYAAOSwd9dccQSa/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/3ygAAOSwPjNccQSq/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/8fMAAOSwFa5ccQSo/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/DPYAAOSwJD1ccQSz/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/gvwAAOSwFpVccQSs/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/hskAAOSwpa5ccQSd/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/QEcAAOSwF59ccQS2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/DTAAAOSwo61ccQSf/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/fYkAAOSwBRZccQSi/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/TxoAAOSwBKBccQSl/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/zM4AAOSw6xVccQSv/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/kTQAAOSww9BccQSx/$_57.JPG?set_id=8800005007"], "PostalCode": "98117", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mmguitarbar", "FeedbackRatingStar": "Red", "FeedbackScore": 2613, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 2599.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2599.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "u***1", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 8}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "1962 Gretsch Double Anniversary 6117 Vintage Guitar Collector-Grade w/ Hangtags", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gretsch"]}, {"Name": "Body Type", "Value": ["Hollow"]}, {"Name": "Body Color", "Value": ["Sunburst"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Material", "Value": ["Maple"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Model", "Value": ["6117 Double Anniversary"]}, {"Name": "Soundboard Style", "Value": ["Archtop"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["1962"]}]}, "HitCount": 23, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=269063702", "StoreName": "Mike and Mikes Guitar Bar"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}