{"BestOfferEnabled": false, "Description": "Up for sale, a 1979 Gibson Les Paul Standard in excellent condition and in perfect working order. 100% original aside from a set of vintage-spec Schaller tuners, this Les Paul features a vibrant Cherry Sunburst nitro lacquer finish, delivering an array of classic Gibson tones from the T-Top humbuckers. The thick carved maple top and solid mahogany body deliver incredibly clarity, warmth, and sustain, and at only 9lbs 11oz this Les Paul is a very manageable weight too. The bridge pickup has round, chiming tones with a hint of growl and great cut, while the middle position has an ideal rhythm sound, especially with the neck pickup rolled back just a touch. The neck position humbucker has great warmth and woof without sacrificing detail, providing a perfect lead sound and a sweetness that lends itself to complex chord voicings. Professionally setup here at Mike & Mike's Guitar Bar, this Les Paul is dialed in with 10-46 strings, low action, and solid intonation. The three-piece maple neck has a slender C shaped profile with gently sloping shoulders and a hair more depth in the higher registers of the fretboard. The neck profile shows wear along the fretboard edges through the Cherry Sunburst lacquer from frets 5-11. The original frets are wide and flat (given Gibson's factory fret dress in this era), yet have a surprising amount of meat, showing light wear on the crowns of frets 1-4 and fainter wear until fret 6 exclusively beneath the plain strings. Further up the fretboard the guitar exhibits no wear and the instrument frets cleanly in all registers. The rosewood fretboard features pearl trapezoid inlays and original cream binding. The nut measures 1 11/16\" in width, and on the headstock, the Schaller-made Kluson-style tuners turn smoothly with double ring lightly greened tulip buttons.All of the electronics work as they should, with untouched solder joints and stock CTS pots that date to the 18th week of '79. Both T Tops have clean patent number baseplates along with 1979 ink stamps on the plates. The chrome hardware is extremely clean with only light wear on the bass side edge of the Nashville bridge base. The original plastic parts are present as well. In terms of cosmetic wear, the guitar boasts a 100% stock Cherry Sunburst finish with zero touchups or overspray. The three-piece carved maple top shows sparingly little wear and is as clean as the photos show it to be, with well matched seams and zero fading of the lacquer. The back of the guitar shows notable buckle rash, yet the wear hasn't penetrated the finish Additionally the guitar shows some requisite minor finish nicks on the back edges of the body. The guitar has zero cracks or repairs, and this is a very nice example of a '70s Les Paul Standard with factory installed full size humbuckers! A hardshell case is included. Check out our shop \"Mike & Mike's Guitar Bar,\" and please let us know if we can answer any questions! Shipping in the continental USA will be $70, fully insured and shipped via FedEx Ground. Expedited shipping available for an additional fee at buyer's request. We will happily ship WORLDWIDE, but please contact us for an accurate international shipping quote before bidding or buying, as cost varies by buyer location. International orders will be declared as “merchandise,” and the value of merchandise will be declared as the amount paid. We cannot declare anything as a gift or for a lesser value. No exceptions! The customer is responsible for all taxes and duty, which may be collected upon delivery, as well as any additional charges involved with import. We have all necessary CITES paperwork in-hand to ship rosewood worldwide.We do our best to describe all items with honesty and accuracy, but to be sure, please contact us with any questions or concerns prior to bidding or buying. We require payment within 48 hours of auction end. In the unlikely event of a return, buyer pays all shipping costs. Your positive feedback and five star ratings are very important to us, and we appreciate your communication in resolving any issues!", "ItemID": "153279597196", "EndTime": "2018-12-28T10:01:07.000Z", "StartTime": "2018-11-27T10:10:37.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1979-Gibson-Les-Paul-Standard-Vintage-Electric-Guitar-Cherry-Sunburst-w-Case-/153279597196", "ListingType": "FixedPriceItem", "Location": "Seattle, Washington", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1532795971968080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTE5NFgxNjAw/z/guIAAOSwUqVb~RU0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjIx/z/XN8AAOSwi7Vb~RU5/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjM5/z/CgcAAOSwF5hb~RVH/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjE0/z/WTkAAOSwZ3pb~RU-/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE5MFgxNjAw/z/LLwAAOSwUMBb~RVC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/3fQAAOSwvcFb~Rdx/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIxMlgxNjAw/z/yq4AAOSwl7db~RU7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/TUcAAOSwdhdb~RU3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE4MlgxNjAw/z/qo8AAOSwaPNb~RVA/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/iHIAAOSwO8pb~RUy/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/dR0AAOSwvhxb~RVM/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/FFEAAOSws2Rb~RVJ/$_57.JPG?set_id=8800005007"], "PostalCode": "98117", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mmguitarbar", "FeedbackRatingStar": "Red", "FeedbackScore": 2591, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 2999.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2999.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "c***w", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 154}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "1979 Gibson Les Paul Standard Vintage Electric Guitar Cherry Sunburst w/ Case", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model", "Value": ["Les Paul Standard"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Cherry Sunburst"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["1979"]}, {"Name": "Body Material", "Value": ["Maple, Mahogany"]}]}, "HitCount": 814, "PrimaryCategoryIDPath": "619:3858:33034", "SecondaryCategoryID": "118985", "SecondaryCategoryName": "Musical Instruments & Gear:Vintage Musical Instruments:Vintage Guitars & Basses:Electric Guitars", "SecondaryCategoryIDPath": "619:181162:181163:118985", "Storefront": {"StoreURL": "https://stores.ebay.com/id=269063702", "StoreName": "Mike and Mikes Guitar Bar"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}