{"BestOfferEnabled": false, "Description": "Up for sale, a 1996 Rickenbacker 370/12 WB in near mint condition and in perfect working order. Boasting the original gloss nitro lacquer Fireglo finish, this 370 is an exceptionally well kept example of a discontinued model, with the rare \"WB\" suffix that denotes the cream binding on the top and back of the body. And unlike all of Rickenbacker's other iterations of the 370, this version has the early '60s \"OS\" (Old Style) body shape.The tone is crystal clear, and sparkles with top end sweetness and chime that is quintessential Rickenbacker. The hollow maple body with set neck construction gives the 370/12 WB a sustain, immediate attack, and richness found with few 12 string designs, and it's no wonder that notable players of the British Invasion and folk boom of the 1960's gravitated towards Rickenbackers for their top notch construction and tone. Equipped with Rick-O-Sound stereo 1/4\" jacks, this 370/12 features a trio of original Hi Gain Rickenbacker single coils, with the middle pickup linked to the neck when switching between positions for some unique and very full sounding 12 string tones only heard on a three pickup Rickenbacker. While the \"Hi Gain\" moniker is a bit misleading, these medium output pickups are bright and sweet sounding without being too compressed or midrange forward. Weighing 8lbs 10oz, this guitar has been professionally setup here at Mike & Mike's Guitar Bar with low action and solid intonation.The neck has a full and substantial C profile that borders on the chunky side of things and feels very solid, filling the palm comfortably and fretting easily. The guitar also has one of the thickest slab rosewood fretboards we've ever seen on a Rickenbacker, and the thickness of the fretboard alone accounts for roughly 1/3rd of the entire neck profile depth. The 1 5/8\" nut width allows for ideal string spacing, and the original frets are virtually unplayed, with perfectly rounded crowns. The lacquered rosewood fretboard boasts pearl triangle inlay and cream binding to match the body. On the headstock, the stock chrome Schaller tuning machines work as they should and hold pitch well, with near perfect chrome plating. Both truss rods are responsive and the original \"Rickenbacker\" truss rod cover/logo is present.All of the electronics work as they should, and everything is exactly how it was when the guitar left the Rickenbacker factory with untouched solder joints and CTS pots. The chrome \"R\" tailpiece and six saddle bridge with original cover is intact and the chrome plating is clean as can be, shining like new. The stock knobs also have minty chrome caps and the pickup covers are practically perfect. The \"I9\" prefix serial number on the jack plate conclusively dates the manufacture of this guitar to September of 1996. Cosmetically, this is a remarkably clean guitar and a particularly nice example of a model that has defined the Rickenbacker sound. This guitar has clearly spent most of its life in the case, with a completely unfaded gloss Fireglo finish which highlights light curly flame figuring in the maple on the back and tighter flame on the face of the instrument between the bridge and tailpiece. We'll conservatively call the guitar \"near mint,\" yet it's a showroom clean example and we can't find a scratch on it.The original vintage-style silver tolex Rickenbacker hardshell case is included. Check out our shop \"Mike & Mike's Guitar Bar,\" and please let us know if we can answer any questions!Shipping in the continental USA will be $80, fully insured and shipped via FedEx Ground. Expedited shipping available for an additional fee at buyer's request. We will happily ship WORLDWIDE, but please contact us for an accurate international shipping quote before bidding or buying, as cost varies by buyer location. International orders will be declared as “merchandise,” and the value of merchandise will be declared as the amount paid. We cannot declare anything as a gift or for a lesser value. No exceptions! The customer is responsible for all taxes and duty, which may be collected upon delivery, as well as any additional charges involved with import. We have all necessary CITES paperwork in-hand to ship rosewood worldwide.We do our best to describe all items with honesty and accuracy, but to be sure, please contact us with any questions or concerns prior to bidding or buying. We require payment within 48 hours of auction end. In the unlikely event of a return, buyer pays all shipping costs. Your positive feedback and five star ratings are very important to us, and we appreciate your communication in resolving any issues!", "ItemID": "153314123747", "EndTime": "2019-01-22T01:10:36.000Z", "StartTime": "2018-12-23T01:42:00.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1996-Rickenbacker-370-12-WB-Fireglo-12-String-Electric-Guitar-Near-Mint-w-ohc-/153314123747", "ListingType": "FixedPriceItem", "Location": "Seattle, Washington", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1533141237478080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/HxcAAOSwPXFcHuCT/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/jYwAAOSwpwBcHuCe/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/MYoAAOSwdzhcHuCg/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/7bIAAOSwVAtcHuCi/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/tksAAOSwOVlcHuCa/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/IDYAAOSwyUFcHuCo/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/4t8AAOSwRbpcHuCV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Vf8AAOSwwqVcHuC8/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/dYEAAOSwl7dcHuCX/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/X3YAAOSwzqtcHuCn/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/sW4AAOSwW~JcHuCk/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MFgxNjAw/z/GWQAAOSw2fRcHuCc/$_57.JPG?set_id=8800005007"], "PostalCode": "98117", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mmguitarbar", "FeedbackRatingStar": "Red", "FeedbackScore": 2591, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 2849.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2849.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "o***d", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 84}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "1996 Rickenbacker 370/12 WB Fireglo 12 String Electric Guitar Near Mint w/ohc", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Rickenbacker"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Type", "Value": ["Semi-Hollow"]}, {"Name": "Body Color", "Value": ["Fireglo"]}, {"Name": "Model", "Value": ["370/12 WB"]}, {"Name": "String Configuration", "Value": ["12 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["1996"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Body Material", "Value": ["Maple"]}]}, "HitCount": 334, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=269063702", "StoreName": "Mike and Mikes Guitar Bar"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}