{"BestOfferEnabled": false, "Description": "2006 Gibson Les Paul Studio Electric Guitar Hardshell Guitar Case. As you can see, this Gibson has been played hard these past 13 years. It is missing a tuner, a tremendous amount of play wear on both sides of the body and throughout... This guitar has been unplayed for a while, hanging on wall my wall for a couple of years now. The neck below the headstock has been glued and screwed. (photos) Our photos are a very large part of our description since they can describe listing better than I ever could using words. Please take a minute to review each carefully for specific details you may be looking for. If you don't see it, it’s not included. Sooo, If you need additional photos, just send a message or call and we try to accommodate as quickly as possible. Please know what your are buying before you bid, this item is a project or for someone who knows how to refinish or make money parting it out. Because of its condition, this item is offered \"as is\" and all sales are final. Okay... I'd like to let you know upfront I wish I could tell you more specifics about this guitar however, I am not a guitar player, guitar reseller or musician moreover, please be aware that I am not the original owner of the guitar so I don't know the history of parts and such other than its been in my office for a couple years. I take many detailed photos so you can make the fairest evaluation of the item's physical condition using your own skilled observation; independent of ours yet subjective, opinion. Make sure to zoom in due to some reflections can be misleading.Ebay only allows 12 photos... You will receive item exactly as shown in the pictures. Please understand, this listing only contains what is described. Don’t assume it comes with something if not stated in the listing description. If you aren’t certain, send us a note thru eBay messaging system. ( stand not included )If an identifying mark, inclusion or defect is visible in the images it is considered disclosed to the buyer.Pay attention to the details, Ebay’s defaulted detail catalog is not always correct. correct. Many times Ebay product catalog does not have the correct photo of the item we have for sale may look different. In addition, I have found many of Ebay defaulted catalogues have certain models, MPN, and other specs wrong from previous listers. Double check to see if it is accurate. Most times the buyer knows more than we do. Please ask if there is something specific you need to know. Purchase of the item represents an agreement on the terms and conditions of this listing. As-is, all sales are final. Once you make the purchase, it cannot be cancelled. Ebay will respond to the unpaid purchase and if it remains unpaid will result in a non-payer strike which can result in a loss of your eBay privileges. Uptown Pawn dba. UptownSalesUSA, a brick and mortar pawnshop located in the heart of the Twin Cities metro area. We are licensed and bonded by the city of Minneapolis and registered with Minnesota Secretary of State since 2002. Check out our feedback and buy with confidence.You can find contact information at the bottom of our Ebay Payment Policy tab in listing. If you have any questions or need to discuss more descriptions, special shipping arrangements, additional photos, or local pick up. 612 823-3001Uptown Pawn dba. UptownSalesUSA makes no express or implied warranties or representations regarding the condition or suitability of the goods and to the extent allowed by law, specifically disclaims any express or implied warranties, including but not limited to any warranty of merchantability or fitness for purpose.We do not offer a warranty on any merchandise: Ebay has a Square Trade program may work. We are not a distributor for any brand. Warranties on the items that I sell may or may not be valid on a non-retail purchase. Indemnity: Buyer shall, at no expense to the Seller, indemnify, defend and hold the Seller harmless against any and all losses, damages and expense (including punitive damages, multiple damages, attorney fees and other costs of defending any action) Seller may incur as a result of any claim made against the seller by any person, including without limitation, Buyer, it's successors, assigns, representatives, agents, employees, insurers, and customers, actually or allegedly arising out of the regarding the transportation, installation or use of the equipment sold hereunder by Seller or out of any products manufactured or sold by Buyer, including, without limitation, any claim which in whole or in part actually or allegedly arises out of (a) Seller's negligent or other wrongful act or omission, (b) danger or default in any equipment sold by Seller to Buyer, (c) infringement by Seller of any patent, copyright, or trade secret relating to any equipment sold by Seller to Buyer.", "ItemID": "173791632109", "EndTime": "2019-02-20T05:08:42.000Z", "StartTime": "2019-02-13T03:36:44.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2006-Gibson-Les-Paul-Studio-Electric-Guitar-Hardshell-Case-Needs-Love-/173791632109", "ListingType": "FixedPriceItem", "Location": "Minneapolis, Minnesota", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1737916321098080_4.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/6NMAAOSwPtBcY4iE/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/2jgAAOSwrhNcY4j4/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIzMFgxNTg2/z/PVwAAOSwPF9cY4jb/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTUzNFg5Njc=/z/PtcAAOSwroJcar1x/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/uLsAAOSwDK9cY4f2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/93gAAOSwElhcY4gA/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/f10AAOSwL~5cY4gb/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/uIsAAOSwgX9cbITv/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/ZUEAAOSwJrdcY4lz/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/dQsAAOSwA~5cY4lR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/X38AAOSwBBRcY4gI/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/Y5UAAOSwJrdcY4gX/$_57.JPG?set_id=8800005007"], "PostalCode": "55408", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "uptownsalesusa", "FeedbackRatingStar": "Red", "FeedbackScore": 3062, "PositiveFeedbackPercent": 99.6}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 340.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 340.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "y***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 55}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2006 Gibson Les Paul Studio Electric Guitar  with Hardshell Case (Needs Love)", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Brown"]}, {"Name": "Product Line", "Value": ["Gibson Les Paul"]}, {"Name": "Model", "Value": ["Les Paul Studio"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Model Year", "Value": ["2006"]}, {"Name": "With Bag", "Value": ["No"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Soundboard Style", "Value": ["Flat Top"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Body Material", "Value": ["Maple", "Ash", "Mahogany"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["LPSANSCH1"]}]}, "HitCount": 2381, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1105760823", "StoreName": "Uptown Pawnstars"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "ProductID": {"Value": "78627826", "Type": "Reference"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "ConditionDescription": "Well used however, needs repair and more... missing one of the Gibson tuners and will need some love to get in playing condition.There was a break headstock that someone tried to repair. It has been glued and screwed. We take lots of detailed photos so you can make the fairest evaluation of the item's physical condition using your own skilled observation.Selling the Gibson Les Paul as described.", "QuantitySoldByPickupInStore": 0, "SKU": "68207-1 MAS OX ( relist - Unpaid Exx )", "NewBestOffer": false}