{"BestOfferEnabled": true, "Description": "This guitar is an awesome playing guitar! It is less than 6 months old and includes the hardshell case! Only minor pick scratches..otherwise perfect condition! This Les Paul Will Exceed Your Expectations The Epiphone Les Paul Tribute Plus solidbody electric guitar honors the years Les Paul spent with Epiphone in the late '30s and early '40s. The LP Tribute Plus takes the classic design of the Les Paul into the modern era with premium components not normally found on a guitar this affordable. The traditional mahogany body is capped with a carved hard maple top for exceptional note definition and clarity. And for classic Epiphone playability, the mahogany neck sports the 1960s SlimTaper D-profile, regarded as the just-right feel by many players. Factor in two Gibson USA '57 Classic humbucking pickups, and you have an incredible performer at an amazing price with the Epiphone Les Paul Tribute Plus solidbody electric guitar.Exceptional craftsmanship at a great price Epiphone takes affordable quality to the next level with the Les Paul Tribute Plus. The solid mahogany body is pure Les Paul tradition, but the carved hard maple top is a feature normally found on more expensive models - and the combination creates tones with warmth, depth, clarity, and definition. Another fine touch is the hand-fitted neck joint that extends to the neck pickup cavity for maximum transfer of string energy - we're talking sustain for days with a fast and lively response to your playing.Premium components As you can already tell from the choice tonewoods used, the Epiphone Les Paul Tribute Plus packs premium components for a value-packed experience. On top of the quality wood and craftsmanship, the LP Tribute Plus packs two Gibson USA '57 Classic humbuckers - you read that right, Gibson USA pickups on an Epiphone! The '57 Classics are known for their wide tonal range and hot output, letting you go from smooth and clean to growling and mean. Plug into your favorite tube amplifier and get ready to conjure the essential tones for almost any musical style.Push/pull tone controls While the Epiphone Les Paul Tribute Plus packs the looks and feel of a classic Les Paul, the modern electronics give you more tonal options than you'd expect. The '57 Classic humbuckers use 4-conductor pickup wiring, giving you access to series/parallel pickup switching with the push/pull tone pots. This additional tone-shaping capability makes the Les Paul Tribute Plus an incredibly versatile performer.Epiphone Les Paul Tribute Plus Solidbody Electric Guitar Features: Classic Les Paul feel, versatile tone, and incredible craftsmanship at a value-packed price Mahogany body with a carved hard maple top for rich tone with clarity and definition Gibson USA '57 Classic humbucking pickups - normally found on much more expensive guitars Push/pull tone pots let you switch between series/parallel pickup configurations for extra tonal options Grover locking tuners for dependable tuning stability", "ItemID": "292891261448", "EndTime": "2018-12-26T21:17:31.000Z", "StartTime": "2018-12-26T21:07:47.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Epiphone-Les-Paul-Tribute-Plus-Vintage-Sunburst-/292891261448", "ListingType": "FixedPriceItem", "Location": "Fort Wayne, Indiana", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2928912614488080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/y9IAAOSwhyZbsRJi/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/0v0AAOSwQIFbsRJ9/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/KsoAAOSwSDxbsRKA/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/njUAAOSw0BtbsRJ-/$_32.JPG?set_id=880000500F"], "PostalCode": "46825", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "fir6758_rwbkinxdrh", "FeedbackRatingStar": "Yellow", "FeedbackScore": 48, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 450.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 450.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "p***l", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1525}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Epiphone Les Paul Tribute Plus - Vintage Sunburst", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "Model", "Value": ["Plus"]}]}, "HitCount": 2, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}