{"BestOfferEnabled": true, "Description": "Store About Policies Contact Store About Shipping Financing Support Contact Store Categories Pro Audio Accessories Acoustic Guitars Electric Guitars Guitar Effects Amplifiers Basses Drums Cymbals Hardware/ Racks Percussion Drum Cases Drumsticks CD/ DVD Other McInturff 2001 Taurus Cherry Burst Electric #10007 - Used Number 7 of the first 20 Taurus' built What We Think Condition: Used, Good This is a players guitar and has buckle rash, dings, and scratches across the top. Photos are included to give a general idea of the playwear, but the love this guitar has had doesn't stop it from being incredible!! If you are looking for the perfect combination of playability, tone, and power this is the one for you! McInturff has never failed to impress us with his outstanding work, and it is a real treat to be able to play one of these early Taurus. Manufacturers Description I built my first guitar in late 1977 and have been a full-time luthier ever since. It has been a fascinating journey, involving many tens of thousands of instruments of all kinds and vintages in addition to the 3600 or so McInturff guitars I&rsquo;ve made to this point. It has been a lifetime's career devoted to the guitarist's world. The first phase of my career relied upon guitar repairs/restorations to pay the bills, and I cannot imagine pursuing my building without having had that incredible education in my background. I have been hands-on with countless vintage guitars as well as with their modern counterparts. If it weren&rsquo;t for this background, I'd likely be &ldquo;building by numbers&rdquo;... Copying the traditional designs without knowing exactly why the very best guitars sound the way that they do. I remain an active performing guitarist, and my lifelong hobby of audio engineering continues to inform my work as well. Here we have two additional sets of experiences that I cannot imagine doing without; the former has given me the opportunity to learn what the real world of the working guitarist is all about... The &ldquo;combat conditions&rdquo; of stage and touring, whilst the latter has enabled me to study in detail the pivotal subject of sound. It is all about sound, this passion of ours. Along the way I've been lucky enough to have been awarded consecutive &ldquo;Editor's Pick Awards&rdquo; by the good folks at Guitar Player Magazine; my work has been featured in many magazines, receiving excellent reviews; I've been the subject of various interviews on TV, radio, and internet publications; and of course I have had the opportunity to work with the finest woods in the world. I have also been gifted with the opportunity to build guitars for artists such as Eric Clapton, Chuck Garvey, Jimmy Page, Seth Yacovone, Brad Whitford, David Hidalgo, BradDelsen, Chris Stamey, and many other fine players. But the greatest reward that my career has brought me is the thousands of friends that I have made from all over the world. As you can imagine, I've had quite a few clients and I can say in all honesty that I have never had a bad client. Guitarists are uniformly interesting people and getting to know so many of them has been a true gift. I am very grateful indeed. Specifications Weight: 8.6 Lbs Model: Taurus Top Wood: 5A Flame Maple Body Wood: Mahogany Neck Wood: Mahogany Fingerboard: East Indian Rosewood Neck Pickup: DiMarzio TCM Zodiac Humbucker Bridge Pickup: TCM TOL Humbucker Tail Piece: Tone Pros Lightweight Stop Bridge: Tune-o-matic Switching: 5-way Tuners: Sperzel Locking Hardshell Case FAST SHIPPING Packed by specialists in high-dollar and fragile shipments Packages are always shipped fully insured (signature required on items above $100) Fast Shipping, free to the lower 48 states on most items (see individual item for details) Questions about shipping? Contact Us \"experience the difference\" LIFETIME SUPPORT from specialized experts in the fields of recording, electric & bass guitars, acoustic instruments, and percussion is just a phone call away Most brand new items include Sound Pure's industry-leading 3-YEAR WARRANTY, in addition to the manufacturer's standard warranty Sound Pure's testing facility is our very own GRAMMY-NOMINATED recording studio We've been IN BUSINESS MORE THAN 15 YEARS, and an eBay seller since 1998! © Sound Pure LLC 2017", "ItemID": "202546865827", "EndTime": "2019-01-21T22:00:52.000Z", "StartTime": "2018-12-24T17:00:42.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/McInturff-2001-Taurus-Cherry-Burst-Electric-10007-Used-/202546865827", "ListingType": "FixedPriceItem", "Location": "Durham, North Carolina", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2025468658278080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMDQ0/z/ruQAAOSw0wJcIRCf/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTgzWDE2MDA=/z/ZIUAAOSw9g1cIRCh/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTQ4WDE2MDA=/z/1F0AAOSw4sNcIRCj/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5OTk=/z/tRoAAOSwb15cIRCl/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTE4WDE2MDA=/z/NIYAAOSwcapcIRCo/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTM2OFgxNjAw/z/m4UAAOSwp3dcIRCr/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1MlgxNjAw/z/3A0AAOSw-QBcIRCt/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTE5WDE2MDA=/z/QhsAAOSwAQVcIRCu/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA0NFgxNjAw/z/lv0AAOSwC9hcIRCx/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjcwWDE2MDA=/z/tBEAAOSw~2VcIRCz/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjA1/z/AfgAAOSwVP5cIRC1/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwNVgxNjAw/z/gk8AAOSwaPNcIRC3/$_12.JPG?set_id=880000500F"], "PostalCode": "27701", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "soundpure", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 18716, "PositiveFeedbackPercent": 98.8}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 2500.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2500.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***g", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 239}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "McInturff 2001 Taurus Cherry Burst Electric #10007 - Used", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Terry C. McInturff Guitars"]}, {"Name": "Model", "Value": ["Taurus"]}, {"Name": "MPN", "Value": ["Taurus"]}]}, "HitCount": 98, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=2494373", "StoreName": "SoundPure"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["ID", "NG"], "GlobalShipping": false, "ConditionDescription": "Used", "QuantitySoldByPickupInStore": 0, "SKU": "21970", "NewBestOffer": false}