{"BestOfferEnabled": false, "Description": "This is a great guitar for someone looking for their first Gibson.Only noticeable issue is the slight discoloration caused when the nitrocellulose finish comes in contact with the foam padding on some guitar stands.This was common on both the regular white finishes as well as the satin white finishes found on the Melody Maker.From the manufacturer:Melody Maker SGSince 1959 the Melody Maker series has brought full and uncompromised Gibson quality and tone to top-grade electric guitars priced for the student, novice, or the pro on a budget. Staying true to this agenda, Gibson USA introduces the Melody Maker SG, one of four great models in an all-new Melody Maker line up. Like their predecessors, these Melody Makers launched in the second decade of the 21st century possess everything you need to rock, with none of the superfluous extras that get in the way. All are crafted from select tonewoods, carry a genuine Gibson USA humbucking pickup, and are built with traditional high-quality features such as a set-in neck, 24 3/4\" scale length and 1 11/16\" width at the nut. In short, nothing is spared in the effort to make these genuine Gibson guitars, but they come in a format that saves you a bundle. This great looking model is crafted in the image of a classic Gibson SG with a gorgeous nitrocellulose finish. In short, nothing is spared in the effort to make these genuine Gibson guitars, but they come in a format that saves you a bundle. Maple has a long history in electric guitar making, and is one of the strongest tonewoods used in luthiery. A body crafted from solid maple gives the Melody Maker SG outstanding clarity and sustain, and helps it retain sharp note definition even through a heavily cranked amp. The guitar's glued-in neck is crafted from solid quarter-sawn mahogany for superior strength and resonance, and carved to a superbly fast yet comfortable \"Melody Maker profile\" that measures .835\" at the 1st fret and .930\" at the 12th. In a contemporary departure from the norm, this neck carries a fingerboard made from baked maple, a heat-treated form of maple that has the rich brown look of rosewood but is superior in strength and durability, and totally sustainable besides. Rendered in the shape of the original SG of the 1960s, a rock icon in itself, the Melody Maker SG has killer looks, tone, and playability. To give this guitar a punch equal to its heritage, Gibson USA loads the Melody Maker SG with one of its most versatile pickups. The single 491T humbucker in the bridge position is crafted in the image of Gibson's acclaimed PAF (\"Patent Applied For\") humbucker of the late '50s, but updated with a ceramic magnet for great power, clarity and sustain, and routed through a single volume control to keep it all simple. Go easy and it purrs sweetly; hit it hard, and there's as much crunch, wail and sustain on tap as any rocker will ever need. Anchored by a timeless and tuneful stud-mounted wraparound bridge at the body end and a set of efficient enclosed tuners at the headstock, with a PLEK-cut Corian nut for enhanced sustain and ultimate intonation precision, it's an incredible package for the player who wants a slice of full-bore Gibson USA quality at a stripped-down price. Listing includes guitar and gig bag. No other accessories are included with this sale. See photos for cosmetic condition.", "ItemID": "264051988504", "EndTime": "2018-12-18T15:16:38.000Z", "StartTime": "2018-11-20T22:11:03.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-Melody-Maker-SG-White-2011-w-Original-Bag-/264051988504", "ListingType": "FixedPriceItem", "Location": "Madison, Wisconsin", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2640519885048080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg2MTA=/z/beMAAOSwzSdbtnt4/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/7N8AAOSwC0dbtnt6/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/h5IAAOSwqFBbtnt9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg1OTE=/z/7MsAAOSwvApbtnt-/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQyNVgxNjAw/z/ObwAAOSwt6NbtnuD/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNDM3/z/b3MAAOSwAN1btnuF/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjQ4WDYyNg==/z/QF4AAOSw2tNbtnta/$_57.JPG?set_id=8800005007"], "PostalCode": "53704", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "ggandelvis", "FeedbackRatingStar": "Red", "FeedbackScore": 1824, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 450.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 450.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "r***k", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 259}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson Melody Maker SG White 2011 w/ Original Bag", "ItemSpecifics": {"NameValueList": [{"Name": "Product Line", "Value": ["Gibson SG"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model", "Value": ["Melody Maker"]}, {"Name": "Model Year", "Value": ["2011"]}]}, "HitCount": 658, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Used,Fully tested and functionalSee photos for cosmetic condition", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}