{"BestOfferEnabled": false, "Description": "Beautiful 2012 Fender MIM Standard Telecaster 3 Tone Sunburst, Maple Neck, +Upgrades, +Extras, Gig Bag I accept PayPal ONLY for payment, and will sell/ship only to PayPal verified addresses in the lower 48 US States only. The $40.00 shipping for this auction will cover Ground Shipping via United Parcel Service (UPS) to the lower 48 US States only. This listing is for an absolutely beautiful 2012 Fender Standard Telecaster in 3 Tone Sunburst . Upgrades: Fender locking tuners. These are super nice and rock solid. I've never been a locking tuner user, but these have made me a believer. Chrome covered Fender humbucker in neck position. Vintage powered with 8.0KOhm DC resistance. Double black bobbins and a shiny silver magnet, so I suspect it is an alnico V magnet. At any rate, it has a great, full, rich tone. Extras: Original Fender pickguard with the original Fender MIM Chrome covered single coil pickup. Sounds great, but I already had a Tele with the normal single / single pickup set, and wanted to Keef-ify this one, hence the humbucker. But the original is here, if you want to re-convert. The included gig bag is a nice, well-padded Godin electric guitar gig bag with two shoulder straps that I've used for this guitar almost since I got it. (The original Fender gig bag bought with the guitar began ripping apart at the zipper and canvas covering seams within months of getting it. I had this nice Godin gig bag and it has worked like a champ with this Tele.). The insides of the gig bag have reinforced canvas patches to protect the insides of the case from the headstock tuners from harming either side of the inside up there, and the inside top of the body area also has a reinforced canvas patch to protect it from the bridge area. There is an added pad at the bottom, inside of the bag that, when inserting the guitar, will protect the bottom zipper area from being damaged by the guitar strap button down there. Definitely a nice gig bag and very clean. I cleaned this bag thoroughly, inside and out before packing it and the guitar. This is a used guitar, it's a 2012, but you will have to look close and diligently for the slightest signs of use. There is no fret wear, and I have polished the frets in preparation for sale. A pro checked and spot leveled the frets and touched up ALL the fret ends with a fret end file, so there's no high / low frets or sharp fret ends. This guitar and frets are ready for you to BEGIN to make YOUR marks on it. There is no dramatic figuring or grain patterns on the body of the guitar, but the front IS pretty with the barest hints of where flame and birds eyes wanted to start forming. The back of the body has some nice mineral/tree ring patterning on it. The maple neck of this guitar doesn't have any flame, but the lines from the tree rings are really pretty and form nice patterns up and down the neck. The nut isn't a TUSQ, but is a man-made graphite, self-lubricating type. It is well formed, and if you know how to check nut slot depth by pressing the strings at the second fret, and checking the string clearance over the first fret, you'll see this nuts slots are about as perfect as can be done. The last thing I did before photographing it, was to put a new set of 9-42 Slinkys on it. These guitars come from Fender with 9-42 size string set, and that is what I used on it. So, unless you use a heavier string set, it will be ready for tuning and playing as soon as you get it. After the photos, I padded, packed, and boxed this guitar, gig bag, and pickguard/pickup for shipment. I will send it either the day you buy, or the next day, depending on when I see it is bought by someone. Again, this guitar is used, but easily 9.5 out of 10. The only marks on the pick guard, neck or body can only be seen with light at the correct angle. A Note of Caution: ALWAYS BE PREPARED TO HAVE A USED EBAY GUITAR SET UP FOR YOU, OR BE PREPARED TO SET IT UP YOURSELF, AFTER IT ARRIVES. You CANNOT assume this guitar playing perfectly for me in Florida will require no more setting up for the climate it will be in with you. I live in Florida, and this guitar has spent its life in Florida so far. Though this guitar is set up perfectly for me, climate conditions where you live, in the dry west, or in the wet northeast with your guitars in a very dry winter heated home, will make the guitar's set up be a bit different for you. A couple of weeks after the guitar gets to you, you very well might need to re-set the action and adjust the truss rod for the guitar to have the action and playability you prefer in the climate in which you live. Take a close look at the photos above and below, and then please ask any questions through the \"Ask Seller a Question Link\" BEFORE bidding. I accept PayPal ONLY for payment, and will sell/ship only to PayPal verified addresses in the lower 48 US States only. The $40.00 shipping for this auction will cover Ground Shipping via United Parcel Service (UPS) to the lower 48 US States only. Please understand that I am not an eBay business after maximum profits. (God bless those who dare to do so though) I list on eBay personal items I have decided to sell and I'm not in a big hurry to sell. I am not out to make money here, just get a fair, current price for things I would like to sell, even if it's at a loss for me. Just know that I take care of my stuff, and I know what the items I sell are worth. I work hard to fully and accurately describe the items I sell in detail and post lots of high quality photos so you can KNOW exactly what you are buying.", "ItemID": "183692490908", "EndTime": "2019-02-20T17:04:37.000Z", "StartTime": "2019-02-19T02:17:28.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2012-Fender-MIM-Standard-Telecaster-3-TS-Maple-Neck-Upgrades-Extas-Gig-Bag-/183692490908", "ListingType": "FixedPriceItem", "Location": "Palm Bay, Florida", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1836924909088080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMDY4/z/fUIAAOSwOylcaxna/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDY4/z/IywAAOSwUTZcaxng/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDY4/z/8uMAAOSwtM9caxnm/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDY4/z/6iUAAOSwGEJcaxnr/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2OFgxNjAw/z/VA0AAOSw~gZcaxn3/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2OFgxNjAw/z/p7oAAOSwd9dcaxn-/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2OFgxNjAw/z/B5IAAOSwBG9caxoF/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2OFgxNjAw/z/4XUAAOSw5k1caxoL/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2OFgxNjAw/z/onoAAOSw1xZcaxoQ/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2OFgxNjAw/z/elYAAOSwIz5caxoV/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2OFgxNjAw/z/At8AAOSwC8Zcaxoa/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2OFgxNjAw/z/BTwAAOSw8KRcaxof/$_32.JPG?set_id=880000500F"], "PostalCode": "32907", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "rccolamoonpie", "FeedbackRatingStar": "Purple", "FeedbackScore": 749, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 415.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 415.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***d", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 219}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2012 Fender MIM Standard Telecaster 3 TS, Maple Neck, +Upgrades, +Extas, Gig Bag", "ItemSpecifics": {"NameValueList": [{"Name": "Body Material", "Value": ["Alder"]}, {"Name": "Brand", "Value": ["Fender"]}, {"Name": "Model Year", "Value": ["2012"]}, {"Name": "Model", "Value": ["Telecaster Standard"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["3 Tone Sunburst"]}, {"Name": "Size", "Value": ["Standard"]}]}, "HitCount": 148, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "Oceania", "Southeast Asia", "South America", "BM", "GL", "MX", "PM"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}