{"BestOfferEnabled": false, "Description": "All photos are of the actual item for sale. Mint Condition This guitar was well maintained and no visible wear can be found. Serial Number: I171013588. Instrument weighs 7.14 pounds. Please see the photos above; they are of the actual item for sale. Ibanez RGD Iron Label RGDIX6PB Solidbody Electric Guitar + OHSC Pure Metal If you play down-tuned metal on a 6-string, Ibanez has designed a guitar just for you. With its 26.5\" scale length, he RGD Iron Label RGDIX6PB is optimized for the heaviest music styles, executing every note with precision and power. The fast Nitro Wizard neck, topped with a luxurious Ebony fingerboard, plays beautifully, while the instrument's deep cutaways give you unrestricted access to the upper registers. And the RGDIX6PB's DiMarzio Fusion Edge pickups deliver powerful scooped tone with tight, compressed bass response and crisp high-end bite. The Ibanez RGD Iron Label RGDIX6PB is a progressive metal player's dream come true. Nitro Wizard neck and Ebony fingerboard The 3-piece Maple/Bubinga neck on the RGDIX6PB features Ibanez's Nitro Wizard neck profile, which gives you effortless access to this guitar's entire range. And for the ultimate in playability, the neck is capped with a luxurious Ebony fingerboard, providing you with unbelievably smooth fretting. Tech Specs: Body Type: Solidbody Body Shape: RG Left-/Right-handed: Right-handed Number of Strings: 6 Body Material: Ash/Mahogany Top Material: Poplar Burl Body Finish: Satin Urethane Color: Surreal Black Burst Neck Material: 3-piece Maple/Bubinga Neck Shape: Nitro Wizard Radius: 15.7\" Fingerboard Material: Ebony Number of Frets: 24, Jumbo Scale Length: 26.5\" Nut Width: 1.692\" Nut Material: Plastic Bridge/Tailpiece: Gibraltar Standard II Tuners: Gotoh MG-T locking machine heads Neck Pickup: DiMarzio Fusion Edge Humbucker Bridge Pickup: DiMarzio Fusion Edge Humbucker Controls: 1 x volume, 3-way toggle pickup switch Manufacturer Part Number: RGDIX6PBSKB INCLUDES Gator Case (Gator ABS Molded) with KeysAllen WrenchesDocumentation Check out my other auction listings! and be sure to add me to your favorites list. CONTACT INFORMATION You can e-mail us with any questions you may have about an item. We are very easy to reach, and we are glad to help. Just click \"Ask a question\" in the questions and answers area below. Please note that we are not in the office after 5:00PM EST on weekdays, or all day Saturdays and Sundays. Questions asked over the weekend will be answered on the following business day. SHIPPING INFORMATION Items are shipped within one business day of payment. To avoid a lost or stolen item, your package may ship \"Signature Required.\" If you have special shipping instructions or would like your item shipped UPS instead of USPS or FedEx, please contact us before you make a purchase. We collect local sales tax here in Indiana. This applies to Indiana residents who we ship to, as well as non-Indiana residents who drive here for local pickups. We also collect sales tax in other states around the country. Please check eBay's tax information on the \"Shipping and payments\" tab above to see if we are collecting tax in your area. PLEASE NOTE Shipping quotes are estimates only. We use eBay’s shipping calculator, which provides estimated shipping charges on listings where “Free Shipping” is not offered. Ebay's FedEx calculator on the item page quotes eBay's discounted FedEx shipping rates, which we honor. At checkout, however, buyers in certain areas will see the calculator attempt to charge the full retail price. FedEx's full retail price is the price you pay if you were to walk into a FedEx retail location. The difference between eBay's discounted rate and this retail price can be as much as 40%. If you estimate shipping with a zip code that is different from the zip code registered to your User ID, eBay’s shipping calculator will make the adjustment at checkout. Additionally, FedEx charges a surcharge for delivery in certain rural areas of the country that does not, for some reason, show up in eBay’s estimate calculator; but it does at checkout (we wish we could control this, but we can’t — we have contacted eBay many times about this issue). FedEx does this based on the +4 extension of your primary 5-digit zip code. For example, eBay’s shipping calculator may quote you one price based on your primary 5-digit zip, and then figure out that your requested street address at checkout places you within the rural surcharge area, changing the shipping price to an alternate amount that was originally quoted. If there is a discrepancy in your shipping cost, please send us a screen shot of the quoted price to you on our item page and we can override the eBay checkout calculation to get you the cheapest rate. RETURN INFORMATION We want you to be completely happy with your purchase. If the item you receive is not as described or has been damaged in shipping, please contact us immediately. We will make every effort to promptly resolve any problem. Your satisfaction is our top priority. We are happy to offer free shipping on some of the items we offer. Please note that if you decide to return something where free shipping was offered, our shipping costs are non-refundable.", "ItemID": "401665051613", "EndTime": "2018-12-28T01:30:16.000Z", "StartTime": "2018-12-21T01:30:16.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Ibanez-RGD-Iron-Label-RGDIX6PB-Solidbody-Electric-Guitar-OHSC-Black-Burst-/401665051613", "ListingType": "Chinese", "Location": "Fort Wayne, Indiana", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/4016650516138080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTI0N1gxNjAw/z/gMIAAOSwlLlb5x9g/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg1ODY=/z/GAYAAOSwDrpb5x9i/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg2NDY=/z/sQkAAOSwALBb5x9j/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU5OVgxNTE4/z/3QIAAOSwDAdb5x9n/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA3NVgxNjAw/z/DKQAAOSwDDRb5x9p/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjUyWDE2MDA=/z/Gq4AAOSwB19b5x9e/$_57.JPG?set_id=8800005007"], "PostalCode": "46818", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jeffsmusicgear", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 14339, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 5, "ConvertedCurrentPrice": {"Value": 459.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 459.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "o***o", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 319}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "CA", "GB", "DK", "RO", "SK", "BG", "CZ", "FI", "HU", "LV", "LT", "MT", "EE", "AU", "GR", "PT", "CY", "SI", "JP", "CN", "SE", "KR", "ID", "TW", "TH", "BE", "FR", "HK", "IE", "NL", "PL", "ES", "IT", "DE", "AT", "BS", "IL", "MX", "NZ", "SG", "CH", "NO", "SA", "UA", "AE", "QA", "KW", "BH", "HR", "MY", "CL", "CO", "CR", "PA", "TT", "GT", "HN", "JM", "AG", "AW", "BZ", "DM", "GD", "KN", "LC", "MS", "TC", "BB", "BD", "BM", "BN", "BO", "EG", "GF", "GG", "GI", "GP", "IS", "JE", "JO", "KH", "KY", "LI", "LK", "LU", "MC", "MO", "MQ", "MV", "NI", "OM", "PK", "PY", "RE"], "Site": "US", "TimeLeft": "PT0S", "Title": "Ibanez RGD Iron Label RGDIX6PB Solidbody Electric Guitar + OHSC - Black Burst", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Ibanez"]}, {"Name": "MPN", "Value": ["RGDIX6PBSKB"]}, {"Name": "Body Color", "Value": ["Surreal Black Burst"]}, {"Name": "Model", "Value": ["RGD Iron Lable RGDIX6PB"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Material", "Value": ["Mahongany / Ash / Poplar Burl"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["2017"]}]}, "HitCount": 442, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=36123540", "StoreName": "jeffsmusicgear"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 464.99, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "PM", "GL", "LR", "GM", "TG", "BF", "ZW", "KE", "TN", "CF", "NE", "AO", "LS", "GA", "SL", "ZM", "ET", "SZ", "CD", "CI", "ZA", "GW", "NA", "DZ", "SC", "TZ", "UG", "KM", "ML", "CV", "SO", "GN", "BJ", "MZ", "YT", "SH", "ER", "DJ", "CM", "CG", "MA", "MU", "GH", "RW", "EH", "GQ", "BW", "MR", "SN", "MW", "LY", "BI", "TD", "NG", "MG", "IQ", "LB", "TR", "YE", "AF", "BT", "RU", "KZ", "KG", "IN", "TM", "AZ", "GE", "MN", "UZ", "AM", "TJ", "NP", "WS", "TV", "VU", "WF", "NC", "PG", "NU", "AS", "PF", "CK", "MH", "SB", "GU", "NR", "TO", "FM", "FJ", "KI", "PW", "SM", "MK", "MD", "AD", "VA", "AL", "ME", "SJ", "RS", "BY", "BA", "PR", "VC", "AN", "DO", "SV", "VG", "VI", "AI", "HT", "VN", "LA", "PH", "PE", "BR", "FK", "AR", "EC", "GY", "SR", "UY", "VE"], "TopRatedListing": true, "GlobalShipping": true, "ConditionDescription": "Mint Condition. This guitar was well maintained and no visible wear can be found. Serial Number: I171013588. Instrument weighs 7.14 pounds. Please see the photos above; they are of the actual item for sale.", "QuantitySoldByPickupInStore": 0, "SKU": "RGDIX6PBSKBU", "NewBestOffer": false}