{"BestOfferEnabled": true, "Description": "Read below to find out how you can get a FREE GUITAR STAND! Update 2/3/2019: I've decided to lower the asking price to $225. Remember, too, that this DOES NOT include shipping charges. Plus, I've decided to include a FREE GUITAR STAND for the person who buys TODAY at $225 + shipping. How's that for value? You're still welcome to make an offer, but you won't get the guitar stand. Just keep that in mind. The guitar stand will be included ONLY for the buyer who pays $225 + shipping, and buys TODAY. Now, folks, you will surely pay more than that for just the guitar. You'd be fortunate to have a lousy pick included. So let's not mess around. I'm offering an insane deal here. Some facts about the excellent shape of this instrument:Intonation is adjusted for a comfortable and smooth action.Neck is straight, no cracks around the bolt holes or nut. Finish is nearly mint, with only a couple tiny scuffs and no chipped paint at all. I stored it safely inside the gig bag out harm's way when I wasn't playing it. So it's been taken good care of.Wiring and contacts in good order; clean sound with no shortsAside from some minor fine tuner adjustments, all it needs is a new set of strings, and a set of Allen-wrenches (Sorry, I didn't have a set to include, but you can get these cheap). The H-S-H pickup configuration, and the 5-position switch, will enable you to dial up just about any sound you can imagine. Included in this package are:Gig bag - nylon and padded, Line 6 Guitar Port interface (a $50+ value) - it still should work if you have the software. I'm sorry I couldn't locate mineCords - guitar cord and all the other cords you need to hook up the interface if you can use itFloyd Tremolo w/barLocking strapFREE Guitar stand - IF YOU BUY AT $225 + shippingThis guitar was manufactured in Korea. Don't believe any trash talk about products made there. It really is a high-quality guitar that looks, plays, and most importantly, sounds great! They make thousands of guitars exactly the same, and then there's one that turns out to be pretty special...like this one! It truly is a rare find. And they are becoming more rare! Due to high shipping costs for guitars, I am holding this auction primarily for the South Florida region only, to make picking up the guitar as painless as possible. However, if you're willing to pay the shipping charges in addition to the asking price, send me a message through eBay. Maybe we can work something out. Due to events beyond my control, I can't accept returns under any circumstances. Frankly, I wish I could. So please be 100% sure that you want to buy it. The guitar is exactly as I described it here, so you should receive it exactly as it's described. On that note, I am confident that, once you play it, you will be so pleased that you won't want to return it anyway! Asking price is $225.00. Once payment is made, within 24 hours I will make arrangements with you so you can receive your guitar. Thank you for visiting!", "ItemID": "173771519151", "EndTime": "2019-02-04T13:59:07.000Z", "StartTime": "2019-01-31T19:29:08.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Ibanez-S-Series-S-370-Guitar-Excellent-Condition-Great-Value-/173771519151", "ListingType": "FixedPriceItem", "Location": "Pompano Beach, Florida", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1737715191518080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg5MDQ=/z/HPMAAOSworNcReOF/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDQ=/z/s18AAOSw87JcReOI/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDQ=/z/jc0AAOSwqjhcReOK/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDQ=/z/jdIAAOSwqjhcReOM/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDQ=/z/1X4AAOSwzodcReOO/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDQ=/z/drgAAOSwyshcReOR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDQ=/z/t88AAOSwf0hcReOT/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDQ=/z/jqsAAOSwDsZcReOY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDQ=/z/VIUAAOSwleRcReOV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDQ=/z/9w8AAOSw-QxcReOX/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDQ=/z/xVgAAOSwxHlcRePu/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDQ=/z/oa8AAOSw4sNcReQA/$_57.JPG?set_id=8800005007"], "PostalCode": "33063", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "adcopymark", "FeedbackRatingStar": "Yellow", "FeedbackScore": 47, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 225.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 225.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "1***n", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 377}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Ibanez S Series S-370 Guitar - Excellent Condition, Great Value!", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Ibanez"]}, {"Name": "Body Type", "Value": ["Double Cutaway/Strat style"]}, {"Name": "Body Color", "Value": ["Purple"]}]}, "HitCount": 201, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Pre-owned, but in excellent condition", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}