{"BestOfferEnabled": true, "Description": "2012 James Tyler Variax, featuring innovativeVariax HD technology which gives you versatility to create the instrumentyou’ve always wanted, and energizes your playing in exciting new ways. Choosefrom an impressive collection of classic guitar models, each with exceptionaldetail, feel and response. Dial up vintage electrics, rare acoustics, eclecticinstruments and more. And with the turn of a knob, instantly access alternatetunings, including Open G, DADGAD, Drop D, or any other custom tuning. The guitar is used, but very little. The condition is perfect except for a littleblemish on the corner of the headstock. Pictures show the excellent condition the guitar is in, and the 1 picshows the only blemish. The neck is straight, plays great, and every function andfeature works perfectly. I thought I would used the whole dream rig of the DT50and HD500X, etc., but I just didn’t have the time to get it figured out for myhome studio. You can still see the plastic still on the plastic protectivecovering on the back plate on the back of the guitar. Maple neck with rosewood fingerboard & pearloid dotinlays. Chrome locking tuners are in perfect working condition. 15/8\" nut width; 25 1/2\" scale length. Double-cutaway, solid bodyfinished in sunburst. James Tyler tremolo bridge with adjustablesaddles. Master volume & tone controls with knurled knobs; 5-wayselector switch. 12-way rotary knob for various guitar tones.EXTRAS INCLUDED!! Line6 gig bag included along with battery & charger. Also I am throwing in theexpensive data cables used to hook up to a Line 6 HD500X and/or a Line 6 DT50or DT25 amp. Also a brand new stereo cable DESCRIPTION FROM LINE 6 WEBSITE: Record and Perform with Unlimited Tonal Potential The Line 6 JTV-69 James Tyler Variax with Variax HD software gives you the amazing ability to create any guitar tone you need for studio or stage. The JTV-69 James Tyler Variax is also an amazing instrument in the conventional sense, and the ability to select different HD instrument models, HD pickup models, and alternate tunings on the fly sets this guitar apart from all the rest. And with the incredible Workbench HD software, you can fine tune your Variax tone more than ever. Built to the specifications of master luthier James Tyler, the Line 6 JTV-69 James Tyler Variax is your ticket to unlimited tonal excellence. Line 6 JTV-69 James Tyler Variax Solidbody Electric Guitar at a Glance:Variax HD Upgrade and Workbench software give you unlimited tonal potentialIt's like owning dozens of different instruments, plus your own workshopDesigned by a master luthier for top-notch performance and playability Variax HD Upgrade and Workbench software give you unlimited tonal potentialThis Line 6 JTV-69 James Tyler Variax packs the latest Variax HD upgrade, bringing you more stellar models of rare vintage electric guitars, classic acoustic guitars, and exotic instruments. You'll be blown away once you start exploring these with the Workbench HD software, which gives you more tonal control and all-around tweakability than you ever thought possible. Create your own unique instrument model, then use Workbench HD to fine-tune individual string pitch, string volume, pickup position, and much more. You've never tweaked your tone like you can with the JTV-69 James Tyler Variax! It's like owning dozens of different instruments, plus your own workshopRight out of the case, your Line 6 JTV-69 James Tyler Variax comes with dozens of impeccable instrument models. Rare vintage electrics, fabulous acoustics, and even exotic instruments are waiting at your fingertips. The latest Variax HD software brings you more stellar HD instrument and pickup models than ever before, and the real magic happens when you tap into the Workbench HD software. It lets you combine your favorite body styles, pickup models, and components to create your own unique instruments. You're guaranteed to be well-equipped for any studio or stage situation with the Line 6 JTV-69 James Tyler Variax. Designed by a master luthier for top-notch performance and playabilityWith its alder body and maple neck, the Line 6 JTV-69 James Tyler Variax is primed from the start for iconic electric guitar tone. It was designed by master luthier James Tyler, who has created instruments for countless session players and performers. Equipped with pickups custom-designed by James Tyler and wound to his exacting specs, you'll find the JTV-69 James Tyler Variax to be an amazingly playable guitar even before you ever try out the superb modeling technology. Line 6 JTV-69 James Tyler Variax Solidbody Electric Guitar Features:Innovative guitar with onboard instrument models, pickup models, and on-demand alternate tuningsIncluded HD upgrade gives you even more HD instrument and HD pickup models than ever beforeWorkbench HD software lets you fine-tune individual string pitch, volume, pickup position, and moreSolid alder body and maple neck are a classic recipe for fantastic toneGraphTech nut and custom tuners give you top-notch tuning stability and reliabilityCompletely designed by master luthier James Tyler, including custom-wound pickupsIncludes Li-Ion battery, switching power supply, and Workbench USB adapter The Line 6 JTV-69 James Tyler Variax is like a Pandora's box of tone! FEATURESVariax models based on:1960 Fender Telecaster Custom1968 Fender Telecaster1968 Fender Telecaster Thinline1969 Fender Stratocaster1958 Gibson Les Paul Standard1952 Gibson Les Paul \"Goldtop\"1961 Gibson Les Paul Custom (3 PU)1956 Gibson Les Paul Junior1976 Gibson Firebird V1955 Gibson Les Paul Special1969 Gretsch 61201956 Gretsch Silver Jet1968 Rickenbacker 3601966 Rickenbacker 360-121961 Gibson ES-3351967 Epiphone Casino1957 Gibson ES-1751953 Gibson Super 4001969 Martin D-281970 Martin D 12-281967 Martin O-181966 Guild F2121995 Gibson J-2001935 Dobro AlumiliteDanelectro 3021Coral Dano Electric SitarGibson Mastertone Banjo1928 National Style 2 \"Tricone\"", "ItemID": "132919978151", "EndTime": "2019-01-17T03:31:58.000Z", "StartTime": "2019-01-16T02:41:10.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2012-Line-6-James-Tyler-Variax-JTV-69-HSS-Sunburst-w-Bag-Extras-/132919978151", "ListingType": "Chinese", "Location": "Effingham, Illinois", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1329199781518080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NjQwWDIyNg==/z/~pcAAOSw5wJcNVuD/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjQwWDM5OA==/z/mAQAAOSw6~pcNVuD/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjQwWDQwOA==/z/zA0AAOSwFGNcNVuD/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjQwWDM0MA==/z/B9gAAOSw8~NcNVuE/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjQwWDQ3Ng==/z/z5kAAOSwTxJcNVuD/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjQwWDM3MA==/z/ooUAAOSw-V1cNVuD/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjQwWDQ4MA==/z/wEQAAOSwJ~xcNVuE/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjQwWDMxMg==/z/MiAAAOSwYwZcNVuD/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NTcwWDY0MA==/z/HJIAAOSwmFxcNVuD/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjQwWDQ4MA==/z/tRQAAOSwMKxcNVuD/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjQwWDMwMA==/z/rpMAAOSw8iZcNVuD/$_32.JPG?set_id=880000500F"], "PostalCode": "62401", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "rogjohn", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 353, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 535.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 535.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "i***7", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 294}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2012 Line 6 James Tyler Variax JTV-69 HSS Sunburst w/ Bag & Extras ", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Line 6"]}, {"Name": "Product Line", "Value": ["Variax"]}, {"Name": "Model", "Value": ["JTV-69 HSS"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Color", "Value": ["Sunburst"]}]}, "HitCount": 65, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 545.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}