{"BestOfferEnabled": false, "Description": "MIJ, made in japan, Gibson, Lespaul, White, SG, Höfner, Duesenberg, Ibanez, ATELIER Z, ARIA, ESP, Caparison, Killer, COMBAT GUITARS, GUYATONE, Greco, Sugi Guitars, TEISCO, DEVISERA, Nil, Bacchus, VANZANDT, Fernandes, Fender Japan, Fujigen, MOON GUITARS, momose, Yairi Guitar, YAMAHA, TOKAI, Zemaitis, VOX, B, C, Rich, Epiphone, Gibson, Gretsch, Suhr, Schecter, Charvel, Jackson, Dean, Tom Anderson, Fender, Paul Reed Smith, Melancon, Mosrite, Rickenbacker, Robert Benedetto, Washburn, Ibanez, kramer, EDWARDS, Burny, Grassroots, Late 80s Burny FERNANDES RLC-60 '60 model Les Paul Custom type ~ with Hard Case~ Very Good++ condition.Made in Japan Down from here, Photo is dent and scratches etc.. About scratches that are hard to see. To make it easy to understand the condition of the scratches, I lighted the light strongly. Late 80s Burny FERNANDES RLC-60 '60 model Les Paul Custom type ~ with Hard Case~ Very Good++ condition.Made in Japan Body Mahogany. Neck Mahogany. Frets 22F. Scale 24.75inch (628mm) Gibson Medium Scale. Nut Width About 1.69 inch (43mm). Pickup It maybe old Nisshin-onpa japan. Control 2 Volume, 2 Tone, 3-Way PU Toggle switch. Bridge Tune O Machic. Stop Tailpiece. Machine Heads GOTOH Japan. Color Black. Weight About 9.77 Pound ( 4.43 Kg ). This is Used Guitar. The Pickups has been changed. There are shallow cracks of clear coating the back of head. _But there is absolutely no problem. When I got it, The electric circuit was in a no good condition due to deterioration. Therefore, I changed all electric circuits to New ones. It is 4 Pots and 3way toggle switch and Output jack and Capacitor and Wiring. The hard case have Six hinges. One of them is broken. I was shooting a lot of photos. Please confirm with a photograph. It was manufactured in late 1980s ~ early 1990s. Although it is an old guitar, I think that the scratch is little. I feel that the previous owner cherished this guitar. It keeps a very good++ condition. The better the deterioration of the metal parts, it is just vintage guitar. This is a so-called \" Black beauty \", All Mahogany's Les paul custom type by Burny. Japanese old guitar uses High quality wood. Thanks to that, Un plugged sound is be powerful. Making is very polite. I am always fascinated by the black beauty Les Paul. About guitar play, Current state, the space between the strings and the frets is standard. The accuracy of the product is high. It is sure thing that the pickups has been changed. I think this pickups is Nisshin-onpa japan. I feel a good Over drive and a good Distortion sound. Of course, the clean sound is also wonderful. Let's enjoy Vintage Burny !! It is cleanliness. I polished with guitar exclusive polish, so it is in a very clean state. I after the finger board cleaning, painted beeswax. The aim is moisturizing and and protection. Current neck condition, very good ! roughly straight ! There is no problem with the Truss rod and it can be adjusted. Remaining the frets are 88% on average. You can play immediately after it is delivered to you. I was set new strings. Regular tuning. ( Inch : 009, 011, 016, 024, 032, 042 ) All is working well. It is in a very good condition. The Truss rod Wrench is not included. The Hard Case Include. Look at the photos, please verify by yourself! It will be professionally pack. Double air packing. And ships inside a sturdy cardboard box. This electric guitar is USED. Please consider it when bidding. Thank you. Payment I accept PayPal only. Please pay within 3 days after the auction closed. Shipping Worldwide shipping from Japan! EMS / Shipping includes a tracking number. / / / Destination cost Delivery time / / / Asia : $1204 ~ 7daysUS Canada : $1405 ~ 8 daysEurope : $1606 ~ 10 daysOceania : $1405 ~ 8 daysSouth America : $2608 ~ 12 days This item is shipped within 3 business days after payment is confirmed. Terms of Sale International buyers - Please Note: Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer's responsibility. Please check with your country's customs office to determine what these additional costs will be prior to bidding/buying. These charges are normally collected by the delivering freight (shipping) company or when you pick the item up -do not confuse them for additional shipping charges. Please contact us first with 30 working days for any returns, Buyer pays shipping cost from buyer's country to Japan when being returned. In case of return, the shipping cost won't be refunded. We sell various kinds of Electric guitars to international customers. Our goal is to provide the best quality products and service and your satisfaction is the most important to us. Happy bidding!! Thank you !!", "ItemID": "254124961210", "EndTime": "2019-02-22T05:00:14.000Z", "StartTime": "2019-02-15T05:00:14.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Late-80s-Burny-FERNANDES-RLC-60-60-model-Les-Paul-Custom-type-Made-Japan-/254124961210", "ListingType": "Chinese", "Location": "Nagoya-shi,Kita-ku, Aichi", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2541249612108080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/pWoAAOSwIxVcZSbG/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMzM4/z/LikAAOSwf69cZSbu/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU5OVgxNjAw/z/dSUAAOSwUTZcZScC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/glMAAOSwbmFcZScR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwOFgxNjAw/z/XroAAOSwQ45cZScV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg2MTQ=/z/jUkAAOSwgs5cZSce/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/VYMAAOSwtM9cZScq/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/L50AAOSw19dcZScx/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTM0NFgxNjAw/z/zrUAAOSwLWJcZSc3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/iE8AAOSwq5dcZSdL/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNDY3/z/AvEAAOSwpp1cZSdR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/VhsAAOSwPF9cZSd9/$_57.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jguitar-shop", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 376, "PositiveFeedbackPercent": 100.0}, "BidCount": 17, "ConvertedCurrentPrice": {"Value": 960.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 960.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "3***1", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 33}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Americas", "Europe", "Asia", "AU"], "Site": "US", "TimeLeft": "PT0S", "Title": "Late 80s Burny FERNANDES RLC-60 '60 model. Les Paul Custom type. Made in Japan.", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Burny Fernandes"]}, {"Name": "Model Year", "Value": ["Late 1980s ~ Early 1990s"]}, {"Name": "Custom Bundle", "Value": ["Yes"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Modified Item", "Value": ["Yes"]}, {"Name": "Model", "Value": ["RLC-60 '60 model"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Bundle Description", "Value": ["The Hard Case"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Modification Description", "Value": ["The Pickups has been changed."]}, {"Name": "Body Color", "Value": ["Black"]}]}, "HitCount": 950, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "JP", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 970.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["APO/FPO", "Africa"], "GlobalShipping": false, "ConditionDescription": "Very Good++ Condition. This is Used Electric Guitar. The electric guitar when connect to the amplifier, sound output is normal. There are scratches and Dents. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. Please Read the descriptions for details.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}