{"BestOfferEnabled": false, "Description": "FAST & EASY PAWN - OSHKOSH ESP LTD EC-256 Electric Guitar Sunburst Description: GUITAR WORKS GREAT AND IS IN EXCELLENT COSMETIC SHAPE. A FEW MINOR NICKS/SCRATCHES BUT WELL TAKEN CARE OF BY THE ORIGINAL OWNER. I'D EASILY GIVE IT A 8.5/10, VERY CLEAN. PLEASE SEE MULTIPLE PICTURES FOR BETTER COSMETIC IDEA AND ASK QUESTIONS YOU HAVE. Details Additional Details for eCommerceESP LTD EC-256 ELECTRIC GUITAR Musical Instrument Condition Rating98% - Excellent - Like New - Rarely Used Instrument Appearance95% - Excellent Condition : Very Clean, might have some minor wear, dings, scratches, or finish cracks, but otherwise very close to new condition. Knobs - Tuners - Electronics - Input Jack95% - Guitar is like new - Very little wear - All original Musical Instrument CaseNot Included Number of Strings6 STRING Country of ManufactureOTHER COUNTRY Body StyleNOT SPECIFED DexterityNot Specified Notes: Emails will be answered during office hours Monday - Friday 8am to 4pm Central time. I try and answer some at weekday nights and will try and get to what I can on the weekends as well (especially with many auctions ending during the weekend), but please note if sent after 4pm you may not hear back until the next morning. Most of the auctions are bidding. We do not accept offers on auctions unless they are \"best offer\" auctions so please note this before asking that question. IMPORTANT! PLEASE NOTE: The Majority of the items I list are used unless stated otherwise. I am NOT the original owners of the items and do not know the history on the items as they are items sold outright to us or forfeighted loaned items. The staff test all items when they come in before being given to me for listing. Please use the description provided and the multiple pictures taken in each auction as a guide. I'm happy to answer anything I can for you if you're looking for something specific on the item. After you receive the item if you have any problems, please contact me immediately, please do not open case/return or leave negative/neutral feedback, contact me first and I will do my best to receive a 5 star positive feedback from you. Payment PayPal is the ONLY online payment method we accept at this time. Your PayPal account must be a Verified U.S. PayPal Account. We also recommend that you use a Confirmed Ship To Address. Shipping Your item will be shipped within 1-3 business day(s). After shipping your items will be delivered within 1-10 business days. Terms of Sale Tax applies in: WI About Us FAST N EASY PAWN Fast N Easy Pawn has provided specialty financial services to individuals in the Appleton WI, Green Bay WI, Oshkosh WI and surrunding areas since 2008. We are one of the largest providers of secured non-recourse loans, commonly referred to as pawn loans, in the area. We do sell many items in online auctions. For those of you who enjoy the thrill of bidding on the items you're interested in please see our web site. We offer a huge selection of electronics, musical instruments, jewelry and firearms in our 5000+ sq ft. retail area. When you visit our store you can expect a very clean, well organized store with very competive prices. From sporting goods, to power tools, to a one of a kind jewelry pieces, our inventory is guaranteed to impress you. Our mission is to provide a clean, modern store for our customers. Our staff prides itself on friendly, professional service to all of our customers, whether they are obtaining a loan or buying merchandise. Things I Buy: Jewelry, Electronics, Firearms, Sporting Goods, Tools, Gold/Silver, Recreational Vehicles Bravo Store Systems Point-of-Sale Operating System Bravo Omni-Commerce solutions offers Brick & Mortar stores the only fully integrated eBay API that seamlessly & effortlessly combines the in-store Point-of-Sale to all eBay commerce selling activities. Click here & find out why eBay stated \"Bravo has best solved Brick & Mortars can sell on eBay\"", "ItemID": "113373364944", "EndTime": "2018-11-17T14:39:44.000Z", "StartTime": "2018-11-14T14:39:44.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/ESP-LTD-EC-256-Electric-Guitar-Sunburst-FE2039185-/113373364944", "ListingType": "Chinese", "Location": "Oshkosh, Wisconsin", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1133733649448080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/zY4AAOSw64xb7DOr/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/C6AAAOSw84Zb7DOs/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/mtkAAOSw2gNb7DOs/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/s2UAAOSwS4Vb7DOs/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/Z5cAAOSw1Tdb7DOs/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/l-8AAOSwzThb7DOt/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/kh4AAOSwYj9b7DOt/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/m9UAAOSw1iVb7DOt/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/8GIAAOSwtaBb7DOu/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/p9QAAOSwH0Vb7DOu/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/uYIAAOSwiwZb7DOu/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/4QgAAOSw-sVb7DOv/$_1.JPG?set_id=2"], "PostalCode": "54901", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "stdauctions", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 10647, "PositiveFeedbackPercent": 99.6, "TopRatedSeller": true}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 199.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 199.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "l***i", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 171}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "ESP LTD EC-256 Electric Guitar Sunburst (FE2039185)", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["ESP"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Model", "Value": ["EC-256"]}, {"Name": "String Configuration", "Value": ["6 String"]}]}, "HitCount": 107, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1095146284", "StoreName": "stdauctions"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 202.49, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}