{"BestOfferEnabled": true, "Description": "USED Fender Deluxe Stratocaster - Sapphire Blue Transparent (136) Physical Condition This Fender guitar is in good condition but has several signs of use. There's some light scratches, scrapes, dings, and chips about the entirety of the body. The worst of these marks have been photographed. There's also some light tarnish about the gold hardware and scratches about the pickguard. The backplate is missing, but the guitar will come with the backplate screws. Overall, this guitar looks great and sounds even better! Includes tremolo arm! Fretwear This guitar only has some minor wear on the first few frets. Plays great! Action Action is medium low and plays great! Could possibly use a quick tweak to your liking! Electronics All electronics work properly! Original pickups were swapped to a Seymour Duncan Jimi Hendrix Signature set. Specs on these can be found below. Case No case or gig bag included! Serial Number MX16757136 Weight 7.8lbs Information from Fender: SERIAL #: MODEL #: 0147102327 UPC #: 885978650378 SAP NAME: DELUXE STRAT MN SBT Description A tonally versatile guitar with time-honored Fender style and sound, the Deluxe Strat has a few tricks up its sleeve. Special switching unlocks extra pickup combinations for those moments you find yourself needing a little extra kick to stand out. Combining noise-free performance with enhanced playing comfort, this sleek instrument is a truly deluxe performer that excels on stage and in the studio. Three Vintage Noiseless™ pickups offer all the clarity and articulation you’ve come to expect from Strat pickups—with no hum. A push/push mini-switch discretely tucked away between the tone controls, yet still easy to reach, activates the bridge pickup in positions four and five on the selector. Use the bridge and neck pickups together or combine all three pickups for flexible tone that can meet the needs of any song. Enjoy smoother travel when using the tremolo bridge, thanks to the modern two-point synchronized design, which includes bent steel saddles for classic aesthetics. A contoured neck heel and 4-bolt asymmetrical neck plate make it easy to comfortably reach the upper registers of the neck. The flatter 12”-radius fingerboard makes it easy to play fast leads and perform deep bends without fretting out. Locking tuning machines provide enhanced tuning stability, along with quicker string changes. The ash body bears a highly durable gloss polyurethane finish that will easily stand up to hard playing, keeping the instrument like new for years to come. Classic aesthetic touches include nickel/chrome hardware and a three-ply B/W/B pickguard, along with aged white pickup covers, control knobs and switch tip. Melding classic Fender style and sound with upgraded modern components, the Deluxe Strat is perfect for players who need a wide variety of authentic Fender tones on tap. Product Specs Model NameDeluxe Stratocaster®, Maple Fingerboard, Sapphire Blue Transparent Model #0147102327 SeriesDeluxe Country Of OriginMX ColorSapphire Blue Transparent BodyAsh Body FinishGloss Polyester Body ShapeStratocaster® Neck MaterialMaple Neck FinishSatin Urethane Neck ShapeModern \"C\" Scale Length25.5\" (648 mm) FingerboardMaple Fingerboard Radius12\" (305 mm) Number of Frets22 Frets SizeNarrow Tall String NutSynthetic Bone Nut Width1.650\" (42 mm) Position InlaysBlack Pearloid Dots on Maple, White Pearloid Dots on Rosewood Truss RodsStandard Truss Rod Wrench3/16\" Hex (Allen) Bridge PickupVintage Noiseless™ Single-Coil Strat® Middle PickupVintage Noiseless™ Single-Coil Strat® Neck PickupVintage Noiseless™ Single-Coil Strat® ControlsMaster Volume, Tone 1. (Neck/Middle Pickups), Tone 2. (Bridge Pickup) Pickup Switching5-Position Blade: Position 1. Bridge, Position 2. Bridge and Middle, Position 3. Middle, Position 4. Middle and Neck (Plus Bridge When Push/Push Switch Is Activated), Position 5. Neck (Plus Bridge When Push/Push Switch Is Activated) Pickup ConfigurationSSS Bridge2-Point Synchronized Tremolo with Bent Steel Saddles Hardware FinishNickel/Chrome Tuning MachinesDeluxe Cast/Sealed Locking with Vintage Style Button Pickguard3-Ply Mint Green Control KnobsAged White Plastic StringsFender® USA, NPS, (.009-.042 Gauges) Dimensions5.00x15.00x42.00 IN Weight13.00 LB Information from Seymour Duncan: JIMI HENDRIX™ SIGNATURE STRAT - SET Summary In 1968 Jimi Hendrix played a Strat loaded with pickups hand-wound by Seymour. Fifty years later we are proud to share a piece of that history with you. Description On a chilly evening in March of 1968, Jimi Hendrix asked a young Seymour W. Duncan to walk his guitar up onstage. That Strat was loaded with pickups Seymour had wound just for Jimi, and that unforgettable night would set in motion Seymour’s future – and his legacy almost five decades later. Now you can be a bit closer to Jimi’s world with our Jimi Hendrix™ Signature Strat Set. Like Jimi’s music, the Jimi Hendrix Signature Strat Set pickups have their roots in the traditional but with an eye on the future. Each is custom wound for a richer, melodic tone. The bridge model has an aggressive attack that cuts through while staying true to his iconic lead tone. The neck pickup sounds thick and full and is great for chord work, bluesy melodies, double-stops and Jimi’s signature hybrid chord/melody style. And in the in-between positions there’s plenty of that classic Strat ‘quack.’ To help you to get even closer to Jimi’s earth-shattering tone, each pickup is made with a reverse magnet stagger to capture the effect of playing a right-handed guitar upside-down and restrung for a lefty. The white pickup covers showcase Jimi’s signature. The set also comes with a commemorative booklet and stickers. Put a set in your Strat and prepare to be Experienced! The Jimi Hendrix™ Signature Strat Set is fully authorized by Authentic Hendrix LLC. TONE PROFILE DCR:6.07 MAGNET:ALNICO 5 CABLE:CLOTH PUSH-BACK", "ItemID": "292868759148", "EndTime": "2018-12-18T16:18:57.000Z", "StartTime": "2018-12-14T18:30:02.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/USED-Fender-Deluxe-Stratocaster-Sapphire-Blue-Transparent-136-/292868759148", "ListingType": "FixedPriceItem", "Location": "Pikeville, Kentucky", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2928687591488080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwM1gxMjAz/z/sOEAAOSwhfRcE~UT/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/PS8AAOSwa~FcE~Ua/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE3M1gxMTcz/z/sR4AAOSwhfRcE~VH/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/kLsAAOSwTDpcE~VP/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE4OFgxMTg4/z/o2wAAOSwfhlcE~Up/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIxOVgxMjE5/z/IGkAAOSwUWtcE~U2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/glMAAOSwgGZcE~WD/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/RPIAAOSwEppcE~Va/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/La8AAOSwdwVcE~Vj/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/LqAAAOSwHGxcE~Vq/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/K3QAAOSwdxVcE~V0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/llwAAOSwZupcE~V7/$_57.JPG?set_id=8800005007"], "PostalCode": "41501", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mountainmusicexchange", "FeedbackRatingStar": "Red", "FeedbackScore": 3521, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 509.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 509.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "u***9", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 16}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "USED Fender Deluxe Stratocaster - Sapphire Blue Transparent (136)", "ItemSpecifics": {"NameValueList": [{"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Fender Deluxe Stratocaster"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Brand", "Value": ["Fender"]}]}, "HitCount": 85, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=10857579", "StoreName": "Mountain Music Exchange"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}