{"BestOfferEnabled": true, "Description": "MY MICAWBER KEITH RICHARDS MICAWBER 1 x Custom Built 'Micawber' 1 x Vintage Style Tweed Telecaster Case 1 x Leather Strap 1 x Fender Custom Shop Tweed 18' 5.5m Guitar Lead Will ship FREE in Australia (insurance optional) or $295AUD to ship worldwide including $3000 Insurance. 40+ IMAGES OF HER BEING MADE FROM START TO FINISH AT END OF DESCRIPTION: https://imgur.com/a/JFdbxDJ Grab a coffee, this babe deserves a detailed description and for you to hear her story: I had her made by a fantastic Sydney based luthier a few years ago, and i didn't spare a penny doing it, importing the parts from all over the world to nail this thing. Every component on it is the best available, and EXACTLY matching every detail that is known about Keith Richards Micawber. His craftsmanship is unreal. From rolling the edges of the fretboard so your hand glides up the neck, through to ensuring that the tone & resonation of this babe is rock solid. Just like the old days. This is not just another copy of a famous guitar, aside from nailing the aesthetics (unbelievably well), this guy made sure that this babe was worth his time making. She is a players guitar, not just a show piece. In fact, it turned in to a labour of love for this guy as he was so stoked to take on this project of mine and put in far too much time for what I paid him. He said it was his best work. I believe him. The ageing and custom \"relic'ing\" (is that even a word?) done by this fella is absolutely fantastic and not only does she look like a dream from the 50's, she sounds and plays like one too. We even went as far as shielding the pickups with a copper plate to ensure that this babe only hums when you want her too. All very geeky, time consuming for the Luthier and expensive for me, but adds to the charm, and makes this a top notch plank. Its a pleasure to play, as well as admire. Any guitar is only as good as its maker and the sum of its parts. Talking of which: The Nuts & Bolts: Body - Warmoth USA Vintage Telecaster®, Right Handed, Solid Swamp Ash Neck - Warmoth USA Telecaster®, Total Vintage, Right Handed, Maple, Maple Fretboard, 42.86mm Nut Width, Boat Neck Contour, 6150 Frets, Straight 7.25\" (vintage) Radius, Black Face Dot Inlays Neck Pick Up - Seymour Duncan Antiquity Humbucker Bridge Pick Up - Seymour Duncan Antiquity Lap Steel Bridge - Armadillo Guitars Solid Brass Bridge Plate w/ \"Keef\" Saddles Strap Pins - Dunlop Black Straplok Locking Strap Retainers Frets - 21 Medium Jumbo Tuners - Sperzel Brushed Chrome In Line Locking Tuners Nut - Bone Nut Custom Cut for 5 String Open G Spacing Output Jack - Switchcraft Jack Mono & Electro SocketJack Mount Silver Selector Switch - CRL 3-way switch With White Strat Tip Pots - CTS Solid shaft, 500K-ohm With Sprague Orange Drop .022uF Capacitors Wiring - Vintage Cloth Weight - 3.6Kg The Story: So, I am obsessed with the Stones and Keef Richards, and fanatically scoured the internet for years gathering ALL the info I could find about Keefs main player 'Micawber' to get this baby made. In brief, Keefs was originally a ‘50's Fender Blackguard Tele, that over the years he modded, tweaked and changed into the 5 string beast that shaped his sound and some of the Rolling Stones greatest tunes - Brown Sugar, Honky Tonk Woman, Rocks Off, Happy etc etc etc... After a bit of modernisation and almost 45 years of being in the band, she is now known as Micawber, and follows him around the world with the boys. Theres not much else known about it (apart from some brief history of how he got it) so everything I've learned about it is all from the available images online, and from HEAPS of forums out there where die hard fans share details and speculate on what is what. From the outside, my Micawber is as close as we could get to the real deal. The main thing thats not known is how the electrics are wired. Is it Blend Wiring (where his tone pot progressively adds the Humbucker to the Single Coil to throw in more Keef 'grunt') or just straight up Tone & Volume. I went with the latter to keep it simple. You can easily change it to suit you though. The only other thing I didn't do on this one was knock out the 17th fret inlay. Keefs fell out about 20 years ago while playing a gig in Canada. I didn't have the heart (or the balls) to get the Luthier to drill it out. I thought it better that nature take its course with this one! All other details are exactly the same. The ageing, the components etc.. Here is a picture of Keith Richards Micawber & all the details I gave to my Luthier to ensure that we made it as exact as possible: IMAGES OF MY MICAWBER BEING MADE FROM START TO FINISH. HE KEPT A PHOTO JOURNAL FOR ME AND EMAILED ME THESE AS THE BUILD PROGRESSED", "ItemID": "323677025584", "EndTime": "2019-02-05T21:47:36.000Z", "StartTime": "2019-02-02T04:57:40.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Custom-Built-I-E-Fender-Telecaster-Guitar-Keith-Richards-Micawber-/323677025584", "ListingType": "FixedPriceItem", "Location": "Melbourne", "PaymentMethods": ["PayPal", "COD", "CashOnPickup"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/3236770255848080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/d30AAOSwwj5b9iyN/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTI5WDY0OQ==/z/StoAAOSwEKxb9jQr/$_57.PNG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/4a4AAOSw0rdb9izM/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/TucAAOSwZNtb9iy4/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI4MFgxMjgw/z/x5AAAOSwT-pb9i2m/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI4MFgxMjgw/z/bcMAAOSwBkNb9i2Q/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI4MFgxMjgw/z/0d4AAOSw~bhb9i0j/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI4MFgxMjgw/z/5o4AAOSwl7db9iza/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI4MFgxMjgw/z/-OMAAOSwJ~xb9iy9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI4MFgxMjgw/z/5wsAAOSwTiVb9izl/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI4MFgxMjgw/z/M-kAAOSwVIBb9izw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI4MFgxMjgw/z/bj8AAOSwTEZb9i2F/$_57.JPG?set_id=8800005007"], "PostalCode": "3000", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "ipso_mofo_au", "FeedbackRatingStar": "Blue", "FeedbackScore": 70, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 2162.24, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2995.0, "CurrencyID": "AUD"}, "HighBidder": {"UserID": "q***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 773}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "Australia", "TimeLeft": "PT0S", "Title": "Custom Built 'ᗰIᑕᗩᗯᗷEᖇ' Fender Telecaster Guitar - Keith Richards Micawber", "ItemSpecifics": {"NameValueList": [{"Name": "Size", "Value": ["Full Size"]}, {"Name": "Body Color", "Value": ["Road Worn Butterscotch Blonde"]}, {"Name": "String Configuration", "Value": ["Right Hand"]}, {"Name": "Model", "Value": ["Custom"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["1952"]}, {"Name": "Series", "Value": ["Custom Made Replica Telecaster \"Micawber\""]}, {"Name": "Features", "Value": ["Vintage cloth wiring", "Shielded", "Vintage NOS treble bleed mods", "Solid Brass Bridge", "Sperzel Brushed Chrome In Line Locking Tuners", "Seymour Duncan Antiquity Humbucker", "Seymour Duncan Antiquity Lap Steel Single Coil"]}, {"Name": "Soundboard Style", "Value": ["Flat Top"]}, {"Name": "Brand", "Value": ["Custom Made Guitar"]}, {"Name": "Body Type", "Value": ["Telecaster"]}, {"Name": "Body Material", "Value": ["Swamp Ash"]}, {"Name": "Custom Bundle", "Value": ["Yes"]}, {"Name": "Bundle Description", "Value": ["1 x Custom Built 'Micawber'\n1 x Vintage Style Tweed Telecaster Case\n1 x Leather Strap\n1 x Fender Custom Shop Tweed 18' 5.5m Guitar Lead"]}, {"Name": "Neck Material", "Value": ["Maple"]}]}, "HitCount": 123, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "AU", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "South America"], "GlobalShipping": false, "ConditionDescription": "The Most Accurate Micawber You Will Find! 40+ Photos Of Build In Description. + Case, Strap & Fender Custom Shop Lead.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}