{"BestOfferEnabled": false, "Description": "UPDATE: I AM ALSO INCLUDING A NEAR MINT IN BOX SEYMOUR DUNCAN DISTORTION BRIDGE HUMBUCKER PICKUP (ALL BLACK COILS) WITH THE GUITAR, IN CASE YOU PREFER THE 80s DOKKEN SOUND OVER THE LYNCH MOB ERA SOUND...... Hello and happy holidays! the bright spots in the front pic are camera flash, it is not a scratch or wear,the front is quite clean for such an old Lynch.....If you are looking at this you already know the specs but if not, ESP George Lynch Purple Sunburst Tiger, this is an original JAPAN MADE ESP, not a cheap LTD chineez made copy....22 XJ frets on a rosewood fretboard, maple neck, HEAVY solid maple body, original floyd rose tremolo with bar included, 25.5\" scale, original ESP SS-120 single coil and the original Seymour Duncan non- logo-ed, Marciela Juarez wound Screamin' Demon George Lynch model bridge humbucker (note the \"J\" on the rear pickup label..) because of the non- logo demon (Seymour duncan started logo-ing pickups in the early 90s i believe, and the screamin demon came out in 1990 i think, with the 1st lynch mob album) and several emails ive exchanged with ESP and other collectors i think this one is from very late 1989 to 1993 in terms of vintage, serial number is 94xxx, plays and sounds great, awesome neck, no breaks or repairs, it has been played and has the dings and chips to show it, these days fender would call it a \"relic\" finish and charge you an extra 1000.00 lol...but all kidding aside its just normal wear for a 30 year old guitar, a chip on the upper horn, a few chips and dings near the input jack that have been touched up are the worst finish flaws, some buckle scratches on the rear, a few indentations on the back of the neck, a 1/4\" size chip on the edge on each back corner of the floyd cavity....if you are looking for a 10/10 guitar to keep in mothballs, keep looking...if you are looking for a Lynch that has been played but not played out, and is solid as a rock and ready for your collection, this may be for you....you will not beat this price for a REAL JAPAN MADE ESP sunburst tiger anywhere, they are close to $4000.00 new and rarely under @2000.00 used, dont wait on this one....some freatwear but not extreme, neck plays great, no headstock breaks or repairs ever, typical 1/2\" long clearcoat cracks on either side of the neck pocket, very common on any bolt on guitar...includes non original hardshell case, nothing special but protects the guitar fine, i will be certain to make sure headstock is extra padded for shipping and that guitar will not move in its package at all......not interested in lowering my price or trading....thanks for looking! AUCTION TERMS: WILL ONLY SHIP THIS GUITAR TO THE LOWER USA 48 STATES, CANNOT SHIP TO ALASKA , HAWAII, CANADA OR OVERSEAS SORRY! PAYMENT DUE AT CLOSE OF AUCTION VIA PAYPAL ONLY.....SHIPPING ON THIS ITEM IS FREE! SHIPPING WILL BE VIA UPS OR FEDEX AND WILL INCLUDE TRACKING AND FULL INSURACE FOR THE PURCHASE AMOUNT....ITEM WILL SHIP WITHIN 2 DAYS OF PAYMENT RECEIPT AND ILL SEND TRACKING INFO AT THAT TIME...YOU MAY REQUEST A SIGNATURE BE REQUIRED AT DELIVERY IF YOU PREFER.....THANKS AGAIN!", "ItemID": "202546281856", "EndTime": "2018-12-28T02:55:59.000Z", "StartTime": "2018-12-24T00:09:11.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/ESP-GEORGE-LYNCH-SUNBURST-TIGER-EARLY-90s-VINTAGE-GUITAR-JUAREZ-WOUND-DEMON-NR-/202546281856", "ListingType": "FixedPriceItem", "Location": "Ann Arbor, Michigan", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2025462818568080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NjIwWDQ0Nw==/z/vhIAAOSwmaJcIBy0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDAxWDYyMA==/z/hZYAAOSwlfNcIBy4/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjIwWDQxOQ==/z/Ee0AAOSwE~ZcIBzB/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjIwWDI5Mw==/z/cFsAAOSwO7dcIBzJ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjIwWDIxOA==/z/h4AAAOSwZddcIBzO/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjIwWDMyNg==/z/wJEAAOSwUu5cIBzU/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjIwWDMxNA==/z/f0AAAOSw9~RcIBzc/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MzExWDYyMA==/z/XesAAOSwHF1cIBzi/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/Mzc3WDYyMA==/z/dUcAAOSwP8dcIBzn/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjIwWDQ0OQ==/z/DZgAAOSwGBRcIBzy/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjIwWDQ2NQ==/z/H7AAAOSwhexcIB01/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjIwWDM2NQ==/z/Xq0AAOSwWrxcIB1S/$_57.JPG?set_id=8800005007"], "PostalCode": "48103", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "ngeorge6", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 310, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1299.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1299.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "0***p", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 4}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "ESP GEORGE LYNCH SUNBURST TIGER EARLY 90s VINTAGE GUITAR JUAREZ WOUND DEMON NR", "HitCount": 166, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}