{"BestOfferEnabled": false, "Description": "Up for sale, an Eastwood Airline '59 Town & Country in exceptional condition and in perfect working order. An uncommon and discontinued reissue of the original Airline-branded model produced in the 1960s for Montgomery Ward, this Eastwood version is a clever modern spin on what made the original so visually and tonally unique. This guitar features a chambered mahogany body, bolt-on maple neck, and rosewood fingerboard for a wonderful combination of tone, sustain, and resonance. Acoustically, notes jump out of the guitar and the instrument has a cutting and rumbly voice. When plugged in, the Town & Country screams and sparkles with a classic sound thanks to the Alnico Hot-10 bridge humbucker and the Airline Vintage Voiced Single Coil (VVSC) pickups in the neck and middle positions. These humbucker-sized single-coils produce a resonant tone that is on the verge of hollow and microphonic for a time-machine type of experience and will go anywhere from glassy clean to punchy and in your face roar. This guitar responds exceptionally well to dirt and fuzz as well as carrying on the legacy of unique tone for which Airline Guitars are known. This Airline weighs a mere 7lbs 8oz and has been professionally setup with 10-46 strings and comfortable action. The maple neck has a big chunky C shaped profile with lots of shoulder and consistent depth as you travel up the fretboard. The jumbo fretwire shows virtually no wear, with lots of meat, well rounded crowns and clear, singing notes in every register. The scale length measures 25\" and the nut is a full 1 11/16\" in width. On the headstock, the original Kluson-style strip tuners turn smoothly and hold pitch well, and the raised \"Airline\" logo is present. The electronics all work as intended, with individual Volume and Tone knobs directly above each pickup, as well as a Master Volume knob and three-way pickup selector switch. The chrome hardware and plastic parts are all in great shape and the gloss Redburst finish has subtle top and back carve to accentuate the otherwise vaguely Les Paul-shaped body. Cosmetic wear is extremely limited, with only a few light scuffs in the clear coat on the body, while the neck profile is free of wear.The Eastwood-branded hardshell case is included. Check out our shop \"Mike & Mike's Guitar Bar,\" and please let us know if we can answer any questions!Shipping in the continental USA will be $75, fully insured and shipped via FedEx Ground. Expedited shipping available for an additional fee at buyer's request. We will happily ship WORLDWIDE, but please contact us for an accurate international shipping quote before bidding or buying, as cost varies by buyer location. International orders will be declared as “merchandise,” and the value of merchandise will be declared as the amount paid. We cannot declare anything as a gift or for a lesser value. No exceptions! The customer is responsible for all taxes and duty, which may be collected upon delivery, as well as any additional charges involved with import. We have all necessary CITES paperwork in-hand to ship rosewood worldwide.We do our best to describe all items with honesty and accuracy, but to be sure, please contact us with any questions or concerns prior to bidding or buying. We require payment within 48 hours of auction end. In the unlikely event of a return, buyer pays all shipping costs. Your positive feedback and five star ratings are very important to us, and we appreciate your communication in resolving any issues!", "ItemID": "173724428722", "EndTime": "2019-01-06T08:09:34.000Z", "StartTime": "2019-01-05T09:15:31.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Eastwood-Airline-59-Town-Country-Std-3-Pickup-Electric-Guitar-Redburst-w-ohc-/173724428722", "ListingType": "FixedPriceItem", "Location": "Seattle, Washington", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1737244287228080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/nokAAOSwwhxcMGyS/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/zOIAAOSwBZBcMGyd/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/nRYAAOSwvapcMGyf/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/otQAAOSwH4dcMGyh/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Ya0AAOSw64xcMGyW/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/2PoAAOSwQhBcMGyp/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/WgMAAOSwAEFcMGyU/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/exwAAOSw6KxcMGyj/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/6D8AAOSwLKhcMGyb/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/dJsAAOSwrAFcMGyl/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/rLoAAOSw7C5cMGyn/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE0M1gxNjAw/z/lIQAAOSw~D5cMGyY/$_57.JPG?set_id=8800005007"], "PostalCode": "98117", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mmguitarbar", "FeedbackRatingStar": "Red", "FeedbackScore": 2591, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 799.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 799.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "5***m", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 12}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "Eastwood Airline '59 Town & Country Std 3 Pickup Electric Guitar Redburst w/ohc", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Redburst"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Brand", "Value": ["Eastwood"]}, {"Name": "Model", "Value": ["Airline '59 Town & Country"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Country/Region of Manufacture", "Value": ["China"]}, {"Name": "Body Material", "Value": ["Mahogany"]}]}, "HitCount": 17, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=269063702", "StoreName": "Mike and Mikes Guitar Bar"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}