{"BestOfferEnabled": false, "Description": "Dean Palomino Solo Archtop Jazz Guitar, Antique Natural finish, Solid spruce top The “Solo” model is no longer available, and I don’t think that Dean is making them anymore. Please don’t confuse this Palomino Solo with all the other Palominos in the Dean lineup. There are almost no similarities - it is a totally different guitar. I suspect it was deleted from their lineup because it was just too darn expensive to produce at the price point they were looking for. It has a solid spruce archtop, gold hardware including Grover tuners, Ebony fretboard and tailpiece. Mine is the Antique Natural color, and the guitar is very stately looking with the fancy fingerboard inlays on the Ebony fingerboard, bound fretboard and F-holes, multi-ply binding, solid Ebony tailpiece, and three layer pickguard. With the solid top and floating pickup, I just can’t believe the acoustic volume it has, far more than my old Guild Artist Award which was over $3000! I also love the plugged in sound of the humbucker. It is a very deep body like Gibson ES-175, the rims are a full 3 7/16”. Comes with the Dean hard-shell case (with two keys) that has a couple scrapes on it, but is in extremely nice condition. Near perfect condition, tiny nick on back of headstock where it bumped the wall (pictured), slight gold tarnish on pickup by the pickguard (pictured). There are the typical light pickguard strumming marks. I bought the guitar brand new a few years ago. Here are some online descriptions: “Dean Palamino Solo jazz guitar breaks another price barrier with Arched Solid Spruce Top and Ebony Fingerboard. Features --F Hole Arched Solid Spruce Top --Maple Body --24 3/4\" Scale --Set Maple Neck --Ebony Fingerboard --Pearl/Abalone Block Inlays --Grover Tuners --Gold Hardware --Tune O Matic Bridge w/Ebony Tail Piece --Dean DMT Designed Floating Mini Humbucker --Gloss Natural --Antique Natural” .......... “Palomino Solo is a single-cut jazz guitar made by Dean Guitars. It features a fully hollow body made of maple back and sides with spruce sound board on top. Top panel is bound in white binding and carved with a pair of \"f\" holes with matching binding. Body of Palomino Solo is finished in high gloss and it`s available in Antique Natural and Gloss Natural. Bridge section on this model is a standard one, it includes a tune-o-matic bridge with wooden base in the front and a trapezoid tailpiece in the back. There`s only one pickup on this model, a minibucker in the neck position. It`s controlled with master volume and master tone knobs. C-shaped maple neck is set in and topped with a 20-fret ebony fingerboard.” .......... “The PALOMINO SOLO from Dean Guitars attracts attention with great looks, then amazes the on-lookers with its beautiful sound. The full body, with its classic Jazz f-holes projects loads of natural acoustic volume on its own; but the Dean Magnetic Technologies floating mini humbucker pickup adds great fullness and warmth to the electric guitar plugged in sound. The arched top is solid spruce, and the appointments are top notch. The hollow body is fully bound, as are the f-holes. The body and neck are all maple and the Jazz style tailpiece is ebony, in keeping with Jazz archtop tradition. The fretboard is also ebony with beautifully done mother of pearl and abalone block inlay position markers. In fact, the workmanship, fit and finish of the whole guitar is superb, and makes the Dean PALOMINO SOLO a great hollow body working guitar as well as a great guitar for Jazz lover.\" Features: Solid Spruce Arched Top Maple Back and Sides Maple Neck, dovetailed set joint Scale Length: 24-3/4 inches Nut Width: 1-11/16 inch Ebony Fretboard Mother of Pearl and Abalone Block Inlays Gold Grover Tuners Adjustable Gold Tune-O-Matic Bridge Ebony Jazz Tailpiece Florentine cutaway body Dean DMT Floating Mini Humbucker Pickup Controls: Volume and Tone Gloss Finish NOTE: US shipping only due to CITES regulations. On Jan-30-19 at 13:58:27 PST, seller added the following information: Please note: Due to CITES regulations I will not ship internationally. I will not use the EBay Global Shipping Program. Only bid if you have a U.S. shipping address other than the EBay GSP address.", "ItemID": "143105355522", "EndTime": "2019-02-03T05:00:46.000Z", "StartTime": "2019-01-27T05:00:46.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Dean-Palomino-Solo-Archtop-Jazz-Guitar-Antique-Natural-finish-Solid-spruce-top-/143105355522", "ListingType": "Chinese", "Location": "Rochester, Michigan", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1431053555228080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/DoUAAOSwMpFcTN4Y/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/LPwAAOSwZDJcTN5T/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/9WQAAOSwvpVcTN5u/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/NEIAAOSwgb1cTN59/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/UZIAAOSw9D1cTN6Q/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/WywAAOSwCWNcTN6h/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTM3MVgxMDcy/z/h2gAAOSw27lcTN8Y/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/4vYAAOSwdaVcTN9E/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/XNQAAOSw9g1cTN~T/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/CIkAAOSwvwRcTOTL/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/F2wAAOSwoZJcTOUS/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/bkkAAOSwjYVcTOVh/$_57.JPG?set_id=8800005007"], "PostalCode": "48306", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "1213ecc", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 386, "PositiveFeedbackPercent": 98.4}, "BidCount": 14, "ConvertedCurrentPrice": {"Value": 455.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 455.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "i***s", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 23}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "CA", "GB", "DK", "RO", "SK", "BG", "CZ", "FI", "HU", "LV", "LT", "MT", "EE", "AU", "GR", "PT", "CY", "SI", "JP", "CN", "SE", "KR", "ID", "TW", "TH", "BE", "FR", "HK", "IE", "NL", "PL", "ES", "IT", "DE", "AT", "BS", "IL", "MX", "NZ", "SG", "CH", "NO", "SA", "UA", "AE", "QA", "KW", "BH", "HR", "MY", "CL", "CO", "CR", "PA", "TT", "GT", "HN", "JM", "AG", "AW", "BZ", "DM", "GD", "KN", "LC", "MS", "TC", "BB", "BD", "BM", "BN", "BO", "EG", "GF", "GG", "GI", "GP", "IS", "JE", "JO", "KH", "KY", "LI", "LK", "LU", "MC", "MO", "MQ", "MV", "NI", "OM", "PK", "PY", "RE"], "Site": "US", "TimeLeft": "PT0S", "Title": "Dean Palomino Solo Archtop Jazz Guitar, Antique Natural finish, Solid spruce top", "ItemSpecifics": {"NameValueList": [{"Name": "Soundboard Style", "Value": ["Archtop"]}, {"Name": "Brand", "Value": ["Dean"]}, {"Name": "Body Type", "Value": ["Hollow , solid archtop"]}, {"Name": "Model", "Value": ["Solo"]}, {"Name": "Body Color", "Value": ["Antique Natural"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}]}, "HitCount": 298, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 460.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 4, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": true, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}