{"BestOfferEnabled": true, "Description": "Powered by Frooition Pro Shop Search 2008 Gibson Les Paul Standard Traditional Plus Guitar - Desert Burst w/Case Click here to view full size. Full Size ImageClick to close full size. Item Description 2008 Gibson Les Paul Standard Traditional Plus Electric Guitar in very good condition with a few light dings on the front and back. Beautiful Desert Burst Flame Top with Antique pickguard and binding. The guitar has a nice action and the rounded 50's profile neck has a great feel. The frets are very good condition with little to no playwear. The '57 Classic and Classic Plus pickups have a great tone with good output. Looks, plays and sounds great. Includes hard shell case. Made in the USA. Serial Number: 012880403 Weight: 9 lbs 3 oz. The Gibson Les Paul Standard Traditional Plus electric guitar has all the traditional features you expect from a Les Paul: mahogany body and set neck, figured maple top, and a pair of Gibson's awesome '57 Classic humbucker pickups. The Plus on this guitar is the gorgeous, figured maple top—just the right touch on this iconic rock machine. One not-so-traditional improvement—the neck has been dressed by Gibson's Plek machine, a computer-controlled robot that analyzes the neck, files the frets, and cuts the slots on the nut to a hundredth of a millimeter accuracy for optimal action and intonation without string buzzing. Key Features Body Wood: Mahogany, non-chambered weight-relieved Top wood: Figured maple Scale Length: 24-3/4\" Neck Joint: Set-in Neck Wood: Mahogany Plek'd on Gibson Plek Machine Neck Shape: '50s rounded Frets: 22 Nut Width: 1.695\" Fretboard Radius: 12\" Bridge: Nashville Tune-O-Matic Tailpiece: Stopbar Pickup Bridge: '57 Classic Plus humbucker Pickup Neck: '57 Classic humbucker Controls: 2 volume, 2 tone, 3-way pickup selector Vintage speed knobs Tuners: TonePros Kluson-style Hardware color: Chrome Binding: top and neck Finish: Lacquer About Us Payment Shipping Terms Returns About UsWe offer a large selection of quality pre-owned musical instruments and equipment from the industries finest manufactures including Akai, Ampeg, Boss, Denon, Digidesign, DigiTech, Epiphone, Fender, Gibson, Gretsch, Guild, Ibanez, Korg, Lexicon, Line 6, Mackie, Mesa Boogie, Marshall, Martin, MusicMan, MXR, Neumann, Peavey, Pioneer, PRS, Roland, Shure, Tascam, Taylor, TC Electronic and Yamaha. New gear arrives daily so check our store often. Lighthouse Sound, Inc. is proud to be an authorized dealer of the following brands of guitar effects pedals, pedal boards, amplifiers and accessories: Bearfoot FX, Bigsby, Cooper Stands, Dunlop, Earthquaker Devices, Ernie Ball, EVH, Fender Accessories, Keeley Electronics, Gretsch Accessories, Ken Smith Strings, Lava Cable, Martin Accessories, Mojo Hand FX, RotoSound, SnaKe Oil Strings, Snark Tuners, Suhr Guitars, Amps, Pedals and Pickups, Voodoo Lab and Wampler Pedals About Us Payment Shipping Terms Returns PaymentWe accept PayPal payments. All major Credit Cards are accepted through PayPal including Master Card, Visa, American Express and Discover. About Us Payment Shipping Terms Returns ShippingLighthouse Sound specializes in prompt, safe shipping. We take great care packaging every item to ensure safe shipment to you. We get your gear to you fast, most orders ship within 1 business day of payment clearance. Tracking information is uploaded to eBay and can be viewed from your eBay account. International customers are responsible for any duties, taxes, brokerage or other fees. Please check with your country's customs office to determine what these additional costs will be. These fees vary from country to country and we have no way to calculate them. About Us Payment Shipping Terms Returns TermsSales Tax - 7 % Ohio Sales Tax will be added to the total amount for all purchases delivered to Ohio. We take pride in our customer service and your satisfaction is very important to us. In the rare event that you have a problem with your item please contact us and we'll be happy to help. While all care is taken, any errors, omissions or variations in the item details are unintentional. About Us Payment Shipping Terms Returns ReturnsWe offer a 14 day return policy. Items must be returned to us within 14 days of the original delivery date. We ask that you please return the product in the original product packaging along with all included materials (manual, warranty card, all accessories) and in the original condition that it was received. Buyer is responsible for return shipping and insurance cost. Refunds will be issued upon return of the item less the original shipping charge and a 15% restocking fee will apply. Helpful Links More Items! This listing is currently undergoing maintenance, we apologize for any inconvenience caused. Powered by SixBit's eCommerce Solution", "ItemID": "352593069514", "EndTime": "2019-03-04T18:20:15.000Z", "StartTime": "2019-02-13T03:55:02.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2008-Gibson-Les-Paul-Standard-Traditional-Plus-Guitar-Desert-Burst-w-Case-/352593069514", "ListingType": "FixedPriceItem", "Location": "Salem, Ohio", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/3525930695148080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/OTMyWDE1MzQ=/z/R00AAOSwI7JcYbYh/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODUzWDE1MDM=/z/z8gAAOSwFfJcYbYk/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYyWDE1NDc=/z/b1MAAOSwu2tcYbYm/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTMzWDE0ODk=/z/dAsAAOSwWtpcYbYp/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODY0WDE1NjQ=/z/-QEAAOSw5vxcOROG/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODY0WDE1MzM=/z/Lp0AAOSwb-1cOROI/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/yCwAAOSwOWdcOROM/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/on0AAOSw8a9cOROO/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/uQoAAOSwC~9cOROU/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/ny0AAOSwWdNcOROR/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/qQYAAOSwIqxcOROa/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/~uYAAOSwqoxcOROX/$_57.JPG?set_id=880000500F"], "PostalCode": "44460", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "lighthouse_sound", "FeedbackRatingStar": "TurquoiseShooting", "FeedbackScore": 33109, "PositiveFeedbackPercent": 99.6, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1649.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1649.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "2***2", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 884}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "CA", "GB", "DK", "RO", "SK", "BG", "CZ", "FI", "HU", "LV", "LT", "MT", "EE", "AU", "GR", "PT", "CY", "SI", "JP", "CN", "SE", "KR", "ID", "TH", "BE", "FR", "HK", "IE", "NL", "PL", "ES", "IT", "DE", "AT", "BS", "IL", "MX", "NZ", "SG", "CH", "NO", "SA", "UA", "AE", "QA", "KW", "BH", "HR", "MY", "CO", "PA", "JM", "BB", "BD", "BM", "BN", "BO", "EG", "GF", "GG", "GI", "GP", "IS", "JE", "JO", "KH", "KY", "LI", "LK", "LU", "MC", "MO", "MQ", "MV", "NI", "OM", "PK", "PY", "RE", "UY"], "Site": "US", "TimeLeft": "PT0S", "Title": "2008 Gibson Les Paul Standard Traditional Plus Guitar - Desert Burst w/Case", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Model", "Value": ["Les Paul Traditional Plus"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Color", "Value": ["Desert Burst"]}, {"Name": "Model Year", "Value": ["2008"]}, {"Name": "Country/Region of Manufacture", "Value": ["USA"]}]}, "HitCount": 742, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=22579709", "StoreName": "LHSound"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": true, "ConditionDescription": "2008 Gibson Les Paul Standard Traditional Plus Electric Guitar in very good condition with a few light dings on the front and back. Beautiful Desert Burst Flame Top with Antique pickguard and binding. The guitar has a nice action and the rounded 50's profile neck has a great feel. The frets are very good condition with little to no playwear. The '57 Classic and Classic Plus pickups have a great tone with good output. Looks, plays and sounds great. \n\nIncludes hard shell case. Made in the USA.\n\nSerial Number: 012880403\n\nWeight:      9 lbs      3 oz.", "QuantitySoldByPickupInStore": 0, "SKU": "43877", "NewBestOffer": false}