{"BestOfferEnabled": false, "Description": "All photos are of the actual item for sale. Excellent Condition This was taken in as a trade. Guitar shows some minor scratches on it from normal use. Our service department tested this guitar and no issues were found. Tested to factory spec. Please see the photos above; they are of the actual item for sale. Gibson SG Standard 2018 Solidbody Electric Guitar - Autumn Shade Immortalized by Santana at Woodstock and smashed onstage by Townsend, the Gibson SG is a rock icon. Gibson's Nashville-made SG Standard 2018 is the real deal, arming you with a pair of toneful humbuckers, a slim-profile neck, and a silky Plek'd rosewood fretboard with action that's almost nonexistent. The SG's lightweight mahogany body delivers great sustain and no pain, even if you play all night. And the nitro finish looks and feels luscious while enhancing the tone of this legendary solidbody electric guitar. Own your piece of rock history: the Gibson SG Standard 2018. Tech Specs Body Type: Solidbody Body Shape: SG Left-/Right-handed: Right-handed Number of Strings: 6 Body Material: Mahogany Top Material: Flame Maple Body Finish: Gloss Nitrocellulose Color: Autumn Shade Neck Material: Mahogany Neck Shape: Slim Taper Radius: 12\" Fingerboard Material: Rosewood Fingerboard Inlay: Acrylic Trapezoid Number of Frets: 22, Medium Scale Length: 24.75\" Nut Width: 1.695\" Nut Material: Tektoid Bridge/Tailpiece: Aluminum Tuners: Locking Kidneys Neck Pickup: 61R Humbucker Bridge Pickup: 61R Humbucker Controls: 2 x Volume , 2 x Tone, 3 Way Toggle Pickup Switch Strings: (.009 -.046) Weight: 6.48lbs INCLUDED Case Candy and Hard-Shell Case Check out my other auction listings! and be sure to add me to your favorites list. CONTACT INFORMATION You can e-mail us with any questions you may have about an item. We are very easy to reach, and we are glad to help. Just click \"Ask a question\" in the questions and answers area below. Please note that we are not in the office after 5:00PM EST on weekdays, or all day Saturdays and Sundays. Questions asked over the weekend will be answered on the following business day. SHIPPING INFORMATION Items are shipped within one business day of payment. To avoid a lost or stolen item, your package may ship \"Signature Required.\" If you have special shipping instructions or would like your item shipped UPS instead of USPS or FedEx, please contact us before you make a purchase. We collect local sales tax here in Indiana. This applies to Indiana residents who we ship to, as well as non-Indiana residents who drive here for local pickups. We also collect sales tax in other states around the country. Please check eBay's tax information on the \"Shipping and payments\" tab above to see if we are collecting tax in your area. PLEASE NOTE Shipping quotes are estimates only. We use eBay’s shipping calculator, which provides estimated shipping charges on listings where “Free Shipping” is not offered. Ebay's FedEx calculator on the item page quotes eBay's discounted FedEx shipping rates, which we honor. At checkout, however, buyers in certain areas will see the calculator attempt to charge the full retail price. FedEx's full retail price is the price you pay if you were to walk into a FedEx retail location. The difference between eBay's discounted rate and this retail price can be as much as 40%. If you estimate shipping with a zip code that is different from the zip code registered to your User ID, eBay’s shipping calculator will make the adjustment at checkout. Additionally, FedEx charges a surcharge for delivery in certain rural areas of the country that does not, for some reason, show up in eBay’s estimate calculator; but it does at checkout (we wish we could control this, but we can’t — we have contacted eBay many times about this issue). FedEx does this based on the +4 extension of your primary 5-digit zip code. For example, eBay’s shipping calculator may quote you one price based on your primary 5-digit zip, and then figure out that your requested street address at checkout places you within the rural surcharge area, changing the shipping price to an alternate amount that was originally quoted. If there is a discrepancy in your shipping cost, please send us a screen shot of the quoted price to you on our item page and we can override the eBay checkout calculation to get you the cheapest rate. RETURN INFORMATION We want you to be completely happy with your purchase. If the item you receive is not as described or has been damaged in shipping, please contact us immediately. We will make every effort to promptly resolve any problem. Your satisfaction is our top priority. We are happy to offer free shipping on some of the items we offer. Please note that if you decide to return something where free shipping was offered, our shipping costs are non-refundable.", "ItemID": "372562818264", "EndTime": "2019-01-17T01:14:11.000Z", "StartTime": "2019-01-10T01:14:11.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-SG-Standard-2018-Solidbody-Electric-Guitar-Autumn-Shade-/372562818264", "ListingType": "Chinese", "Location": "Fort Wayne, Indiana", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/3725628182648080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTE0NVgxNjAw/z/k~AAAOSwm5xcNhXy/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjUzWDE2MDA=/z/S~wAAOSwMpFcNhXv/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg1Njc=/z/ARQAAOSw8~NcNhXz/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMTky/z/noUAAOSw-V1cNhX2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg1OTA=/z/P4gAAOSwYPNcNhX3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMzMy/z/0vUAAOSwdhdcNhX6/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDI3/z/0v0AAOSwdhdcNhX9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjU0/z/8doAAOSwyeNcNhX~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTg1WDE2MDA=/z/JikAAOSw6jJcNhYB/$_57.JPG?set_id=8800005007"], "PostalCode": "46818", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jeffsmusicgear", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 14336, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 8, "ConvertedCurrentPrice": {"Value": 895.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 895.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "u***b", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 59}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson SG Standard 2018 Solidbody Electric Guitar - Autumn Shade", "ItemSpecifics": {"NameValueList": [{"Name": "Product Line", "Value": ["Gibson SG"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model", "Value": ["SG Standard"]}, {"Name": "MPN", "Value": ["SGS18AMCH1"]}, {"Name": "Model Year", "Value": ["2018"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}]}, "HitCount": 699, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=36123540", "StoreName": "jeffsmusicgear"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 905.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "TopRatedListing": true, "GlobalShipping": false, "ConditionDescription": "Excellent Condition. This was taken in as a trade. Guitar shows some minor scratches on it from normal use. Our service department tested this guitar and no issues were found. Tested to factory spec. Please see the photos above; they are of the actual item for sale.", "QuantitySoldByPickupInStore": 0, "SKU": "SGS18AMCHU", "NewBestOffer": false}