{"BestOfferEnabled": false, "Description": "Jackson DK2 Eerie Dess Swirl MADE IN JAPAN. Serial #9761750. As you may already know these are hard to find in this condition. The finish on this guitar is in beautiful condition. You will have a hard time finding one this clean. The protective plastic film is still on the back of the tuners and on the truss rod cover. The \"Made In Japan\" sticker is still on the back of the neck. The frets are very shiny and smooth. Neck is beautiful. The headstock is in very nice condition. The tip is not chipped. The neck pocket has the typical finish crack on the top side of the neck pocket as pictured and illustrated with a red arrow. A few very small light scratches in the finish but they would not show up in the pics. They are the kind that you have to tip in the light to see. There are only very minor surface marks on the finish and there are very few of them. It has Ernie Ball 9s on it. Please use the pics, the description, and all stated terms to determine if this guitar is up to your standards and purchase accordingly. Thanks for looking. See specs below: SPECS: Alder bodyMade in JapanRock maple bolt-on neckBound rosewood compound-radius fingerboardSeymour Duncan JB TB4 humbuckerDuncan Design (mid and neck) pickups with Seymour Duncan Pickup covers24 Jumbo fretsSharkfin inlaysIvoroid bindingBlack hardwareSealed die-cast tunersFloyd Rose Licensed Jackson Low Profile JT580 LP double-locking 2-Point Tremolo Scale length: 25.5 in. Width at nut: 1-11/16 in. If you have any questions please make sure they are answered before you bid, buy, or make an offer. Immediate payment is required for buy it now. If your best offer is accepted, payment is to be made within 24 hours. Item is sold as is. All sales are final. No returns. Item will be insured for at least the purchase price. As this is a used guitar and I am not the original owner, I cannot guarantee that all parts are factory stock. This item is offered to those buyers/bidders in the contiguous US Only. Sorry no APO/FPO/DPO. Signature will be required upon delivery. Will ship to confirmed Paypal addresses only. I usually ship via FedEx but reserve the right to use an alternate shipper solely at my discretion. If FedEx cannot deliver to your confirmed paypal address, you are not allowed to bid, make an offer, or use the buy it now option. It is your responsibility to determine if FedEx can or cannot deliver to your confirmed paypal address BEFORE bidding, making an offer, or using the Buy it Now option. If you are outside the contiguous U.S. and/or attempt to use any means (shipping hubs, forwarding services, etc.) to circumvent my stated sales terms and conditions, I will terminate the transaction and report the violation to eBay. By bidding, making an offer, or using the Buy it Now option, you agree to abide by the terms stated herein. Normal 0 MicrosoftInternetExplorer4", "ItemID": "183665395055", "EndTime": "2019-02-05T22:46:01.000Z", "StartTime": "2019-02-02T01:00:28.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Jackson-DK2-Dinky-Eerie-Dess-Swirl-Electric-Guitar-/183665395055", "ListingType": "FixedPriceItem", "Location": "Sunny Southern California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1836653950558080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/OTkyWDE2MDA=/z/HuIAAOSw-QxcVOrS/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTEyMFgxNjAw/z/bP8AAOSwyn1cVOrV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU1NVgxNjAw/z/I-cAAOSwBwZcVOrY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAzNlgxNjAw/z/M2gAAOSw5tNcVOra/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/z3IAAOSwptZcVOrc/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODQ4WDE2MDA=/z/YfwAAOSweCpcVOrd/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE0NlgxNjAw/z/-pwAAOSwOmBcVOrf/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjgxWDE2MDA=/z/gcIAAOSwnGVcVOrg/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODcyWDE2MDA=/z/SMQAAOSwJ4hcVO21/$_57.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "sellnem", "FeedbackRatingStar": "Purple", "FeedbackScore": 725, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 599.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 599.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "h***o", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 16}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Jackson DK2 Dinky Eerie Dess Swirl Electric Guitar", "HitCount": 181, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 5, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}