{"BestOfferEnabled": false, "Description": "Twin City GoldCertified diamonds available by:Fine Estate Jewelry, Certified Diamonds & MoreESP LTD EC256FM Electric Guitar, Lemon Drop Right HandedFREE Delivery ConfirmationFREE Standard Shipping on JewelrySatisfaction Guarantee14 Day Return PolicyFREE Jewelry Gift Box ESP LTD EC Series EC-256FM Flamed Maple Top Electric Guitar, Lemon Drop The EC-256FM is the perfect evidence that a great guitar doesn&apos;t have to be prohibitively expensive. A classic shape that&apos;s excellent for all musical styles and genres, the EC-256FM offers features that you normally associate with high-end guitars, like a flamed maple top, binding on the body, neck, and headstock, and set-neck construction for fast and easy access to the highest frets. The EC-256FM also features a mahogany body, a comfortable three-piece thin U-shaped mahogany neck, a rosewood fingerboard with inlays all in good used condition PaymentShipping & TaxesReturn PolicyPaymentShipping & TaxesReturn Policy We accept payment by any of the following methods: PayPal Please pay as soon as possible after winning an auction, as that will allow us to post your item to you sooner! All items with a value in excess of $500 will require a confirmed and eligible PayPal shipping address as well as signature confirmation. We offer FREE shipping on all domestic orders! Your order will be dispatched within 1 business day of receiving payment (Monday-Friday). Expedited shipping is available upon request! Please inquire with location for a price estimate. Maine residents are required to pay Maine State sales tax* International buyers please note that customs charges are your responsiblity. We do not pay customs or import fees. If you are not 100% satisfied with your purchase, you can return the product and get a full refund or exchange. You can return a product for up to 14 days from the date you purchased it. Any product you return must be in the same condition you received it and in the original packaging. Please keep the receipt. Please note we charge a 15% re-stocking fee to cover the costs associated with returnsSee our other itemsESP LTD EC Series EC-256FM Flamed Maple Top Electric Guitar, Lemon Drop The EC-256FM is the perfect evidence that a great guitar doesn&apos;t have to be prohibitively expensive. A classic shape that&apos;s excellent for all musical styles and genres, the EC-256FM offers features that you normally associate with high-end guitars, like a flamed maple top, binding on the body, neck, and headstock, and set-neck construction for fast and easy access to the highest frets. The EC-256FM also features a mahogany body, a comfortable three-piece thin U-shaped mahogany neck, a rosewood fingerboard with inlays all in good used condition Certified diamonds available by:Twin City GoldFine Estate Jewelry, Certified Diamonds & MoreESP LTD EC256FM Electric Guitar, Lemon Drop Right HandedFREE Delivery ConfirmationFREE Standard Shipping on JewelrySatisfaction Guarantee14 Day Return PolicyFREE Jewelry Gift Box ESP LTD EC Series EC-256FM Flamed Maple Top Electric Guitar, Lemon Drop The EC-256FM is the perfect evidence that a great guitar doesn&apos;t have to be prohibitively expensive. A classic shape that&apos;s excellent for all musical styles and genres, the EC-256FM offers features that you normally associate with high-end guitars, like a flamed maple top, binding on the body, neck, and headstock, and set-neck construction for fast and easy access to the highest frets. The EC-256FM also features a mahogany body, a comfortable three-piece thin U-shaped mahogany neck, a rosewood fingerboard with inlays all in good used condition Payment We accept payment by any of the following methods: PayPal Please pay as soon as possible after winning an auction, as that will allow us to post your item to you sooner! All items with a value in excess of $500 will require a confirmed and eligible PayPal shipping address as well as signature confirmation.Shipping & Taxes We offer FREE shipping on all domestic orders! Your order will be dispatched within 1 business day of receiving payment (Monday-Friday). Expedited shipping is available upon request! Please inquire with location for a price estimate. Maine residents are required to pay Maine State sales tax* International buyers please note that customs charges are your responsiblity. We do not pay customs or import fees. Return Policy If you are not 100% satisfied with your purchase, you can return the product and get a full refund or exchange. You can return a product for up to 14 days from the date you purchased it. Any product you return must be in the same condition you received it and in the original packaging. Please keep the receipt. Please note we charge a 15% re-stocking fee to cover the costs associated with returnsSee our other items ESP LTD EC Series EC-256FM Flamed Maple Top Electric Guitar, Lemon Drop The EC-256FM is the perfect evidence that a great guitar doesn&apos;t have to be prohibitively expensive. A classic shape that&apos;s excellent for all musical styles and genres, the EC-256FM offers features that you normally associate with high-end guitars, like a flamed maple top, binding on the body, neck, and headstock, and set-neck construction for fast and easy access to the highest frets. The EC-256FM also features a mahogany body, a comfortable three-piece thin U-shaped mahogany neck, a rosewood fingerboard with inlays all in good used condition", "ItemID": "312282055110", "EndTime": "2018-12-16T06:03:50.000Z", "StartTime": "2018-10-26T18:39:05.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/ESP-LTD-EC256FM-Electric-Guitar-Lemon-Drop-Right-Handed-/312282055110", "ListingType": "FixedPriceItem", "Location": "Biddeford, Maine", "PaymentMethods": ["PayPal", "VisaMC", "Discover", "AmEx"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/3122820551108080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg5MjY=/z/o88AAOSwjatbx15m/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg4NDQ=/z/yG8AAOSwBRVbx15p/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODc1WDE2MDA=/z/8ZMAAOSwcbRbx15r/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNTcw/z/xa0AAOSwv1dbx15x/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzMzWDE2MDA=/z/F4kAAOSw8m5bx150/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODY4WDE2MDA=/z/QscAAOSwufpbx154/$_57.JPG?set_id=8800005007"], "PostalCode": "04005", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "estatejewelry66", "FeedbackRatingStar": "TurquoiseShooting", "FeedbackScore": 47389, "PositiveFeedbackPercent": 99.9}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 249.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 249.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "z***g", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 492}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "ESP LTD EC256FM Electric Guitar, Lemon Drop Right Handed", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["ESP"]}, {"Name": "MPN", "Value": ["EC256"]}]}, "HitCount": 422, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=127992160", "StoreName": "Twin City Gold"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "14 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "SKU": "Z313183", "NewBestOffer": false}