{"BestOfferEnabled": false, "Description": "Fender Telecaster 52 Reissue Butterscotch 6 String Electric Guitar American 2of9 Click images to enlarge Description Described By:Michelle TKSS HFA VX Please Scroll Down for More Images Title:Fender Telecaster 52 Reissue Butterscotch 6 String Electric Guitar American 2of9 Settling Musicians Estate 99 cent Start No Res Description: Fender Telecaster 52 Reissue Circa 2002 Butterscotch 6 String Electric Guitar American. Comes with Tweed Hard case, a Fender strap, a cord, a capo and manuals and tags Acquired from a Musicians Estate. Plays beautifully and in beautiful overall condition! Offered with no reserve! Please take a moment to enlarge and view all the detailed pictures. Check out our other auctions for lovely antiques, fabulous and unique jewelry and wonderful watches! Approx. Dimensions or Size:Guitar measures 38 inches long, 12 inches at widest point, Case measures 41 X 14 X 4 inches Condition:Plays beautifully, no popping or cracking, looks great overall, displays minor wear, outer case displays some minor wear, one closure does not close Hallmarks:Fender Telecaster Pat Pend 61671 Made in USA Estimated weight of piece:Approximately 35 lbs total with Case Estimated size of package:Shipping cost is not included. This item is too large or heavy for us to ship. The item must be picked up at our location by the buyer or buyer's authorized agent. All arrangements for shipping, including preparation, packaging and loading are the responsibility of the buyer. This item may be shipped via UPS by our local UPS Store that picks up at our freight door. They charge for packing and shipping and will bill you separately. You can contact them at (727) 826-6075. Additional Info: If the winning bidder would like to arrange to pick up their item at our store, please notify us by email and we will make the appropriate shipping adjustments. Condition: Used Condition Notes: Fender Telecaster 52 Reissue Circa 2002 Butterscotch 6 String Electric Guitar American. Comes with Tweed Hard case, a Fender strap, a cord, a capo and manuals and tags Acquired from a Musicians Estate. Plays beautifully and in beautiful overall condition! Offered with no reserve! Approx. Dimensions or Size:Guitar measures 38 inches long, 12 inches at widest point, Case measures 41 X 14 X 4 inches Condition:Plays beautifully, no popping or cracking, looks great overall, displays minor wear, outer case displays some minor wear, one closure does not close Hallmarks:Fender Telecaster Pat Pend 61671 Made in USA Estimated weight of piece:Approximately 35 lbs total with Case Payment Paypal Shipping Shipping Options: Domestic shipping: Fixed Shipping Charges. Shipping Carrier Domestic Local Pickup$0.00I will ship to: United States Customer Service Policy: Please note in bidding or buying this auction you are entering into a binding contract. In bidding or buying you are agreeing to all policies stated below and comply with Florida State laws. Sales Tax applies to all Florida sales unless you have a valid dealers license. Please check payment methods prior to bidding. Only the payment method listed in the auction will be accepted. Legal Shipping High value items may require restricted delivery with only the addressee being able to sign for it. * Shipping is calculated by eBay and shown in the auction. * Florida Sales tax applies to all transactions shipped within the State of Florida unless a current valid resale certificate is presented. * The auctions contain only what is described. Do not assume something comes with a used item if it is not stated in the auction verbiage. Many items will be marked with serial numbers or identifying numbers items may not be accepted for return if these numbers are not present. * You can count on us to be factual and have clear accurate photographs which are not \"edited\" to deceive. * Photographs often disclose condition far better than verbiage as many people have different ideas on what terms may mean. * If an identifying mark, inclusion or defect is visible in the images it is considered disclosed to the buyer. * Gold items have been tested with a Kee gold tester M-509GM and tested as stated in the auction. * All Items are shipped insured. If an item has arrived damaged we will require images and a damage affidavit. CUSTOMS AND INTERNATIONAL BIDDER POLICIES International bidders - you are agreeing to the following when you place a bid with us: * If your total purchase including shipping exceeds $200.00 US and you pay with a credit card then your only delivery option is UPS signature delivery. This is because credit cards require both a signature and tracking. * If you pay with PayPal and the total price including shipping is less than $750.00 US then we can ship USPS to most countries. Please contact us with eBay?s message system before you pay for an amended invoice. * The following applies if you are shipping to or from these countries. CANADA, Australia, Belgium, Brazil, Croatia, Denmark, France Germany, Great Britain and Northern Ireland, Israel, Netherlands New Zealand Spain and Switzerland, Estonia, Finland, Gibraltar, Hungary, Italy, Latvia, Lithuania, Luxembourg, Malaysia, Malta, Portugal, and Singapore. We will be able to offer you USPS International shipping if you are paying with PayPal and the item and shipping are less than $750.00 US. We may be able to ship 1st Class USPS International if you are shipping to or from the countries listed above. * If you wish your item sent to a colleague with a US address we are of course willing to do so but the address must be verified with PayPal Credit card company and in the eBay invoice. * We declare all items for the winning bid amount. * It is common for countries to charge some form of customs duties, taxes, VAT, or brokerage fees on items being shipped from the USA. These costs, along with country-specific importing rules and delays caused by customs, are the buyer?s responsibility. * We do not falsify customs documents to assist you in evading your lawful taxes. We reserve the right to notify eBay as well as State and Federal authorities if we receive such requests. * CONTACT US with eBay?s message system before you pay to see if your items can be shipped USPS International. Hess Fine Auctions Hess Fine Auctions can be reached during working hours of 9 to 5 PM EST. Legal Shipping Vendio Images: More than just a pretty image. 250+ Mobile Responsive & Active Content Free Listing Templates with Vendio Sales Manager. Vendio provides powerful selling automation for sellers of all sizes. Get business information that counts! - Vendio Counters are active content free. On Feb-25-19 at 09:02:01 PST, seller added the following information:", "ItemID": "333086280183", "EndTime": "2019-02-28T21:16:05.000Z", "StartTime": "2019-02-21T21:16:05.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fender-Telecaster-52-Reissue-Butterscotch-6-String-Electric-Guitar-American-2of9-/333086280183", "ListingType": "Chinese", "Location": "Saint Petersburg, Florida", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/3330862801838080_2.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA2M1gxNjAw/z/rwEAAOSwq4xcbxVT/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIyMFgxNjAw/z/QrQAAOSwT9hcbxVV/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/uUsAAOSwWB5cbxVW/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjI2/z/mtUAAOSwzOxcbxVY/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzEwWDE2MDA=/z/0NcAAOSwaRBcbxVa/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTAxWDE2MDA=/z/UcQAAOSw32lcbxVc/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNDg5/z/OlEAAOSwohVcbxVe/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg2MzA=/z/nSUAAOSw1vxcbxVg/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NTYxWDE2MDA=/z/aWMAAOSwcY5cbxVi/$_12.JPG?set_id=880000500F"], "PostalCode": "33701", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "hessfineauctions", "FeedbackRatingStar": "RedShooting", "FeedbackScore": 115297, "PositiveFeedbackPercent": 99.6, "TopRatedSeller": true}, "BidCount": 67, "ConvertedCurrentPrice": {"Value": 1400.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1400.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "h***i", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 512}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["None"], "Site": "US", "TimeLeft": "PT0S", "Title": "Fender Telecaster 52 Reissue Butterscotch 6 String Electric Guitar American 2of9", "ItemSpecifics": {"NameValueList": [{"Name": "Model Year", "Value": ["2002"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Brand", "Value": ["Fender"]}, {"Name": "Model", "Value": ["52 Telecaster Reissue"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "MPN", "Value": ["Does not apply"]}]}, "HitCount": 2035, "Subtitle": "Settling Musicians Estate  99 cent Start No Res", "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1113285", "StoreName": "Hess Fine Arts"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 1425.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Fender Telecaster 52 Reissue Circa 2002 Butterscotch 6 String Electric Guitar American. Comes with Tweed Hard case, a Fender strap, a cord, a capo and manuals and tags Acquired from a Musicians Estate. Plays beautifully and in beautiful overall condition! Offered with no reserve! Approx. Dimensions or Size:\t\tGuitar measures 38 ½ inches long, 12 ¾ inches at widest point, Case measures 41 ¼ X 14 ¼ X 4 ¼ inches\nCondition:\t\tPlays beautifully, no popping or cracking, looks great overall, displays minor wear, outer case displays some minor wear, one closure does not close\nHallmarks:\t\tFender Telecaster  Pat Pend 61671 Made in USA\nEstimated weight of piece:\t\tApproximately 35 lbs total with Case", "QuantitySoldByPickupInStore": 0, "SKU": "HFA VX MM999", "NewBestOffer": false}