{"BestOfferEnabled": true, "Description": "Jackson DK2M White Bengal Limited Run from 2007 MADE IN JAPAN. This guitar is in very very good condition but not absolutely mint. It has the EMG 81/85 pickups with the EMG solderless kit (the pickup selector is standard wiring). The frets are like new. They are polished and beautiful. The hardware shows very minimal wear. The neck is straight and shows barely any wear. The guitar plays great. The protective plastic is still on the back of the tuners. The few minor blemishes that I noticed include a mark on one of the black fretboard shark fin markers (pictured), a small ding on the back near the tremolo spring cavity cover (pictured), and a tiny finish crack in the neck pocket (pictured). It has some very minor marks in the clear hear and there but they are the kind that you have to tip in the light just right to see. There are also a few very minor scratches on the back but again they are not deep and are only in the clear coat. I also noticed a very small mark of the upper edge which can be seen in the pic of the upper edge of the guitar to the right side of the pic. It is small but I'm trying to mention everything I saw. That said, what it does not have is much in the way of swirl marks. The finish is very highly polished and VERY clean. I noticed that the tremolo spring cavity cover has a corner crack in the plastic at the corner screw hole. This is very common and is merely cosmetic. Overall I would consider this guitar a 9 out of 10 but ratings are subjective so please use the pics and description to judge if it is up to your standards or not and make offers/purchase accordingly. It will ship in a Jackson Hard shell case that has typical wear, some marks etc. and one of the little feet has been re-affixed as shown in the pic. but all latches are good and case is fully functional. I do not have the keys to the case so they are not included. This guitar is one of the cleanest used guitars I've owned. SPECS: White Bengal Custom Graphics Limited productionAlder bodyMade in JapanRock maple bolt-on neckBound Maple compound-radius fingerboardEMG 81 Bridge PickupEMG 85 Neck Pickup24 Jumbo fretsSharkfin inlaysBlack hardwareSealed die-cast tunersFloyd Rose Licensed Jackson Low Profile JT580 LP double-locking 2-Point Tremolo Scale length: 25.5 in. Width at nut: 1-11/16 in. If you have any questions please make sure they are answered before you bid, buy, or make an offer. Immediate payment is required for buy it now. If your best offer is accepted, payment is to be made within 24 hours. Item is sold as is. All sales are final. No returns. Item will be insured for at least the purchase price. As this is a used guitar and I am not the original owner, I cannot guarantee that all parts are original/factory stock. This item is offered to those buyers/bidders in the contiguous US Only. Sorry no APO/FPO/DPO. Signature will be required upon delivery. Will ship to confirmed Paypal addresses only. I usually ship via FedEx but reserve the right to use an alternate shipper solely at my discretion. If FedEx cannot deliver to your confirmed paypal address, you are not allowed to bid, make an offer, or use the buy it now option. It is your responsibility to determine if FedEx can or cannot deliver to your confirmed paypal address BEFORE bidding, making an offer, or using the Buy it Now option. If you are outside the contiguous U.S. and/or attempt to use any means (shipping hubs, forwarding services, etc.) to circumvent my stated sales terms and conditions, I will terminate the transaction and report the violation to eBay. By bidding, making an offer, or using the Buy it Now option, you agree to abide by the terms stated herein. Normal 0 MicrosoftInternetExplorer4", "ItemID": "183582931788", "EndTime": "2018-12-25T19:26:37.000Z", "StartTime": "2018-12-13T02:25:09.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Jackson-Dinky-DK2M-White-Bengal-Limited-Run-/183582931788", "ListingType": "FixedPriceItem", "Location": "Sunny Southern California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1835829317888080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA0NFgxNjAw/z/sZ8AAOSwySZcEcEz/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjYzWDE2MDA=/z/s-kAAOSwSVNcEcE0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/Eg4AAOSw~bhcEcE2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAxMVgxNjAw/z/lWMAAOSwP8dcEcE3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTMyMVgxNjAw/z/oewAAOSwJ3RcEcE5/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/ToIAAOSwj-RcEcE8/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODkyWDE2MDA=/z/pQQAAOSwJ~xcEcE-/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTcyWDE2MDA=/z/yGgAAOSwIUVcEcE~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjg2/z/~2IAAOSwQqZcEcFB/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTY5WDE2MDA=/z/yYUAAOSw4VpcEcFC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/D~0AAOSwC85cEcFE/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI0MlgxNjAw/z/c0kAAOSwAEFcGv3Z/$_57.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "sellnem", "FeedbackRatingStar": "Purple", "FeedbackScore": 724, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 799.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 799.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "0***n", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 335}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Jackson Dinky DK2M White Bengal Limited Run", "HitCount": 330, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 5, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}