{"BestOfferEnabled": false, "Description": "Washburn HB-45 Pearl White Semi-Hollow Electric Christmas is over and I've got bills to pay, so I'm thinning out my guitars to pay those credit cards! I bough this Washburn HB-45WHK a few years ago (2015), it's in excellent condition, looks & plays great. The white finish with black trim and gold hardware makes this a really classy, eye-catching guitar. Includes gold Schaller strap locks and a Washburn hardshell case. Here are some more photos: Here's what \"Guitar Player\" magazine had to say about this guitar (this review is what turned me on to this guitar in the first place): If you’re like me, when you see a semi-hollow guitar with no f-holes, you think B.B. King’s Lucille. That conjures up tones that are bluesy but ballsy, with throaty midrange and sweet, singing sustain and musical but controllable feedback. The Washburn HB-45 you see here delivers on all fronts. At the risk of spoiling the ending, it is a beautiful looking, smooth playing guitar that intonates like a dream. There is elegance and then there is “black-tie formal” elegance, and the HB-45 resides comfortably in the latter category. The tuxedo-grade white finish with tasteful black appointments is an instant classic. The gold hardware only accentuates this vibe and, miraculously, does not take it into gaudy-land. It just looks gorgeous, but it would not be out of place on a sweaty bar gig. Nice. The whole package simultaneously screams class and quality as well as solid dependability. In my entire collection I don’t own a single white guitar, but I want one now.This guitar has a loud acoustic strum that belies its lack of f-holes. It feels big and resonant. The playing feel is silky smooth. The frets are polished and the action is low and easy. Big bends fret out just a bit acoustically, but overall the HB-45 plays great. Personally I go for a slightly chunkier neck—the HB-45’s is on the slim side—but that’s a minor point.Amplified, there are no surprises with this guitar. It gives you everything you would expect from a two-humbucker guitar with a 3-way switch. The Washburn humbuckers have a medium output and good detail. The HB excels at bluesy single-note lines and double-stops, especially if you ride the Volume knob B.B.-style. You can also get great jazz and fusion tones on the neck pickup or by blending the two—and, on that subject, these pickups do play very nicely together in the middle position, with lots of musical sounds to be found. What I like best about this Washburn, though, is the gorgeous feedback that it produces so easily. At even mellow volumes I was able to get notes to sing in an awesome, “Europa” fashion.Part of the HB’s tonal sweetness undoubtedly stems from the fact that it intonates so well. Washburn was the first major manufacturer to adopt the Buzz Feiten Tuning System, and although this guitar does not feature that system, it definitely reflects Washburn’s awareness of and commitment to playing in tune. Complex chords, played with distortion way up the neck sound beautiful, with nice overtones and zero garbled harshness. Bravo!This is a tremendous amount of guitar for the money. It’s got eye-catching cosmetics, excellent tones, and solid construction. Blues cats and jazzers—not to mention rockers and punkers too—owe it to themselves to plug one of these in.SPECS:Maple Top, Back and Sides Pearl/Abalone Split Block Inlays Graphtech Nubone Nut NUT WIDTH: 1 11/16\" NECK: Maple FRETBOARD: Rosewood 24 3/4\" scale FRETS: 22 TUNERS: Gold Grover Exclusive 18:1 BRIDGE: Tune-o-matic PICKUPS: Dual Washburn Humbuckers CONTROLS: Two Volume, two Tone, 3-way toggle Includes Schaller strap-locks and hardshell case. Buyer pays all shipping costs ($35.00 to ship within the continental U.S.). All Sales Final - No Returns.", "ItemID": "113576758905", "EndTime": "2019-01-28T01:00:12.000Z", "StartTime": "2019-01-23T01:00:12.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Washburn-HB-45-Pearl-White-w-Hardshell-Case-HB-45WHK-/113576758905", "ListingType": "Chinese", "Location": "Hillsboro, New Hampshire", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1135767589058080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg5NjA=/z/7x8AAOSwCNlcQ3WX/$_57.JPG?set_id=8800005007"], "PostalCode": "03244", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "bradpage", "FeedbackRatingStar": "Purple", "FeedbackScore": 795, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 349.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 349.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "t***r", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 517}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Washburn HB-45 - Pearl White - w/Hardshell Case - HB-45WHK", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Washburn"]}, {"Name": "MPN", "Value": ["HB-45WHK"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Material", "Value": ["Maple"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Body Type", "Value": ["Semi-Hollow"]}, {"Name": "Body Color", "Value": ["White"]}, {"Name": "Model", "Value": ["HB-45WHK"]}, {"Name": "Size", "Value": ["Full Size"]}, {"Name": "Country/Region of Manufacture", "Value": ["China"]}, {"Name": "Model Year", "Value": ["2015"]}]}, "HitCount": 50, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 354.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Middle East"], "GlobalShipping": false, "ConditionDescription": "Used, in excellent condition.  Includes hardshell Washburn case", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}