{"BestOfferEnabled": true, "Description": "Peavey Predator Strat '94 era Authentic Made in USA, Super neck, NICE Road runner Gig Case and matching quality Wayco padded Strap. Very Good pickups* and a tech set up. Very good condition tho some Scratches and nicks THIS IS A VERY GOOD ONE! If looking at description for this Peavey you probably are familiar with the rising cult status of this EXACT model guitar. OR you are an aspiring player who heard these were better than an import and a great deal IF you haven't already JUST Google then weigh my opinion I BUCK trends! That's got nothing to do with E-bay but I have been buying, modifying or at least swapping parts, and playing mostly solid body strat type guitars for over 40 years! Most everything you read on chat rooms is BS and ill informed opinion stated as biased fact!READ actual guitar techs interviews who service pro's Guitars like J.Beck and the like, or actual setup guides from the guitar or parts manufacturers. Having had my say I now am rendering the opinion/Declaration \"THESE ARE ACTUALLY BETTER THAN HYPED!\" If you don't buy mine find one for $150 and go through it, use it as a canvas to upgrade and modify to your likes but YOU don't need to! Stock with a set up these play GREAT and Stay in tune as well as any non=locking Fender type Trem and IMHO these tuning machines hold quite well, course NOT as secure or smooth or convenient as say Gotoh or Scheller Locking tuners.They are NOT junk! One person says it, and they don't look contemporary, YET are a lot tougher and better than the inline Kluson's on a $2300 USA 60s-70s Replica Strat! *The Pick ups? to me sound more that 60-80s ceramic magnet heavy pre metal ZEp Groundhogs and EC then what most people replace them with! That however IS subjective I am NOT trying create an Ebay debate. ON value the electric NEW guitar industry IS in trouble! I think the millions of imports stored in attics are surfacing on online sites and frankly some are darn well crafted!I just sold MOST of my Godin Collection for about 35% less than would have last year.YET, These old Peaveys are rising in Price says a lot. Now, This guitar, I set up, and the trem floats as well as an Earlier American strat! You can get about 2 steps sharp on most strings and 3 down (approx) I THINK the Bridge on these IS an improvement over the org. HP knew well what he was doing by eliminating the even screw spacing, the saddles are quality and I machine oiled ALL the tiny adjustment screws etc. they are all smooth and well chromed evenly not overly thick. It does stay in tune for lengths of playing time. Again, like an American 90s strat NOT like an Pivoted upgrade with locking tuners, and an roller nut!The Neck (some claim these among BEST ever made) is pretty much a 9 no pea dents or any real fret wear, dead even, solid as a rock and fits superbly in neck cavity which has NO cracks. Has had an tree upgrade and now has 2 high quality guides. These have the tilt adjustment and I've never used it the allen key engages and tightens. I just reset and evenly torqued the neck plate. Good set of 9's medium height and radius-ed adjusted saddles.The body is medium weight solid Alder or Basswood and VERY thin painted. Which is a big sound plus but very easily scratched. No big dents or even deep scuffs I painted in several little surface dings with white out, the thing is. Get matching nail polish and in an hour with a steady hand can bring these painted bodies back to new!Darn GOOD pots and selector 5 way switch after 20 years they don't crackle or hiss and the jack smooth and secure holding of even a heavy cable. The pickguard tho hardly scuffed has a bit of warpage between some screws and rises a bit as you can see can remove heat and flatten but Why?Instrument will be sent securely packed in the like new Road runner gig case with tuning dropped a bit. Tune and play Its set up a bit high as a strat should be can lowered with no buzzing but give MY setup a try. Season's Greetings! Please respect a few buyer guidelines if item is a Binow payment will be required immediately. If I agree to your offer I expect terms to be rendered at that time. Mainly though am getting a few non-payment after an auction. This creates issues. I simply will herein be re-listing after two days if I don't have definite validation as to why and re-commitment for the next day.", "ItemID": "283312352858", "EndTime": "2018-12-22T15:24:21.000Z", "StartTime": "2018-12-21T17:49:53.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Peavey-Predator-Strat-90s-Authentic-Mn-USA-Super-neck-Pus-set-up-RRunner-Case-/283312352858", "ListingType": "Chinese", "Location": "Cape May, New Jersey", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2833123528588080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/ODg1WDE1ODQ=/z/qlgAAOSw8iZcHSX-/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/EZEAAOSwmOBcHST6/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/C7wAAOSwwXRcHSUT/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/iuAAAOSwxZxcHSUK/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/h4AAAOSwqxdcHSUM/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/qwgAAOSw-2hcHSUO/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/0YQAAOSwoDFcHSUF/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/~6cAAOSw-HRcHSUE/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/GZAAAOSwXGRcHST-/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/VVEAAOSwUVFcHSUB/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/QNEAAOSwlLlcHSUI/$_57.JPG?set_id=880000500F"], "PostalCode": "08204", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "wmcflamecrafts", "FeedbackRatingStar": "Purple", "FeedbackScore": 804, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 245.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 245.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "i***r", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 154}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Peavey Predator Strat 90s Authentic M'n USA Super neck Pu's set up, RRunner Case", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Peavey"]}, {"Name": "Model Year", "Value": ["1995 ish"]}, {"Name": "Model", "Value": ["Predator USA made"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Soundboard Style", "Value": ["Flat Top"]}, {"Name": "Bundle Description", "Value": ["Road Runner Gig Case and matching strap"]}, {"Name": "Tech Setup", "Value": ["excellent playability"]}, {"Name": "A Super neck", "Value": ["Plays great"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "Features", "Value": ["Volume Knob", "With Pickup"]}, {"Name": "Body Material", "Value": ["Alder", "Basswood"]}, {"Name": "Product Line", "Value": ["American Standard"]}, {"Name": "Custom Bundle", "Value": ["Yes"]}, {"Name": "String Configuration", "Value": ["5 String"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Size", "Value": ["Full Size"]}]}, "HitCount": 96, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1244260676", "StoreName": "Torchkid&#39;s Pyro Figures"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 247.5, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "USA Made Strat style Peavey Guitar. Very Good Condition overall . Well maintained and tremelo Set-up", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}