{"BestOfferEnabled": false, "Description": "At top 40 guitarsour customers satisfaction is our first concern.All of out items have a 14 day return policy.If after 14 days you are not completely satisfiedwith your purchase, please return it for a full refund....Peace be with you... *all returned items must be in the same condition theywere at the time of sale. All original packing must be included. #Up for Sale is a 2018 Supro Martinique 1593VEW Guitar! Ermine White Finish! “Acousti-Glass” top!2018 NAMM Show Display Model!Top 40 Guitars a factory authorized Supro dealer, purchased the display models from the 2018 NAMM Music Trade Show held in Anaheim, CA. USA. These were models hanging on the wall of their display for the 4-day show from January 25-28, 2018. Some of these guitars may have been played and handled during the event. Some were never even touched. I am selling these as used guitars. They have never been sold, just been on display at the show. They still have the Factory Warranty from Supro. They still have the plastic film on the pickguard. We were able to make a below market purchase on these guitars and we are passing the savings on to you! Not a Second or Refurbished guitar. A brand New guitar that was just on display for 4-days and than sent to Top 40 Guitars! This is really cool. You are looking at a 2018 Supro Martinique 1593VEW Guitar. All the Vintage Vibe in a Modern Guitar! Based on Supro’s vintage res-o-glass guitar designs, the Supro Americana Series Martinique semi-hollow electric guitar combines the best of vintage appeal with modern craftsmanship. The semi-hollow mahogany back is topped with Acousti-glass, creating a swampy tone that loves distortion. A Vistatone pickup and ’50s wiring deliver the iconic sound that put Supro on the map. From The Web:Historic Reissue The Martinique is a reproduction of the top-of-the-line, piezo-equipped fiberglass Supro electric guitar that was manufactured in the early 1960s. The Martinique reissue mates a chambered body with a newly developed, composite “Acousti-glass” top. This updated construction preserves the instrument’s Art Deco aesthetics as well as the signature blend of piezo and magnetic pickups, while improving its semi-hollow acoustic resonance and tuning stability. The Martinique’s vintage-correct tuners, Art Deco stairstep tailpiece and adjustable, piezo-equipped rosewood bridge are joined by a faithful replica of the legendary Vistatone pickup to bring you a fully realized and worthy reissue of this classic Supro guitar. Vistatone Pickups The Vistatone pickups found in the Supro Martinique are a reproduction of the groundbreaking, single-coil design developed for Valco by Ralph Keller in the early 1950s. The Vistatone pickup is cited as prior art in Seth Lover’s PAF patent and is found in many of the most desirable vintage Supro models. Legendary Sound The Supro Martinique is acoustically resonant, and this voice translates through the bridge-mounted piezo pickup, which can be used independently or blended with the magnetic Vistatone pickups with a 50’s-wired master volume. This allows for precision volume control without disturbing the blend of the piezo and magnetic pickups. With its wide body and arsenal of vintage pickups, the Martinique is more versatile and potent than any other Supro guitar model. The neck pickup sounds huge and wooly, while the bridge pickup has an unmistakable midrange growl that is downright dirty. Blending these sounds with the piezo bridge output creates tones unlike any other instrument on the market. Our semi-hollow recipe of an Acousti-glass top and semi-hollow body retains the unique sonic characteristics of the original piezo-equipped Supro Martinique guitar, while providing today’s musicians with a lightweight, highly playable instrument that stays in tune and is easy to maintain.Features:Vintage Supro body designErmine White finishRe-designed two-bolt neck jointVintage-correct Vistatone pickupsPiezo-equipped rosewood bridgeVolume and tone control for each pickupRosewood bridgeArt Deco stairstep tailpieceAcousti-glass topSemi-hollow mahogany backMahogany neck with dot inlays24 ¾” scale Our luthier did a complete setup. Brand new strings were installed. Gig ready on Arrival! Serial Number: #CM16101213 Weight: 7.75 lbs. Case is NOT Included Due to CITES Treaty for Endangered Wood (Mahogany, Rosewood) We no longer ship out of the USA. Cosmetics: Excellent Condition. Pristine. Dripping with \"Mojo\". It is used. Not perfect. Overall, a really nice guitar. Look at the pictures closely. They will tell the story. Top 40 guitars is a Veteran owned business.", "ItemID": "392159515862", "EndTime": "2018-11-05T01:05:55.000Z", "StartTime": "2018-10-29T01:05:55.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2018-Supro-Martinique-1593VEW-NAMM-Show-Display-Model-MINTY-NO-RESERVE-/392159515862", "ListingType": "Chinese", "Location": "Santee, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/3921595158628080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NjQ2WDQ5Ng==/z/VEEAAOSwCH9bc17v/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQyOFgxMDgx/z/kRkAAOSwTYNbc18s/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQyOFg2OTA=/z/YD0AAOSw1Hpbc16W/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/HcwAAOSwY1xbc10O/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzI1WDU5Mw==/z/L-YAAOSw4SRbc1zy/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU4Nlg2MDY=/z/dqsAAOSwbpBbc13H/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTM4MFg4MDg=/z/ZS4AAOSwkP1bc15s/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ1OVgxMDI0/z/jKoAAOSwNxlbc138/$_57.JPG?set_id=8800005007"], "PostalCode": "92071", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "top40powertrio", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 13196, "PositiveFeedbackPercent": 99.7}, "BidCount": 36, "ConvertedCurrentPrice": {"Value": 554.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 554.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "m***7", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1108}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2018 Supro Martinique 1593VEW! NAMM Show Display Model! MINTY! NO RESERVE!!!!!! ", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Ermine White Finish"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Martinique 1593VEW"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["2018"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Brand", "Value": ["Supro"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}, {"Name": "Body Type", "Value": ["Semi-Hollow"]}]}, "HitCount": 364, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=47416021", "StoreName": "Top 40 Guitars"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 564.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "2018 Supro Martinique 1593VEW, Excellent Condition, See ad below for Full Description", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}