{"BestOfferEnabled": true, "Description": "Very nice 2014 Les Paul TPII in excellent condition and very little play time. The guitar shows only minor play-wear with minor swirl and finish wear. Really nice flame maple top. No dings, gouges or deep scratches on the entire guitar except one minor blemish on the lower left side of the back of the headstock, which is barely noticeable (see photo). The clear plastic is still on the pickguard. Zero fretwear, low action and great playability. In my opinion these Traditional pro II's are the best value in the Gibson Les Paul stable. From Gibson: A gigging musician's Trad Pro II with '60s slim-tapered neck, coil-split humbuckers, boost circuit and an exclusive finish Taking design and visual cues from the Les Pauls of the '80s and '90s, the Les Paul Traditional Pro II features powerful pickups with push/push for coil splits and boost circuit, '60s neck profile, Grover locking tuners, antique binding, period-correct pickguard, vintage Gibson top hat knobs, and the revolutionary Plek set up. With all the fat, sweet, snarling Les Paul tone that purists love, the new Gibson Les Paul Standard Traditional Pro II sports a mahogany body with a thick maple cap for the perfect blend of warmth and clarity. The top is finished in high-gloss lacquer, while the back, sides, and neck have a smooth satin finish that feels great and lets the wood resonate full. Includes original Gibson hard case. Period-Correct Pickguard The creme-colored pickguard has been a Les Paul staple dating back to the models of the late 1950s and the early 1960s. Many players, however, removed the pickguard from their Les Pauls to show off the beauty of the flame maple tops, prompting Gibson to stop installing the pickguard altogether. During the 1980s and 1990s, Gibson began reinstalling the pickguard in the factory, and the Les Pauls from this era once again arrived in stores bearing the classic, creme-colored pickguard. The Les Paul Traditional comes equipped with a period-correct pickguard, designed to protect the maple top. Pickups: Neck - '57 Classic; Bridge - Super '57 Among the qualities that make Gibson's original \"Patent Applied For\" humbucking pickups so unique are the subtle variations between coil windings. For the first few years of their productions”1955 to 1961”Gibson's PAF humbuckers were wound using imprecise machines, resulting in pickups with slightly different output and tone. The '57 Classic and Super '57 pickups are the result of Gibson's drive to capture and recreate this characteristic. Introduced in 1992, the '57 Classic at the neck provides warm, full tone with a balanced response, packing that classic Gibson PAF humbucker crunch, inspired by those original PAFs that received a few extra turns of wire. The Super '57 bridge pickup debuts in the Trad Pro with a wider frequency response and increased output. Both are made by Gibson to the exact same specs as the original PAFs, including Alnico II magnets, nickel-plated pole pieces, nickel slugs, maple spacers, and vintage-style, 2-conductor braided wiring. Gibson added poly-coated wiring, which improves consistency by eliminating thick or thin spots on the wiring, and wax potting, which removes all internal air space and any chance of microphonic feedback. Both pickups offer coil splitting for single-coil sounds and a boost circuit via push/push switching in the volume controls. œStraight Split coil-splitting offers pure single coil tone and differs from LP Standards and Studios that have a œSuper Tap coil-tap, which still has a small amount of humbucking. The boost circuit has a user-adjustable 10-dB boost for added power and frequency range for solos, single-note picking and dirty chording (depending on amp settings) and features true bypass that disengages the boost completely, ensuring pure passive Les Paul tone. Revolutionary Plek Set Up The Les Paul Traditional is the first model from Gibson USA to utilize the revolutionary Plek machine in setting up the guitar. The Plek is a German-made, computer-controlled machine that carefully measures each fret, along with the fingerboard height under each string, and then automatically dresses each fret, virtually eliminating string buzz and greatly improving the overall playability of the guitar. This pioneering process does in minutes what it takes a luthier several hours”sometimes even days”to accomplish. Every fret is accurately aligned, and the guitar is properly intonated, leaving the instrument \"Plek'd\" and amazingly playable. Antique Binding To see the process of putting the binding on the Les Paul Traditional is to really appreciate the effort and attention that Gibson puts into each instrument. A lone craftsman will carefully glue and fit 2 pieces of binding around the entire body of a Les Paul. He then winds a single, very long piece of narrow cloth around the entire body until the entire surface is nearly covered. The body is then hung to dry for a full 24 hours before it is unwrapped and moved into the next phase of production. It has been done the same way for over 100 years. Some question the value of adding binding, but Gibson believes it is a fundamental part of our rich guitar-making history. The binding adds elegance to the Les Paul Standard, and helps protect the edges of the body. The neck binding is installed over the fret ends, which eliminates sharp fret edges and provides for a smooth neck and easier playability. FEATURES Exclusive to Musician's Friend finish A user-adjustable 10-dB boost for added power and frequency range for solos, single-note picking and dirty chording (depending on amp settings) True bypass: disengaging boost completely removes active circuit, ensuring pure passive Les Paul tone New Super ™57 bridge pickup debuts in the Trad Pro; wider frequency response, increased output Easy-to-use push/push pots engage coil-splits and boost circuit œStraight Split coil-splitting offers pure single coil tone Locking Grover tuners, satin-finished back and sides Includes case Own an exclusive Les Paul that combines vintage and and modern styles. Order today. SPECIFICATIONS Body: Mahogany Top: Carved maple Back: Mahogany Neck: Set mahogany Neck Profile: '60s Headstock: Angled Scale length: 24-3/4\" Fingerboard: Bound Rosewood No. of frets: 22 Nut width: 1.69\" Inlays: Trapezoid Binding: Antique Bridge: Tune-o-matic with stopbar tailpiece Tuners: Locking Grover Hardware: Chrome Bridge pickup: Super 57 humbucker with push/push coil-splitting Neck Pickup: '57 Classic with push/push coil-splitting Electronics: 2 volume with push/push coil-splitting, 2 tone (1 with push/push to activate boost), 3-way toggle pickup selector Knobs: Vintage Gibson top hats Pickguard: Period-correct Case: Hardshell Other: Plek setup", "ItemID": "323592999432", "EndTime": "2018-12-11T01:55:47.000Z", "StartTime": "2018-12-11T01:18:04.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-Les-Paul-Traditional-Pro-II-Flame-Top-/323592999432", "ListingType": "Chinese", "Location": "Ashburn, Virginia", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/3235929994328080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/Hh0AAOSwH2VcDwwi/$_57.PNG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/HcIAAOSw-QBcDwwP/$_57.PNG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/LEYAAOSwjwZcDwzB/$_57.PNG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/~a4AAOSw5-hcDwyJ/$_57.PNG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/eIYAAOSwIbtcDwye/$_57.PNG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/B4EAAOSwsDZcDwxm/$_57.PNG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/CAwAAOSwmXpcDwwz/$_57.PNG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/iu4AAOSwhu9cDwxD/$_57.PNG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/CPQAAOSwn6JcDwxV/$_57.PNG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/M00AAOSw8OFcDwx3/$_57.PNG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/IrQAAOSwpTBcDw0C/$_57.PNG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/BNwAAOSw3bZcDwyw/$_57.PNG?set_id=8800005007"], "PostalCode": "20147", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "giordanojared2013", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 285, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 1099.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1099.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "t***i", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 121}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson Les Paul Traditional Pro II Flame Top", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Model", "Value": ["Les Paul Traditional Pro"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Color", "Value": ["Flame"]}, {"Name": "Body Material", "Value": ["Mahogany"]}, {"Name": "Features", "Value": ["Coil split and boost"]}, {"Name": "Model Year", "Value": ["2014"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Size", "Value": ["Full Size"]}, {"Name": "Product Line", "Value": ["Gibson Les Paul"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}]}, "HitCount": 9, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 1124.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Excellent condition.  See details for full description.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}