{"BestOfferEnabled": true, "Description": "PLEASE READ THE ENTIRE DESCRIPTION TO ENSURE COMPLETE COMPREHENSION OF LISTING. The exact item(s) and description(s) are listed as follows:~ FREE SHIPPING ~- Up for sale is a USED Jericho Guitars, Elite 6 NT Baritone Scale (27\" inch) Electric Guitar, in Transparent Black. This baritone guitar is for RH right-handed players, and comes with a near mint Gator Hardshell Case. This guitar is in excellent, 100% functioning condition. It is VERY CLEAN (recently thoroughly cleaned!) and was kept in a clean, properly humidified, smoke-free, pet-free environment.- This Elite 6 NT Baritone Guitar is is near mint condition. It has been strung with New GHS Custom Shop 14-70 Baritone Guitar Strings. With it's open pore design, all of the wood is fairly exposed to the elements, so knicks, marks, dings, dents, blemishes and scratches will all show up more easily, if they happen. The only cosmetic flaws I could find, besides all the manufacturer marks within and underneath the finish of the open pore design, were: there are some wear marks on the back of the headstock, where different tuners were used. The tuners had different screw hole placement, but no screws or holes were ever drilled into the wood, just marks from tightening the tuners down. There are some mark and scratches on the electronics cavity cover, though it still has it's plastic protective film on it. There are some very small scratches and slight wear marks on the top/ face of the guitar, and some on the back, but they really don't show up in pictures. These are all from playing and from using the guitar, which was mostly lightly played and used. - There is no strap included with the guitar, however there is a near mint Gator Hardshell Case that the guitar comes in, with locking keys (not shown in pictures), and this case is clean inside and has very, very minimal wear on it. - This Elite 6 NT Baritone originally came with a 5-way blade switch and just 1 volume pot/ knob. The electronics have been replaced (upgraded) to a Mad Hatter solderless 3-way blade switch and a 500K stacked volume/ tone pot, so you get both in one knob. I will include the original switch and pot with this guitar (SEE PIC #2). - The pickups have been replaced with Seymour Duncan Mark Holcomb's Signature Alpha/ Omega 6 String Humbucker Pickup Set- Alpha in the neck position/ Omega in the bridge position, which I will also include the Seymour Duncan case and SD's wiring instructions with this guitar (SEE PIC #2). The guitar's current pickup setup are the direct mount type, and the foam underneath the pickups is not the best foam to use, so you may want to install some better foam, I did not have the ideal type, however they function decently well, and the direct mount screws are stainless steel. - The sound of this guitar with the current pickups in it, is exactly like Jericho Guitars describes it; glassy cleans, with excellent sustain, and superb presence. When this guitar is overdriven, the sounds are angry, snarly, growly, and very aggressive, a bit of a scooped mid's sound. It is definitely a sound and playability all in its own. The body is thinner, and lighter than many baritone guitars I've played, and the wenge neck is slick, not too thin or wide, and feels super comfortable. There is very little to no fretwear on these stainless steel frets, and the hipshot locking tuners, the graphtech TUSQ nut, the hipshot bridge, and the neck-thru, string-thru design really contribute to all of the tonal qualities of this guitar. It really is quite unique on it's own. Here are the specs from Jericho, besides the pickups and electronics I installed: Hipshot Fixed Bridge, 24 Stainless Steel Frets, Hipshot Locking Tuners, Open-Pore Finish, Wenge / Maple 5-Piece Neck-Through Construction, Ash Body, Transparent Black Maple Top, Ebony Fretboard and Bound Neck & Body Scale: 27″Top: Flamed MapleRadius: 17″Frets: 24 Stainless Steel FretsNut Width: 1 11/16″Body: AshNeck: Wenge/Maple 5-PieceConstruction: Neck Through (Wenge/Maple/Wenge/Walnut/Wenge)Pickups: Seymour Duncan Alpha/ Omega, Mark Holcomb's Signature 6 String Humbucker SetTuners: Black Hipshot Locking w/Gold ThumbscrewsBridge: Hipshot FixedFinish: Open-Pore - The guitar is currently set-up to tune to Standard \"B\" tuning (B E A D F# B). It could use a new set-up based on player's preference. PLEASE ASK ALL QUESTIONS BEFORE BIDDING OR BUYING!!! ALL OF THESE ITEMS ARE PACKAGED EXTRA SECURELY. - You can research these parts and items online, and find out almost everything you would need to know about them. - If interested, please look at my other items for sale, in my other listings. Thank you. RECAP: All USED items included in this package: - (1) Jericho Guitars, Elite 6 NT Transparent Black Baritone Scale (27\" inch) Electric Guitar, with Gator Hardshell Case included (SEE PICS AND DESCRIPTION). ALREADY PACKAGED SECURELY AND READY TO SHIP. THIS ENTIRE PACKAGE IS SOLD AS-IS WITH NO RETURNS. PLEASE CONTACT ME ASAP, IF YOU HAVE ANY QUESTIONS OR CONCERNS AFTER RECEIVING THIS ITEM, BEFORE CONTACTING E-BAY. ALL ITEMS SHOWN IN PICTURES ARE THE EXACT ITEMS YOU WILL RECEIVE IN THIS PACKAGE. THERE ARE NO RETURNS. ALL ITEMS ARE CLEAN, AND IN THE CONDITIONS AS BEST DESCRIBED. I TRY TO THOROUGHLY DESCRIBE ALL OF MY ITEMS SO THAT YOU KNOW EXACTLY WHAT YOU'RE GETTING, AND WHAT CONDITIONS EACH OF THE ITEMS ARE IN. I ENJOY BUYING ITEMS ON EBAY AND APPRECIATE THE SAME QUALITY DESCRIPTIONS FOR THE ITEMS THAT I AM BUYING, THAT I GIVE FOR MY ITEMS SELLING. I take care of and clean all of my equipment. Please ask all questions before bidding. Please pay with PAYPAL only, and before 72 hours after winning bid. No International or Canadian/ Mexican Bidders please. Look at my E-BAY Ratings/ Feedback and BID WITH CONFIDENCE! Will always package securely and ship promptly. Will ship to all 48 states within the USA only. If another payment method is requested, any info is requested, or any other pictures are requested, please contact me before bidding or buying. Thank you for looking!!!", "ItemID": "173700922545", "EndTime": "2019-01-04T19:06:57.000Z", "StartTime": "2018-12-20T18:41:30.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Jericho-Elite-6-NT-Baritone-Scale-Electric-Guitar-Transparent-Black-Gator-HSC-/173700922545", "ListingType": "FixedPriceItem", "Location": "Erie, Pennsylvania", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1737009225458080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/PaQAAOSwO6NcGqpZ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTEwOVgxNTU5/z/yB4AAOSwiOxcGqyn/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Bm0AAOSwyYRcGqo4/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/mXUAAOSwFURcGqp4/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA5NVgxNDU3/z/iwAAAOSw8a9cGqrY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/KL0AAOSw3bZcGqr9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTEwOVgxNTkx/z/NAAAAOSwqoxcGqs-/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTEwOVgxNTU5/z/7FcAAOSw96ZcGquE/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTIwWDE0ODM=/z/aT8AAOSwpFtcGqu~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTI0WDE1NDc=/z/VMcAAOSwOVlcGqv0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTEzM1gxNTc1/z/R5wAAOSwvapcGqxb/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA5M1gxNTMx/z/jckAAOSwybtcGqyP/$_57.JPG?set_id=8800005007"], "PostalCode": "16510", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "revilosbay1", "FeedbackRatingStar": "Purple", "FeedbackScore": 561, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1100.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1100.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***r", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 889}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Jericho Elite 6 NT Baritone Scale Electric Guitar, Transparent Black, Gator HSC+", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Jericho Guitars, Hipshot, Seymour Duncan"]}, {"Name": "Body Type", "Value": ["Baritone"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Elite 6 NT Baritone"]}, {"Name": "Body Material", "Value": ["Ash"]}, {"Name": "Size", "Value": ["Baritone Scale"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Modified Item", "Value": ["Yes"]}, {"Name": "Modification Description", "Value": ["Original 5-way blade switch and Volume pot were swapped for a Mad Hatter 3-way blade switch & stacked Volume/ Tone pot, Seymour Duncan Alpha/ Omega Set was installed. Includes original switch & knob."]}]}, "HitCount": 160, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "ConditionDescription": "*All Conditions and Descriptions for Item(s) can be found in the Entire Description for the Listing*", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}