{"BestOfferEnabled": false, "Description": "Great playing guitar in pretty clean condition, no cracks scrapes gouges. These guitars are being sought after lately because of their accurate vintage replication. Unlike the weak wide range humbuckers that come in the Mexican version of these guitars, the specially voiced American wide range humbuckers are a take on the original Seth Lover humbuckers and these puppies scream! The '72 Telecaster Thinline replicates the second-generation Thinline, introduced in 1971. That guitar sported a pair of then-new Fender humbuckers (still with the single volume and tone control layout) along with a three-bolt micro-tilt neck joint and bullet truss rod adjuster. Advertisement Build The original Thinline was in production for barely three years - and its successor is what we see here. It really was a point of change for Fender with the three-bolt micro-tilt neck (designed and patented by Leo Fender after he'd sold his company to CBS, but was retained as a consultant) and bullet truss rod adjustor that became symbols of the 'bad days' of the CBS guitars. In reality, done right, these features work in the favour of the musician. The three 'bolts' - actually two machine screws, as normally used by Fender, and one actual bolt that threads into a circular metal plate mounted on the base of the neck that also serves as a hard surface for the micro-tilt screw to bare onto - hold the neck securely. The micro-tilt feature means that slight neck pitch adjustments can be easily made without removing and shimming the neck as the four screw method requires. Secondly, a slight truss rod tweak is easily achieved without slipping the neck up out of its pocket to access the old-style adjuster at the base of the neck. Aside from those changes the neck pretty much mirrors that of its '69 Thinline sibling. Likewise the body - although here only the bass-side is hollowed - which is natural- finished ash and you can clearly see the construction. Both back and top are three-piece spreads but the grain of the back really doesn't match the thicker top. The jointing is excellent, butat this price it seems a little untidy. The major change to this Thinline came with its new Fender humbuckers - designed, of course, by the inventor of the Gibson humbucker, Seth Lover - still married to a single volume and tone, albeit here they're 250k ohm with a 0.022 microfarad capacitor. \"The '72 humbuckers that are offered on the Classic Series '72 Telecaster Thinline and Custom (see Rivals) are not to the original spec,\" explains Neil Whitcher. \"We wanted these vintage re-issue pickups to be voiced like the original Seth Lover-designed Wide Range models. \"The original polepieces are unable to be manufactured any longer as the material [Cunife] is unavailable, but these pickups were voiced and tested in a studio environment and, we think, sound fantastic, just like the originals.\" An even bigger scratchplate is necessary to mount both pickups on, and a non-vibratio Strat-style six-saddle bridge replaces the classic Tele assembly. Sounds One reason why the Telecaster has survived all these years is that it has graced pretty much every genre from country, jazz and blues through to modern mainstream rock and metal. It's not always an easy ride: some swear by the bridge pickup (and swear at the neck pickup), others find an endless soul and funk groove from that middle, hollowed mix. There are even a few of us that actually like the neck single-coil for its smooth, jazz-edged voice. Plug in the '72 Thinline and, whoa, where's the high end gone? It's quite a dramatic difference, the spike of the '69 is replaced with a very rounded high-end, more mid-range thickness and smooth, almost too soft, bass - certainly on the neck pickup. But get used to it and anyone working in a bluesier/jazzier realm will appreciate this for its Kenny Burrell-like smooth attack. But the more we play it, it's the classic old-style tonality that impresses. The '72 Thinline is hugely versatile - plugged into a clean Fender amp, it's just such a good jazz sound. But switch over to a gained H&K Statesman with some front-end gain boost and it's way more contemporary rock with a decidedly fashionable retro flavour. This guitar was originally conceived at a time when Fender began to lose its way. However, 40 years on the guitar has been elevated into Fender's top drawer thanks to numerous often left-field players who wanted a piece of 'vintage' Fender but simply couldn't afford the high-value classics. Although this guitar has been available for some time in both Mexican- and Japanese-made guises, this American Vintage guitar improves on both those and the original with its lightweight build and lacquer finishes. Features such as the three-bolt neck joints and bullet truss rod adjusters (when done properly) make a lot of sense, too. The small frets and fingerboard radius won't endear it to all, but with street prices already around £1.5k this updated blast from the past remains a powerful draw.", "ItemID": "123656256797", "EndTime": "2019-02-23T18:49:50.000Z", "StartTime": "2019-02-20T18:49:50.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2011-Fender-American-Vintage-72-Thinline-Telecaster-Guitar-Humbucker-Black-/123656256797", "ListingType": "Chinese", "Location": "Howell, Michigan", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1236562567978080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/CLsAAOSw245cbZ72/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/DUMAAOSwBPxcbZ77/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/CNIAAOSw245cbZ8A/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/YQ4AAOSwFstcbZ8C/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/tYoAAOSwEaxcbZ8L/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/1OAAAOSwUR9cbZ75/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/-3MAAOSw0VBcbZ8E/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/jggAAOSwoF5cbZ7-/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/RS4AAOSwIz5cbZ8N/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDg2/z/zFQAAOSwsrBcbZ70/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/prcAAOSwlddcbZ8H/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/OB0AAOSwYkJcbZ8J/$_12.JPG?set_id=880000500F"], "PostalCode": "48843", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "rockget-upbyab", "FeedbackRatingStar": "Purple", "FeedbackScore": 963, "PositiveFeedbackPercent": 100.0}, "BidCount": 6, "ConvertedCurrentPrice": {"Value": 1036.11, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1036.11, "CurrencyID": "USD"}, "HighBidder": {"UserID": "p***i", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 3021}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2011 Fender American Vintage 72 Thinline Telecaster Guitar Humbucker Black", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "Model Year", "Value": ["2011"]}, {"Name": "Model", "Value": ["72 Telecaster Thinline"]}, {"Name": "Body Color", "Value": ["Black"]}]}, "HitCount": 201, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 1061.11, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}