{"BestOfferEnabled": true, "Description": "Bid and Buy with confidence from Prescott Valley Music, AZ. PV MUSIC RELIC'ed JAPANESE HOLLOWBODY ELECTRIC GUITAR Good Playing and Sounding Relic Japanese Hollowbody Guitar NOTE: WE HAVE SOLD OVER 40 RELIC GUITARS LOCALLY AND ON THE NET (SEE PICS BELOW OF JUST A FEW) MOST OF THEM WERE SOLD TO PROFESSIONALS WHO WANTED A ONE OF A KIND GUITAR THAT PLAYED, SOUNDED AND LOOKED GREAT ALL PV RELICS HAVE SOLD WITH EXCELLENT REVIEWS -- WE DON'T CHASE YOU TO LEAVE A REVIEW OVER HALF OF OUR BUYERS HAVE CALLED US TO THANK US NOT ONE BUYER HAS RETURNED OR EVEN COMPLAINED ABOUT A PROBLEM HERE'S FEEDBACK FROM THE LAST RELIC(s) SOLD Great guitar, great seller, super fast shipping A+A+A+Buyer: pearly.gates ( 488) During past month RELIC Stratocaster - 1 Single Humbucker Hardtail - Excellent Playing Relic Strat (#233008352583)US $129.95Best Offer Price was AcceptedView Item FeedbackFromWhenExcellent !! Very - Well Done Guitar !! Fast Shipping !!Buyer: hornfixer ( 688) During past month RELIC Stratocaster - Excellent Playing Relic Strat (#232747746579)US $134.95View Item Special seller with great productsBuyer: cencal.805 ( 1400) During past month PV MUSIC RELIC Stratocaster -- Plays Sounds Great (#232952915259)US $134.95Best Offer Price was Accepted VINTAGE 60's JAPANESE HOLLOWBODY ELECTRIC PV MUSIC GUITAR SHOP INSPECTED RELIC' ED AND SETUP WITH NEW GHS .010's AND TESTED INSPECTED RE-BUILT AND TESTED THIS GUITAR CAME IN STRIPPED WITH VIRTUALLY NO ELECTRONICS JUST THE BODY (the control plate) AND THE NECK (with the machines) AND THESE ORIGINAL PARTS: BODY, TAILPIECE, CONTROL PLATE, NECK, NECK PLATE, NUT, MACHINE TUNERS, STRAP BUTTONS WE ADDED THE SINGLE COIL BRIDGE PUP AND THE NECK HUM AND THE VOL & TONE POTS AND THE COOL RED KNOBS WE HAD TO SHIM THE NECK, WE ADDED A \"FLOATING TUNE-O-MATIC\" VINTAGE JAP BRIDGE THERE'S LITTLE TO NO FRET WEAR, THE BACK OF THE NECK IS IN EXCELLENT CONDITION THE NECK FEELS AND PLAYS GREAT WITH MED - LOW ACTION THIS GUITAR IS PROFESSIONALLY RELIC'edTHE RUBY RED BURST FINISH LOOKS GREATIT'S AN ORIGINAL ONE OF A KIND PV RELIC JAPANESE HOLLOWBODY GUITARTHIS GUITAR PLAYS, FEELS AND SOUNDS GREAT ! All our PV relic's are completely overhauled Whatever these guitars needed, it was addressed ---- including new pickups, fret crowning and leveling - whatever was needed. These are great playing, sounding and looking one of a kind creations for not much money (we will ship the guitar with the strings downtuned) This guitar will arrive \"as described\" professionally setup and ready to play right out of the box.It has had a complete overhaul --- It's an awesome \"Japanese Hollowbody Relic\" We take many pictures - Please see them all below. It comes with a 30 Day 100% Money Back Warranty from PV MUSIC=============================================SPECIAL OFFERWANT YOUR GUITAR OR BASS GUITAR HEAVY RELIC' ED ? ?CHOOSE YOUR OWN DESIGN OR LET US CREATE ONE FOR YOUSPECIAL OFFER -- $125.00 (plus return shipping of $39.95) SHIP YOUR GUITAR TO US FOR A SPECIAL CUSTOM RELICINCLUDES SPECIAL CUSTOM DESIGNED RELIC FINISHAND COMPETE OVERHAUL WITH A SETUP WITH YOUR CHOICE OF STRINGS LOW DROP \"B\" - \"C\" OR C # OR DROP \"D\" - NO PROBLEM FLOYD ROSE ? WE ARE MASTERS OF SET UP WE SPEAK METALEMAIL OR CALL FOR INFO =======================================ACTUAL PICTURES ABOVE AND BELOW: HEAVY RELIC' ED 60's JAPANESE HOLLOWBODY ELECTRIC GUITAR This PV MUSIC Vintage 60's Japanese Relic Hollowbody Electric Guitar comes with a 30 - Day 100% PRESCOTT VALLEY MUSIC Inspection & Refund Warranty.===================================== About Shipping: FAST SHIPPING $39.95 FAST FEDEX GROUND SHIPPING TO ANY LOWER 48 US STATE $100.00 USPS PRIORITY MAIL SHIPPING TO: AK, HI, VI, PR, GUAM, APO's, FPO's AND ANY OTHER US TERRITORYNO INTERNATIONAL SALES OR SHIPPING THANK THE CITES ACT FOR THAT ===================================== ABOUT OUR WARRANTY The Prescott Valley Music 100% Return warranty covers ANY issue with an item for \"not being as described\". If you are returning an instrument for any reason other than \"not as described\" such as \"buyers remorse\" or \"bought the item by mistake\" or \"I can't afford it right now\" a restocking fee may be imposed to your refund. So please be sure you want the instrument you are buying, and you're not purchasing it \"just to try it out.\"===================================== We strive for 110% customer satisfaction.If you feel that your item is not as described, please allow us the opportunity to address the issue BEFORE leaving feedback.We will do everything possible to insure that you are happy with your purchase experience. ====================================== AUCTION TERMS: Buyer is responsible for all questions.PayPal is preferred payment - If another payment is preferred please contact us first. We consider international shipping on a case by case basis. All items include insurance. We will only ship to a verified PayPal address. We try to ship items out the same or next business day. ===================================== ABOUT US: IF you have any issues with your auction, please notify us BEFORE you leave feedback.We will ensure that you will be totally satisfied with your purchase and experience. Prescott Valley Music8651 E. Florentine Road, Suite A Prescott Valley, AZ 86314 Item is guaranteed to be as described.", "ItemID": "233072483384", "EndTime": "2018-12-29T05:35:52.000Z", "StartTime": "2018-12-28T20:13:50.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/60s-Japanese-Hollowbody-PV-Music-Reliced-Electric-Guitar-Plays-Sounds-Great-/233072483384", "ListingType": "FixedPriceItem", "Location": "Prescott Valley, Arizona", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2330724833848080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/Njc1WDI5Ng==/z/CIAAAOSwxoJcEYou/$_57.PNG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjU5WDE4Ng==/z/GiUAAOSwpwBcEYoL/$_57.PNG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjMxWDIwNQ==/z/x-sAAOSwqLRcEYot/$_57.PNG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjgwWDI2Nw==/z/FqAAAOSwXI1cEYoz/$_57.PNG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjY1WDIwNg==/z/RbAAAOSwgotcEYon/$_57.PNG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjM1WDIwNw==/z/ROEAAOSwhzhcEYov/$_57.PNG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjUzWDU4OA==/z/-QAAAOSwT2BcEpDv/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjUyWDU4NA==/z/iDkAAOSwfgRcEpD8/$_57.PNG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjU2WDEwMjQ=/z/ez4AAOSwUpFcEpDu/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjUyWDg1MA==/z/aKYAAOSwtvZcEpDw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjcwWDM0NA==/z/RsoAAOSwtYZcEpD2/$_57.PNG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjQyWDMzMw==/z/XtkAAOSwkfxcEpDu/$_57.PNG?set_id=8800005007"], "PostalCode": "86314", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "prescottvalleymusic", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 493, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 189.95, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 189.95, "CurrencyID": "USD"}, "HighBidder": {"UserID": "d***h", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 536}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "60's Japanese Hollowbody PV Music Relic'ed Electric Guitar - Plays Sounds Great ", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["PV RELIC (JAPANESE LYLE, TEISCO ?)"]}, {"Name": "Model", "Value": ["JAPANESE HOLLOWBODY RELIC"]}, {"Name": "Dexterity", "Value": ["RIGHT HANDED"]}, {"Name": "String Configuration", "Value": ["6 STRING"]}, {"Name": "Body Color", "Value": ["RED BURST"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Model Year", "Value": ["1960's"]}, {"Name": "Body Type", "Value": ["HOLLOWBODY"]}, {"Name": "Product Line", "Value": ["HOLLOWBODY ELECTRIC"]}, {"Name": "Style", "Value": ["PV RELIC'ed JAPANESE HOLLOWBODY"]}, {"Name": "Right-/ Left-Handed", "Value": ["RIGHT HANDED"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}]}, "HitCount": 24, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=186589846", "StoreName": "prescottvalleymusic"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "PV MUSIC RELIC'ed JAPANESE HOLLOWBODY ELECTRIC GUITAR - MUST SEE ALL PICTURES IN LISTING BELOW - COMPLETE SETUP WITH NEW STRINGS AND TESTED - EXCELLENT PLAYING, SOUNDING COOL JAPANESE HOLLOWBODY RELIC - PRESCOTT VALLEY MUSIC 100% MONEY BACK WARRANTY", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}