{"BestOfferEnabled": true, "Description": "Hello, This listing is for one loaded, gorgeous 6 string Ernie Ball Music Man John Petrucci Majesty in Sapphire Blue. John & Music Man have created something special with the Majesty. This axe is literally a machine. THE most comfortable,ergonomically perfect guitar I've encountered in 4 decades. It hugs literally hugs your body and sits so well balanced in playing position. Playing at the 24th fret is incredible. My hand never even hits the lower cutaway! Stainless steel frets that'll never wear out,a non locking,no nonsense SMOOTH tremolo you can bury and it'll return to perfect zero. Gorgeous mirror inlays,rock solid locking tuners,killer tone wood combination(mahogany,basswood,maple,ebony fingerboard)and no big bulky neck heel so you can rip licks & chord way up the neck comfortably. The electronics are awesome! 2 perfectly balanced magnetic illuminator humbuckers and the bridge Piezos that deliver beautiful acoustic tone and can be used alone or blended with the humbuckers. The volume,tone & piezoelectric control knobs are all push/push plunger types. The official performance will all be included with the specs below,in my experiemce... push the volume knob and you're in overdrive heaven,like kicking in a stomp box . Push the tone knob and you're splitting the coil or adding a capacitor,the piezo push/push knob changes your input from mono to stereo. I'm constantly using the preamp on the volume knob and the tonal variance of the tone knob. I love pedals,but its killer to get the dirt right from the guitar. I've only been able to scratch the surface. The case is excellent. Built and molded to fit this guitar like a glove. Has a key lock and solid hinges. It would stand up to shipping as is. Beautiful way to protect this gorgeous The Majesty has been set up recently & plays like a dream. Comes with the whammy bar. ,I'm including a set of Elixir Polyweb 9-42 strings, EBMM cleaning wipes and an array of cool picks of different shapes and thickness because finding the right pick is awesome. (Not pictured) Shipping is free to the lower 48 states. International please contact us before hand so we can work out the details Please ask any and all questions you may have,I'm happy to answer in any way possible. All sales are final. I pack really well and ship fast the same day. Thanks so much for looking,this is an insanely well thought out instrument I know you'll enjoy. The Majesty has been babied and will floor you in real life. This is our 17th year on EBAY. Please check our feedback and buy with confidence. Majesty Specs below. The Majesty of Shred Never one to rest on their laurels, Ernie Ball Music Man and Dream Theater guitarist John Petrucci once again bring a touch of evolution to the guitar world with the Ernie Ball Music Man John Petrucci Majesty 6-string solidbody electric guitar. The sleek, new body style utilizes a neck-through design to give you huge sustain and killer tone. Couple that with premium tonewoods, DiMarzio Illuminator pickups, a piezo tremolo, and custom switching, and you have a guitar that’s ready to rock any stage. The Ernie Ball Music Man John Petrucci Majesty 6-string is the evolution of a long line of shred machines from this prolific artist and guitar company. Ernie Ball Music Man John Petrucci Majesty 6-string Solidbody Electric Guitar Features: Take command of your tone The sounds you need for any style of music Floating piezo tremolo and Schaller locking tuners for perfect pitch Take command of your tone The Ernie Ball Music Man John Petrucci Majesty makes you a master of the tonal universe. Its comfortable, contoured body consists of a mahogany neck-through design with basswood wings that’s topped with a maple cap – a unique tone cocktail that gives you wonderful warmth and resonance you don’t expect in a solidbody, along with massive sustain. Another unique aspect of the Majesty is its laser-etched maple cap. Not only is it etched in the shape of a shield, but it resembles the cool look of carbon fiber. The sounds you need for any style of music Two DiMarzio Illuminator humbuckers – designed by DiMarzio and Petrucci – serve up a universe of tone that takes the Ernie Ball Music Man John Petrucci Majesty from chimey cleans through a wide range of delectable crunch, all the way to fearsome, face-melting shred. But there’s more: a custom piezo floating vibrato bridge lets you engage in vigorous whammy action with absolute tuning stability, while giving you access to a range of gorgeous, nuanced acoustic sounds. Tonally speaking, there’s very little this exquisite axe can’t do for you. Floating piezo tremolo and Schaller locking tuners for perfect pitch The custom John Petrucci Ernie Ball Music Man Piezo floating tremolo is constructed of chrome-plated hardened steel with bent steel saddles. With the flick of a switch you’ll be able to get great-sounding acoustic tones from your John Petrucci Majesty, making this one of the most versatile guitars in your collection. The headstock is adorned with Schaller M6 locking tuners that make string changing a cinch. Just insert the string, tighten the clamp screw, and tune it up to pitch. Strings won’t be wound around the shaft so your tuning will be reliable, no matter how hard you play. Ernie Ball Music Man John Petrucci Majesty 6-string Solidbody Electric Guitar Features: Signature John Petrucci guitar with premium tonewoods and components Unique body design incorporates a mahogany neck-through design with basswood wings that’s topped with a maple cap Mahogany neck & Ebony fingerboard Recessed neck heel gives you clear access to all 24 frets DiMarzio John Petrucci signature Illuminator pickups Custom-designed tremolo with piezo pickup for expressive playing with reliable performance Locking tuners offer tuning stability and easy string changes Stainless steel frets will last a lifetime.", "ItemID": "153380303313", "EndTime": "2019-02-17T10:15:44.000Z", "StartTime": "2019-02-15T23:57:50.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Ernie-Ball-Music-Man-John-Petrucci-Majesty-Sapphire-Blue-6-String-/153380303313", "ListingType": "Chinese", "Location": "Chandler, Arizona", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1533803033138080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/0DoAAOSwrndcXgvp/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/sngAAOSwGLZcXgvs/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/kFIAAOSw0qdcXgvu/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/RK0AAOSwM6VcXgvv/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/qYsAAOSw379cXgvx/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/25IAAOSwJItcXgvy/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/j0gAAOSwCqZcXgv0/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/g7wAAOSwlEZcXgv1/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/4cgAAOSwwStcXgv2/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/jo4AAOSwJm5cXgv4/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/16MAAOSwS3NcXgv5/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/ARkAAOSw32lcXgv6/$_12.JPG?set_id=880000500F"], "PostalCode": "85249", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "lynchgwie", "FeedbackRatingStar": "Red", "FeedbackScore": 1364, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 1850.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1850.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "k***k", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 875}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Ernie Ball Music Man John Petrucci Majesty Sapphire Blue 6 String ", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Ernie Ball"]}, {"Name": "Model", "Value": ["Majesty"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Blue"]}]}, "HitCount": 60, "Subtitle": "Exc.+ cond. Case Candy. Free shipping. ", "PrimaryCategoryIDPath": "619:3858:33034", "Charity": {"CharityID": "1135", "CharityName": "The Humane Society of the United States", "CharityNumber": 1726, "DonationPercent": 10.0, "Mission": "The Humane Society of the United States is the nation's most effective animal protection organization. Since 1954, HSUS has been fighting for the protection of all animals through advocacy, education and hands-on programs. Together with our affiliates, we rescue and care for tens of thousands of animals each year, but our primary mission is to prevent cruelty before it occurs. We're there for all animals! ", "LogoURL": "https://i.ebayimg.com/00/s/NzYyWDEzNzM=/z/0rcAAOSwqj9bj5vJ/$_1.JPG?set_id=8800005007", "Status": "Valid"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 1875.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}