{"BestOfferEnabled": false, "Description": "Up for sale, a 2013 Fender '52 vintage reissue Telecaster model TL52-TX in exceptional condition with a rare black gloss finish. Built exclusively for the Japanese market, this \"Made in Japan\" guitar was made at a level that provides stiff competition for Fender's American Vintage series instruments. Using a premium ash body and a one-piece maple neck, this guitar truly delivers on its promise of classic Tele sparkle and twang through your favorite tube amp. Fat and throaty in the neck position, chimey and cutting in the middle, and aggressive in the bridge position, this guitar covers all the important Tele bases! The pickups are a pair of factory installed Fender Custom Shop Texas Special single coils that are designed with the same alnico magnets and output as genuine vintage examples, capturing all the nuance and snap of a Tele. Weighing in at 8lbs 13oz, the guitar has a clear, snappy acoustic voice. Professionally setup here at Mike & Mike's Guitar Bar with low action and solid intonation, this Tele combines all of the essential elements of the model's first iteration.The maple neck has a very slender and fast C shaped profile with a flawless ambered gloss finish. The frets are practically perfect, with zero wear and perfectly rounded crowns. The neck has Fender's traditional 25 1/2\" scale, with a 1 5/8\" nut width, and vintage 7 1/4\" fretboard radius. The headstock sports a set of original Kluson-style Gotoh tuners that turn smoothly and hold pitch well.The ash body has an uncommon gloss black finish, accented by a one-ply black pickguard for a particularly sleek look. While the finish is opaque, the grain of the ash is so prominent that it's still visible under direct light. All of the electronics work as they should with staggered alnico pole pieces on the bridge pickup and a three-way blade pickup selector wired to original potentiometers. The vintage-style bridge has three brass saddles, and the chrome hardware is particularly clean on both the control plate and bridge with only a touch of light patina on the saddles and edges of the bridge base. The guitar even has the correct domed knobs and all flathead screws, consistent with genuine vintage examples from '52! Cosmetically, the guitar is near mint with only a few faint scuffs in the gloss finish.This Tele is professionally setup and complete with factory installed Custom Shop pickups as well as the original hangtags and Fender-branded gigbag. Check out our shop \"Mike & Mike's Guitar Bar,\" and please let us know if we can answer any questions! Shipping in the continental USA will be $75, fully insured and shipped via FedEx Ground. Expedited shipping available for an additional fee at buyer's request. We will happily ship WORLDWIDE, but please contact us for an accurate international shipping quote before bidding or buying, as cost varies by buyer location. International orders will be declared as “merchandise,” and the value of merchandise will be declared as the amount paid. We cannot declare anything as a gift or for a lesser value. No exceptions! The customer is responsible for all taxes and duty, which may be collected upon delivery, as well as any additional charges involved with import. We have all necessary CITES paperwork in-hand to ship rosewood worldwide.We do our best to describe all items with honesty and accuracy, but to be sure, please contact us with any questions or concerns prior to bidding or buying. We require payment within 48 hours of auction end. In the unlikely event of a return, buyer pays all shipping costs. Your positive feedback and five star ratings are very important to us, and we appreciate your communication in resolving any issues!", "ItemID": "173689347248", "EndTime": "2019-02-23T01:10:50.000Z", "StartTime": "2018-12-13T11:11:20.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2013-Fender-Telecaster-52-Vintage-Reissue-TL52-TX-w-Custom-Shop-Pickups-Japan-/173689347248", "ListingType": "FixedPriceItem", "Location": "Seattle, Washington", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1736893472488080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/eLkAAOSwoZJcEjuL/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/z-YAAOSw0YlcEjuS/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/N9cAAOSwVRBcEjuV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/mJcAAOSwjolcEjuY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/w1AAAOSw0~pcEjub/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/liMAAOSwqnVcEjun/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Uy0AAOSwEVtcEjuO/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/4S4AAOSwenJcEjuQ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/0dcAAOSwckVcEjuf/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/w8MAAOSwsGpcEjui/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/lWYAAOSwfMlcEjud/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/ljEAAOSwI1VcEjuk/$_57.JPG?set_id=8800005007"], "PostalCode": "98117", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mmguitarbar", "FeedbackRatingStar": "Red", "FeedbackScore": 2613, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 949.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 949.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "r***0", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 642}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "2013 Fender Telecaster '52 Vintage Reissue TL52-TX w/ Custom Shop Pickups, Japan", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "Model", "Value": ["'52 Telecaster TL52-TX"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Material", "Value": ["Ash"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["2013"]}]}, "HitCount": 565, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=269063702", "StoreName": "Mike and Mikes Guitar Bar"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}