{"BestOfferEnabled": true, "Description": "This was original advertisement for the 1st Limited Edition in 2010. Redefining the Blues! Musicians that redefine an art form are few and far between. Yet in the span of a few years, guitarist Joe Bonamassa has single handedly transformed blues rock with his own unique fusion Of both Old and new ideas. His distinct interpretation of the blues and his extraordinary guitar skills have earned him a fitting a tribute from Epiphone - the new Limited Edition Joe Bonamassa Les Paul Goldtop Outfit. Designed in close cooperation with Joe himself, this new signature model captures the essence of Bonamassa's Goldtop by blending several vintage features from the legendary Les Pauls of the 1950s including a traditional 1959 neck profile and Gibson BurstbuckertU pickups with a few modern appointments. Limited to 1,000 guitars worldwide, the new Epiphone Joe Bonamassa Les Paul Goldtop sets a new standard for affordable performance. Traditional '59 Les Paul Construction! There's little argument that the 1959 Les Paul is the \"holy grail\" of electric guitars and like the '59, the new Bonamassa Goldtop shares many of the same coveted features. It starts with a solid Mahogany body married to a hard Maple cap for that unique combination of warmth and bite. Add to that, a traditional Mahogany neck that is hand-fitted and glued \"deep\" into the body using premium TiteBond' glue. Extending well into the neck pickup cavity, the long-neck tenon provides additional strength and stability to the neck and offers more wood-to-wood contact between the neck and body. This ultimately results in sweetertone and longer sustain. Also true to it's heritage, the neck features an authentic, 1950's rounded neck profile. Often referred to as \"the baseball bat\", this neck feels beefy yet comfortable in your hands while adding warmth and sustain with it's greater mass. Ultimate Vintage Blues Tone! The classic tone of this new model comes courtesy of Gibson's famed BurstbuckerTM pickups. BurstBuckersTM replicate the sound of Gibson's original \"Patent Applied For\" pickups - the pickups that gave the '59 Les Paul Standard its legendary sound. Like the originals, with unpolished magnets and non-potted coils, variations in pickup output and tone also came from inconsistencies in winding the bobbins, a result of the lack of automatic shutoffs on Gibson's winding machines in the late 1950s. Seth Lover, who invented the humbucker, always said they wound the bobbins \"until they were full.\" When two coils in a pickup have a different number of turns, that variation puts a little \"edge\" or \"bite\" on the classic humbucker sound. That's the sound BurstBuckers replicate. The neck pickup is a Burstbucker-2 and is wound in the range of Gibson's '57 Classic. The bridge pickup is a Burstbucker-3 and is slightly over-wound with a hotter output that works well in combination with the BB-2 in the neck. Classic Styling and Attention to Detail! While most Goldtops feature cream plastic parts and a brown back, the new Bonamassa departs from that tradition with black pickup mounting rings, a black pickguard, black toggle washer and black cavity control covers. The back, sides and neck Of the guitar are also black creating a unique and striking Black/Gold combination. Other details include a mis-matched set of bridge/neck pickup knobs (just like Joe's), Epiphone's patent-applied-for LockToneTM Tune-o-matic and stopbar tailpiece, vintage nickel hardware and premium 14:1 ratio Grover\"' tuners, Epiphone StrapLocks and a 12-inch radius Rosewood fingerboard with 22 nickel/silver alloy medium-jumbo frets. \"Bonamassa\" is tastefully printed on the bell-shaped trussrod cover in white and the back of the headstock features Epiphone's \"Limited Edition\" logo in gold. And That's Not All! Each new Limited Edition Joe Bonamassa Les Paul Goldtop Outfit comes with a replica Lifton-style hardshell case and a certificate of authenticity personally hand signed by Joe Bonamassa. Combined with Epiphone's Limited Lifetime Warranty backed by 24/7/365 Customer Service, it's a one-of-a-kind package that is a fitting tribute to an extraordinary musician. Only 1,000 will be made — get yours while you still can.", "ItemID": "223362034100", "EndTime": "2019-02-03T23:12:44.000Z", "StartTime": "2019-02-02T20:03:42.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Epiphone-Ltd-Ed-Joe-Bonamassa-Les-Paul-Goldtop-Outfit-/223362034100", "ListingType": "FixedPriceItem", "Location": "Webster, New York", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2233620341008080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/SY8AAOSwZnpcR5Gb/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/IuQAAOSwikBcR5Gp/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/opoAAOSwPA1cR5G7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/C4UAAOSwuZVcR5HI/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/FhwAAOSwzodcR5Hd/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Cd4AAOSwFAtcR5Ho/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/npgAAOSw5EpcR5IU/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/E6wAAOSwhzhcR5Io/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/pyAAAOSws2RcR5I5/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/8XEAAOSwEfVcR5JR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/q1wAAOSwl7dcR5Jb/$_57.JPG?set_id=8800005007"], "PostalCode": "14580", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "rlaskow7951", "FeedbackRatingStar": "Yellow", "FeedbackScore": 33, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 410.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 410.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "l***a", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 131}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Epiphone Ltd Ed Joe Bonamassa Les Paul Goldtop Outfit", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "Model", "Value": ["2010 Ltd Ed. Joe Bonamassa"]}, {"Name": "Body Type", "Value": ["Les Paul"]}, {"Name": "Body Color", "Value": ["Gold"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Material", "Value": ["Mahogany"]}, {"Name": "Features", "Value": ["Bridge pick up Gibson USA BurstBuker 3 Humbucker", "Neck pick up Gibson USA BurstBucker 2 Humbuker", "Rounded D profile 1959 neck shape", "Deep Set Glued in Neck Joint", "Adjustable Truss Rod", "24.75\" Scale Length", "Rosewood with pearloid \"Trapezoid\" inlays", "12\" Fingerboard Radius", "22, medium jumpo Frets", "Bridge volume and tone control", "Neck volume and tone control", "LockTone Tune-o-matic/Stopbar", "1-11/16\" Nut Width"]}, {"Name": "Custom Bundle", "Value": ["Yes"]}, {"Name": "Model Year", "Value": ["2010"]}, {"Name": "Bundle Description", "Value": ["Lifton style Hardshell Case, Hand Signed Certificate of Authenticity, Epiphone Straplocks, Amp Cord, Shoulder Strap"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Soundboard Style", "Value": ["Carved Hand Maple Cap for Top Material"]}, {"Name": "Country/Region of Manufacture", "Value": ["China"]}]}, "HitCount": 80, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Purchased 2010 as 1 of first 1,000 Special Edition Joe Bonamassa Les Paul - Excellent Condition", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}