{"BestOfferEnabled": false, "Description": "Our eBay Store About Us Fender Classic Player Baja Telecaster Electric Guitar (Blonde) Designed by Fender Custom Shop Master Builder Chris Fleming, the Classic Player Baja Telecaster blends vintage-inspired Tele features with a variety of mods that set it apart from the rest including a set of Custom Shop-designed pickups, special tone circuitry and switching, and more!The body is made from ash and comes dressed in your choice of Blonde, 2-Color Sunburst or Black gloss finishes. The perfect mixture of classic 50s feel and modern playability, the maple neck has been shaped into a cozy, somewhat rounded soft \"V\" profile instead of the more pronounced, sharper 50s-style \"V\" shape. The maple board also features a contemporary 9.5\" radius and houses 21 medium-jumbo frets.Helping to put this Tele in a class all its own, the Fender Classic Player Baja Telecaster comes equipped with premium pickups and incredibly versatile electronics. First, a rare feature for a Fender at this price point, this Tele comes fitted with a pair of top-of-the-line Custom Shop single-coil pickups: a vintage-style Tele bridge pickup and a \"Twisted\" Tele neck pickup. These pickups dish out all that timeless Tele twang and tone that made the originals legendary. Whats more? The pickups are wired through a unique 4-position pickup selector switch as opposed to the typical 3-position switch, which allows you to combine the neck and bridge pickups in series for fatter tone and higher output--perfect for delivering raw, hard-rocking tone. Giving you even more sonic flexibility, the volume control features two-way S-1 switching that changes the pickup wiring from in-phase to out-of-phase when both pickups are on.The Classic Player Baja Telecaster comes equipped with high-quality chrome hardware, which includes an American Vintage 3-saddle strings-through-body bridge, a set of vintage-style tuners, and a 4-bolt neck plate engraved with \"Custom Shop Designed\". Comes complete with deluxe gig bag.Get your Fender Classic Player Baja Telecaster Electric Guitar today at the guaranteed lowest price from Sam Ash Direct with our 45-day return and 60-day price protection policy. Product Details - Designed by Custom Shop Master Builder Chris Fleming - Ash Body w/Soft \"V\" Maple Neck & 9.5\"-Radius Maple Fretboard - Custom Shop Vintage-Style Tele (Bridge) and \"Twisted\" Tele (Neck) Pickups; 4-Position Blade & S-1™ Switch For Added Tonal Variety - 3-Saddle American Vintage Strings-Through-Body Bridge w/Brass Saddles and Vintage-Style Tuners Shipping Information Your gear will ship out within 2 days of order confirmation. At this time we can not ship PO Boxes, APO and FPO locations. Industry Leading 45-Day Return Policy We stand by the products we sell, and we'll certainly stand by you as well! We truly appreciate your business, and we want you to be 100% happy with your purchase. However, we know that one of the drawbacks of internet shopping is that you can't try something before you buy it. That's where our money-back guarantee comes in. If you are not completely satisfied with an item, for any reason, you can return it within 45 days of the shipping date for a complete refund of the merchandise price.* Due to the complexity of international shipping, we are unable to accept any returns on international orders. Before making a purchase outside of the United States, please know that products sold by Sam Ash use the standard 120V/60Hz voltage standard. Sam Ash is not responsible for any damage caused by not adhering to the voltage requirements. *All returns must be within 45 days of the date the item was shipped. Please do not accept any shipment if the packaging appears damaged in any way. We strongly suggest that you check your order after receiving it to be sure that it is in proper working order. Returned items must be in resalable condition. Resalable Condition means that the product(s) is exactly in the same condition as you received it. All exchanges must be pre-paid, returned in original packing, complete with blank warranty cards, owner's manual and show no sign of wear or abuse. In the event that the product is not in the same condition as you received it you may be subject to a minimum 15% restocking fee, repair charge or disqualification. Shipping and handling charges are non-refundable. Please call our Customer Service department if you have any questions about returning an item. CDs, DVDs, video tapes, sheet music, books, strings, computer hardware/software, drum heads, harmonicas, mouthpieces, sound cards, microphones, raw speakers, studio furniture, blank CDs/Tapes or Special Orders are not covered by this return policy.", "ItemID": "173709656969", "EndTime": "2018-12-28T19:14:38.000Z", "StartTime": "2018-12-27T00:29:56.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fender-Classic-Player-Baja-Telecaster-Electric-Guitar-Blonde-Used-/173709656969", "ListingType": "FixedPriceItem", "Location": "Tampa, FL", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1737096569698080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYxWDUwMA==/z/CXoAAOSw5qdcJCyl/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYxWDUwMA==/z/jKIAAOSw~rhcJCyl/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MzMzWDUwMA==/z/7NsAAOSwHGJcJCyl/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MzMzWDUwMA==/z/BWgAAOSwQqZcJCyl/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MzMzWDUwMA==/z/2s4AAOSwVcZcJCyl/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MzE0WDUwMA==/z/b0sAAOSwRYNcJCyl/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MzMzWDUwMA==/z/wVkAAOSwHexcJCyl/$_1.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "samashdirect", "FeedbackRatingStar": "PurpleShooting", "FeedbackScore": 58755, "PositiveFeedbackPercent": 99.2, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 683.77, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 683.77, "CurrencyID": "USD"}, "HighBidder": {"UserID": "4***e", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 8}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Fender Classic Player Baja Telecaster Electric Guitar (Blonde) (Used)", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "MPN", "Value": ["0141502307"]}]}, "HitCount": 11, "Subtitle": "Sam Ash - Serving Musicians Since 1924.", "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1111655870", "StoreName": "Sam_Ash_Music_Direct"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalRefund": "MoneyBack", "InternationalReturnsWithin": "30 Days", "InternationalReturnsAccepted": "ReturnsAccepted", "InternationalShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "ConditionDescription": "Like New", "QuantitySoldByPickupInStore": 0, "SKU": "F1502307X", "NewBestOffer": false}