{"BestOfferEnabled": false, "Description": "Selling my perfect condition Fender Roland VG Stratocaster MIM. This was purchased at Sam Ash and will include a vintage case. Works perfectly and flawless for a 2007 guitar. I purchased on Sunset Boulevard last year but never used it. Complete with all paperwork and lifetime warranty. Shipping is 50 dollars but I am happy to do pickup if you are in Los Angeles. Amazing guitar and deal - I have a perfect Ebay record so bid with confidence and let me know if you have any questions. Thanks for looking! _____________________ You no longer need to choose between a virtual guitar and a real guitar. The Fender VG Stratocaster is both”everything you'd expect from a Fender Strat, and a whole lot more! Lurking beneath its classic Strat exterior are 37 sounds based on Strat, Tele, humbucker Strat and acoustic, as well as 6 tunings, but the aesthetic and cosmetic of the Strat remains intact. Even better, the VG Stratocaster delivers level, balanced tone and volume across all these remarkable functions, so that you won't need to continually readjust amp settings with each change in guitar sound. No unique hardware necessary to use the VG Strat guitar: no special 13-pin or USB cables, no power supply or input box. It plugs in and plays like any electric guitar. All you'll notice visually are 2 additional knobs on the VG Strat's pickguard, plus a small LED and an inconspicuous Roland® GK bridge pickup. The 2 additional knobs are a Mode Control knob and a Tuning Function knob. The Mode Control Knob between a Virtual version of the Ash bodied Strat (for use of the tuning function), a virtual Telecaster, virtual 2-humbucker Strat, and an assortment of 5 acoustics, from Dreadnought to Resonator. The 5-way blade switch switches you between sounds in the modeling modes just like on a regular guitar. Tune function rotary control lets you choose between Normal ” regular tuning, Drop D, Open G, DADGAD, Baritone/Low B, and 12 string. The tuning function does not work in Normal mode when circuit is bypassed. Tuning function is also relative ” if you tune down to E flat, all of these tunings will transpose down a half step. Since guitarists don't have to turn a single tuning key, a major benefit of all these instant tuning changes is that the string tension remains the same and the guitar itself feels the same. Fender's VG Stratocaster is the result of a 10-year research and design partnership between Fender and music technology pioneer Roland Corporation. The VG's development followed a commitment to \"The Complex Art of Keeping It Simple.\" Developers spent time and great effort working out intricate details so that you can just plug in and play. Their goal: a balance of usability and tech ” the more functionality added to an instrument, the more complex it becomes. Fender kept it pared down so it could really be used in a live setting. They stayed with Fender sounds ” Strat®, Tele®, Humbucking pickups and acoustics. No unique hardware is necessary to use the VG Strat guitar: no special 13-pin or USB cables, no power supply or input box. It plugs in and plays like any electric guitar, and no phonebook sized manual is necessary ” it is built for 5 minute mastery, and is easy to use and understand. The VG Stratocaster is a MIM Series Strat featuring the classic sleek, contoured body shape, 3 American Series single-coil pickups with five-position switching and a maple neck", "ItemID": "173739577430", "EndTime": "2019-01-14T15:48:20.000Z", "StartTime": "2019-01-14T00:06:24.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fender-Roland-VG-Stratocaster-Black-perfect-condition-vintage-case-/173739577430", "ListingType": "Chinese", "Location": "Los Angeles, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1737395774308080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/w2IAAOSwusdcO8~v/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/xRoAAOSw0YlcO8~s/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/1bcAAOSwjfBcO8~s/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/lc8AAOSwUoJcO8~v/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/BoMAAOSwH2VcO8~s/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/RrEAAOSwgGNcO8~s/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/wy8AAOSwJtJcO8~s/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/jOoAAOSwJOJcO8~s/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/T78AAOSwVNNcO8~u/$_32.JPG?set_id=880000500F"], "PostalCode": "90077", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "member9221529", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 105, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 675.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 675.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "y***3", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 404}, "ListingStatus": "Completed", "QuantitySold": 1, "ReserveMet": true, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Fender Roland VG Stratocaster - Black perfect condition with vintage case ", "ItemSpecifics": {"NameValueList": [{"Name": "Body Material", "Value": ["Alder", "Ash"]}, {"Name": "Brand", "Value": ["Fender"]}, {"Name": "Product Line", "Value": ["Fender Special Run"]}, {"Name": "Model Year", "Value": ["2007"]}, {"Name": "Non-Domestic Product", "Value": ["Yes"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Model", "Value": ["Stratocaster"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Soundboard Style", "Value": ["Flat Top"]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "Features", "Value": ["Built-in Effects"]}]}, "HitCount": 72, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 685.0, "CurrencyID": "USD"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}