{"BestOfferEnabled": false, "Description": "MIJ, made in japan, Gibson, Lespaul, White, SG, Höfner, Duesenberg, Ibanez, ATELIER Z, ARIA, ESP, Caparison, Killer, COMBAT GUITARS, GUYATONE, Greco, Sugi Guitars, TEISCO, DEVISERA, Nil, Bacchus, VANZANDT, Fernandes, Fender Japan, Fujigen, MOON GUITARS, momose, Yairi Guitar, YAMAHA, TOKAI, Zemaitis, VOX, B, C, Rich, Epiphone, Gibson, Gretsch, Suhr, Schecter, Charvel, Jackson, Dean, Tom Anderson, Fender, Paul Reed Smith, Melancon, Mosrite, Rickenbacker, Robert Benedetto, Washburn, Ibanez, kramer, EDWARDS, Burny, Grassroots, Burny FERNANDES LG-75JP JOE PERRY model All Original Very Good ++ condition.Made in Japan Down from here, Photo is dent and scratches etc.. About scratches that are hard to see. To make it easy to understand the condition of the scratches, I lighted the light strongly. Burny FERNANDES LG-75JP JOE PERRY model All Original Very Good ++ condition.Made in Japan Body Top : Maple. Back : Mahogany. Neck Mahogany. Frets 22F. Scale 24.75inch ( 628mm ) Gibson Medium Scale. Nut Width About 1.69 inch (43mm). Pickup VH-1. Control 2 Volume, 2 Tone, 3 way toggle Switch. Bridge Tune O Machic. Stop Tailpiece. Machine heads GOTOH Japan. Weight About 10.23 Pound ( 4.64 Kg ). This is Used Guitar. There are cracks in the back of the head. __I think it is clear coating crack. __The head is very sturdy. __It is no problem. There are scratches and dents. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. Currently the Burny RLG-55JP JOE PERRY model is made in China. Around 2000, Fernandes moved manufacturing base to China. ( excepting the specific model. ) This JOE PERRY model is made in Japan. It was manufactured in late 1980s ~ early 1990s. It is last JOE PERRY model by made in Japan. I can assert that it is a rare model. Aerosmith is very popular in japan. Because it is not currently produced in Japan, it is getting harder to find the Japanese-made LG75JP in the japanese used guitars market. I checked my sales history. Last time I sold a LG75JP in March 2018. On average it sells 2 from 3 in one year. Therefore, the LG 75JP is probably the last sale in 2018 from me. Mounted VH-1 Pickups in Neck and Bridge. This VH-1 Pickup is excellence. And worldwide assessment is high. Official name is \"Vintage Humbucker HISTORY\". I feel the good distortion sound. Accuracy of the product is high, Un pluged sound is very loud. You can feel vibrations transmitted to the body. Burny is Great !! It is cleanliness. I polished with guitar exclusive polish, so it is in a very clean state. I after the finger board cleaning, painted beeswax. The aim is moisturizing and and protection. Current neck condition, very good ! roughly straight ! There is no problem with the Truss rod and it can be adjusted. Remaining Frets are about 85 %. You can play immediately after it is delivered to you. I was set new strings. Regular tuning. ( Inch : 009, 011, 016, 024, 032, 042 ) Guitar playing, is comfortable. All is working well. It is in a very good condition. The Truss rod Wrench is not included. All Original.Note : I changed the bridge's tone pot and the output jack to new one. Look at the photos, please verify by yourself! It will be professionally pack. Double air packing. And ships inside a sturdy cardboard box. This electric guitar is USED. Please consider it when bidding. Thank you. Payment I accept PayPal only. Please pay within 3 days after the auction closed. Shipping Worldwide shipping from Japan! EMS / Shipping includes a tracking number. / / / Destination cost Delivery time / / / Asia : $1004 ~ 7daysUS Canada : $1205 ~ 8 daysEurope : $1406 ~ 10 daysOceania : $1205 ~ 8 daysSouth America : $2408 ~ 12 days This item is shipped within 3 business days after payment is confirmed. Terms of Sale International buyers - Please Note: Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer's responsibility. Please check with your country's customs office to determine what these additional costs will be prior to bidding/buying. These charges are normally collected by the delivering freight (shipping) company or when you pick the item up -do not confuse them for additional shipping charges. Please contact us first with 30 working days for any returns, Buyer pays shipping cost from buyer's country to Japan when being returned. In case of return, the shipping cost won't be refunded. We sell various kinds of Electric guitars to international customers. Our goal is to provide the best quality products and service and your satisfaction is the most important to us. Happy bidding!! Thank you !!", "ItemID": "254001840805", "EndTime": "2018-12-04T22:27:36.000Z", "StartTime": "2018-11-27T22:27:36.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Burny-LG-75JP-Aerosmith-JOE-PERRY-model-All-Original-Made-Japan-/254001840805", "ListingType": "Chinese", "Location": "Nagoya-shi,Kita-ku, Aichi", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/2540018408058080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/yMwAAOSwTFBbyTsN/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/viYAAOSwv6FbyTsa/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE1NVgxNjAw/z/m-cAAOSwb4VbyTsE/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU5OVgxNjAw/z/YdcAAOSwRE9byTsC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/tooAAOSwXWhbyTsA/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/y~gAAOSwOYRbyTr7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/O-UAAOSwoDlbyTr1/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/IF0AAOSwHSRbyTrs/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/tn4AAOSwXWhbyTry/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg2Mzg=/z/FvIAAOSw8KJbyTrZ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/RFcAAOSwlxxbyTsb/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/tq8AAOSwXWhbyTsh/$_57.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jguitar-shop", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 369, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 298.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 298.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "t***o", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 12}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Americas", "Europe", "Asia", "AU"], "Site": "US", "TimeLeft": "PT0S", "Title": "Burny LG-75JP. Aerosmith. JOE PERRY model. All Original. Made in Japan.", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Burny"]}, {"Name": "Model Year", "Value": ["late 1980s ~ early 1990s"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["LG-75JP"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Series", "Value": ["Original"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["7150"]}]}, "HitCount": 168, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "JP", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 303.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["APO/FPO", "Africa"], "GlobalShipping": false, "ConditionDescription": "Very Good ++ Condition. This is Used Electric Guitar. The electric guitar when connect to the amplifier, sound output is normal. There are scratches and Dents. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. Please Read the descriptions for details.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}