{"BestOfferEnabled": true, "Description": "Like new. Custom shop Gibson. What more can I say. Plays incredible and weighs half what a Custom Les Paul does. You can play this one all night without getting a sore shoulder and back ache. Comes with original HS Case with all case candy and extra truss rod cover for some reason. Was in the case when I purchased new. Excellent condition but has been played. Don’t see anything that stands out. Bid with confidence. Almost 1500 transaction on EBay with excellent reviews. Description from Gibson Made with a considerably thinner body and traditional weight relief, this limited-edition Les Paul Classic Custom Lite lightens the load for a superbly playable Custom that still packs all the elegant looks and dual-humbucker tone that has made the Les Paul legendary. In crafting the Les Paul Custom Lite, Gibson USA starts with time-tested ingredients, including the legendary tonewood pairing of a carved maple top and genuine mahogany body, the latter treated with Gibson’s traditional weight relief to reduce the load and enhance resonance. The quarter-sawn mahogany neck is carved to a rounded ’50s profile and topped with a Grade-A, rosewood fingerboard with single-ply binding and classic acrylic block inlays. The body and headstock are trimmed in multi-ply binding, and the headstock carries an Acrylic Gibson logo and traditional acrylic split-diamond inlay. Gibson LE 2016 Les Paul Classic Custom Lite Features Carved Maple top, mahogany back and sides Mahogany neck with rounded '50s profile Rosewood fingerboard with acrylic split-diamond inlays Powerful 490R and 498T humbucking pickups in the neck and bridge positions Gold plated Grover keystone tuners with 16:1 ratio The beauty of this gorgeous black Les Paul Custom Lite is more than skin deep, and Gibson USA has also packed added versatility into the traditional formula. Two of Gibson’s most popular humbucking pickups from the Modern Classics series offer all the tone that made the Les Paul legendary in the first place with two tone controls and two volume controls as well as a 3-position pickup selector. The 490R in the neck position is made with a genuine Alnico II magnet and wound with 42 AWG wire in the image of the original PAF humbuckers, for plenty of depth and warmth with impressive articulation. The 498T in the bridge position has an Alnico V magnet and extra turns of coil wire for added punch and growl. A traditional Tune-o-matic bridge and stopbar tailpiece enhance the sustain that has long made the Les Paul legendary, and a set of Grover keystone tuners—all in gold, as are the pickup covers and strap buttons—ensure a lifetime of smooth tunings. Check out the Les Paul Custom Lite today, from Gibson USA, and grab a more comfortable hunk of that classic elegance. When guitar star Les Paul and Gibson president Ted McCarty sat down at the start of the 1950s to design a revolutionary new solidbody electric guitar, they originally envisioned two versions of the Les Paul Model: a ‘standard,’ which arrived first in the Goldtop of 1952, and a black Custom model with gold hardware, intended to be the creme de la creme. The 1954 Custom debuted with two single-coil pickups, but McCarty had already set Seth Lover and a team of Gibson designers the task of developing a revolutionary new humbucking pickup, which first hit the scene on the Les Paul Custom and Les Paul Goldtop in 1957. While the Les Paul Custom has always been a supremely elegant instrument—a ‘black tie’ guitar for the formal crowd, as Les originally conceived it—many have come off the line over the years considerably heavier than the typical Les Paul Standard.", "ItemID": "283279952578", "EndTime": "2018-12-04T02:47:26.000Z", "StartTime": "2018-11-27T19:09:48.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-Les-Paul-Custom-Lite-White-2016-/283279952578", "ListingType": "Chinese", "Location": "Spring, Texas", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2832799525788080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NjIyWDE1OTc=/z/EzQAAOSwSn1b~ZZx/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTU5N1g2MDc=/z/2jQAAOSw5qJb~ZVm/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/MwIAAOSwXMxb~ZU5/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTMxMlg3OTI=/z/Yr4AAOSwg2lb~ZWF/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/z14AAOSwkERb~ZU6/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTEyMlg3MjQ=/z/2fQAAOSwypZb~ZWb/$_12.JPG?set_id=880000500F"], "PostalCode": "77381", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "davidwbickle", "FeedbackRatingStar": "Purple", "FeedbackScore": 531, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 1600.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1600.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "k***r", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 908}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson Les Paul Custom Lite White 2016", "ItemSpecifics": {"NameValueList": [{"Name": "Product Line", "Value": ["Gibson Les Paul"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model Year", "Value": ["2016"]}, {"Name": "Model", "Value": ["Custom"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Color", "Value": ["White"]}]}, "HitCount": 330, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 1625.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}