{"BestOfferEnabled": false, "Description": "Excellent Condition with Pickguard. I’m not sure if the pickguard was a special order or if someone added it. Looks factory to me but I’m not sure. I absolutely love the way this guitar looks with the Pickguard. All the hardware for the Pickguard is gold color and matches the guitar perfectly. No issues with this guitar, plays great, sounds great. Guitar was made in China, May of 2013 Production # 1575 Includes Epiphone Case, trossrod tool, strap locks case key & Owners Manual. I found the info below online, The Prophecy Les Paul Custom Plus GX Outfit This guitar is the supreme Les Paul for those who dare to break new ground in speed, sound, and technique. And now, the GX features Gibson USA's powerful 490R/498T humbucker combination with push/pull coil-tapping for each pickup, an elegant mother of pearl and abalone block & triangle inlay and pickup individual volume and tone controls in the traditional Les Paul layout. The Prophecy Les Paul Custom Plus GX Outfit features a mahogany body with a stunning Quilt maple veneer top that's available in two beautiful color finishes, Black Cherry and Heritage Cherry Sunburst. The super fast mahogany neck has a SpeedTaper D-profile with a satin finish and a 24.75\" scale. The elegant rosewood fingerboard has 24 jumbo frets, a 14\" radius, a standard 1.68\" graphite nut, and beautiful mother-of-pearl and abalone block and triangle inlays on the 1, 3, 5, 7, 9, 12, and 15th frets, alternating with mother-of-pearl block inlays on frets 17, 19, 21, and 24. The classic Epiphone Clipped Dovewing headstock has 5-ply white and black binding with a mother of pearl \"stickpin\" design on the headstock face and Prophecy Les Paul Custom Plus GX on the bell-shaped truss rod cover. Fans of the original Prophecy Les Paul Custom Plus GX, fitted with Gibson DirtyFingers, often noted that the 490R/498T might be a great match for the new GX. They heard you and your wish was Epiphone's command. The new Prophecy Les Paul Custom Plus GX features a Gibson USA 490R humbucker in the neck position and a Gibson USA 498T in the bridge position. The 490R features an Alnico II bar magnet and the 498T carries an Alnico-V bar magnet. These pickups have the traditional characteristics of the original \"Patent Applied For\" tone that's unmistakably from Gibson's legendary family of humbucker pickups but, with a modern edge to give your tone a distinct personality. Best of all, each pickup features coil tapping via a push/pull control at each pickup's volume knob. And now for the first time, the Prophecy GX features individual volume and tone controls for each pickup. Over the last decade, Epiphone has built a reputation for outstanding quality, especially in their hardware. Now, the Prophecy GX gold hardware goes beyond anything seen before in the Prophecy series beginning with the GX's gold metal barrel controls with mother of pearl inlaid tops, their legendary gold LockTone tune-o-matic bridge and stopbar tailpiece, a gold Epiphone Exclusive non-rotating heavy-duty output jack, and gold Epiphone straplocks. The Prophecy GX also includes gold Grover 14:1 machine heads for superb tuning accuracy, just like you find on all the best Les Pauls. The Prophecy GX also includes a hard case so you have the security to take your GX anywhere the music takes you. Includes case.", "ItemID": "264120490384", "EndTime": "2019-02-24T05:25:27.000Z", "StartTime": "2019-01-06T00:41:49.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Epiphone-Les-Paul-Custom-Prophecy-Plus-GX-Heritage-Cherry-Sunburst-w-Pickguard-/264120490384", "ListingType": "FixedPriceItem", "Location": "Woodruff, Wisconsin", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2641204903848080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTQ3M1gxMDA1/z/h9gAAOSw6jJcI9xF/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/h10AAOSwybtcI9ui/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTExMFgxNjAw/z/qkkAAOSwfwpcI9u8/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NVgxNDIz/z/megAAOSwBVdcI9vj/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTU1MVg5NDU=/z/uBEAAOSwHF1cI9zU/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/uTkAAOSw-sVcI9uC/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/EIQAAOSwwDJcI9v8/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/O~MAAOSwUu5cLYD6/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTU5N1gxMDgz/z/CaYAAOSwylBcI9ts/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTU4MVg4OTA=/z/HDQAAOSwf1xcI9wT/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA5OFgxNTM1/z/OnsAAOSwohVcI9xm/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1M1gxNDI1/z/BooAAOSwEKxcI9tG/$_12.JPG?set_id=880000500F"], "PostalCode": "54568", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "thomas321", "FeedbackRatingStar": "Red", "FeedbackScore": 3965, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 629.95, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 629.95, "CurrencyID": "USD"}, "HighBidder": {"UserID": "d***l", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 111}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Epiphone Les Paul Custom Prophecy Plus GX Heritage Cherry Sunburst w/ Pickguard", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}]}, "HitCount": 328, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=12485447", "StoreName": "Mike&#39;s Vintage Rescue"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}