{"BestOfferEnabled": false, "Description": "MIJ, made in japan, Gibson, Lespaul, White, SG, Höfner, Duesenberg, Ibanez, ATELIER Z, ARIA, ESP, Caparison, Killer, COMBAT GUITARS, GUYATONE, Greco, Sugi Guitars, TEISCO, DEVISERA, Nil, Bacchus, VANZANDT, Fernandes, Fender Japan, Fujigen, MOON GUITARS, momose, Yairi Guitar, YAMAHA, TOKAI, Zemaitis, VOX, B, C, Rich, Epiphone, Gibson, Gretsch, Suhr, Schecter, Charvel, Jackson, Dean, Tom Anderson, Fender, Paul Reed Smith, Melancon, Mosrite, Rickenbacker, Robert Benedetto, Washburn, Ibanez, kramer, EDWARDS, Burny, Grassroots, 1980 YAMAHA SL-500S BS Studio Lord Model ~ All Original ~ Very Good ++ condition.Made in Japan Down from here, Photo is dent and scratches etc.. About scratches that are hard to see. To make it easy to understand the condition of the scratches, I lighted the light strongly. 1980 YAMAHA SL-500S BS Studio Lord Model ~ All Original ~ Very Good ++ condition.Made in Japan Body Maple + Agathis. Neck Maple. Frets 22F. Scale 24.75inch (628mm) Gibson Medium Scale. Nut Width About 1.69 inch (43mm). Pickup YAMAHA L-III. Control 2 Volume, 2 Tone, 3-Way PU Toggle switch. Bridge Tune O Machic. Stop Tailpiece. Machine Heads YAMAHA Die-Cast. Color Brown Sunburst. Weight About 8.4 Pound ( 3.81 Kg ). This is Used Guitar. The Clear coating of the head is deteriorating by aging. There are partial shallow dents in 1 to 7 frets. _However that is no problem. _You can play normal guitar playing. There are scratches and dents. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. Is it God 's whim...? I noticed that. That is about maple top. I sold 9 YAMAHA LS Les Paul type in the past in eBay. I checked all the pictures of YAMAHA LS I sold in the past. As a result, all the YAMAHA LS tops were 3 piece maple. This YAMAHA SL500S is 2 piece maple top. I can say RARE. It was manufactured in 1980. It was made 38 years ago. This is a very old YAMAHA Les Paul type. Although it is an old guitar, I think that the scratch is little. I want to boast of the high quality wood of old Japanese guitar. Please look at the Maple top. I sold a lot of the electric guitars in eBay. And I always feel so. Vintage Greco and vintage Aria proII and vintage Epiphone japan are very similar. Vintage Tokai and vintage Burny are very similar. However, I feel Yamaha is not similar to any brand. YAMAHA is characteristic. And I always think about the all old YAMAHA. I think the quality of wood is high anyway. It can consistently say to the old YAMAHA. That can be said for low price SL-380 too. High quality wood is used for this SL-500. I think that you can understand immediately. Making is polite anyway. Sufficient noise countermeasure are given. I think old Yamaha does not care about the cost. There are various reasons for that. Many dielectric paint etc. If you get it, please confirm with your eyes. Current, Some High end model guitars are made in Japan, but others are produced in Yamaha's own factory in China. It may be the cause, but currently in Japan, Yamaha's electric guitar is not popular. This is a Yamaha guitar of a very popular era. Produced by Kasuga musical instrument manufacture. Kasuga musical instrument manufacture was producing acoustic guitar, banjo, violin. Representative brands are \"Heerby\" \"ELECTRA\" \"Gaban\" \"Ganson\" \"RK Herby\" \"The KASUGA\" etc. Currently, it is all evaluated as Japan Vintage. This SL500S has dignity of vintage guitar. About guitar play, Current state, the space between the strings and the frets is narrow. Thanks to that, I feel easy to play the guitar. Un pluged sound is very loud. You can feel vibrations transmitted to the body. I like this pickups of YAMAHA L-III. I feel the very good distortion sound. I recommend for Heavy Metal music or Hard Rock music !! Of course, Clean sound is very well. Old YAMAHA is Great !! It is cleanliness. I polished with guitar exclusive polish, so it is in a very clean state. I after the finger board cleaning, painted beeswax. The aim is moisturizing and and protection. Current neck condition, very good ! roughly straight ! There is no problem with the Truss rod and it can be adjusted. Remaining the frets are 88% on average. You can play immediately after it is delivered to you. I was set new strings. Regular tuning. ( Inch : 009, 011, 016, 024, 032, 042 ) All is working well. It is in a very good condition. The Truss rod Wrench is not included. All Original.Note : The Lock nut and the Whammy bar are not original. Look at the photos, please verify by yourself! It will be professionally pack. Double air packing. And ships inside a sturdy cardboard box. This electric guitar is USED. Please consider it when bidding. Thank you. Payment I accept PayPal only. Please pay within 3 days after the auction closed. Shipping Worldwide shipping from Japan! EMS / Shipping includes a tracking number. / / / Destination cost Delivery time / / / Asia : $1004 ~ 7daysUS Canada : $1205 ~ 8 daysEurope : $1406 ~ 10 daysOceania : $1205 ~ 8 daysSouth America : $2408 ~ 12 days This item is shipped within 3 business days after payment is confirmed. Terms of Sale International buyers - Please Note: Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer's responsibility. Please check with your country's customs office to determine what these additional costs will be prior to bidding/buying. These charges are normally collected by the delivering freight (shipping) company or when you pick the item up -do not confuse them for additional shipping charges. Please contact us first with 30 working days for any returns, Buyer pays shipping cost from buyer's country to Japan when being returned. In case of return, the shipping cost won't be refunded. We sell various kinds of Electric guitars to international customers. Our goal is to provide the best quality products and service and your satisfaction is the most important to us. Happy bidding!! Thank you !!", "ItemID": "254005160662", "EndTime": "2018-12-07T04:46:40.000Z", "StartTime": "2018-11-30T04:46:40.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1980-YAMAHA-SL-500S-BS-Studio-Lord-Model-All-Original-Made-Japan-/254005160662", "ListingType": "Chinese", "Location": "Nagoya-shi,Kita-ku, Aichi", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2540051606628080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMTAy/z/4s0AAOSwUalb~jJJ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg2MTU=/z/S~0AAOSwzDFb~jJP/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/uwAAAOSw~atb~jJb/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/FSUAAOSwg2lb~jJh/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU5OVgxNjAw/z/pc4AAOSwg-tb~jJt/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/MmoAAOSwEp5b~jJy/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/M5UAAOSw5Epb~jJ6/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/IWwAAOSwfX9b~jJ7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTM0MlgxNjAw/z/BbIAAOSwip5b~jJ-/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI2OVgxNjAw/z/MegAAOSwPWtb~jKJ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/JrEAAOSwNpRb~jKM/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQxN1gxNjAw/z/858AAOSwEVlb~jKT/$_57.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jguitar-shop", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 369, "PositiveFeedbackPercent": 100.0}, "BidCount": 6, "ConvertedCurrentPrice": {"Value": 359.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 359.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "l***s", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 225}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Americas", "Europe", "Asia", "AU"], "Site": "US", "TimeLeft": "PT0S", "Title": "1980 YAMAHA SL-500S BS. Studio Lord Model. All Original. Made in Japan.", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Yamaha"]}, {"Name": "Model Year", "Value": ["1980"]}, {"Name": "Model", "Value": ["SL-500S BS"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Exact Year", "Value": ["1980"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Series", "Value": ["Original"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["001991"]}, {"Name": "Body Color", "Value": ["Brown Sunburst"]}]}, "HitCount": 598, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "JP", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 364.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["APO/FPO", "Africa"], "GlobalShipping": false, "ConditionDescription": "Very Good++ Condition. This is Used Electric Guitar. The electric guitar when connect to the amplifier, sound output is normal. There are scratches and Dents. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. Please Read the descriptions for details.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}