{"BestOfferEnabled": false, "Description": "I have a pending trade offer, reserve the right to take down listing before the first bid comes. Though, upon the first bid I pledge to the sale This is a magnificent 2015 Gibson Les Paul Standard. I would like to declare off the bat, I have seen and held in person a minimum of 20 of these 2015 Ocean premium Les Pauls, whoever finished this specific guitar at the factory absolutely hit a grand slam, the deep richness of the aqua blues and the greens together on this one is unlike any other that I have seen before. This one reminds me of the Makena blue finish from Prs, but with this guitars gorgeous metallic fleck it blows the makena blues away. Together with this insanely beautiful Premium Quilt top that seriously looks like moving ocean waves. This quilt was Hand selected and Book Matched By the best technicians that Gibson has. This finish is absolutely the most beautiful that I have ever seen from any brand, the Ocean Water Perimeter blue. A key point with this work of art of a guitar is that it the paint on this specific 2015 (2014 versions used regular paint) version has a stunning metallic blue/aqua flake embedded in the paint and it is the most beautiful paint I’ve ever seen on any guitar from any brand, it glows a gorgeous metallic blue, green and aquamarine shade under the lights unlike any other paint I’ve seen. I know I keep repeating beautiful but just look at that guitar!! Comes with a very high end gold on black Gibson hardshell case! But the photos do the talking on this one. This easily stands side to side of any private stock artist series some that cost over $10,000. The fit, finish, feel and tone is absolutely second to none. This is as good as a guitar gets. Gibson really sweated the details on the 2015 premium quilt models even the Gibson logo is made out of REAL abalone, as are all of the fret inlays and even the knobs!!!! Its just breathtaking I can stare at this for over a half hour and loose track of time. These premium standard guitars are put together by the best technicians that Gibson has. When you hold this masterpiece, feel it, hear it and play it you will be blown away. Guitar sounds glorious and has the best tone woods that Gibson has to offer. I did my best to photograph this beauty in as many variations of lighting as I can. from fluorescent lights, to halogen to natural sunlight so you can see the majestic beauty of this work of art in all lighting. But I definitely have to say the pictures don’t do the justice when you pop open the case, your heart will skip a beat, its like opening a case to a beautiful jewel, the guitar glows like a precious gem especially with the metallic fleck it has a blue sapphire hue to it in the gloss its unlike anything ive ever seen. Guitars like this one rarely or never come up for sale. Grab this one while it’s available. Guitar is in excellent condition just about zero fret wear, just a vague imprint mark from being on the guitar stand on top center of the rear. Also, Gibson has created special brackets that came on this model, the pick guard clicks in and out without needing to drill any screws into this magnificent woodd. All items come as is, as pictured, check photos are they look great! Any questions don’t hesitate to ask!! I am yet to see a guitar this breathtaking for sale, if you don’t take it, some other lucky fellow will Guitar is priced to sell, >>ORIGINAL MSRP $4999", "ItemID": "113527100953", "EndTime": "2019-01-11T02:44:14.000Z", "StartTime": "2019-01-06T02:44:14.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/MAGNIFICENT-GIBSON-LES-PAUL-STANDARD-PREMIUM-QUILT-OCEAN-BLUE-CUSTOM-/113527100953", "ListingType": "Chinese", "Location": "Long Branch, New Jersey", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1135271009538080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTQzMlgxNjAw/z/TBAAAOSwFlJcKV0f/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNTg4/z/qGAAAOSwMpFcKV0X/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/37cAAOSwoylcKV2R/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/6GoAAOSwDEBcKV0e/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/kkoAAOSwHEZcKV0p/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/pCMAAOSwfhlcKV0l/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/hUQAAOSwCwBcKV0Z/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/K-cAAOSw9z1cKV2S/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIzOFgxNjAw/z/GfQAAOSw~xtcKV0m/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODUwWDE2MDA=/z/Kw8AAOSwVYhcKV0n/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNTM0/z/SqoAAOSw5bxcKV0b/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAwNFgxNDk5/z/9qsAAOSwuQhcKV6F/$_12.JPG?set_id=880000500F"], "PostalCode": "07740", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "eddiea3", "FeedbackRatingStar": "Purple", "FeedbackScore": 873, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 2749.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2749.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "m***n", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 0}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "MAGNIFICENT!! GIBSON LES PAUL STANDARD PREMIUM QUILT OCEAN BLUE CUSTOM", "ItemSpecifics": {"NameValueList": [{"Name": "Product Line", "Value": ["Gibson Les Paul"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model", "Value": ["Les Paul Standard"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Exact Year", "Value": ["2015"]}, {"Name": "Style", "Value": ["Les Paul Standard"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Ocean Water Perimeter Candy"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}]}, "HitCount": 210, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 2799.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}