{"BestOfferEnabled": true, "Description": "I bought this sweetheart of a guitar brand new online from Sweetwater in October 2018, so it's only a couple of months old. I paid an extra $200 to have it \"plekked\" before they shipped it out, so it is set up perfectly. The hardshell case has never been used except in shipping, so it is in mint condition. The last pic shows a tiny ding (small lighter spot) right in the middle of the pic. The ding is not noticeable unless you are looking for it. Other than that, the guitar is mint! I checked with my rep at Sweetwater and he verified that their 2-year warranty is transferable. You can check it out on their website. I will give my Sweetwater rep the new owner's contact information immediately after the sale. Why am I selling it so soon? I have arthritis in the base of my left thumb, which unfortunately is getting worse every day, making it painful for me to grip the fretboard. It seems likely now I'll need surgery to remove a bone at the base of my thumb. The recuperation time for this can be up to 6 months or more and, since I'm in my mid 70s, I may never regain full strength in my left hand. I will offer Free Shipping with Insurance, so someone would need to be available to sign for it. The essence of the Taylor playing experience lives within the rosewood/spruce 800 Series, which includes this 814ce DLX V-Class Grand Auditorium acoustic-electric. With the debut of its comprehensive redesign in 2014, master guitar designer Andy Powers took what was already Taylor’s flagship guitar and deployed an array of voicing enhancements, ranging from customized bracing and wood thicknesses for each body style to the use of protein glues and ultra-thin finish, to bring out another level of musicality. Taking these enhancements one step farther in 2018 with Taylor's innovative V-Class bracing, together, these refinements deliver much more than the sum of their parts. For everyone from pros to hobbyists, they make the playing experience more expressive, inspiring and fun. The volume, the sustain, the \"in-tune-ness\" of the instrument and its high-fidelity sonic detail combine to deliver a new level of player experience. The 814ce DLX V-Class guitar also features a specially designed radius-style armrest in maple with rosewood top edge trim, Sitka spruce bracing, and chrome Gotoh tuners. The radius armrest actually takes the edge off the playing experience, easing the physical stress on your strumming or picking arm. Sitka spruce bracing supercharges the tonal response to create a more dynamic voice. Gotoh 510 tuners supply a higher 21:1 gear ratio to give you finely calibrated tuning control. The 814ce DLX V-Class guitar comes with Taylor Expression System 2 electronics and ships in a Taylor deluxe hardshell case for optimal fit and protection.Body ShapeA Taylor original, the Grand Auditorium helped establish the Taylor acoustic sound. The popular body style makes for a versatile guitar that yields ample volume in response to light fingerpicking, and reacts to medium strumming and flatpicking with a clear, balanced sound across the tonal spectrum. If you want a great all-purpose guitar, the GA is an excellent choice.Tonewood PairingA guitar's top is the primary filter and distributor of vibrating string energy through the guitar, which means it has a huge impact on its sound. Sitka Spruce is the most prevalent guitar top wood of the modern era. It blends stiffness and elasticity in just the right proportions, which translates into broad dynamic range with crisp articulation. Solid Indian rosewood back and sides complement the Sitka top with sound that's made it one of the most popular tone woods ever. Rosewood produces the strongest bass response among the tonewoods commonly used for guitars, with a slightly scooped midrange. Rosewood's sweeping frequency range - deep lows that assert a throaty growl with sparkling highs - rings out with bell-like, high-fidelity clarity. It yields a full-range acoustic voice with complex overtones and extended sustain.ElectronicsTaylor's ES2 is a revolutionary pickup design that delivers the latest in Taylor’s ongoing innovation in acoustic guitar amplification. The heart of the Expression System 2 is Taylor’s patented behind-the-saddle pickup, which features three uniquely positioned and individually calibrated pickup sensors. Because the pickup doesn't sit under the saddle, the bottom of the saddle comes in full contact with the bridge, allowing all the nuance of the guitar's tone to come through clearly whether playing acoustically or plugged-in. The location of the sensors enables a more dynamic range of acoustic sound to be captured than ever before while playing plugged-in. Together with Taylor’s custom-designed “professional audio”-grade preamp, this system produces exceptional amplified tone and responsiveness. On stage through a PA, plugged into your favorite acoustic amplifier, or direct into recording software, the Expression System 2 faithfully conveys the voice of your Taylor guitar. The Taylor Expression System 2 operates through a proprietary 9-volt battery compartment and easy-to-use volume, and active bass and treble controls.Other FeaturesTaylor's V-Class bracing is a fundamental innovation in acoustic guitar design. It marks an important evolution beyond traditional X-bracing, introducing an entirely new platform for acoustic performance. It is essentially a \"sonic engine\" that optimizes the response of an acoustic guitar in three key ways: by boosting volume, sustain, and by largely resolving the intonation (in-tune-ness) issues that have long plagued acoustic guitars. V-Class bracing creates purer, more orderly notes that don't cancel each other out or sound \"off\". They have clearer, more consistent response, and the whole fretboard is brought into greater sonic alignment for a more musical playing/listening experience. Guitars with V-Class bracing are easier to tune; the pitch sounds purer and more solid, and electronic tuners can more easily locate notes for quick, precise tuning. Other benefits: harmonics ring more uniformly down the neck, notes are louder with more projection and sustain, and notes are more consistent, i.e., upper register notes don't get choked out or swallowed. Fewer \"sour\" sonic qualities exist with chords; a more agreeable relationship is created between notes as they ripen, bloom and decay.The Taylor DifferenceWhat sets Taylor Guitars apart? Unmatched build quality, the most stable and playable necks, a vast array of tonal options, eco-conscious and ethically-sourced raw materials, and a lifetime of service and support. Sitka spruce V-Class bracingGotoh 510 tunersMaple radius armrest with rosewood edge trimCustom-calibrated wood thickness3.5 mil finish thicknessProtein glue (bracing and bridge)Indian rosewood pickguardRosewood top trimSingle-ring abalone rosette edged with rosewoodPearl \"Element\" fingerboard inlayMaple binding (non-figured)", "ItemID": "292915048162", "EndTime": "2019-02-05T13:19:22.000Z", "StartTime": "2019-01-11T16:57:03.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Taylor-814ce-2018-DLX-V-Class-Grand-Auditorium-Acoustic-Electric-Guitar-Natural-/292915048162", "ListingType": "FixedPriceItem", "Location": "Derwood, Maryland", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2929150481628080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NjQwWDQ4MA==/z/OtoAAOSwpppcN79u/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjQwWDQ4MA==/z/wYIAAOSwDgJcN793/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjQwWDQ4MA==/z/jkgAAOSwc9VcN7-J/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjQwWDQ4MA==/z/ISkAAOSwmFxcN7-Q/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjQwWDQ4MA==/z/ANAAAOSwJ~xcN7-a/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjQwWDQ4MA==/z/jJUAAOSwxO9cN7-f/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjQwWDQ4MA==/z/bjMAAOSwZddcN7-l/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjQwWDQ4MA==/z/eL4AAOSwV3dcN7-u/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjQwWDQ4MA==/z/JZQAAOSwQqZcN7-2/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjQwWDQ4MA==/z/0OYAAOSwJOJcN7~G/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NDgwWDY0MA==/z/wSgAAOSwpYxcN7~S/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjQwWDQ4MA==/z/MS8AAOSw8U9cN7~-/$_32.JPG?set_id=880000500F"], "PostalCode": "20855", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "hmilne-half", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 248, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 3150.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 3150.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "e***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 208}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Taylor 814ce 2018 DLX V-Class Grand Auditorium Acoustic-Electric Guitar Natural", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Taylor"]}, {"Name": "Model Year", "Value": ["2018"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["814ce DLX V-Class Grand Auditorium"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Body Type", "Value": ["Grand Auditorium"]}]}, "HitCount": 283, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}