{"BestOfferEnabled": false, "Description": "We are a guitar shop, an authorized PRS Dealer, and this was purchased new here a couple of years ago and then traded in on a Zach Myers. SE Flame Top 245 Soapbar. Set mahogany neck in mahogany body, flame maple top in Tobacco Sunburst. Singlecut body with wide fat neck. Near mint to say the least, you will be hard pressed to tell this from when it was new. No visible wear, no fret wear, an easy 9.75 out of 10 overall. Plays low and clean, neck is perfectly straight, electronics work perfectly. Gone through professionally by us an authorized PRS Dealer. Includes PRS soft case. Made in Korea.From PRS:Superb PRS Singlecut with SoapbarsThe PRS SE 245 Soapbar solidbody electric guitar packs sleek looks, exceptional playability, and amazing tone into a comfortably familiar form factor. If you grew up playing single-cutaways, the SE 245 Soapbar's 24.5\" scale will instantly feel like home. The SE 245 Soapbar sports two single-coil pickups that'll go from refined to raunchy with a twist of your volume knob. Wrap your hand around the wide-fat profile neck, and let your fingers fly on the rosewood fingerboard with its classic bird inlays. The PRS SE 245 Soapbar will add single-coil spank to your single-cut tones.PRS SE 245 Soapbar Solidbody Electric Guitar at a Glance:Short scale, single cut, and ready to rockA great looking guitarTwo SE Soapbars provide tonal flexibilityShort scale, single cut, and ready to rockThe Paul Reed Smith SE 245 Soapbar takes the popular platform of a PRS Singlecut and gives it a vintage-style shorter scale. The 24.5\" scale length will feel immediately familiar in the hands of any fans of older carved-top single-cutaway electric guitars. The scale also offers a slinkier string feel across the fretboard for easier string bending and lighter string tension when chording. This looser string feel also gives you a warmer tone with a fat, singing quality.A great looking guitarThe SE 245 Soapbar is sleek and beautiful. The beveled top of the guitar is not only comfortable to play, but it adds a high-class visual statement to the instrument. Maple binding surrounds the body of the SE 245 Soapbar, offsetting the finish with an organic-looking outline. And the trademark Paul Reed Smith bird inlays are on full display across the length of the 22-fret fingerboard. Sweetwater players agree that these guitars look and play like much more expensive instruments.Two SE Soapbars provide tonal flexibilityThe PRS SE Soapbar pickups on this instrument are incredibly versatile, offering the bell-like tones of single-coils and the warm chunk of humbuckers. And they do it in a way that still retains that classic soapbar midrange growl. These sonic characteristics make soapbars play equally well with shimmering clean tones and raw, loud distorted guitar tones. If you have to grab a single guitar to cover a lot of sonic ground, the SE 245 Soapbar's pickups help make this guitar a great option.PRS SE 245 Soapbar Solidbody Electric Guitar Features:A shorter-scale Singlecut with soapbar pickupsSingle-cut mahogany body24.5\" scale for a slinkier feelWide-fat profile mahogany neck with rosewood fingerboardClassic PRS bird inlaysPRS-designed stoptail bridge and tuners2 PRS SE Soapbar single-coil pickups", "ItemID": "123631129495", "EndTime": "2019-02-06T00:38:04.000Z", "StartTime": "2019-02-05T18:59:32.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/PRS-SE-245-Singlecut-Soapbar-Flame-Top-W-PRS-Case-/123631129495", "ListingType": "FixedPriceItem", "Location": "Wausau, Wisconsin", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1236311294958080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/3gcAAOSwpFtb8x5g/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/NUQAAOSwRrlb8x5v/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/sWsAAOSwXAxb8x5z/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/pVUAAOSwQwFb8x5-/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/S-kAAOSwiqBb8x6C/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/GucAAOSw1hJb8x6G/$_57.JPG?set_id=8800005007"], "PostalCode": "54401", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "octoberguitars1", "FeedbackRatingStar": "Red", "FeedbackScore": 1452, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 399.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 399.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "d***g", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 116}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "PRS SE 245 Singlecut Soapbar Flame Top W/PRS Case", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["PRS"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Model", "Value": ["SE 245 Flame Top"]}, {"Name": "Body Color", "Value": ["Tobacco Sunburst"]}, {"Name": "Product Line", "Value": ["SE"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["Korea, Republic of"]}, {"Name": "Model Year", "Value": ["2016"]}, {"Name": "String Configuration", "Value": ["6 String"]}]}, "HitCount": 6, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=33191330", "StoreName": "acousticcreation"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "ConditionDescription": "You will be hard pressed to tell this from new.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}