{"BestOfferEnabled": true, "Description": "CALL OR TEXT G-BRAT’S GUITARS ANYTIME; (972)816-7736 You are looking at a 2012 PRS Custom 24 with a Eriza Verde V12 finish on a nicely flamed maple top with birds fret inlays and tremolo! The back plate on this one has also been signed by the great Paul Reed Smith himself, so there’s nice added bonus for the proud new owner. Aside from her gorgeous looks, she's also a great player, with a nice low & easy action... and she sounds like a great PRS should! She's 100% original and we just put on a fresh new set of 10-46’s, so she’s all dressed up and ready to rock! Here is the lowdown on the features:Model: Custom 24Color: Eriza Verde, V12 glossTop: Carved flamed mapleBody: MahoganyNeck, Mahogany, set neckNeck Profile: Wide/thinFretboard: Indian rosewoodFret Inlays: BirdsHardware: NickelPickups: PRS 59/09 bass & treble humbuckersControls: 1 volume, 1 tone and 5-way blade switchKnobs: Clear lampshadesBridge: PRS tremolo bridge, includes the tremolo barTuners: PRS phase III, locking, nickelBack-Plate: Hand-signed by Paul Reed SmithWeight: 8.2 lbs.Serial # 12 164212 She was born on January 20th, 2012 and has been played. There are several minor nicks, as well as scratches on the back, and below the treble strings. The guitar really does have a clean appearance despite these flaws.The neck is straight, with no cracks or repairs... the frets show some minor wear, but still have plenty of life ahead of them, and it sounds like a great PRS should! Also included is the original PRS hard shell case (which has considerable wear) and although the bird tag is missing, it does include the other case candy, adjustment tool & tremolo bar, just as shown in the last picture! Whoever brings this baby home is gonna be STOKED!! LET'S GO!! If you have any questions, please call anytime at; (972)816-7736 WHILE YOU ARE HERE, GO AHEAD AND LOOK AT MY OTHER LISTINGS!! OUR CLIENTS ARE THE BEST IN THE WORLD!! Me- I have a 100% positive feedback rating, and intend to keep it that way! So please don't worry! You're in good hands here!! Shipping- We take pride in packing our guitars well, and shipping them quickly. Please note, if you are paying with Pay Pal, we will only ship to the address that is listed in Pay Pal. Here are the shipping rates, covering the planet earth:USA - $49 with UPSCanada, Hawaii, Alaska, Puerto Rico - $119Brazil, Argentina - $159Australia, New Zealand, Switzerland - $219 USPS Express or $249 UPSAll Other Worldwide Shipping - $219 - UPS Worldwide Expedited (in most cases); However, if UPS is more costly in certain countries, USPS will then be used instead. Payment Methods- Pal Pal is preferred!! We do also accept direct payment with Mastercard, Visa, American Express and even Discover! ~ TEXAS RESIDENTS ARE REQUIRED TO ADD 8.25% SALES TAX ~ Factory Warranty- We are an authorized dealer for: Knaggs, Ken Smith, Trussart, Warwick, Breedlove and Warrior, so for these instruments, if listed as NEW, there is a full factory warranty. For all other brands, or if listed as USED, there is no warranty available. Return Policy- We do accept returns up to 14 days from the point of the initial sale, which means that the guitar must be back in our possession within this 14 day period. However, please be aware of the following conditions: If for any reason you wish to return the guitar, just call or email me directly, within 24 hours of your receiving the item, and let me know that you want to return it. Once we receive the guitar back, in the same condition, you will receive a refund, less a $50 restock fee. Also be aware that the initial shipping fee is not refundable under any circumstances. International Bidders- We, at G-Brat's Guitars, are HONORED to do business with anybody on the planet earth... So international buyers are VERY welcome here! That being said, please observe the following conditions: If you are paying with Pay Pal, please be completely registered with Pay Pal, prior to the purchase; this will help avoid shipment delays, and will assure that you will get your guitar as quickly as possible!International shipments usually require additional \"Customs Fees\" or \"Import Taxes\". These fees will vary, depending on the country, and are the responsibility of the buyer. If you want more information on what these fees entail, please contact your local customs office for this information. THANK YOU SO MUCH FOR LOOKING!!! _gsrx_vers_827 (GS 7.0.13 (827))", "ItemID": "362496243897", "EndTime": "2018-12-26T07:00:03.000Z", "StartTime": "2018-11-27T14:10:09.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2012-PAUL-REED-SMITH-PRS-CUSTOM-24-FLAME-TOP-BIRDS-ERIZA-VERDE-SIGNED-/362496243897", "ListingType": "FixedPriceItem", "Location": "Red Oak, Texas", "PaymentMethods": ["PayPal", "VisaMC", "Discover", "AmEx"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/3624962438978080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Y2IAAOSwdPBbrTO9/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/v1MAAOSwtItbrTO8/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/4mIAAOSwespbrTO-/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/GrkAAOSwQjxbrTO-/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/308AAOSweTlbrTO~/$_3.JPG", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/i4EAAOSw8lhbrTPB/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/UX0AAOSwuM9brTPA/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/4mkAAOSwespbrTPB/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/E6EAAOSw2jNbrTPC/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/E8wAAOSwjCVbrTPE/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/inoAAOSwj6lbrTPD/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/AdwAAOSwLOdbrTPG/$_3.JPG"], "PostalCode": "75154", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "guitarbrat1", "FeedbackRatingStar": "Red", "FeedbackScore": 3672, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 2499.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2499.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "n***d", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 16}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "2012 PAUL REED SMITH PRS CUSTOM 24 FLAME TOP & BIRDS ~ ERIZA VERDE ~ SIGNED", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Paul Reed Smith"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Model", "Value": ["Custom 24"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Color", "Value": ["Eriza Verde"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Model Year", "Value": ["2012"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}]}, "HitCount": 287, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=43416548", "StoreName": "guitarbrat1"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "14 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Very Good Condition", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}