{"BestOfferEnabled": false, "Description": "Hey there!! Thank you for looking at this auction. I’m sadly selling this near mint, amazing guitar from one of my favorite bands of all time U2. This guitar has sat in the case in my climate controlled studio for months and months now and has been brought out once in awhile as a back up guitar on stage and for studio recordings. Again this guitar is in solid meticulously clean condition. I have only ever played after being setup by my guitar tech, less then six times since. It is setup with low action, zero buzz with Elixir Nanoweb 10’s. This guitar was purchased BRAND NEW from Sweetwater for $1849. If you know anything about Sweetwater they have the best inspections on and care for all of their guitars. *******My only beef with them is the original case that implied a G&G style case but was not as it was made in China....was pure garbage. Also the original case did not hold the guitar properly in the case because of the 70’s style headstock. The neck wasn’t even supported in the case! It was supported by headstock in the case. Needless to say they sent me a better hardshell case that fit the guitar perfectly and snug to protect my nearly $2000.00 guitar. So it DOES NOT COME WITH ORIGINAL CASE! Please stop asking me.******** It comes with all of the case candy including the strap that is unused. Please let me know if you have any questions I can answer. And please only bid if you are willing to buy. Thank you and God Bless!! Here’s what Sweetwater has to say about this guitar: A Player's Strat with Edge-designed Specs No doubt about it: The Edge's Stratocasters helped inspire the signature tones on countless U2 records and set a new standard for what the instrument could do. That's why Fender was pleased to offer The Edge a signature Strat that he not only endorses, but plays personally out on the road in arenas all over the world! The Edge Stratocaster features a jumbo '70s-style headstock with Edge's autograph on a fast maple neck, premium Fender pickups with aged pickup covers and knobs, and the American Deluxe's two-point synchronized tremolo bridge for Edge's haunting sustain and subtle shimmery vibrato. If you love The Edge's tone as much as Sweetwater guitarists, do yourself a favor and check out The Edge Signature Fender Stratocaster. A great Fender Strat all players can appreciate Whether you've studied The Edge's style and tones or you just want a great-playing Strat with classic-styled appointments, the Fender Edge Signature Stratocaster delivers. With its comfortable alder body, fast maple neck, and versatile, responsive, punchy, and soulful pickups, it's no exaggeration to say the Fender Strat has helped shape the very sound of rock 'n' roll for the past 60 years. Fender The Edge Signature Stratocaster Features: Designed in close collaboration with The Edge of U2 3 premium Fender single-coil pickups to re-create classic Edge guitar tones Black finish harkens back to Edge's \"Blackie\" Strat Aged pickup covers, knobs, and pickup selector provide contrast atop a white pickguard 2-point synchronized tremolo bridge enhances sustain and adds color to chords and leads Alder body for light weight and a punchy, balanced sound Classic Fender maple neck and fingerboard with dot inlays Get Edge-inspired rock tones with the Fender Edge Signature Stratocaster!", "ItemID": "163477389994", "EndTime": "2019-01-19T04:00:35.000Z", "StartTime": "2019-01-09T04:00:35.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/FENDER-The-Edge-Artist-Series-Stratocaster-Excellent-Condition-Made-USA-/163477389994", "ListingType": "Chinese", "Location": "Poulsbo, Washington", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1634773899948080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMDg2/z/fjMAAOSw64xcNVqB/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMTA0/z/ewMAAOSwl1FcNVqV/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzQ5WDUwMA==/z/YgoAAOSwNqxcNVqX/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/7PUAAOSw5xhcNVqT/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/92AAAOSwcqhcNVqd/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/HmEAAOSwQZVcNVqa/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/gmsAAOSwTEZcNVqh/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/mLMAAOSwvcFcNVqX/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/u~sAAOSwMQ1cNVqK/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/5iUAAOSwEUdcNVqR/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/GEMAAOSwUlFcNVqf/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/FWMAAOSwGq5cNVqO/$_12.JPG?set_id=880000500F"], "PostalCode": "98370", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jesus_is_king_777", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 359, "PositiveFeedbackPercent": 100.0}, "BidCount": 15, "ConvertedCurrentPrice": {"Value": 1269.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1269.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "n***1", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 162}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "FENDER “The Edge” Artist Series Stratocaster Excellent Condition!!! Made In USA", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "Model Year", "Value": ["2016"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Black"]}]}, "HitCount": 297, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 1294.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}