{"BestOfferEnabled": false, "Description": "Barely used Epiphone Les Paul Traditional guitar with hard shell case for sale here. I'm a single coil kind of guy, but from time to time I decide that I must be missing something and pick up a guitar with humbuckers. I bought this new about a year and a half ago and have had it out of the case less than a dozen times. It's a really nice guitar - I just haven't bonded with the LP style (again). The neck is on the fuller side, the pickups sound great to me (that doesn't usually happen), and the gold top finish is beautiful. No dents or scratches anywhere on the guitar and all electronics work great. The Volume knobs have a push / pull switch that allows the neck or bridge pickup to be split for single coil operation.The frets have no wear, neck is straight and the truss rod works fine. Be advised that these models don't have a gloss finish on the back of the body and neck (don't want you to be surprised).I just don't pick it up much - so it's time to pass it along to someone who appreciates the LP body & scale length.Ships with a hard shell ABS case. See the Epiphone write-up below for all details: Features Body Body shape: Single cutaway Body type: Solid body Body material: Solid wood Top wood: Not applicable Body wood: Mahogany Body finish: Gloss Orientation: Right handed Neck Neck shape: D standard Neck wood: Mahogany Joint: Set-in Scale length: 24.75 in. Truss rod: Standard Neck finish: Gloss Fretboard Material: Rosewood Radius: 14 in. Fret size: Medium jumbo Number of frets: 22 Inlays: Trapezoid Nut width: 1.68 in. (42.67 mm) Pickups Configuration: HH Neck: Alnico Classic Middle: Not applicable Bridge: ProBucker 3 Brand: Epiphone Active or passive pickups: Passive Series or parallel: Series Piezo: No Active EQ: No Special electronics: Push/pull coil taps Controls Control layout: Volume 1, volume 2, tone 1, tone 2 Pickup switch: 3-way Coil tap or split: Coil split Kill switch: No Hardware Bridge type: Fixed Bridge design: Tune-o-matic Tailpiece: Stopbar Tuning machines: Grover Color: Chrome Other Number of strings: 6-string Special features: Pickups Case: Sold separately Accessories: None Country of origin: China Professional Electronics. The Les Paul Traditional Pro uses Epiphone's 4-wire, nickel/silver base humbuckers with newly tooled, USA-style bobbins. In the neck position is the Alnico Classic Pro humbucker with Alnico-II warm, thick vintage tone and open zebra coils. It's uniquely paired with Epiphone's ProBucker-3 humbucker. An inspired by version of Gibson's BurstBucker-3, the Les Paul guitar features unevenly wound coils and Alnico-II magnets that replicate that \"Patent Applied for\" airy tone. You'll love the way they sound! To top it all off, both volume controls feature push/pull potentiometers allowing you to coil-split each pickup for single-coil sounds. Combined with the 3-way toggle, you get 6 unique sounds from one great Les Paul guitar. Tone Woods with Great Feel! The Epiphone Les Paul Traditional Pro guitar has a solid mahogany back with a carved top and a solid mahogany neck that's hand-fitted and glued into the body for excellent neck-to-body contact and acting almost like one continuous piece of wood. The guitar neck features a SlimTaper D profile with a smooth and fast \"worn\" type finish on the back of the neck and body. Loaded with premium add-ons! Other features on the Epiphone Les Paul included quality Grover tuners, a traditional cream-colored pickguard, LockTone Tune-O-Matic bridge/stopbar, and Epiphone's own StrapLocks.", "ItemID": "143100226186", "EndTime": "2019-01-27T16:01:25.000Z", "StartTime": "2019-01-22T16:01:25.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Epiphone-Les-Paul-Traditional-Pro-Gold-Top-Electric-Guitar-/143100226186", "ListingType": "Chinese", "Location": "Chardon, Ohio", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1431002261868080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/Bs0AAOSwuZVcRguO/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU1NlgxMjMw/z/SLYAAOSwQXlcRgvL/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTUyMFgxNDkw/z/quUAAOSwwZVcRgvw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU3M1gxMDQx/z/lrkAAOSws~dcRgzg/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU2OVgxMTA3/z/iVoAAOSwsO5cRgz6/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/oAkAAOSwFtNcRgyJ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/s6QAAOSwvGZcRgyU/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/oVcAAOSwMkdcRzIu/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU3OFgxMzQ5/z/svkAAOSw~JFcRg0f/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/6w4AAOSwGMdcRg0p/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/-MIAAOSw~bhcRgy8/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/y7YAAOSwmaJcRgzD/$_57.JPG?set_id=8800005007"], "PostalCode": "44024", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "lucky_gump", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 417, "PositiveFeedbackPercent": 100.0}, "BidCount": 44, "ConvertedCurrentPrice": {"Value": 365.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 365.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "5***g", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 62}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Epiphone Les Paul Traditional Pro Gold Top Electric Guitar ", "ItemSpecifics": {"NameValueList": [{"Name": "Model", "Value": ["Les Paul Traditional PRO"]}, {"Name": "Body Color", "Value": ["Gold Top"]}, {"Name": "Model Year", "Value": ["2017"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Soundboard Style", "Value": ["Archtop"]}, {"Name": "Size", "Value": ["Full Size"]}, {"Name": "Country/Region of Manufacture", "Value": ["China"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "Body Material", "Value": ["Mahogany"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "MPN", "Value": ["ENLTEBSNH3"]}]}, "HitCount": 883, "Subtitle": "Like New Condition with Hard Shell Case - No Reserve!", "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 370.0, "CurrencyID": "USD"}, "ProductID": {"Value": "137052777", "Type": "Reference"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Fully functional guitar - all parts working properly and in excellent condition", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}