{"BestOfferEnabled": false, "Description": "--> Yamaha PAC611VFMX Pacifica Electric Guitar (Translucent Black) Used This item is slightly used and has been thoroughly checked out by our experts to make sure it is in perfect working condition. We then re-sealed it in its original packaging with all factory included accessories. This item is guaranteed to be in \"as new\" condition and has virtually no cosmetic imperfections. This item is covered with a one year warranty from Sam Ash. The Yamaha Pacifica PAC611VFMX is a guitar for players who are serious about tone and versatility. The body is carved from alder and comfort-contoured so that it fits your posture standing or seated. Translucent satin finishes boast a flamed maple top for that classic tonewood combination. The Yamaha PAC611VFMX also features a maple bolt-on neck with 22 frets on a flat 13.75” radius rosewood fretboard which allows for luxurious string bending. Select a wide range of tones from a 3 position switch and choose between a classic Seymour Duncan SP90 in the neck position, or go for a little extra by selecting the Duncan TB-14 bridge position humbucker. The 611VFMX has expansive tonal variety from a Push/pull Coil Split built into the master tone control. A set of Grover Locking Tuners and a Wilkinson VS50 Bridge round out this affordable package that will deliver an endless variety of tones! Case not included.Get your Yamaha Pacifica PAC611VFMX Electric Guitar today at the guaranteed lowest price from Sam Ash Direct with our 45-day return and 60-day price protection policy. Shipping Information Your gear will ship out within 2 days of order confirmation. At this time we can not ship PO Boxes, APO and FPO locations. Industry Leading 45-Day Return Policy We stand by the products we sell, and we'll certainly stand by you as well! We truly appreciate your business, and we want you to be 100% happy with your purchase. However, we know that one of the drawbacks of internet shopping is that you can't try something before you buy it. That's where our money-back guarantee comes in. If you are not completely satisfied with an item, for any reason, you can return it within 45 days of the shipping date for a complete refund of the merchandise price.* Have a question about your order? A Sam Ash Customer Service specialist is available to help! Call 800-472-6274, Monday - Saturday, from 10:00AM - 6:00PM EST. Due to the complexity of international shipping, we are unable to accept any returns on international orders. Before making a purchase outside of the United States, please know that products sold by Sam Ash use the standard 120V/60Hz voltage standard. Sam Ash is not responsible for any damage caused by not adhering to the voltage requirements. *All returns must be within 45 days of the date the item was shipped. Please do not accept any shipment if the packaging appears damaged in any way. We strongly suggest that you check your order after receiving it to be sure that it is in proper working order. Returned items must be in resalable condition. Resalable Condition means that the product(s) is exactly in the same condition as you received it. All exchanges must be pre-paid, returned in original packing, complete with blank warranty cards, owner's manual and show no sign of wear or abuse. In the event that the product is not in the same condition as you received it you may be subject to a minimum 15% restocking fee, repair charge or disqualification. Shipping and handling charges are non-refundable. Please call our Customer Service department if you have any questions about returning an item. CDs, DVDs, video tapes, sheet music, books, strings, computer hardware/software, drum heads, harmonicas, mouthpieces, sound cards, microphones, raw speakers, studio furniture, blank CDs/Tapes or Special Orders are not covered by this return policy.", "ItemID": "173815268589", "EndTime": "2019-02-28T21:10:58.000Z", "StartTime": "2019-02-28T00:16:19.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Yamaha-PAC611VFMX-Pacifica-Electric-Guitar-Translucent-Black-Used-/173815268589", "ListingType": "FixedPriceItem", "Location": "Tampa, FL", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1738152685898080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MzcxWDUwMA==/z/sG4AAOSwXoJcdyhU/$_1.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "samashdirect", "FeedbackRatingStar": "PurpleShooting", "FeedbackScore": 59073, "PositiveFeedbackPercent": 99.3, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 490.88, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 490.88, "CurrencyID": "USD"}, "HighBidder": {"UserID": "o***w", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 102}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Yamaha PAC611VFMX Pacifica Electric Guitar (Translucent Black) Used", "HitCount": 13, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1111655870", "StoreName": "Sam_Ash_Music_Direct"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "DiscountPriceInfo": {"OriginalRetailPrice": {"Value": 1050.0, "CurrencyID": "USD"}, "PricingTreatment": "STP", "SoldOneBay": false, "SoldOffeBay": false}, "ExcludeShipToLocation": ["Alaska/Hawaii", "APO/FPO", "US Protectorates", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "SKU": "YPAC611MT", "NewBestOffer": false}