{"BestOfferEnabled": true, "Description": "58 Epiphone Flying V KorinaMade in Korea This is not your average Epi 58 Flying V KorinaThis one has lots of upgrades! Let's start with the bridge. The original was chucked and the bushing removed, the hole for the bushing was filled, and Gibson ABR-1 studs and bridge were installed. This makes for a very resonant guitar which is acoustically louder than before, with better sustain and tone. This is now just like the Gibsons are set up. Then 500k CTS Pots were added, together with a Bumblebee cap, and made in USA Switchcraft pickup selector switch. The pickups are made in USA Diamarzios with a DP193 Air Norton in the bridge, and DP103 36th Anniversary PAF in the neck.The Air Norton is a slightly hot output pickup with an in circuit resistance of 11.56 k ohms, and the Anniversary PAF stays true to vintage specs with a resistance of 7.58 k ohms. These two pickups pair very nicely, with both having very nice midrange tone. The Air Norton is surprisingly very clean, and screams when turning up the gain on your favorite tube amp. I tested this on my Fender Bassman and pinch harmonics were a breeze. Very nice midrange honk. Now, about the guitar. According to its serial number this particular Epi was made in February of 2009 at the Unsung plant in Korea. There's lot's of speculation in many forums about whether these were made with actual Korina wood or just laminated with Korina using basswood as the body wood, with maple for the necks. Basswood is a very plain wood with barely distinguishable wood grain. If you scroll down and look at the pictures I took of the control and pickup cavities you can clearly see Korina grain. I'm not implying that all 58 Epi V's are like this. After all, there were many plants throughout the years that made these, and some may have been Korina veneered Basswood. But not in this case. From what I can see looking at the edges of this guitar, this is a two piece Korina body with the center line being slightly off center, with veneered top and back. As a matter of fact, there is a very cool black Korina streak running through the length of the upper wing, with no distinguishable seems along the edge that would be a tell-tale sign of a multi-piece body. The neck is maple with a scarf jointed headstock, and Grover tuners. The frets are in great condition. The action is low, with no buzzing or cancelling of notes across the fingerboard. Whoever put this guitar together did an amazing job! The guitar is a delight to play, and I'll go as far as saying it has nothing to envy a made in USA Gibson over. The gold finish on the hardware is in great shape, and the pickup covers are new Gibson gold covers that I installed. The bridge pickup cover has a small scratch that runs parallel with the G string and right under it, so you can't really tell unless you intentionally look for it. There is a pin sized small ding by the poker chip (picture included). Other than this there are no dings, bumps, chips, or scratches anywhere on the finish. Flying V's are prone to bumps and chipping on the bottom of the wings. Below, I've included plenty of pictures to show that there are no defects in this and/or other areas. If I missed a specific area that you would like to see, don't hesitate to reach out for extra pictures. The poker chip and truss rod cover still have the protective plastic over them. A very nice pink lined hardshell case is included. Way nicer than the original Epi case. Shipping is to the contiguous US only. Sorry, no Intl shipping. Thanks for looking!", "ItemID": "192812143873", "EndTime": "2019-02-18T20:53:17.000Z", "StartTime": "2019-02-02T01:25:34.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Epiphone-58-Flying-V-Korina-/192812143873", "ListingType": "FixedPriceItem", "Location": "Hialeah, Florida", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1928121438738080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/wbYAAOSwAdFcVOBh/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/-fYAAOSwsTJcVOBS/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/qzoAAOSwl7dcVOB5/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/QoQAAOSwvGZcVOCM/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/vSkAAOSwwqVcVOCb/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/h0EAAOSw7StcVOCv/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/vqkAAOSwGplcVODC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/ScMAAOSwC~9cVODQ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/pTEAAOSw0xtcVODu/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/LqAAAOSwg0dcVOD7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/A6QAAOSwxtVcVOEN/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/h8EAAOSwS2lcVOEh/$_57.JPG?set_id=8800005007"], "PostalCode": "33015", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "greenwebslinger", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 221, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 699.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 699.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "1***1", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 346}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Epiphone 58 Flying V Korina", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "Model", "Value": ["58 Flying V Korina"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Natural"]}, {"Name": "Body Material", "Value": ["Korina"]}, {"Name": "Model Year", "Value": ["2009"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Product Line", "Value": ["Epiphone Designer Series"]}, {"Name": "Country/Region of Manufacture", "Value": ["Korea, Republic of"]}]}, "HitCount": 252, "Subtitle": "\"LOOK\" Not your average Epi Flying V Korina!", "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "ConditionDescription": "This is not your average Epiphone Flying V. Please see description for details and additional pictures.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}