{"BestOfferEnabled": false, "Description": "Up for sale, a 2015 Gibson Memphis limited edition ES-335 Satin in excellent condition and in perfect working order. A discontinued model with pearl small block inlays, this guitar captures the look and tonal profile of an early '60s 335, with \"Mickey Mouse\" rounded body cutaways, a slender C shaped profile, and Burstbucker PAF reissue humbuckers. The handwound humbuckers give this ES-335 tight low end, complex midrange, and sweet highs, consistent with Gibson's golden era vintage PAF (\"Patent Applied For\") pickups. The pickups have ample clarity and power, with a slightly hotter bridge pickup and a sweet and smooth neck position humbucker that has great bloom and complex harmonic content. Lightweight at only 7lbs 14oz, this 335 has a defined and balanced acoustic voice that translates well through the pickups, and it's easy to see why the ES-335 has historically been one of Gibson's most versatile models, adopted by a wide range of genres for its ability to provide everything from nuanced cleans to rich, powerful drive. We've had this 335 professionally setup here at Mike & Mike's Guitar Bar with 10-46 strings and comfortable action. The one-piece mahogany neck has a slender and fast C shaped profile which measures .810\" deep at the first fret, filling out to .907\" at the 12th fret, and since the profile has constant contact with the palm of the hand, the lacquer in this area has been buffed to a gloss sheen. Gibson made note of redesigning the neck binding for this iteration of the 335 too, with rolled edges for a smoother playing experience. The stock fretwire shows light wear beneath the plain strings on frets 1-5, with wear only extending beneath the B string until the 7th fret, and virtually no wear further up the fretboard. The frets retain their full factory height and have plenty of meat and life. The nut measures a full 1 11/16\" in width and the headstock is fitted with original Grover Rotomatic tuning machines. On the body, all of the electronics work as intended, with individual Volume and Tone controls for each pickup. The neck pickup also has a factory \"treble bleed\" capacitor to keep treble frequencies present when rolling down the knob. The original chrome hardware and plastic parts are all accounted for, and Gibson used titanium bridge saddles for this model, ensuring long life and optimal tone. Cosmetic wear on the satin nitro lacquer finish is limited to some scuffing in the pick path (primarily on the pickguard), and some light finish scratches on the back, but nothing through the finish. The neck profile is flawless. The original brown tolex Gibson-branded hardshell case is included. Check out our shop \"Mike & Mike's Guitar Bar,\" and please let us know if we can answer any questions!Shipping in the continental USA will be $80, fully insured and shipped via FedEx Ground. Expedited shipping available for an additional fee at buyer's request. We will happily ship WORLDWIDE, but please contact us for an accurate international shipping quote before bidding or buying, as cost varies by buyer location. International orders will be declared as “merchandise,” and the value of merchandise will be declared as the amount paid. We cannot declare anything as a gift or for a lesser value. No exceptions! The customer is responsible for all taxes and duty, which may be collected upon delivery, as well as any additional charges involved with import. We have all necessary CITES paperwork in-hand to ship rosewood worldwide.We do our best to describe all items with honesty and accuracy, but to be sure, please contact us with any questions or concerns prior to bidding or buying. We require payment within 48 hours of auction end. In the unlikely event of a return, buyer pays all shipping costs. Your positive feedback and five star ratings are very important to us, and we appreciate your communication in resolving any issues!", "ItemID": "163564252068", "EndTime": "2019-02-25T02:31:44.000Z", "StartTime": "2019-02-25T01:22:07.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2015-Gibson-Memphis-ES-335-Satin-Faded-Cherry-w-Small-Block-Inlay-Case-/163564252068", "ListingType": "FixedPriceItem", "Location": "Seattle, Washington", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1635642520688080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/6wsAAOSwrn9ccz1F/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/VssAAOSwWKpccz1R/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/kdsAAOSwLMRccz1T/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/hwMAAOSwHTJccz1V/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/u3EAAOSwKptccz1K/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/fs8AAOSwPF9ccz1f/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/FEMAAOSwIYdccz1I/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/aMcAAOSwhWFccz1N/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/scEAAOSwLMFccz1a/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/KZkAAOSwQXdccz1X/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/CckAAOSwxlxccz1P/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/BTMAAOSw6Ghccz1c/$_57.JPG?set_id=8800005007"], "PostalCode": "98117", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mmguitarbar", "FeedbackRatingStar": "Red", "FeedbackScore": 2613, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 2099.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2099.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "v***_", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 0}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "2015 Gibson Memphis ES-335 Satin Faded Cherry w/ Small Block Inlay & Case", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Body Color", "Value": ["Faded Cherry"]}, {"Name": "Model", "Value": ["ES-335 Satin"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Type", "Value": ["Semi-Hollow"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Material", "Value": ["Maple"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["2015"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}]}, "HitCount": 4, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=269063702", "StoreName": "Mike and Mikes Guitar Bar"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}