{"BestOfferEnabled": true, "Description": "This is a rare, like new 2019 Gibson Memphis 1961 ES-335 with a Bigsby Vibrato in a dazzling Blue Sparkle finish. I am the sole and original owner, having purchased this guitar brand new directly from Wildwood Guitars, which is an authorized Gibson Memphis and Custom Shop dealer. Everything is in pristine, perfect condition, including the case, original documentation, and case candy. She still has that sweet, sweet, Gibson factory smell when you open the case! The original list price was $5,199, but you can bring her home for much less here. This one is unusual in that every other version of this model I could find came with Grover Milk Bottle Rotomatic tuners - this one comes with the classic Kluson Tulip tuners that really give it a much nicer vintage look and feel. Not sure if Gibson did only 1 of these, but again, I was on the hunt for one of these and this is the only one with the Tulip tuners that I could find. She weighs a relatively light 8.5 pounds - just a really sweet weight for a Bigsby-equipped 335! Gibson has been hitting it out of the park with its 2019 guitar line, and this Memphis model stands toe to toe with the best instruments in Gibson's long, historic line of iconic guitars. It's just a beautiful, heirloom quality instrument that plays and sounds terrific for just about any style of music - jazz, rock, country - this one has all bases covered. She is loud and touch-sensitive, and can go from pristine shimmer and chime to thick, warm jazz , from biting classic rock to ferocious punk snarl - she is simply an extraordinarily versatile axe. I cannot recommend a guitar any more than I do this one - she is an absolute killer! This guitar has been played only by me in my humidity and temperature-controlled basement studio. She is truly pristine, no dings, dents, or blemishes, just a light aged treatment performed by Gibson, which is mostly visible on the pickup covers and the Bigsby, which have a slight cast to them rather than being completely bright, shiny, and new. The gloss may be not quite as glossy as a new gloss finish, but again, it's just the aging treatment rather than any actual wear and tear, and as you can tell from the pics it's all just beautifully done. This instrument is like new, same as I got her from Wildwood just before Christmas, less about 5 - 6 hours or so of playing by me in my smoke-free home studio. She even still has the protective cover on the pickguard! Here are the original details from Gibson: Classic Semi-hollowbody Electric With impeccable sound across a wide range of tonal options, the ES-335 can be found in the hands of jazz, blues, and rock players all over the globe. For 2019, Gibson brings the 1961 MOD ES-335 to you with a Bigsby B7 tailpiece for the ultimate in dreamy vibrato. The 1961 MOD ES-335 has the same rounded neck profile that Gibson debuted in 1961 as an answer to players looking for a neck that still had the classic Gibson width but without the depth of the ES-335s of the 1950s. For tonal excellence, the Gibson Memphis 1961 MOD ES-335 comes with MHS humbucker pickups and MTC Premiere controls, giving you a massive range of stylistic options for performance. Legendary tone from unpotted MHS humbuckers When players think of the ES-335, they think of its unique tone signatures — from growl and howl to sweet, crisp whispers, the ES-335 covers the tonal color palette through blues, jazz, and rock. Loaded with a pair of unpotted humbucking pickups, each with its own volume and tone controls, the ES-335 lets you dial in jangly country tones to distorted rock tones with ease and precision. The neck pickup gives you classic semi-hollowbody tones for everything from smooth jazz to dirty blues. Flip to the bridge position, and you'll command sounds from bright and clean to raw and mean. Vintage detail and styling The 1961 MOD ES-335 includes appointments to add even more authenticity and vintage vibe to a timeless design. Necks are now attached using hide glue, which lasts longer than synthetic glue, and to some, even improves the guitar's sound. Gibson also re-engineered the truss rod, truss rod washer, and anchor to their original forms. They also eliminated the tubing that surrounded the truss rod — all subtle yet important changes to both the durability of the ES-335 and its overall tone. Kluson Tulip tuners are also featured on this 1961 ES-335 and lend even more visual vintage vibe and style. Gibson Memphis 1961 MOD ES-335 Features: Semi-hollowbody design for enhanced harmonic richness3-ply maple/poplar/maple top and backAdirondack spruce bracing for vintage tonalityHide-glued mahogany neck, rosewood fingerboardBigsby B7 vibrato tailpiece for that dreamy Bigsby soundComfortable, lightweight body with historically correct slim horns at the cutawayPeriod-correct window center block shape and neck profileUnpotted MHS humbuckers deliver exceptional articulation and richnessKluson Tulip tuners for vintage visual style Tech Specs: Body Type: Semi-hollowbody Body Shape: ES-335 Left-/Right-handed: Right-handed Number of Strings: 6 Body Material: 3-ply Maple/Poplar/Maple Top Material: 3-ply Maple/Poplar/Maple Body Finish: Gloss Nitrocellulose Lacquer Color: Blue Sparkle Neck Material: Quartersawn Mahogany Neck Shape: Rounded Early 60s Radius: 12\" Fingerboard Material: Dark Rosewood Fingerboard Inlay: Aged Pearloid Dots Number of Frets: 22, Medium Jumbo, Nickel Silver Scale Length: 24.75\" Nut Width: 1.6875\" Nut Material: Bone Bridge/Tailpiece: ABR-1 Bridge with Nickel-plated Brass Saddles, Bigsby B-7 Vibrola Tuners: Classic Kluson Tulip Neck Pickup: MHS II Rhythm Humbucker Bridge Pickup: MHS II Lead Humbucker Controls: 2 x volume, 2 x tone, 3-way toggle pickup switch, Memphis Tone circuit Historic Strings: 10-46 Case Included: Hardshell Case Manufacturer Part Number: ES61MD19B1NB1 Please feel free to ask me any questions - I will do my best to answer ASAP. Buyer to prepay via PayPal, and I will ship via UPS Ground within a couple of days, well packed to ensure safe delivery. If you are interested in expedited UPS shipping and are willing to pay my actual cost, I am more than happy to accommodate you - just let me know and we will work it out. I promise a prompt and courteous transaction - will do my best to ensure that you are happy with your purchase. I promise that this guitar is truly pristine and looks as new and clean as the day I took delivery. Thanks for looking, and good luck - this one is hard for me to part with, but I really need the funds!", "ItemID": "183648415666", "EndTime": "2019-01-29T17:29:14.000Z", "StartTime": "2019-01-22T17:29:14.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2019-Gibson-Memphis-1961-MOD-ES-335-Bigsby-Blue-Sparkle-OHSC-Like-New-/183648415666", "ListingType": "Chinese", "Location": "Parsippany, New Jersey", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1836484156668080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/xRoAAOSwyPFcO-7K/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/f8kAAOSwiwZcO-7O/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/c24AAOSwDmxcO-7S/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/0Y8AAOSwd0pcO-7m/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/r9YAAOSwCVtcO-7q/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/N7IAAOSw8NNcO-7u/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/9AgAAOSwqLlcO-70/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/jMoAAOSwK~BcO-75/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/mXIAAOSwYYpcO-79/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/iqkAAOSwoZJcO-8E/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/2PIAAOSwGD1cO-8K/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/ZYIAAOSws~dcO-8P/$_57.JPG?set_id=8800005007"], "PostalCode": "07054", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "asg618", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 323, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 3000.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 3000.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "k***e", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 5}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2019 Gibson Memphis 1961 MOD ES-335 Bigsby - Blue Sparkle OHSC - Like New!", "ItemSpecifics": {"NameValueList": [{"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Body Color", "Value": ["Blue Sparkle"]}, {"Name": "Model", "Value": ["335"]}, {"Name": "Body Type", "Value": ["Semi-Hollow"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}]}, "HitCount": 145, "Subtitle": "Original Hardshell Case + Case Candy + Documentation", "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 3050.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Excellent, like new", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}