{"BestOfferEnabled": false, "Description": "For sale is a limited edition 2013 Gibson SG Custom Captain Kirk Douglas Signature Cherry guitar. This guitar is all stock and in excellent condition. Only noticeable blemishes are a swirl scratch in one of the cutaways (pictured) and a small finish chip in one of the corners (pictured). Plays and sounds great with a wide range of switching options. Comes with original case, inspection card and owners manual. Original strap buttons were replaced with Schaller's guitar strap locks for added security (original strap locks/screws included in the case). This is a NO RESERVE auction! Shipping to USA and Canada is $49.00 USD. Kirk Douglas SG As the guitarist with The Roots, the beloved house band for Late Night with Jimmy Fallon on NBC, “Captain” Kirk Douglas has developed a well-deserved reputation as a stellar and versatile player. From vamping a theme tune one moment to cranking out a psychedelic jam the next, then backing a major artist after the commercial break, this is one amazing player who can truly do it all. And he has always done it on a Gibson-made electric guitar. A Les Paul Goldtop, an ES-356, a black Custom Shop Les Paul with P-90s, a Byrdland archtop, and a vintage Epiphone Crestwood (damaged by Prince in a must-see musical TV moment) are among his arsenal, but one of his sexiest guitars—the three-pickup Gibson SG Custom—is now commemorated in the new Kirk Douglas SG from Gibson USA. The Kirk Douglas SG is as versatile as its namesake, primed to tap every tone you might need to rock out with today’s demanding music. Through some inventive Gibson USA switch trickery, this three-pickup SG Custom—with a trio of ’57 Classic humbuckers for legendary PAF tones—gives you single-coil sounds via its push-pull tone pots, and lets you dial in the middle pickup wherever desired thanks to the stealth blender ring disguised within its TogPot™ selector switch. A vibrola tailpiece further enhances this stunning guitar’s chops, and tips off the visual splendor that makes the Kirk Douglas SG such a sultry beast. The high-gloss Vintage Cherry nitrocellulose finish is a classic yet lesser-seen variation of the SG Custom of the 1960s. It is beautifully set off by acrylic pearloid block markers, a wide SG Custom headstock with multi-ply binding and split-diamond inlay, and a double-wide white pickguard. The visual pièce de résistance, though, is the long gold “Lyre” tailpiece cover engraved with Kirk’s nickname—“Captain”—and dual roses, partnered by a Kirk Douglas signature decal on the back of the headstock. For classic yet original looks, versatile tones, and an unparalleled playing feel, the Kirk Douglas SG is ready to rock you sideways, whatever your musical requirements. Visit your authorized Gibson USA dealer today to witness a truly remarkable, and amazingly nimble, guitar. Body and Neck The Kirk Douglas SG is made from solid Grade-A mahogany in the iconic double-horned style of the original ’60s SG. Its thin dimensions and beveled edges are key ingredients in its legendary playing comfort, as is its slim, super-fast mahogany neck, with depths of 0.800” at the 1st fret and 0.900” at the 12th. Its Grade-A rosewood fingerboard carries stunning acrylic pearloid block markers, and is topped with a large Custom headstock with multi-ply binding and split-diamond inlay. Pickups and Electronics Three of Gibson’s popular ’57 Classics provide a usefully contemporary take on vintage PAF humbucker tone, with added versatility thanks to coil-splitting switching on the tone controls’ push-pull pots. In addition, the TogPot™ selector switch carries a blender pot within its ring, to dial in the middle pickup level to any position, as desired. All this clever wiring trickery gives the Kirk Douglas SG unseen sonic depths, while hiding within the traditional four-knob plus three-way switch control array. Hardware The hardware, all gold, includes high-quality Grover™ keystone tuners, Tune-o-matic bridge, and a vibrola for added versatility, with stunning “Lyre” cover etched with Kirk’s nickname “Captain” and dual roses. The guitar carries the larger white mid-’60s pickguard, with multi-ply headstock binding, single-ply fingerboard binding, and a traditional “bell” truss-rod cover. Normal 0 false false false EN-CA X-NONE X-NONE", "ItemID": "332904111497", "EndTime": "2018-12-03T03:20:12.000Z", "StartTime": "2018-11-26T03:20:12.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2013-Gibson-SG-Custom-Captain-Kirk-Douglas-Signature-Cherry-guitar-NO-RESERVE-/332904111497", "ListingType": "Chinese", "Location": "Grande Prairie, Alberta", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/3329041114978080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA5NlgxNjAw/z/AIMAAOSwmkBb-yr9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODc5WDE2MDA=/z/NyQAAOSwj-Rb-ysJ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/Zd4AAOSwXI1b-ysW/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5Mjg=/z/Kj4AAOSw~odb-ytD/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA0OFgxNjAw/z/WY4AAOSwAbxb-yt8/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5Mzc=/z/vlYAAOSwip5b-yuF/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAxOVgxNjAw/z/k3kAAOSwF1tb-yvC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE4OFgxNjAw/z/X~YAAOSwWI5b-yvb/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjM2/z/3NgAAOSwwkRb-ywA/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/vDsAAOSwDEBb-ywL/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODU2WDE2MDA=/z/AtUAAOSw2~Nb-ywQ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAwMVgxNjAw/z/t0sAAOSwZddb-yxx/$_57.JPG?set_id=8800005007"], "PostalCode": "t8v1m5", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "spacegalton", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 489, "PositiveFeedbackPercent": 100.0}, "BidCount": 30, "ConvertedCurrentPrice": {"Value": 1910.88, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1910.88, "CurrencyID": "USD"}, "HighBidder": {"UserID": "e***a", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 227}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "CA"], "Site": "US", "TimeLeft": "PT0S", "Title": "2013 Gibson SG Custom Captain Kirk Douglas Signature Cherry guitar NO RESERVE", "HitCount": 739, "Subtitle": "Limited edition", "PrimaryCategoryIDPath": "619:3858:33034", "Country": "CA", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 1935.88, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Please see detailed item description below.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}