{"BestOfferEnabled": false, "Description": "ESP LTD EC-400AT Goldtop Electric Guitar Seymour Duncans Arch Top Rare Nice!! Click images to enlarge Description NICE ESP LTD EC-400AT GOLDTOP ELECTRIC GUITAR. COMES WITH ARCH TOP AND SEYMOUR DUNCAN PICKUPS AND GIBSON SOFT CARRY CASE BAG. PLAYS GREAT AND SOUNDS GREAT. IT IS IN GREAT CONDITION FOR THE AGE. IT HAS A SMALL RUB ON THE BOTTOM EDGE AND A SMALL RUB AT THE 3 WAY TOGGLE SWITCH AND A SMALL RUB INDENT ON THE BACK THAT YOU CAN'T SEE BUT IT'S THERE. LOOKS TO BE A 9 OUT OF 10 CONDITION. FRETS STILL HAVE LOTS OF LIFE LEFT IN THEM. THE RUB MARKS ARE NOT CHIPS AS THEY ARE SMOOTH.                                              An absolute screamer here. The predecessor to the EC-401VF, this discontinued EC-400AT model was manufactured in the higher end Korean factory, compared to the Indonesian 401VFs. Full traditional thickness, reminiscent of a traditional LP. She weighs in at a good 9 lbs, which means sustain for days, tone for days.  The ESP EC-400 Archtop Electric Guitar gets its musicality from a resonant mahogany body. A 3-piece, 24-3/4\" scale, mahogany neck with rosewood fretboard decorated with flag inlays and the model name at the 12th fret give the EC-400AT that eye-appeal. For pickups, it has a set of Seymour Duncan JB/59s. Controls on the EC-400 guitar include 2 volumes, a tone knob, and 3-way toggle. Fully bound in creme. Chrome hardware with an Earvana Compensated nut, Mini Grover tuners, a Tune-o-matic-style bridge with stop tailpiece and 22 XJ frets complete the EC-400AT.  FEATURES: - Resonant mahogany body - 3-piece mahogany neck - Rosewood fretboard - 24-3/4\" scale - 22XJ frets - Flags inlay and the model name at the 12th fret - Set of Seymour Duncan JB (bridge) & 59 (neck) - 2 volumes, a tone knob, and 3-way toggle - Fully bound in creme - Chrome and Earvana compensated nut - Mini Grover tuners - Tune-o-matic bridge with stop tailpiece                                                                                      PLEASE CHECK OUT ALL THE PICTURES IN SUPERSIZE AND ASK ANY QUESTIONS BEFORE PURCHASE. SOLD AS IS. NO RETURNS. PAYMENT DUE WITHIN 48 HOURS OF PURCHASE. ONLY ACCEPT PAYPAL AT THIS TIME. PLEASE CHECK OUT OUR STORE J'S MUSIC AND MORE FOR MORE GREAT DEALS AND RARE ITEMS!! ONLY SHIP TO THE LOWER 48 STATES Pictures sell! Auctiva offers Free Image Hosting and Editing.250+ Listing Templates! Auctiva gets you noticed! The complete eBay Selling Solution. Track Page Views WithAuctiva's FREE Counter", "ItemID": "254032301806", "EndTime": "2018-12-19T17:40:26.000Z", "StartTime": "2018-12-19T17:37:49.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/ESP-LTD-EC-400AT-Goldtop-Electric-Guitar-Seymour-Duncans-Arch-Top-Rare-Nice-/254032301806", "ListingType": "FixedPriceItem", "Location": "Lumberton, North Carolina", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2540323018068080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTAyNFg2ODI=/z/~vkAAOSwT69bLT9B/$_1.JPG?set_id=880000500F"], "PostalCode": "28358", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "diceman_28358", "FeedbackRatingStar": "Red", "FeedbackScore": 3579, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 425.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 425.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "i***s", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 2208}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "ESP LTD EC-400AT Goldtop Electric Guitar Seymour Duncans Arch Top Rare Nice!!", "HitCount": 2, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=40224839", "StoreName": "J&#39;s Music and More"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Great Condition for the age.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}