{"BestOfferEnabled": false, "Description": "Please feel free to contact us with any questions you may have about this listingor any other items that we carry in our store! Thank you for taking the time to visit Blues Angel Music's eBay store! Blues Angel Music, est. in 1997 in Pensacola, Florida, has been named by NAMM (National Association of Music Merchants) as one of the \"TOP 100\" music stores in the USA since 2011!!! Your satisfaction is our #1 objective! Yamaha BB434-BLK 4 String Electric Bass Guitar, Black, B-Stock, #HNL053239 This is a B-Stock bass. It has some very light scratches on it. They're too light to photograph and are not easily seen. We invite you to view the photo and please message us with any questions that you may have about this item. BEYOND CLASSICThe latest in Yamaha's storied BB series of bass guitars delivers the superb sound and build quality that this series is known for in a smaller body with even better playability. Featuring a Alder/Maple/Alder construction for quicker transmission of sound from the strings to the body and neck, a firmer 6-bolt miter neck joint for improved stability, and custom-wound pickups that achieve higher output gain while retaining the classic BB voicing, the new lineup of BB basses are a testament to our commitment to musical excellence. THE LEGACY CONTINUESIn the BB Series, Yamaha has always sought to offer bassists nothing less than a pure bass guitar. Forgoing passing technical fads in favor in proven technologies and production techniques, every model in the BB Series has been a product of our commitment to creating a bass that allows you to build your own sound rather than defining one for you. These latest models continue this tradition of reliable excellence in superbly crafted bass guitars that you can depend on to give you the sound you need, in any situation you throw at it. Built for the Working BassistWhat are bassists really looking for in their chosen instrument? The perfect sound? Versatility? Durability? All of the above and so much more. We've spent decades working closely with artists who practice their craft at the highest levels of recording and live performance to help us forge a clear vision of what working professionals demand of their bass in every capacity. By incorporating this invaluable, real-world experience and insight into practical approaches to the BB series' design, construction, and ultimately its legendary tone, this collaboration has been the impetus behind this iconic instrument's continuing evolution as the hardest working bass in the business. Penetrating SoundThink of any great bassist and you'll likely hear one of their more memorable bass lines, techniques, or solos playing in your head. You'll also most certainly recall the signature sound that helped define their unique identity as a musician and made them stand out as a real presence in the band they have performed or recorded with. Throughout the BB's 40 year history, Yamaha has worked closely with some of the most prolific bassists in the business to craft that unmistakable BB sound— constantly evaluating their ideas and feedback to create the right sound for the music of the moment. The latest series features a miter neck joint that has won praise in the Billy Sheehan Signature/ Attitude Limited III lineup, by increasing the efficiency of vibration transmission to the body for a more resonant, organic feel and tone. It also features an Alder/Maple/Alder construction that sandwiches maple into the center of the body for a crisper, richer sound, and impressive resonance. A New Take on a Classic DesignWe all know the old adage about not fixing things that aren't broken, but that doesn't mean you can't make subtle, practical, or stylistic modifications to benefit performance and aesthetic—even to a proven design like the BB series. The new lineup has undergone a significant redesign with subtle contour changes and body weight reduction made out of consideration to playability and comfort, while still retaining the classic silhouette of the BB body/ head design. The differences are subtle, but you'll definitely feel them. The new models also feature standard sized pickups for the first time in a BB, for more convenient customization or replacement. Alder/Maple/Alder Body ConstructionThe new BB features an Alder/Maple/Alder multi-laminated body construction. The hard maple center increases body stiffness and accentuates midrange to cut through the mix of a band, and allows a more uniform transmission of vibrations between the body and the maple neck for unparalleled resonance and sustain. (BB Pro, BB700 Series) 6-bolt miter neck jointMiter bolting holds the neck closer and tighter to the body fusing these two separate components into one. Compared to a conventional bolt-on joint, miter bolting offers more efficient transfer of string vibration throughout the body, for improved sustain and outstanding resonance that brings every note to life. (BB Pro, BB700, BB400 Series) Custom-Wound PickupsBB's custom-wound pickups are designed to fit standard pickup cavities and feature a medium-high output with vintage voicing for great tone in any setting. BB basses come with pickups selected specifically to match the distinct character of each model in the series, delivering a uniquely versatile sound while retaining the classic BB tone. Convertible Bridge and Saddle for Precise Tone ShapingBB basses incorporate “Diagonal Body Thru Stringing” where strings are angled at the saddle and pass through the instrument to the bridge at a 45º angle, as opposed to the traditional vertical stringing method which places more stress on the strings. Diagonal Body Thru Stringing significantly reduces this stress while transferring string vibration to the body reliably and efficiently. Strings can also be set to the tail end of the bridge, which comes equipped with a convertible saddle that can be adjusted to 2 different angles for more precise tonal shaping and feel. The rounder side of the saddle gives a slightly duller sound, while the more angled area of the saddle produces a slightly tighter one. The 700 and Pro are equipped with the Vintage Plus Bridge, designed with a diagonal cut at the string’s contact point on the saddle to form a more stable fulcrum and produce a clear, well-shaped sound. Brass saddles deliver a slightly deeper low-end, while the steel bridge plate offers more response. All screws and springs are made of stainless steel to guard against corrosion. The 400 is equipped with a “Vintage Light” bridge with an offset low E string. BB400 SeriesYou’ve got the chops—now it’s time to get out there and get noticed. Featuring a six-bolt miter neck joint, the BB400 series continues the legacy of superb sound and playability of the renowned BB series. BB400 SeriesProve YourselfYou've got the chops and you're ready to nail that audition, hit the stage, or get creative in the studio—now it's time to get out there and get noticed. The 400 lineup continues the BB tradition of great build quality and signature sound that won the series acclaim throughout its forty-year history. Whether you prefer a rosewood fingerboard or the distinctively bright, crisp sound of maple, the precision feel and response of the six bolt miter neck along with the presence and clarityof custom-wound pickups will inspire you to play your best when it really counts. Featuring a six-bolt miter neck joint, the BB400 series continues the legacy of superb sound and playability of the renowned BB series. SPECIFICATIONSBB434Featuring a six-bolt miter neck joint, the BB400 series continues the legacy of superb sound and playability of the renowned BB series.Solid Alder Body6-Bolt Miter Neck Joint5-piece NeckYGD Custom V5 Pickups (AlnicoV)Vintage Plus Light Bridge : Convertible Bridge and SaddleLightweight Open Gear TunersWeight- Actual: 8.8lbs This bass does not come with a standard case or gig bag, but one can be purchased separately from our inventory if desired. ALL of our guitars at Blues Angel Music are professionally detailed and set up by our very own Master Luthiers! We want your guitar to arrive in the best condition possible and ready to play! Please note that temperature and humidity changes occurring during shipping may affect setup, and the responsibility of any desired changes to setup resides with the buyer. Rest assured that most customers are satisfied with setup upon arrival! If you're ever passing through Northwest Florida, be sure to stop by and say hello! We're home of the World's only full-scale Drum Set Fish Tank created by Animal Planet's hit TV show \"Tanked!\" WANT MORE? SEE OUR OTHER LISTINGS#EAM#01.08.19", "ItemID": "333004352874", "EndTime": "2019-02-27T03:05:36.000Z", "StartTime": "2019-01-08T23:16:41.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Yamaha-BB434-BLK-4-String-Electric-Bass-Guitar-Black-B-Stock-HNL053239-/333004352874", "ListingType": "FixedPriceItem", "Location": "Pensacola, Florida", "PaymentMethods": ["PayPal", "VisaMC", "Discover", "AmEx"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/3330043528748080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTM4NVgxNjAw/z/4BYAAOSwGq5cNSu9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzI0WDE2MDA=/z/zpQAAOSw8U9cNSu7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTMwMVgxNjAw/z/A-sAAOSwxHlcNSvH/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzcwWDE2MDA=/z/iiYAAOSw~BRcNS8w/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI3OFgxNjAw/z/VGYAAOSw8kRcNSvB/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIxMVgxNjAw/z/XS0AAOSwUMBcNSvL/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA4OFgxNjAw/z/qykAAOSwtutcNSu~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTYwWDE2MDA=/z/eVsAAOSwiJZcNSvJ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/beUAAOSws2RcNSvF/$_57.JPG?set_id=8800005007"], "PostalCode": "32507", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "bluesangelmusic850", "FeedbackRatingStar": "Red", "FeedbackScore": 4330, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 405.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 405.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***u", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 739}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Yamaha BB434-BLK 4 String Electric Bass Guitar, Black, B-Stock, #HNL053239", "ItemSpecifics": {"NameValueList": [{"Name": "Size", "Value": ["Full Size"]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "String Configuration", "Value": ["4 String"]}, {"Name": "Model", "Value": ["BB434"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["2018"]}, {"Name": "MPN", "Value": ["BB434 BL"]}, {"Name": "Body Material", "Value": ["Solid Wood", "Swamp Ash"]}, {"Name": "Brand", "Value": ["Yamaha"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}]}, "HitCount": 52, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=13970765", "StoreName": "Blues Angel Music"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["RU", "BR"], "GlobalShipping": false, "ConditionDescription": "This is a B-Stock bass. It has some very light scratches on it. They're too light to photograph and are not easily seen. We invite you to view the photo and please message us with any questions that you may have about this item.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}