{"BestOfferEnabled": false, "Description": "Gretsch G6120T Nashville Guitar Players Edition Mint SKU: SS2297 Brand: GRETSCH® Condition: Used Body Type: Hollow String Configuration: 6 String Dexterity: Right-Handed Body Color: Orange Stain Country of Manufacture: Japan Model: G6120T MPN: 2401350822 Type: HOLLOW BODY Hand: Right STREET SOUNDS THE LARGEST AUTHORIZED GRETSCH DEALER IS PROUD TO OFFER: PHOTOS OF ACTUAL GUITAR GRETSCH G6120T NASHVILLE FEATURING: LOCKING TUNERS PINNED ROCKING BAR BRIDGE STRAP LOCKS STRING-THRU BIGSBY SUPER COMFORTABLE 2.25'' BODY GUITAR WEIGHT: 7LBS. 9OZ. 2018 PRODUCTION MINT CONDITION NO DENTS, DINGS, OR SCRATCHES GRETSCH HARDSHELL CASE INCLUDED WARRANTY INCLUDED SET UP INCLUDED FREE SHIPPING IN CONTINENTAL U.S. INCLUDED Designed from the ground up for modern players yet retaining all the timeless style that made the 6120 famous, the Players Edition Nashville with String-Thru Bigsby is a marvelous example of art and performance. Player-oriented features, wide, open sound and comfortable playability combine to create a playing experience like no other. Ideal for every song, every night, this Nashville is certain to become your go-to guitar. Two High Sensitive Filter’Tron™ humbucking pickups pair with the laminated maple body, delivering pristine high end, glassy midrange, robust low end and balanced harmonics for tone that blends seamlessly with other instruments. A 12”-radius ebony fingerboard with 22 medium jumbo frets and striking pearloid Neo-Classic™ thumbnail inlays tops a maple neck with a comfortably familiar standard “U”-shaped profile for fluidly easy playing. The innovative Gretsch “ML” bracing is specifically voiced to provide full hollow body tones from the thinner, 2.25” body. Controls are simple and versatile—separate bridge and neck volume controls, three-way pickup switching, No Load tone control and master volume—and allow for countless tone variations. The new Gretsch “Squeezebox” paper-in-oil caps add smooth vintage tone while the treble bleed circuit lets your guitar retain all of its tasty clarity when rolling the volume control down. Highly expressive, the Bigsby B6GP vibrato tailpiece and pinned “rocking” bar bridge combine with the GraphTech® Tusq XL nut for stable tuning. In a uniquely Gretsch touch, the Bigsby tailpiece is now string-through, making it quicker (and easier) to change strings as well as providing increased vibration transfer for enhanced sustain. A treat for the eyes and ears, this guitar is a highly-tuned music machine—from the shining gold Schaller® locking tuning machines and gold “G Arrow” control knobs to the F Holes, gloss urethane finish and gold vintage thick plexi pickguard with Gretsch logo. Constructed with sterling fit and finish and an eye for detail, the Players Edition Nashville with String-Thru Bigsby is a marvel of modern instrument design. Includes a deluxe hardshell case. Model Name: G6120T Players Edition Nashville™ with String-Thru Bigsby®, Filter'Tron™ Pickups, Orange Stain Model Number: 2401350822 Series: Gretsch® Professional Collection MSRP: $3449.00 Color: Orange Stain Body Body Shape: Nashville® Bracing: ML Style Body Binding: White with B/W/B Purfling Body Material: Laminated Maple Body Finish: Gloss Urethane Body Back: Laminated Maple Body Top: Laminated Maple Neck Neck Material: Maple Neck Shape: Standard \"U\" Neck Binding: White Scale Length: 24.6\" (625 mm) Fingerboard Radius: 12\" (305 mm) Number of Frets: 22 Fret Size: Medium Jumbo String Nut: Graph Tech® TUSQ XL Nut Width: 1.6875\" (43mm) Neck Plate: NA Neck Finish: Gloss Urethane Fingerboard: Ebony Position Inlays: Pearloid Thumbnails Electronics Bridge Pickup: High Sensitive Filter'Tron Neck Pickup: High Sensitive Filter'Tron™ Controls: Volume 1. (Neck Pickup), Volume 2. (Bridge Pickup), Master Tone Pickup Switching: 3-Position Toggle: Position 1. Bridge Pickup, Position 2. Bridge And Neck Pickups, Position 3. Neck Pickup Pickup Configuration: HH Hardware Bridge: Rocking Bar Tuning Machines: Schaller® Gold Locking Tuners Orientation: Right-Hand Pickguard: Gold Plexi with Black Gretsch Logo Control Knobs: \"G\" Arrow Miscellaneous Strings: Nickel Plated Steel .011-.049 STREET SOUNDS 14 DAY TRIAL PERIOD INCLUDED FREE SHIPPING IN CONTINENTAL U.S. LOCATED IN BROOKLYN, JUST 4 MILES FROM THE ORIGINAL GRETSCH FACTORY CONTAINS ONE OF THE LARGEST INVENTORIES OF GRETSCH® GUITARS ANYWHERE IN THE WORLD. WE WOULD LIKE TO THANK FRED GRETSCH AND JOE CARDUCCI FOR THERE MULTIPLE VISITS TO OUR SHOP AND CONTINUED SUPPORT OF THE GREATEST GUITAR BRAND EVER PRODUCED ALL NEW GRETSCH GUITARS INCLUDE FACTORY WARRANTY ALL USED GRETSCH GUITARS INCLUDE STREET SOUNDS 1 YEAR WARRANTY ANY GUITAR LISTED WITH FREE SHIPPING IS FOR CONTINENTAL U.S. ONLY", "ItemID": "292892423398", "EndTime": "2019-02-27T22:40:08.000Z", "StartTime": "2018-12-27T18:18:55.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gretsch-G6120T-Nashville-Guitar-Players-Edition-Mint-/292892423398", "ListingType": "FixedPriceItem", "Location": "Brooklyn, New York", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2928924233988080_3.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/ODUwWDEyODA=/z/ToMAAOSwakJcJRgr/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDYzOA==/z/6k4AAOSwdxVcJRgq/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDYzOA==/z/zY0AAOSwnjZcJRgq/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTI4MFg4NTA=/z/rccAAOSwpppcJRr9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTYwWDYzOA==/z/BNAAAOSwckVcJRgq/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDYwMA==/z/P7AAAOSwxDJcJRgq/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDYzOA==/z/EH4AAOSwzEVcJRgr/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDYzOA==/z/XeoAAOSwXnxcJRgq/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODQ5WDEyODA=/z/3-kAAOSwsqdcJRgr/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDEyODA=/z/vm4AAOSwAmJcJRgr/$_57.JPG?set_id=880000500F"], "PostalCode": "11209", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "rockystreetsounds", "FeedbackRatingStar": "TurquoiseShooting", "FeedbackScore": 27062, "PositiveFeedbackPercent": 99.9}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1899.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1899.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "r***m", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 11}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "GB", "DK", "RO", "SK", "BG", "CZ", "FI", "HU", "LV", "LT", "MT", "EE", "AU", "GR", "PT", "CY", "SI", "JP", "CN", "SE", "KR", "ID", "TH", "BE", "FR", "HK", "IE", "NL", "PL", "ES", "IT", "DE", "AT", "BS", "IL", "MX", "NZ", "SG", "CH", "NO", "SA", "UA", "AE", "QA", "KW", "BH", "HR", "MY", "CO", "PA", "JM", "BB", "BD", "BM", "BN", "BO", "EG", "GF", "GG", "GI", "GP", "IS", "JE", "JO", "KH", "KY", "LI", "LK", "LU", "MC", "MO", "MQ", "MV", "NI", "OM", "PK", "PY", "RE", "CA", "UY"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gretsch G6120T Nashville Guitar Players Edition Mint", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["GRETSCH®"]}, {"Name": "Body Type", "Value": ["Hollow"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Body Color", "Value": ["Orange Stain"]}, {"Name": "Country of Manufacture", "Value": ["Japan"]}, {"Name": "Model", "Value": ["G6120T"]}, {"Name": "MPN", "Value": ["2401350822"]}, {"Name": "Type", "Value": ["HOLLOW BODY"]}, {"Name": "Hand", "Value": ["Right"]}]}, "HitCount": 968, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=157392609", "StoreName": "STREETSOUNDS NYC"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": true, "QuantitySoldByPickupInStore": 0, "SKU": "SS2297", "NewBestOffer": false}