{"BestOfferEnabled": true, "Description": "PLEASE VIEW ALL PHOTOS COMPLETELY \"Backdraft \" WHY HAVE A GUITAR THAT LOOKS LIKE EVERYONE ELSE'S WHEN YOU CAN BE UNIQUE! Each guitar painted here by us is unique and One-of-a-Kind This is one of the coolest looking Epiphone S-310's you will ever see. This Epiphone has been completely gone through and there are no known issues. It has all new electronics with a new NDGV Hotrod Dual Rail, with Push/Pull Coil Splitting pot (Bridge Pickup). And (2) new NDGV EMP Covered Single coils. This guitar has been custom swirl painted with a black, Metallic Silver, Orange, and White. There is very little fret wear and plays very nice. This guitar has been setup with new Ernie Ball Super Slinky 9s and is ready to ROCK! Please click on \"See Details\" to see more photos and full description of guitar Rare (MIK) Custom Swirl Painted and Upgraded Epiphone S310 Strat Electric Guitar Click images to enlarge Description PLEASE VIEW ALL PHOTOS AND DESCRIPTION COMPLETELY \"Backdraft \" WHY HAVE A GUITAR THAT LOOKS LIKE EVERYONE ELSE'S WHEN YOU CAN BE UNIQUE!  Each guitar painted here by us is unique and One-of-a-Kind This is one of the coolest looking Epiphone S-310's you will ever see.  This Epiphone has been completely gone through and there are no known issues. It has all new electronics with a new NDGV Hotrod Dual Rail, with Push/Pull Coil Splitting pot (Bridge Pickup). And (2) new NDGV EMP Covered Single coils. This guitar has been custom swirl painted with a black, Metallic Silver, Orange, and White. There is very little fret wear and plays very nice. This guitar has been setup with new Ernie Ball Super Slinky 9s and is ready to ROCK!  UPGRADES: New Custom Swirl Painted With Gloss Lacquer Clear Coat (Black, Metallic Silver, Orange, and White)  Matching Swirl Dipped Pickguard New NDGV Hotrod Dual Rail Pickup (With Push/Pull Coil Spitting Pot in Bridge) New NDGV EMP Covered Single Coils (Middle and Neck) New 500K Pots (Push/Pull on lower tone pot) New 5 Way Blade Switch  New Ernie Ball Super Slinky Strings New 1/4 Jack This guitar is a SCREAMER!  DISCLAIMER:  This is not a factory finish, all custom finishes are done here at Naked Dave's. Guitar has been wet sanded to remove 99% of the orange peel. It has been hand buffed to a Gloss (Lacquer) finish. We try to do our best in taking photos however color in photos may not be exact. Also guitar will be shipped from a warm & dry state (AZ), if it is being shipped to a cold and/or wet area the neck may need to be adjusted when it arrives. Check out our eBay Store for other really cool guitars.   Payment Payment: Payment is due immediately. We accept payment by Pay-Pal & can only ship to a Pay-Pal verified address. If your address is not verified we will hold off on shipping until it is or cancel the sale of this item. Shipping International Buyers Please Note: Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer's responsibility. Please check with your country's customs office to determine what these additional costs will be prior to bidding/buying. These charges are normally collected by the delivering freight (shipping) company or when you pick the item up, do not confuse them for additional shipping charges. We do not mark merchandise values below value or mark items as \"gifts\" - US and International government regulations prohibit such behavior. Some item's we can only ship in the Continental United States because of weight & size of package. Shipping: Winning bidder to pay all shipping costs unless stated differently in the auction. Please inquire as to exact costs. Free shipping: When offered is only good for the Continental United States. Resident's of Hawaii and Alaska must write us for a shipping quote. We do not ship to PO boxes or third party addresses. Combined Shipping: We will combine shipping when items will not be damaged by doing so. Combined shipping is good only for products purchased and paid for on the same day. If you have any question's about shipping please write in advance and include your zip code so we are able to answer you correctly. Terms of Sale FEEDBACK Feedback is automated, once you leave us a positive feedback the automated system will leave you positive feedback in return. We reserve the right to cancel any and all bids from bidders: If you have bid & won from us before and not paid. If shipping and/or packing cost greatly exceed quoted price. If you live in a country we do not ship to. If you pay with PayPal and your ship to address has NOT been confirmed by PayPal. If your registered address with E-bay doesn't match your address on file with PayPal. Warranty: We sell new and gently used merchandise. Used Items: If your item is used we are unable to offer any warranty although we do have our tech's check out all used equipment to make sure it's in good working order before we list here on E-bay. New Items: When offered new products come with a manufactures warranty. Keep your packing slip as your receipt for proof of purchase. ITEMS DAMAGED IN SHIPPING: If your item is damaged in shipping please contact us so we can start the claim process. Contact Us E-Mail: If you have any questions please e-mail us through Ebay. Get images that make Supersized seem small.Tailor your auctions with Auctiva's Listing Templates! THE simple solution for eBay sellers.", "ItemID": "254103354702", "EndTime": "2019-02-05T06:44:00.000Z", "StartTime": "2019-01-31T05:38:43.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Rare-MIK-Custom-Swirl-Painted-and-Upgraded-Epiphone-S310-Strat-Electric-Guitar-/254103354702", "ListingType": "FixedPriceItem", "Location": "Mesa, Arizona", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2541033547028080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTAyNFg3MDc=/z/ofoAAOSwPGtcUonm/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAyNFg2ODY=/z/N0gAAOSwpLdcUonm/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODIwWDEyODA=/z/9tgAAOSwYbdcUonm/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODgyWDEyODA=/z/fM0AAOSwhrpcUonm/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODUzWDEyODA=/z/XCYAAOSw-elcUonm/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/Nzc5WDEyODA=/z/nzgAAOSwwfFcUonm/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODUzWDEyODA=/z/pkgAAOSwPXFcUonm/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/Nzc5WDEyODA=/z/iZUAAOSwGIZcUonm/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODUzWDEyODA=/z/kfcAAOSwWAhcUonm/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODUyWDEyODA=/z/VSsAAOSwkelcUonm/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/Nzc5WDEyODA=/z/hkkAAOSwO7dcUonm/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODUzWDEyODA=/z/N9YAAOSwaPNcUonm/$_1.JPG?set_id=880000500F"], "PostalCode": "85202", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "nakeddavesgearvault", "FeedbackRatingStar": "Purple", "FeedbackScore": 741, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 399.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 399.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "4***e", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 1}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Americas", "Europe", "Asia", "AU"], "Site": "US", "TimeLeft": "PT0S", "Title": "Rare (MIK) Custom Swirl Painted and Upgraded Epiphone S310 Strat Electric Guitar", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Custom Painted Black & Red"]}, {"Name": "Brand", "Value": ["Epiphone By Gibson"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Size", "Value": ["Full Size"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["S 310"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Country/Region of Manufacture", "Value": ["Korea, Republic of"]}, {"Name": "MPN", "Value": ["Does not apply"]}, {"Name": "Model Year", "Value": ["1994"]}, {"Name": "Modification Description", "Value": ["Custom Swirl Painted"]}, {"Name": "Modified Item", "Value": ["Yes"]}]}, "HitCount": 64, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=41774047", "StoreName": "nakeddavesgearvault"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "14 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Middle East", "South America", "BN", "KH", "HK", "ID", "LA", "MO", "MY", "PH", "SG", "TW", "VN", "BM", "GL", "MX", "PM", "AF", "AM", "AZ", "BD", "BT", "CN", "GE", "IN", "KZ", "KG", "MV", "MN", "NP", "PK", "LK", "TJ", "TM", "UZ", "AL", "AD", "BY", "BA", "BG", "HR", "CY", "EE", "GI", "LV", "LI", "LT", "MK", "MT", "MD", "MC", "ME", "PT", "SM", "RS", "SK", "SI", "ES", "SJ", "DM", "DO", "SV", "GD", "GP", "GT", "HT", "HN", "NI", "PO Box"], "GlobalShipping": false, "ConditionDescription": "“This guitar is in \"Very Good\" Condition”", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}