{"BestOfferEnabled": false, "Description": "Fender Custom Shop 55 Esquire made in 2015. The photos in this listing are taken of the exact guitar that is being sold. Everything is flawless just like it came in from the factory. I didn't take pictures of the original hardshell case, or the case candy, or the Original Fender Custom Shop Telecaster conversion kit, but it's all here. It's all perfect.(From Fender Custom Shop original to this purchase, still in the box and never installed). Yes, you can convert this Esquire into a Telecaster if you wish; with the included neck pickup and pick guard. Me personally, I didn't even try to see what the guitar sounds like as a Tele..It's that good as a Esquire.. with that beautiful bridge pick up running solo. This is a outstanding guitar and I will ship it professionally. Limited Edition Esquire with a Tele Conversion Kit Fender Custom Shop's Limited Edition 1955 Relic Esquire solidbody electric guitar may be the ultimate expression of 6-string tonal purity. The '55 Relic serves up the twang with its ash body, single Custom Shop '55 Tele pickup, and sustain-enhancing string-through-body bridge. It also includes a Custom Shop Tele conversion kit in case you want to add the included neck pickup. Get your fretting hand around the comfy soft V-shape maple neck, and you'll find Fender Custom Shop's Limited Edition 1955 Relic Esquire impossible to put down. Fender Custom Shop Limited Edition 1955 Relic Esquire Solidbody Electric Guitar at a Glance:The looks and sound of a legendary FenderThree-way switching from a single pickupThe tonal purity of a single-pickup axe The looks and sound of a legendary Fender Introduced in 1950, the Esquire's unique circuitry and biting bridge pickup created a tonal sensation. It later became the weapon of choice for musical luminaries such as Jeff Beck and Bruce Springsteen, and has re-emerged time and time again in the hands of many other great players. The forerunner of the stunningly successful Telecaster, the Esquire packs a ton of tone into its purist setup. And the Custom Shop nitrocellulose lacquer Relic finish gives the Limited Edition 1955 Relic Esquire the look and feel of a well-played classic. Three-way switching from a single pickup So, how do you get 3-way switching from a single-pickup guitar? Fender built three preset tones into the Esquire's circuitry. In the bridge position, the pickup is connected only to the volume control (the tone control is disconnected); this minimal circuitry produces more top-end sparkle than is possible with a Telecaster. In the middle position, the standard tone control circuit is activated. In the neck position, the tone control is again disengaged, but a tone-shaping capacitor rolls off much of the top end and some bottom, producing a darker tone and slight volume loss. The tonal purity of a single-pickup axe Considering it was Leo Fender's first solidbody guitar, it's amazing how much he got right with the Esquire. The general idea was to emulate the sustain of a lap steel and eliminate the onstage feedback issues that plagued the archtop guitars of the day, so the Esquire ended up with one pickup placed at the bridge. Now, with no magnetic pull from additional pickups, the tonal purity of a single-pickup axe is undeniable. And with the tone control bypassed, this is as pure as it gets. If you dig the vibe of a Telecaster neck pickup, then you'll appreciate the included Telecaster conversion kit. You get a pickup mounted in a pickguard and a new control plate that's ready to rock 'n' roll. Fender Custom Shop Limited Edition 1955 Relic Esquire Solidbody Electric Guitar Features:Classic '55 Esquire guitar with additional parts to convert it to a TeleAsh body with relic'd lacquer finish delivers a vintage lookCustom Shop '55 Telecaster pickup provides classic Tele tone9.5\" radius and 6105 (medium jumbo) frets let you bend up high without fretting outQuartersawn maple neck is ultra-stable and warp resistantFender's classic soft \"V\" neck profile serves up outstanding feelLimited-edition hardshell case and certificate of authenticity included", "ItemID": "223302551220", "EndTime": "2019-01-05T04:20:09.000Z", "StartTime": "2018-12-29T04:20:09.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2015-Fender-Custom-Shop-1955-Esquire-Telecaster-conversion-kit-Heavy-Relic-/223302551220", "ListingType": "Chinese", "Location": "Paducah, Kentucky", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2233025512208080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/LR4AAOSwMBdb0P7Y/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/HdQAAOSwHcFb0P7c/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/~hgAAOSwBFlb0P7j/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDYy/z/RVsAAOSwHhRb0P7r/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDYy/z/y5UAAOSw0ZZb0P7w/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/89IAAOSwvx1b0P8K/$_32.JPG?set_id=880000500F"], "PostalCode": "42001", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "sazdsx", "FeedbackRatingStar": "Blue", "FeedbackScore": 71, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 2610.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2610.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "2***b", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 96}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2015 Fender Custom Shop 1955 Esquire with Telecaster conversion kit Heavy Relic", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "Model Year", "Value": ["2015"]}, {"Name": "Model", "Value": ["Custom"]}, {"Name": "String Configuration", "Value": ["6 String"]}]}, "HitCount": 137, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 2660.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}