{"BestOfferEnabled": false, "Description": "All photos are of the actual item for sale. Used Item In excellent, mint condition. The bass side threaded insert for the bridge is not sitting perfectly flush to the surface of the body. This does not seem to affect the action, intonation or tone. A virtually brand new guitar with all docs and accessories in Custom Shop case that's in excellent condition. Gibson Custom SG Custom Solidbody Electric Guitar w/ Case - Ebony - 1 of 300 made Solidbody Electric Guitar, Limited Edition, with Mahogany back, Maple top, Mahogany neck, Richlite fretboard, and 2 Humbucking pickups. 6.9 lbs As part of a very limited run of only 300 instruments for 2017, the Gibson Custom SG Custom electric guitar was not available for long. Gibson has taken the iconic SG platform and given it a distinctive look, Custom Shop appointments, and 490R/498T humbucking pickups for exceptional tone. The combination of Ebony finish, rolled fretboard binding, and gold hardware sets this SG apart from the pack. CTS control pots, a Switchcraft toggle switch, and a hand-wired harness are ready for a lifetime of reliable performance. Don't miss your chance to step up to Custom Shop quality with Limited Edition appeal, with the Gibson Custom SG Custom. Features Limited Edition SG — only 300 were made Custom Shop appointments include rolled fingerboard binding, block pearl inlays, and hand-wired electronics Ebony finish with gold hardware for an undeniably classy look 490R/498T humbucking pickups for classic tone with an edge Hardshell Custom Shop case included Tech Specs Body Type: Solidbody Body Shape: SG Left-/Right-handed: Right-handed Number of Strings: 6 Body Material: Mahogany Top Material: 2-piece Maple Body Finish: Nitrocellulose Lacquer Color: Ebony Neck Material: Mahogany Neck Shape: Medium C profile Fingerboard Material: Richlite Fingerboard Inlay: Pearloid blocks Number of Frets: 22, Medium Jumbo, rolled binding Scale Length: 24.75\" Nut Width: 1.687\" Nut Material: Corian Bridge/Tailpiece: Tune-o-matic bridge with stopbar tailpiece Tuners: Grover Kidney tuners Neck Pickup: 490R Humbucker Bridge Pickup: 498T Humbucker Controls: 2 x volume, 2 x tone, 3-way toggle pickup switch Strings: 10-46 Case Included: Hardshell case Manufacturer Part Number: SGC-PSL11052 Includes* Everything pictured with factory box. *There could be important accessories not included. We do our best to call out the accessories that should be included that are missing, however, we don't research every item to know with certainty what should be included. Please do this research before bidding and know what you are purchasing. Check out my other auction listings! and be sure to add me to your favorites list. CONTACT INFORMATION You can e-mail us with any questions you may have about an item. We are very easy to reach, and we are glad to help. Just click \"Ask a question\" in the questions and answers area below. Please note that we are not in the office after 5:00PM EST on weekdays, or all day Saturdays and Sundays. Questions asked over the weekend will be answered on the following business day. SHIPPING INFORMATION Items are shipped within one business day of payment. To avoid a lost or stolen item, your package may ship \"Signature Required.\" If you have special shipping instructions or would like your item shipped UPS instead of USPS or FedEx, please contact us before you make a purchase. We collect local sales tax here in Indiana. This applies to Indiana residents who we ship to, as well as non-Indiana residents who drive here for local pickups. We also collect sales tax in other states around the country. Please check eBay's tax information on the \"Shipping and payments\" tab above to see if we are collecting tax in your area. PLEASE NOTE Shipping quotes are estimates only. We use eBay’s shipping calculator, which provides estimated shipping charges on listings where “Free Shipping” is not offered. Ebay's FedEx calculator on the item page quotes eBay's discounted FedEx shipping rates, which we honor. At checkout, however, buyers in certain areas will see the calculator attempt to charge the full retail price. FedEx's full retail price is the price you pay if you were to walk into a FedEx retail location. The difference between eBay's discounted rate and this retail price can be as much as 40%. If you estimate shipping with a zip code that is different from the zip code registered to your User ID, eBay’s shipping calculator will make the adjustment at checkout. Additionally, FedEx charges a surcharge for delivery in certain rural areas of the country that does not, for some reason, show up in eBay’s estimate calculator; but it does at checkout (we wish we could control this, but we can’t — we have contacted eBay many times about this issue). FedEx does this based on the +4 extension of your primary 5-digit zip code. For example, eBay’s shipping calculator may quote you one price based on your primary 5-digit zip, and then figure out that your requested street address at checkout places you within the rural surcharge area, changing the shipping price to an alternate amount that was originally quoted. If there is a discrepancy in your shipping cost, please send us a screen shot of the quoted price to you on our item page and we can override the eBay checkout calculation to get you the cheapest rate. RETURN INFORMATION We want you to be completely happy with your purchase. If the item you receive is not as described or has been damaged in shipping, please contact us immediately. We will make every effort to promptly resolve any problem. Your satisfaction is our top priority. We are happy to offer free shipping on some of the items we offer. Please note that if you decide to return something where free shipping was offered, our shipping costs are non-refundable.", "ItemID": "132933275990", "EndTime": "2019-02-05T02:28:49.000Z", "StartTime": "2019-01-29T02:28:49.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-Custom-SG-Custom-Solidbody-Electric-Guitar-w-Case-Ebony-1-300-/132933275990", "ListingType": "Chinese", "Location": "Fort Wayne, Indiana", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1329332759908080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA0OFgxNjAw/z/p7sAAOSwLeFcTzH7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg2NzA=/z/bX4AAOSwA3xcTzH9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjQ0/z/E~cAAOSw4qBcTzH~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg1OTQ=/z/xz4AAOSwy6NcTzIA/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/wSgAAOSwtutcTzIB/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE0NlgxNjAw/z/CpgAAOSwUpFcTzIE/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTQyWDE2MDA=/z/CXcAAOSwiz1cTzIT/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjU3WDE2MDA=/z/iWwAAOSwS3lcTzH5/$_57.JPG?set_id=8800005007"], "PostalCode": "46818", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jeffsmusicgear", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 14396, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 8, "ConvertedCurrentPrice": {"Value": 2150.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2150.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "n***2", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1628}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson Custom SG Custom Solidbody Electric Guitar w/ Case - Ebony -1 of 300", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson Custom"]}, {"Name": "Product Line", "Value": ["Gibson SG"]}, {"Name": "Model", "Value": ["SG Custom"]}, {"Name": "MPN", "Value": ["SGC-PSL11052"]}, {"Name": "Series", "Value": ["Custom"]}, {"Name": "Body Color", "Value": ["Ebony"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["2017"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Material", "Value": ["Mahogany"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}]}, "HitCount": 610, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=36123540", "StoreName": "jeffsmusicgear"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 2175.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "In excellent, mint condition. The bass side threaded insert for the bridge is not sitting perfectly flush to the surface of the body. This does not seem to affect the action, intonation or tone. A virtually brand new guitar with all docs and accessories in Custom Shop case that's in excellent condition. Please see the photos above; they are of the actual item for sale.", "QuantitySoldByPickupInStore": 0, "SKU": "SGCustEBGHU1", "NewBestOffer": false}