{"BestOfferEnabled": false, "Description": "--> Steinberger Spirit GT-PRO Deluxe Electric Guitar (White) Used This item is slightly used and has been thoroughly checked out by our experts to make sure it is in perfect working condition. We then re-sealed it in its original packaging with all factory included accessories. This item is guaranteed to be in \"as new\" condition and has virtually no cosmetic imperfections. This item is covered with a one year warranty from Sam Ash. The Steinberger GT-PRO 6-string electric guitar features the revolutionary Steinberger design with a Basswood body and 3-pc Hard Maple neck for an instrument that resonates as a single piece of wood. For traveling musicians, the GT-PRO is the Ultimate Travel Guitar. At only 30.25\" long, its ergonomic design makes it easy to take anywhere including overhead airline compartments. And thanks to its headless construction and 3-pc Hard Maple neck, the GT-PRO isnt as sensitive to temperature changes as typical guitars, which makes it virtually indestructible! The neck has a comfortable 1960s style SlimTaper-D profile, 24 medium jumbo frets, and a 14\" radius. A folding leg rest sits compactly on the lower bout of the guitar. A deluxe gig bag is included.Patented R-Trem Tremolo and 40:1 Ratio Direct-Pull Systems The Steinberger neck gives you slightly extended spacing at the upper frets and can maintain incredibly accurate intonation under intense shredding. With no headstock, the GT-PRO has a Zero Nut Fret with a width of 1.625 that moves up to 2.04 at the 12th fret as the neck subtly widens to 0.42\" string spacing at the bridge. The bridge has steel saddles with Steinbergers patented R-Trem Locking Tremolo and 40:1 Ratio Direct-Pull tuning systems. Unlocked, the R-Trem is capable of extreme dive-bombing as well as pull-ups. Locked, the R-Trem acts like a fixed bridge. Since there is no headstock, the weight of the GT-PRO feels more balanced than a typical guitar. Fine tuning adjustments are made at the bridge and string changes can be made fast! The Steinberger GT-PRO is set up at the factory with Steinberger DoubleBall 10-46 strings. Plus, with the Single Ball string adopter, you can set also set up the GT-PRO with regular strings. Versatile Pickups The Steinberger GT-PRO is powered by Steinbergers versatile humbucker pickups in the neck (HB-2) and bridge (HB-1) positions along with full-range Steinberger SC-1 single coil pick up in the middle position. Controls include Master Volume, Master Control, and a 5-way pickup selector. Revolutionary Steinberger DesignThere was nothing like Ned Steinbergers guitars and basses when they were first introduced in 1979. Today, with their lightweight and headless design, Steinberger guitars are still bold, modern instruments that offer players both a smooth tonal response and rock solid intonation at any position on the neck while giving soloists a more pronounced single note attack not available from typical guitar designs.Specifications:Finish: GlossNeck Material: 3-pc Hard MapleBody Material: BasswoodNeck Shape: 1960s SlimTaper; D profileFingerboard Radius: 14\"Frets: 24; Medium-JumboScale Length: 25.5\"Zero Nut Width: 1.62512th Fret Width: 2.04\"Bridge: Locking R-Trem Tremolo SystemSaddle Material: SteelBridge String Spacing: 0.42\"Tuning System: Patented 40:1 Ratio Direct-PullNeck Pickup: Steinberger HB-2Middle Pickup: Steinberger SC-1Bridge Pickup: Steinberger HB-1Controls: Master Volume, Master Tone, 5-Way Pickup SelectorHardware: BlackOutput Jack: Premium 1/4\" Barrel-StyleStrings: Steinberger DoubleBall 10-46Other: Fold Down/Up Leg RestIncludes: Deluxe GigbagWeight: 7.0 lbsLength: 30.25\"Get your Steinberger GT-PRO Deluxe Electric Guitar today at the guaranteed lowest price from Sam Ash Direct with our 45-day return and 60-day price protection policy. Shipping Information Your gear will ship out within 2 days of order confirmation. At this time we can not ship PO Boxes, APO and FPO locations. Industry Leading 45-Day Return Policy We stand by the products we sell, and we'll certainly stand by you as well! We truly appreciate your business, and we want you to be 100% happy with your purchase. However, we know that one of the drawbacks of internet shopping is that you can't try something before you buy it. That's where our money-back guarantee comes in. If you are not completely satisfied with an item, for any reason, you can return it within 45 days of the shipping date for a complete refund of the merchandise price.* Have a question about your order? A Sam Ash Customer Service specialist is available to help! Call 800-472-6274, Monday - Saturday, from 10:00AM - 6:00PM EST. Due to the complexity of international shipping, we are unable to accept any returns on international orders. Before making a purchase outside of the United States, please know that products sold by Sam Ash use the standard 120V/60Hz voltage standard. Sam Ash is not responsible for any damage caused by not adhering to the voltage requirements. *All returns must be within 45 days of the date the item was shipped. Please do not accept any shipment if the packaging appears damaged in any way. We strongly suggest that you check your order after receiving it to be sure that it is in proper working order. Returned items must be in resalable condition. Resalable Condition means that the product(s) is exactly in the same condition as you received it. All exchanges must be pre-paid, returned in original packing, complete with blank warranty cards, owner's manual and show no sign of wear or abuse. In the event that the product is not in the same condition as you received it you may be subject to a minimum 15% restocking fee, repair charge or disqualification. Shipping and handling charges are non-refundable. Please call our Customer Service department if you have any questions about returning an item. CDs, DVDs, video tapes, sheet music, books, strings, computer hardware/software, drum heads, harmonicas, mouthpieces, sound cards, microphones, raw speakers, studio furniture, blank CDs/Tapes or Special Orders are not covered by this return policy.", "ItemID": "183701758512", "EndTime": "2019-02-24T22:47:35.000Z", "StartTime": "2019-02-24T16:15:16.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Steinberger-Spirit-GT-PRO-Deluxe-Electric-Guitar-White-Used-/183701758512", "ListingType": "FixedPriceItem", "Location": "Tampa, FL", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1837017585128080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MzcxWDUwMA==/z/jZQAAOSw8uFcW3fh/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MzcxWDUwMA==/z/UwQAAOSwF8BcXGKF/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MzcxWDUwMA==/z/IGIAAOSwbmFcXGKF/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MzcxWDUwMA==/z/scwAAOSwpHtcXGKF/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MzcxWDUwMA==/z/BDIAAOSwUR9cXGKF/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MzcxWDUwMA==/z/JIAAAOSwCYdcXGKF/$_1.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "samashdirect", "FeedbackRatingStar": "PurpleShooting", "FeedbackScore": 59073, "PositiveFeedbackPercent": 99.3, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 323.88, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 323.88, "CurrencyID": "USD"}, "HighBidder": {"UserID": "m***p", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 2}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Steinberger Spirit GT-PRO Deluxe Electric Guitar (White) Used", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Steinberger"]}, {"Name": "MPN", "Value": ["GTPROWH1"]}]}, "HitCount": 11, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1111655870", "StoreName": "Sam_Ash_Music_Direct"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "DiscountPriceInfo": {"OriginalRetailPrice": {"Value": 665.0, "CurrencyID": "USD"}, "PricingTreatment": "STP", "SoldOneBay": false, "SoldOffeBay": false}, "ExcludeShipToLocation": ["Alaska/Hawaii", "APO/FPO", "US Protectorates", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "ConditionDescription": "Like New", "QuantitySoldByPickupInStore": 0, "SKU": "SGTPROWH1", "NewBestOffer": false}