{"BestOfferEnabled": false, "Description": "For the coolest guitars on eBay Be sure to visit the Guitars and Audio Stuff eBay Sales and Auctions You are bidding on a used 2002 Epiphone Les Paul Standard by Gibson This Epiphone Les Paul features a mahogany body with a maple cap and a maple neck with a 24.75\" scale rosewood fingerboard with 22 frets and trapezoid inlays. The guitar has an Ebony finish. The electronics consist of 2 Standard humbucker pickups controlled by a 3 way switch and a volume control and tone control for each pickup. The knobs are vintage style amber colored top-hat models. The guitar has sealed Grover tuners with metal Kidney bean knobs. The tuner for the D string is a replacement. The bridge is a tune-o-matic with a stop tailpiece. The hardware has a Chrome finish. There are only minor marks on this guitar and it is in excellent near mint condition. The neck is straight and the truss rod can adjust the relief to your preference. There is no fretwear and no wear to the rosewood fingerboard. The electronics are all working as designed and quiet. This Les Paul is a great sounding guitar with classic styling in a classic color. A gigbag is included. Don't miss out. This item is used and sold as is. California residents add 7.75% state sales tax. Winning bidder pays for Fed Ex Ground Shipping delivery time 2 to 6 days Local pickup is allowed if you're in the Riverside, California area International shipping not available on this item due to restrictions on rosewood by the CITES Treaty. THE FINE PRINT: * PLEASE READ CAREFULLY!* New ebayers with 0 feedback are invited to bid but please contact me before bidding to let me know what payment method you will use. All items will be insured in the amount of the winning bid when shipped. I will not end the auction early Please don't ask. Item is sold as-is with no warranty or approval period implied or stated. If a transferable warranty exists, it is up to the high bidder to take the necessary steps to implement it. If the item is not paid for within 72 hours of the end the auction results will be canceled and the item will be relisted. Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer’s responsibility. Please check with your country’s customs office to determine what these additional costs will be prior to bidding/buying. These charges are normally collected by the delivering freight (shipping) company or when you pick the item up – do not confuse them for additional shipping charges. We do not mark merchandise values below value or mark items as ‘gifts’ - US and International government regulations prohibit such behavior. I will not undervalue the item to help you avoid Customs Fees. The USPS considers it a crime. Please don't ask. Once the item has left the United States I have no control over how it is handled or where it is sent. The Postal Service can only confirm that it has left the US. The buyer will need to contact their local Customs Agency or Postal Service if an item does not arrive with in the specified time. I will provide the buyer with the Customs Form Number and the Insurance Number if applicable. Sorry, no C.O.D.s. * NO TRADES!* I reserve the right to decline sale to bidders with excessive or unexplained negative feedback. Seller cannot be held responsible for loss or damage incurred during shipment or denied claims. I have a LOT of experience shipping, and always pack well. However once it leaves my shipping department I have no control over how it is treated. I will do all I can to help you resolve any situations that arise as a result of shipping problems. Positive feedback will be left upon receipt of same Thanks for looking and good luck.", "ItemID": "202609085518", "EndTime": "2019-03-01T20:38:46.000Z", "StartTime": "2019-02-26T20:38:46.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2002-Epihone-Les-Paul-Standard-Ebony-Epi-/202609085518", "ListingType": "Chinese", "Location": "Norco, California", "PaymentMethods": ["PayPal", "VisaMC", "CashOnPickup"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2026090855188080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/Mjk3WDgwMA==/z/qy4AAOSwzd5cdZ6K/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MzY1WDgwMA==/z/tQgAAOSwdwlcdZ6L/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTc2WDgwMA==/z/lakAAOSwqrVcdZ6N/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjM0WDgwMA==/z/thAAAOSwjARcdZ6Y/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTEyWDgwMA==/z/0gkAAOSwsaBcdZ6a/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjMyWDgwMA==/z/Ga8AAOSwu2tcdZ6c/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjUzWDgwMA==/z/4K4AAOSw7KhcdZ6e/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA3MFg3NjU=/z/9WYAAOSw1dxcdZ6l/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjU0WDgwMA==/z/F14AAOSw6aJcdZ6o/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjQ4WDgwMA==/z/MZMAAOSwk1hcdZ6p/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTE4WDgwMA==/z/vYcAAOSweZ9cdZ6r/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDg0WDgwMA==/z/1xgAAOSw2jFcdZ6t/$_57.JPG?set_id=8800005007"], "PostalCode": "92860", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "guitaudio", "FeedbackRatingStar": "Red", "FeedbackScore": 2183, "PositiveFeedbackPercent": 100.0}, "BidCount": 6, "ConvertedCurrentPrice": {"Value": 222.5, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 222.5, "CurrencyID": "USD"}, "HighBidder": {"UserID": "b***r", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 8}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2002 Epihone Les Paul Standard Ebony Epi", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Epiphone By Gibson"]}, {"Name": "Model", "Value": ["Les Paul Standard"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Ebony"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model Year", "Value": ["2002"]}]}, "HitCount": 100, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=596584", "StoreName": "Guitars And Audio Stuff"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 225.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}