{"BestOfferEnabled": false, "Description": "Fender Mid 60's Styled Tribute Relic Stratocaster My guitars are beautifully unique Art pieces and music makers. Each one is designed and built to represent an Icon from the past. They are built with the best parts; commensurate with the price you pay. As a Wounded Warrior, I place integrity, know how, lots of time and love into each of them, as this is also a form of therapy for me. See my feedback, I've been at this hobby for a while. Included with your purchase is a ChromaCast Padded Gig Bag ($50.00) and Fender Custom Shop custom care packet, Owners manual, registration card, hang tags, appropriate tremolo bar, allen wrenches and tremolo back plate - (if needed)! Thanks for looking & check out my other STRATS and Fender parts for sale! For your consideration is this Custom hand restored Stratocaster. I've Styled this after a 1964-65 Stratocaster with the L plate, Rosewood naked neck and 57/62 pickups. BODY: The body has been finished with all the road worn imperfections that would normally come with a fifty-year-old well-played guitar. The body is an aftermarket and is painted in a Translucent Gloss Butterscotch, with what I think is a Poly finish. It has a Translucent finish with hand aged yellowed cream pick guard contrasted with black pick up covers, knobs and switch tip. The pickguard, pickup covers, switch tip and knobs have been hand aged. The Bridge is a Fender vintage big block with American standard wider spacing (2 3/16). NOTE: There's a small space in the neck pocket but it's barely noticeable and the neck is still tight and with all honesty, this guitar neck plays as sweet as my real 65! ELECTRONICS: The Heart has upgraded pickups and electronics. The pick up’s are True Custom Shop 57/62 copper wound Alinco II's fiber bottoms and the wiring is done to vintage 60's specifications. They are staggered, beveled-edge Alnico magnets with formvar wire designed to deliver the original vintage Strat sound, feel, and vibe. It has upgraded new Seymour Duncan Bourns Smooth Taper 250K Split Shaft Speed Pots on the volume and tone, and the capacitor is NOS vintage Fender Bright Orange Dime .022 uF. The wiring is vintage cloth as well. All 5-tone switch positions are distinct and clear; the 2 tone pots work correctly with their corresponding pick-ups. NECK: The neck is a Rosewood cap on maple. It has a mid 60's type naked smooth front headstock (the neck has no truss rod slot on the face of the headstock), and also has a naked back (all smooth maple with no skunk stripe.) The neck is straight (see photo #10) with a C profile, Jumbo frets and the tuners are vintage Kluson style. It’s built in the early sixties tribute style with a 80's Fender (Rare Japan re-issue) 60's neck and small headstock, with a waterslide from the 64-65 ERA. The neck plate is a matching F plate with a mid 60's number and the rare \"L\" in front as they transitioned to CBS. It’s a beautiful machine with a neck radius of 10\" and a string height at the 12th fret of 3/64\". I always setup the neck (truss rod), frets and strings to minimize the string height and fret buzz while keeping the neck as straight as allowed. The neck plays low and easy, with a complete new setup. I've added new Ernie Ball super slinky .09 strings, and then completed a bridge adjustment for perfect string height and playability. Lightweight at 7.5 lbs. I’m a Wounded Warrior and have been rescuing and rebuilding guitars for the last ten years, as a form of therapy. One too many several explosions left me wrapped too tight, (majoranthonyjones.com.) Now, I exercise my brain by playing and rebuilding guitars. I’m wrapped pretty tight so I’m OCD about getting my guitars as perfect as I can, within reason, so you’re definitely getting your moneys worth! RETURNS are NOT ACCEPTED - BUT if you contact me immediately, (7 days) and have not opened or modified the guitar, I will accept return & Buyer pays shipping. Below, I’ve best described the spec’s on my guitar’s, allowing you to make an informed decision. BODY: MODEL: Stratocaster, contour body – classic style - aftermarket. WOOD: Best guess would be ASH. FINISH: TRANSLUCENT BUTTERSCOTCH - “Shoulder Light Relic’d” PAINT: Sanded and buffed. WIEGHT: 4.0 lbs PLUG JACK: New Switchcraft JACK PLATE: New Fender “Relic’d” BRIDGE: Fender Vintage style “Relic’d” = 2” 3/16 American standard wide spacing BRIDGE SCREWS: 6 New steel – “Relic’d” TREMELO BLOCK: Synchronized Big Block “Relic’d”. TREMOLO CLAW: New wider Fender “Relic’d” TREMOLO SPRINGS: Fender “Relic’d” 3 springs TREMELO ARM: New Fender “Relic’d” BRIDGE SADDLES: Fender stamped STRAP BUTTONS: New Fender “Relic’d” with pads SCREWS: 11 + 2 “Relic’d” PICK GUARD: TYPE: Fender Hand “Relic’d” 11 hole. PICK GUARD SCREWS: New relic'd 11 hole. COLOR: CREAM - YELLOWED hand relic FINISH: Hand “Relic’d” SHIELDING: Aluminum / Copper PICK UP COVERS: Black Fender “Relic’d” KNOBS: Black Fender original relic SWITCH TIP: Black Fender “Relic’d” POTS: Upgraded new Seymour Duncan Bourns Smooth Taper 250K Split Shaft Speed Pots X 3 CAPACITOR: NOS vintage Fender Bright Orange Dime .022 uF SWITCH: 5 way Oaks Grigsby WIRING: Vintage 60's standard setup PICKUPS: True Custom Shop beveled ALINCO II overwound vintage fiber bottoms NECK: 6.90 ohms MIDDLE: 7.01 ohms BRIDGE: 7.78 ohms NECK: TYPE: Fender Japan 60's Re-Issue Rosewood cap on maple - NAKED headstock and back - 60's style. PROFILE: C SCALE LENGTH: 25.5 / 4 bolt WOOD: Flatcut sawn Maple FINGERBOARD: Rosewood FINISH: Tinted - New FINGERBOARD RADIUS: 10\"FRETS: 21 FRET SIZE: JumboTRUSS ROD: Working / Heel / Naked headstock and smooth back. STRING NUT: Black vintage bone HEADSTOCK: Vintage / Small TUNERS: Vintage Slotted “Kluson” style “Relic’d” FERRELS: Vintage “Kluson” style “Relic’d” STRING TREE: Vintage POSITION INLAYS: Pearl PLATE: “Relic’d” SERIAL NUMBER: 50 – 60’s vintage style early CBS F plate - #L964** Assembled TOTAL weight: 7.5 lbs Thanks for looking. FEEDBACK: Great delivery timing but (hard) case arrived damaged (Saudi Arabia) guitar is fine & plays well. FENDER STRATOCASTER 60s STYLED TRIBUTE NATURAL RELIC. Great to deal with! Sweet strat, Quick shipping - FENDER STRATOCASTER CUSTOM 68 STYLED GOLD FLAKE RELIC. Thank you. Great guitar! CLAPTON “BLACKIE\" TRIBUTE STRATOCASTER RELICThanks for the great work and service! Great seller. FENDER 50'S CREAM STRATOCASTER LIGHT RELIC.Very pleased - plays and sounds as described. FENDER HEAVY RELIC BLACK STRATOCASTER.Great neck - natural relic. Plays like I hoped! FENDER LEAD II NECK.Shipped fast arrived in great shape - thanks. FENDER TOM DELONGE STRATOCASTER.Great communication and shipping. Love the guitar. GIBSON SG.Smooth sale and shipping. Plays and sounds sweet - FENDER SUNBURST STRATOCASTER.Steal of a deal! 5 star looks, tone, play, shipping. Look here before buying Strat = FENDER STRATOCASTER – 1995 - USA 40th ANNIVERSARY.Nice guitar. Most of all thank you for your service to our country. God bless u = FENDER TELECASTER - Custom Double Contour.Good communication, fast shipment. Great guitar! FENDER STRATOCASTER, FOTO FLAME.Fast shipping, packed great, arrived ready to play and looked awesome. As described and also a great guitar – Thanks! FENDER BIEGE STRATOCASTER.Wow, what a great deal. Real relic strat that plays like a dream. FENDER JAPAN NATUAL STRATOCASTER.Worth every penny. Strat landed here with no issues and shipped fast. Plays great too. FENDER SUNBURST STRATOACSTER.Great guitar, forgot trem bar and shipped another out asap. Plays low and fast – thanks! FENDER CLASSIC PLAYER. PLEASE EXAMINE THE PHOTOS VERY CAREFULLY AS THEY ARE THE TRUE DETAILS OF THIS ITEM. Seller's payment instructions: Shipping to continental USA ONLY. No international shipping. PayPal ONLY. We ship to PayPal confirmed address only. All auction payments must be received within 24 hours of auction close. My feedback is outstanding and will do everything possible to ensure a pleasant transaction.", "ItemID": "163458492625", "EndTime": "2019-01-12T09:57:39.000Z", "StartTime": "2019-01-11T09:00:58.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/FENDER-STRATOCASTER-CUSTOM-64-STYLED-BUTTERSCOTCH-ROAD-WORN-SHOP-RELIC-/163458492625", "ListingType": "FixedPriceItem", "Location": "Las Vegas, Nevada", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1634584926258080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/070AAOSwN~tb1Mc2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/2qUAAOSw0HlbprNg/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/bbcAAOSwdzRbprNt/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/rs8AAOSwAqFbprJX/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/aMwAAOSwaEJb1Mcx/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/AssAAOSw52tbY4od/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/mfAAAOSwAoFbZj3p/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/zPoAAOSw-31bZj3f/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/tfwAAOSwlJ9bprN4/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/2BIAAOSwg0hbY4nw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/T5IAAOSwE0JbZkIC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTcyWDEyOTY=/z/KOgAAOSwHhRb1Mca/$_57.JPG?set_id=8800005007"], "PostalCode": "89110", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "cor5221", "FeedbackRatingStar": "Red", "FeedbackScore": 2138, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 599.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 599.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "l***a", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 152}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "FENDER STRATOCASTER CUSTOM 64 STYLED BUTTERSCOTCH ROAD WORN SHOP RELIC", "ItemSpecifics": {"NameValueList": [{"Name": "Size", "Value": ["Full Size"]}, {"Name": "Body Color", "Value": ["BLONDE CREAM"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["60s Stratocaster"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Style", "Value": ["Stratocaster"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Brand", "Value": ["Fender"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}]}, "HitCount": 44, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "APO/FPO", "Africa", "Central America and Caribbean", "Europe", "North America", "Oceania", "Southeast Asia", "South America", "RU", "AF", "AM", "AZ", "BD", "BT", "CN", "GE", "IN", "JP", "KZ", "KR", "KG", "MV", "MN", "NP", "PK", "LK", "TJ", "TM", "UZ", "PO Box"], "GlobalShipping": false, "ConditionDescription": "This is NOT a Fender “Custom Shop” guitar, but it has been carefully built to standards of most Custom Shop relics and Road Worn guitars, with the best parts (i.e. partscaster) and knowledge.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}