{"BestOfferEnabled": false, "Description": "FenderJohn Mayer Stratocaster Artist Signature Electric Guitar - 3-Color Sunburst PLEASEREAD ALL THE DESCRIPTION Your Chance to Play John Mayer's Signature!The old-school blues guitar gets a newvoice! Pick up the John Mayer Signature Stratocaster and you immediately knowyou're holding a very special Strat. This is no off-the-shelf instrument with asignature attached; the John Mayer Strat is built to the Grammy-winningartist's personal specs. You get a unique, slightly bigger C-shaped neckprofile and a trio of Big Dipper single-coil Strat pickups (with a special\"scooped\" midrange voicing), for starters. Five tremolo springs areinstalled at the factory, and the string tree is a bit further from the nutthan it would be on a standard Strat. Grab the John Mayer SignatureStratocaster and you know you're playing a modern blues-rock tone machine! Item Description Fender John Mayer SignatureStratocaster Unique Features:· Satin Urethane on neck with buffed headstock and vintage'50s decal· \"Big Dipper\" single-coil Stratocaster pickups withspecial \"scooped\" midrange voicing to meet John Mayer'sspecifications· 3-ply white Shell pickguard (I CHANGE THE ORIGINAL ONE BECAUSE DIDN'T LIKE THE COLOR)· 5 tremolo springs installed at factory· No back plate· String tree slightly further from the nut Fender John Mayer SignatureStratocaster Solidbody Electric Guitar Features:· Color: 3-color Sunburst· Neck wood: Maple· Neck shape: Slightly bigger \"C\"-shape, satinurethane on neck with buffed headstock and vintage '50s decal· Machine heads: Fender/Gotoh vintage style· Body wood: Solid alder· Fingerboard: African rosewood fingerboard, 9-1/2\"radius· No. of frets: 21 Dunlop 6105 frets· Pickguard: 3-ply Brown Shell· Pickups: Big Dipper single-coil Stratocaster pickups withspecial \"scooped\" midrange voicing to meet John Mayer'sspecifications· Controls: Master Volume, Tone 1= neck pickup, Tone 2=bridge/middle pickup· Bridge/tailpiece: American vintage synchronized tremolo.· Pickup switching: 5-way switch· Case: softshell case Fender GuitarsYou could easily make the case thatFender electric guitars were responsible - at least in great part - for thebirth of modern rock 'n' roll. Originally designed to be easier to build, andthus more affordable, Leo Fender's masterpieces, which include classics likethe Stratocaster (is there a more distinctive guitar shape in the world?), theTelecaster and the original Precision Bass, were at the core of a musicalrevolution that spawned everything from surf to country to punk!In the 1960s, when Fender guitarsfirst hit bandstands and stages all around the country, it was astonishing tosee that trademark Fender maple neck and fingerboard. Though the companyeventually offered rosewood fingerboards as standard or optional on its entireline of instruments, those first\"blond\" necks really shook things up.Others have picked up on the maple neck theme, but it's clearly yet another ofLeo Fender's \"firsts.\"Today,no other manufacturer can match Fender for the sheer number of optionsavailable throughout its entire line. While vintage Fenders can commandastronomic prices, the company now has the widest range of quality instrumentsin the world, along with the highest profile players like Eric Clapton, JeffBeck, Jimi Hendrix and Stevie Ray Vaughan, all of whom are legendary. NOTE: This product is available in the United Statesonly - no international sales. READ The Guitar and case are used but in excellentcosmetic condition and perfect play/working condition, with some minor wear on the guitar body for normal use but hard to notes (see pics for details). Comes witheverything see in the photos. If you have any questions or request, please letme know at any time. this guitar comes with: -Guitar -Fender in case Soft shield John Mayer Signature -Original whammy bar \"NOTICE: Before purchasing, please understand that this is as used itemor vintage item that some of them might has damages not listed or invisiblewears in the photos. all of the electronics function are perfect I can ship ONLY to your Paypal address Payment Importduties, taxes and charges are not included in the item price or shippingcharges. These charges are the buyer's responsibility. Please check with your country's customs office to determine what these additionalcosts will be prior to bidding/buying. I accept PayPal payment only. Please make payment within 2days of the end of the auction. If you have any questions, please email me before purchase.", "ItemID": "223218038681", "EndTime": "2018-11-12T03:30:01.000Z", "StartTime": "2018-11-05T03:30:01.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fender-Artist-John-Mayer-Stratocaster-Electric-Guitar-/223218038681", "ListingType": "Chinese", "Location": "Miami, Florida", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/2232180386818080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTI4MFg5NjA=/z/PuAAAOSwarlb37et/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTI4MFg5NjA=/z/a8IAAOSwCtNb37en/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTI4MFg5NjA=/z/wioAAOSw2-pb37ek/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTI4MFg5NjA=/z/RQYAAOSw18Jb37eg/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTI4MFg5NjA=/z/HkQAAOSwYYpb37ec/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTI4MFg5NjA=/z/yX8AAOSwdwVb37ex/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTI4MFg5NjA=/z/K4kAAOSws99b37e2/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTI4MFg5NjA=/z/cuAAAOSwzTFb37e4/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTI4MFg5NjA=/z/tg4AAOSwtmZb37fN/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTI4MFg5NjA=/z/u4cAAOSwHWtb37fA/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTI4MFg5NjA=/z/qWAAAOSwN5hb37fX/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTI4MFg5NjA=/z/5wUAAOSwIbtb37fj/$_32.JPG?set_id=880000500F"], "PostalCode": "33176", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mgguarrasi28", "FeedbackRatingStar": "Blue", "FeedbackScore": 96, "PositiveFeedbackPercent": 100.0}, "BidCount": 2, "ConvertedCurrentPrice": {"Value": 1324.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1324.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "e***d", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 33}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Fender Artist John Mayer Stratocaster Electric Guitar", "ItemSpecifics": {"NameValueList": [{"Name": "Model Year", "Value": ["2005-2014"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Body Color", "Value": ["3-Color Sunburst"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Brand", "Value": ["Fender"]}, {"Name": "Body Material", "Value": ["Alder"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "MPN", "Value": ["119700805"]}]}, "HitCount": 277, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 1349.0, "CurrencyID": "USD"}, "ProductID": {"Value": "78630649", "Type": "Reference"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}