{"BestOfferEnabled": true, "Description": "eBay Template Design by OCDesignsOnline Home About Testimonials Policies Contact Sell your Gear Epiphone Les Paul Black Beauty 3 w/ Hardshell Case Ebony Gold #34361 × × × × × × × × × × × × × × × × × × × × × × × × × × × × × × × × × × × Item Description INVENTORY #34361 BRAND: Epiphone MODEL: Les Paul Black Beauty 3  FUNCTION: Electric Guitar PRODUCT DESCRIPTION: This listing is for a Epiphone Les Paul Black Beauty 3. SPECS: Serial #EE080400317 Finish/Color: Ebony Weight: 9 lbs Nut Width: 1-11/16\" Scale Length: 24.75\" Fretboard: Rosewood Frets: 22 General Neck Shape: Slim Taper D Pickup Configuration: 3 Humbuckers Knob and Switch Configuration: 2 Volume 2 Tone ACCESSORIES INCLUDED: This item includes an Epiphone hardshell case and does not include any additional accessories. EXTRAS INCLUDED: D'addario 9-42 Strings PHYSICAL CONDITION: Good - The guitar has lots of oxidation on its gold metal hardware. There are scratches and indentations on the guitar's finish mainly on the front side of the body. Other than that, all the pots, knobs, and switches are intact and in great structural condition. The frets look well maintained and don't have any major divots or wear. Overall, this guitar is in good physical condition.Very Good - The case has some marks on its exterior surface and some oxidation on its hardware. All latches are intact including the handle. All the interior lining and padding is in excellent condition. Overall, the case in very good condition. WORKING CONDITION: Very Good - All control knobs works perfectly, toggle switch and all three pickups work great as well. Overall working condition is very good.  UNPACKAGED WEIGHT: 18 lbs. UNPACKAGED DIMENSIONS: 42\" x 17\" x 5\" Warranties Payment Shipping Returns Warranties 100% Satisfaction Guarantee We very much appreciate having your confidence to make a purchase from us and we want you to be happy. With that, we strive to do all we can to make sure your transaction with us is fully positive and trouble-free. For any issues or concerns you may have about your transaction and for fastest service, please use the ‘contact us’ link above and we will address the situation with priority. NEW ITEMS For items in which we are an authorized dealer we offer an extended one (1) year to the manufacturer's stated warranty! USED ITEMS 30-Day Warranty In the rare case that you receive an item that is not operating as described in the listing, you are welcome to return it for a full refund, credit or exchange for a used item of equivalent value within 30 days of receipt of the item, with free return shipping. We strongly suggest that you check your order after receiving it to be sure that it is in proper working order. NOT WORKING – FOR PARTS – AS-IS Items that are listed as \"not working\", \"for parts\", or \"as-is\" do not have any warranty or guarantees and cannot be returned for a refund, credit or exchange of any kind. We do our best to fairly evaluate the condition of a non-working item and give an honest description of any symptoms. If there are any further conditions, missing parts, or dead-issues with the item that are unknown in this type of listing, we will not be held liable for it. WARRANTY DETAILS Similar to any manufacturers warranty, our one-year extended warranty on new items and 30-day warranty on used items provides coverage under normal operating conditions. It does not cover such things as normal wear and tear. It also specifically does not cover items that have been tampered with, altered, modified or where item has been damaged because of buyer negligence. i.e.- Incorrect voltage, un-authorized or self-repair, moisture damage, failure to follow manufacturers instructions or incorrect application etc. Further not covered by our warranty. Acts of god, the old gods and the new gods, forces of nature, items with removed serial numbers, microphone ribbons, speaker drivers, capsules, batteries, tubes, bulbs, damage resulting from the use or misuse of voltage regulators, losses incurred from loss of business, clients, down-time, profits or for personal inconveniences or expenses in travel, gas etc. loss from theft, damages caused by UFO's or ghosts, damage or defects normally covered or still covered by the manufacturers active warranty or 3rd party service plan, use of product for rentals or use by non-owner, losses from corrupted drives or data. Warranties are non-transferable. Please see our RETURNS tab for additional details. Payment We accept PayPal payments made from a verified PayPal account. The confirmed shipping address on the PayPal account must match the shipping address on the order. We also accept all major credit cards. We can accept payments by phone or we can issue a credit card invoice by email. Domestic and International credit card transactions go through comprehensive fraud prevention checks. All transactions are 100% secured with 128-bit encryption. Cash payment for local pick-up is always welcome. Payments for all listings are due within 5 business days of listing close unless agreement is made by us via email to extend deadline. All listings not paid by the morning of the 5th business day will be re-listed or sold and previous listings cancelled. California residents pay 8.75% sales tax on both new and used items. Shipping DOMESTIC Local pickup at our Burbank location is always welcome and FREE!  Most Brand New items for which we are an authorized dealer ship for FREE within the contiguous United States! USED items are subject to standard shipping charges as calculated for that individual item. All orders are handled within 1 business day of cleared payment. In the unusual circumstance that it takes longer, we will notify you with an email. Some larger items and freight shipments take longer than one day to process. USPS and FedEx Ground are our standard choice for shipments made in the Continental US and Canada. USPS is our standard method for all shipments made to Hawaii, Alaska, US territories and Military APO addresses. Additional shipping fees may apply to these areas, please inquire. Techno Empire does ship FREIGHT and can accommodate the crating and palletizing of most any size item. Please inquire for a special quote. Know that extra time is needed in preparing freight shipments. Express or overnight delivery on items is available upon request at an additional expense. All shipments are insured for their sale amount. Direct signature on packages is an option. If desired, please request signature delivery prior to shipment. Packages lost due to theft are not the responsibility of Techno Empire Inc. Examine all boxes upon receipt by the carrier before acceptance. Carrier must note any damage to the box on a release form or you can refuse acceptance. Any items that you receive that have exterior damage to the box or damage to the item, or missing parts or accessories, please report this immediately to customer service at Techno Empire. Please keep all packing materials, accessories and merchandise tags for any item you want to report a claim. Techno Empire will not be responsible for denied insurance claims if any of the above terms are not met. INTERNATIONAL All orders are handled within 1 business day of cleared payment. In the unusual circumstance that it takes longer, we will notify you with an email. USPS Priority is our standard method for most shipments made Internationally. Express services are available for faster delivery at buyer’s expense. Please inquire before purchasing. FedEx Express and DHL are available for International packages exceeding USPS size limits for certain countries. Please inquire for rates if you do not get a rate from the calculator. Import duties, tax charges, or any other destination fees besides direct shipping costs are not included in the product price or shipping charges. Import duties and taxes are the sole responsibility of the buyer. Please check with your country's customs office to determine what these additional costs will be prior to bidding or buying. For International shipments, we cannot mark items as \"GIFTS\"; they will be marked as \"Merchandise\". Insurance for the item will be based on the declared value of the item. No insurance claims will be made exceeding the value declared. Techno Empire will not be responsible for any packages that are lost, stolen, or damaged in International transit. Items that are un-collected from customs and returned to us are subject to a 15% restocking fee and no refund will be given on shipping charges. Specific shipping requests must be written in the \"notes\" section of the PayPal payment. Techno Empire can ship Sea or Air Cargo on very large and oversize items and can accommodate the crating and palletizing of most any items we carry. Please inquire for a special quote. Know that extra time is needed in preparing freight shipments. Returns NEW ITEMS RETURN POLICY If you are not completely happy with a new item that you have purchased, you can return it within 30 days of receipt. Returns on new items are subject to restocking fees if qualifications are not met (See qualifications below). Return shipping costs for new items are the responsibility of the buyer. Shipping and insurance costs are non-refundable. New items that are defective within 30 days of receipt can be returned for replacement, store credit or full refund. In this case we provide return shipping at our expense. If free shipping was provided for the item, then our actual cost of shipping will be deducted from the refund. Techno Empire will not reimburse customs, taxes or any other related fees or expenses for any International returns. Returns have to be processed through several departments. Please understand that it may take 1-3 days to complete your refund after receipt of the returned item. QUALIFICATIONS FOR NEW ITEM RETURNS: All new item returns must include everything that came with the original purchase and be in new condition. This includes all packing materials, accessories, manuals and related documentation. Any item returned with missing or damaged packaging or accessories are subject to reasonable devaluation fees to be deducted from the refund amount. Any item returned that shows wear, damage, stains or has retained pet or smoke odors are subject to reasonable devaluation fees to be deducted from the refund amount. All new item returns must receive an RMA number from us before it can be accepted for return. Return items must be repackaged for safe return with the same care in which you received it. Return items must be insured for at least the full value of the item. Any losses incurred because of inadequate insurance or return packaging will be subject to fees charged against the refund. TIPS TO AVOID RESTOCKING FEES ON NEW ITEMS When you receive an item, open the package using a box cutter and be mindful not to tear up or throw away the box or any internal packaging.  Without having to curb your enthusiasm of basking in the glow of your new piece of gear, think in terms of preserving it in its mint condition until certain you are keeping it. For instance, if it were rack gear, we would recommend avoiding racking it until you were certain it was a \"keeper\". Thus preventing any possible \"rack rash\" or scratches. If it were a guitar pedal, avoid sticking Velcro on it and mounting to your pedal board until it passed your test to be knighted and sit at your round table of pedals. Although tempting to have both of your favorite things together, put down the chicken wings slathered in barbecue sauce that is dripping all over your leather vest and beard and be sure your hands are clean and dry before trying out your awesome new gear. Pet odors, cigarette and other smoke items can also affect the \"newness\" of your gear. Also, keep the gear away from your friend with the Billy Ray Cyrus mullet driving the Camaro. He's a good guy and he means well, but years of smoke tar and beer bongs have dulled his perceptions. Observation and application of these tips will help you avoid any restocking fees on new item returns! USED ITEMS RETURN POLICY In the rare case that you receive an item that is not operating as described in the listing, you are welcome to return it for a full refund, store credit or exchange for a used item of equivalent value within 30 days of your receipt of the item, with free return shipping. We strongly suggest that you check your order after receiving it to be sure that it is in proper working order. Items purchased that are subject to buyer’s remorse or negligence can be returned for a refund within 30 days minus a 15% restocking fee and minus shipping expenses. If free shipping was provided for the item, then shipping costs will be deducted from the refund also. All used item returns must include everything that came with the item and in the same condition as received. This includes all packing materials, accessories, manuals and related documentation. Items returned damaged, altered or in any way less than the condition you received it are the responsibility of the buyer. Devaluation from damages, costs of repairs or loss of value will be deducted from the refund in addition to the restocking fee. Items returned because of apparent defects, but found upon return to be because of user error are subject to a 15% restocking fee and no refund on shipping expenses. For example, if you returned a guitar pedal or microphone because \"it is not working\", but it was found that you simply had plugged it in wrong. In this case, we will be glad to send the item back to you with instructions on correct usage, at your further expense for shipping. Techno Empire will not reimburse customs, taxes or any other related fees or expenses for any international returns. Returns have to be processed through several departments. Please understand that it may take 1-3 days to complete your refund after receipt of the returned item. NON-RETURNABLE ITEMS: Items that have been tampered with, altered, modified or where item has been damaged because of buyer negligence, i.e., incorrect voltage, self-repair, exposure to extreme temperatures, moisture damage, or incorrect application, etc. Earphones, microphones or other items that have intimate mouth, face or body contact. Software, computer hardware, computer drives and other digital or media tape. Oversized or freight items. Items that are special orders, discontinued, or closeouts, are all non-returnable. Items that are listed as \"not working\", \"for parts\", or \"as-is\" do not have any warranty or guarantees and cannot be returned for a refund, credit or exchange of any kind. CANCELLATIONS New and used items are subject to a 5% processing fee if cancelled before delivery. HOW TO RETURN YOUR ITEM Please contact customer service at our \"contact us\" link above so we can send you an RMA number and helpful return instructions. Store Categories ACCESSORIES ACOUSTIC TREATMENT AMPS CABLES COMPUTER AUDIO COMPUTERS CONSOLES & MIXERS CONSUMER ELECTRONICS CONTROL SURFACES DJ DYNAMICS EFFECT PEDALS EQUALIZERS GUITARS KEYBOARDS & MIDI MICROPHONES MONITORS MULTI-TRACK RECORDERS PARTS PERCUSSION PHOTO & VIDEO PREAMPS ROAD CASES SIGNAL PROCESSING SPECIAL ARTISTS STUDIO FURNITURE TOUR GEAR Newsletter Add my Store to your Favorites and receive my email newsletters about new items and special promotions! Home About Testimonials Policies Contact Sell your Gear Copyright © 2017 Techno Empire. All rights reserved. Sell Smarter with Kyozou.Inventory and Ecommerce Management", "ItemID": "183624431975", "EndTime": "2019-01-23T00:55:19.000Z", "StartTime": "2019-01-07T05:26:05.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Epiphone-Les-Paul-Black-Beauty-3-w-Hardshell-Case-Ebony-Gold-34361-/183624431975", "ListingType": "FixedPriceItem", "Location": "Burbank, California", "PaymentMethods": ["PayPal", "VisaMC", "Discover", "CashOnPickup", "AmEx"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1836244319758080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/hfkAAOSwzhFcMuLx/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/AtYAAOSwpzRcMuLx/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/1PUAAOSwOWdcMuLx/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/DXkAAOSwRWZcMuLx/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/~1YAAOSwQ9lcMuLx/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/WNEAAOSwWI5cMuLx/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/NrQAAOSwPVFcMuLx/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/n-8AAOSwYYpcMuLy/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/lM4AAOSwLgpcMuLy/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/eWsAAOSwEp5cMuLy/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/d2MAAOSw~BRcMuLy/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/UqMAAOSwhrpcMuLy/$_1.JPG?set_id=880000500F"], "PostalCode": "91502", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "technoempire", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 14207, "PositiveFeedbackPercent": 99.7}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 549.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 549.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "3***a", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 33}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "Epiphone Les Paul Black Beauty 3 w/ Hardshell Case Ebony Gold #34361", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}]}, "HitCount": 169, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=15771083", "StoreName": "Techno Empire"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalRefund": "MoneyBack", "InternationalReturnsWithin": "30 Days", "InternationalReturnsAccepted": "ReturnsAccepted", "InternationalShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "PHYSICAL CONDITION: Good - The guitar has lots of oxidation on its gold metal hardware. There are scratches and indentations on the guitar's finish mainly on the front side of the body. Other than that, all the pots, knobs, and switches are intact and in great structural condition. The frets look well maintained and don't have any major divots or wear. \n\nOverall, this guitar is in good physical condition.\n\nVery Good - The case has some marks on its exterior surface and some oxidation on its hardware. All latches are intact including the handle. All the interior lining and padding is in excellent condition. Overall, the case in very good condition.\n\nWORKING CONDITION: Very Good - All control knobs works perfectly, toggle switch and all three pickups work great as well. Overall working condition is very good.\n\nPlease click on \"Item Description\" for more details and photos.", "QuantitySoldByPickupInStore": 0, "SKU": "2A8CCC29-FFDA-400D-8C5A-E7879EA313FD", "NewBestOffer": false}