{"BestOfferEnabled": true, "Description": "If you know anything about this company, this guitar is from one of the 5 years you want. From my personal collection, for your consideration is this vintage 1990 Ibanez RG550 in ultra-RARE Purple Metallic (PM) finish (looks like rose metallic.) Matched-color headstock with black 'Ibanez' logo. Unmodified. This color was only available in Japan in 1990. Obviously, very few were made and even fewer made it outside of Japan. One of the cleanest vintage RG550's you'll ever encounter nowadays. This is one of the original, 'Real Deal' RG550's!These late 80's and early 90's RG's are legendary. They will never be made again like this. I'll take an old school RG over any current one all day long. The original Wizard necks are to DIE FOR, as those of you who play them already know.From Ibanez's Golden Era. There are NONE of the usual neck pocket or lock-nut cracks or noticeable chipping along the edges, as is incredibly common with these guitars. Miraculous. Aside from the neckplate, all other hardware is immaculate. There are a few small imperfections here and there which I've tried to photograph (the largest one being on the back next to the trem plate as shown, but no paint is missing), but they are all so small as to be insignificant and hardly noticeable. Brand new Ernie Ball 9-42 strings.These original RG masterpieces have never been exactly duplicated and remain the pinnacle of play-ability and workmanship to this day. There's an obvious reason why the market is currently flooded with 'Reissues' of this guitar: They are NOT the same...the neck profiles are night and day apart. There's only ONE original 1-Piece WIZARD guitar neck, and they were only available on the earliest Ibanez models from the late 80's to the early 90's. (Here's what another person says about these originals.) \"There is a reason that this exact guitar can still be purchased today as a reissue, and that is because it is truly an amazing instrument. However, If you are like me there is no substitute for the original and I wouldn’t bother wasting your money on a reissued genesis. The majority of the specs are the same, however, the original wizard neck profile is considered by many as the best neck that Ibanez ever made vs the super wizard.\"Very minor fret wear, low action, straight neck, and plays and sounds like all Golden Era RG's...effortlessly and MASSIVE. Stock USA-designed V1/S1/V2 pickups (preferred by many Ibanez enthusiasts and probably the BEST pickup set to ever grace the RG550.) Built at the now-legendary Fuji-Gen factory in Japan during their Golden Era of RG's. Nothing else comes close to these very first timeless machines. Everything on these...from the top-of-the-line hardware, materials, fit, finish, workmanship and play-ability, is just astounding. I and many other Ibanez enthusiasts will tell you that you won't be satisfied with a reissue. And the chances of finding one like this are few and far between nowadays. Get one in great, unmolested condition while you still can. Comes with the trem bar and will be packed professionally to prevent damage. Don't miss this opportunity to add such a stunning piece to your collection. Check out the YouTube video 'IBANEZ GUITAR SOLO COMPETITION 2013 - Frank Steffen Mueller' and see one of these guitars in action. It's very hard (if not impossible) to achieve those same 'fluttering' effects with the newer Ibanez tremolos.Listed elsewhere so don't procrastinate. Reasonable offers will be considered. Shipping listed is to the lower 48 states only. ALL other locations will be extra. Read my feedback and bid with confidence, and thanks for taking a peek.INTERNATIONAL BUYERS WELCOME. The MAPLE fretboard on this guitar thankfully doesn't fall under the new CITES import/export regulations.", "ItemID": "132917775359", "EndTime": "2019-01-17T01:36:02.000Z", "StartTime": "2019-01-13T22:35:02.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/RARE-Vintage-1990-Ibanez-RG550-Purple-Metallic-jem-usa-V1-S1-V2-Pickups-570-770-/132917775359", "ListingType": "FixedPriceItem", "Location": "South Dartmouth, Massachusetts", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1329177753598080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTE5OFgxNjAw/z/TdgAAOSwLSZcEZpi/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/2zwAAOSwsqdcCY0N/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/ZGoAAOSwZ4RcCY1a/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/grkAAOSw~rhcC0k8/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/-j8AAOSwNYtcCY0X/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/1-gAAOSwzThcCY0g/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/EHkAAOSwKSlcCZXZ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/XKMAAOSwieFcNzew/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/WqQAAOSwip5cCY1G/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/mWsAAOSwqRlcCY1O/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/broAAOSwvfpcCY1l/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/mXMAAOSwAFFcCY19/$_57.JPG?set_id=8800005007"], "PostalCode": "02748", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "rent.a.fish", "FeedbackRatingStar": "Red", "FeedbackScore": 3126, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 895.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 895.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "o***o", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 399}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "RARE Vintage 1990 Ibanez RG550 Purple Metallic jem usa V1 S1 V2 Pickups 570 770 ", "ItemSpecifics": {"NameValueList": [{"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Brand", "Value": ["Ibanez"]}, {"Name": "Model Year", "Value": ["1990"]}, {"Name": "Model", "Value": ["RG550"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "No. of Strings", "Value": ["6 string"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Yellow"]}, {"Name": "MPN", "Value": ["RG550 PM"]}, {"Name": "Size", "Value": ["Full Size"]}]}, "HitCount": 101, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "The Original Real Deal.  Excellent Condition.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}