{"BestOfferEnabled": false, "Description": "PLEASE READ THE LISTING ENTIRELY AS THIS CONTAINS IMPORTANT INFORMATION OF THE ITEM From my personal collection and batch.Up for grabs is a very beautiful Dean Zelinsky Tagliare Z glide Custom guitar in a breathtakingblue flame top.. Very NICE LOOKING AND SOUNDING GUITAR. CONDITION: USED WITH very little wear.Guitar was completely detailed, adjusted, polished, new strings, fret done, fretboard cleaned and lightly oiled,, and it looks SUPERB!!!!!!!!!!!!!!!!!!!!!!Guitar was barely used but it has 2 dings on the back,, ( pictured on photo #11) on the photodue it is a translucent blue the reflection makes it look worst that actually is,, one ding wastouched with almost identical touch up but of course is not the same. one little bump scratch on the side that is not that noticeable. not limited to other minor normal wear and tear.Everything work, action is at 4/64, and sounds great. Guitar will ship with a brand new generic non original case. DISCLAIMER: All item for sale are meticulously inspected, tested, and documented prior to listingand also before shipping,this refer to things such condition ( dings, scratches, etc..), and to make sure everything is fully functional again before shipping, I ALSO document all the shipping process and package items right and insured. 1.-Bass is fully described and I strive to do so. I ALWAYS explain it as accurate as I possibly CAN!2.-Photos are part of the item description3.-In the event that your playing style requires you to have a new setup done to it, Not because the instrument doesn't work,or that it's defective, I sell fully operational and complete working gear and equipment. But bare in mind that sometimes it often might need some minor adjustments for your own technique,playing, touch, or in most occasions it just takes some time to adjust to the feel. PLEASE READ THE FOLLOWING: NOTE: Buyer assumes all responsibility for all the costs for the personal set up preference expenses. All the basses and guitars that I sell comes fully disclosed if a setup or any procedure was done or not. The way I do it, is in a general and universal way but ONLY for my personal likes or choices. Will It might work for a majority of players? maybe yes! but it could not work for you maybe. If you prefer that having a new setup is needed to suit your style and usability, then that cost or of any cost will be at your expense. DESCRIPTION OF THE ITEM: ITEMS varies condition wise, I fully disclose everything THE BEST I CAN please take your time to READ the listing completely and ask any question you may have prior to purchase. * I DON\"T OFFER PARTIAL REFUND OF ANY KIND AND ALL SALES ARE FINAL, PLEASE BE AWARE AND UNDERSTAND AS PER EBAY POLICY WHEN AN ITEM IS NOT AS DESCRIBED,THIS MEANS THAT THE ITEM MUST BE SUBSTANTIALLY DIFFERENT TO THE DESCRIPTION ON THE LISTING OR BROKEN. If you would like to have any specific picture of the item, I will be glad to assist you in every way. * I won't be responsible or liable for any realistic or unrealistic repair that you or any 3rd party might say needed in order to play like any other bass you have had or was used for comparison. Every instrument is different in their own ways. Nor for any upgrades could be suggested. Thanks for reading. I SHIP VIA USPS OR FEDEX AND USUALLY TAKES 3 TO 9 BUSINESS DAYS TO DELIVER, BE PATIENCE ON THE ESTIMATED TIME ALLOWING THE CARRIER DO THEIR JOB.Please keep in mind that once the package is in transit I can't track the exact locationor know anything until package arrives at the final destination, also please be awarethat certain weather conditions and unforeseen events may delay it too in which I don't have control over it. Thanks for your patience once again. NO RETURNS ACCEPTED AND ALL SALES ARE FINAL Please don't forget to check out my other items for sale, Thanks!", "ItemID": "283366417750", "EndTime": "2019-02-05T08:13:51.000Z", "StartTime": "2019-02-05T05:23:24.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Dean-Zelinsky-Tagliare-custom-Z-glide-private-label-guitar-W-Hard-shell-case-/283366417750", "ListingType": "FixedPriceItem", "Location": "Santa Ana, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2833664177508080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/-tcAAOSw0d1b-xA8/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/PvoAAOSwj4dbkyuk/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/ZrkAAOSwMzVbkyun/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/bGUAAOSwanhbkyup/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/X~kAAOSwI6xbkyut/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/788AAOSwQT5bkyuz/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Qq0AAOSwbF1bkyu2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/EQAAAOSwa9Fbkyu6/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/hUAAAOSwvN9bkyu9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/FM8AAOSwyH5bkyvh/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/t~kAAOSwtcZbkyvj/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/6F0AAOSw6zNbkyvm/$_57.JPG?set_id=8800005007"], "PostalCode": "92704", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "highendbass", "FeedbackRatingStar": "Purple", "FeedbackScore": 612, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 599.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 599.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "v***g", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 523}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Dean Zelinsky Tagliare custom Z glide private label guitar W/ Hard shell case", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Blue"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Z glide Tagliare"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["2014"]}, {"Name": "Brand", "Value": ["Dean Zelinsky"]}, {"Name": "Body Type", "Value": ["Bolt on"]}, {"Name": "Features", "Value": ["With Pickup"]}, {"Name": "Modified Item", "Value": ["No"]}]}, "HitCount": 6, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "ConditionDescription": "Guitar is in very decent condition,, guitar has minimum wear but it has 2 little ding on the backand one scratch on the side.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}