{"BestOfferEnabled": false, "Description": "Fender Squier STRAT Electric Guitar Black w/Hardcase (1128) Click Photos to Enlarge Description 16.00 Normal 0 false false false EN-US X-NONE X-NONE This auction features Fender Squier STRAT Electric Guitar Black w/Hardcase This pre-owned Fender Squier STRAT Electric Guitar has been tested and is in good condition. This Case is also in good condition. Happy Bidding!!! PLEASE NOTE: We are not experts when it comes to musical instruments. All items are sold in \"As Is\" condition with no returns or guarantees. We will answer any questions you have to the best of our ability. PLEASE NOTE: This auction includes ONLY THOSE ITEMS pictured or listed in the description. All parts, accessories, cables, etc. are only included if pictured or listed in description. If in doubt, please contact us before purchasing. Communication Please feel free to contact us with any questions or concerns you may have regarding our active or completed listings. We will do our best to provide you the information you are looking for. Employees of The Salvation Army manage this eBay account Monday through Friday, 8:00am to 4:00pm EST. During these hours we are available to to answer questions and address customer concerns. Please send all communication via the eBay messaging system. About Us The Salvation Army Adult Rehabilitation Center provides spiritual, social and emotional assistance for men who have lost the ability to cope with their problems and provide for themselves. The program is offered free of charge to participants and focuses on rehabilitating the mind, body, and spirit. The center provides for the physical necessities of the men, as well as their emotional and spiritual needs. While in the program each man participants in a variety of therapies including individual, group, family and work; all in a clean, wholesome environment. The physical and spiritual care the program participants receive, prepares them to re-enter society and return to gainful employment. Many of those who have completed the program, are reunited with their families and resume a normal life. The center is funded solely by the sale of donated goods. The items we receive are sold in our Family Stores and through our eBay selling program. Each time you make a purchase from us, either here or in one of our Family Stores, you are helping to restore broken lives. Customer service is our top priority. If you make a purchase from us and an issue arises; please give us a chance to make things right by contacting us before leaving negative feedback or opening a case. We promise to resolve problems quickly and professionally. Payment and Shipping PAYMENT TERMS: PayPal is the only method of payment we accept In the event payment has not been received 5 business days after the auction has ended, we may relist the item and open an unpaid item case We do not end auctions early for \"Buy-it-Now\" offers SHIPPING TERMS: We are happy to offer combined shipping for listings ending on the same day. Please contact us after the auctions end to make arrangements Payment must clear PayPal before an item will be shipped All items are available for local pick-up, but payment must first be cleared via PayPal Local pick-up is available 8am to 4pm Monday through Friday; please contact us to make arrangements All shipments come with delivery confirmation Items listed for \"Local Pick-up Only\" must be retrieved no later than 10 business days after payment is received, if any item is not retrieved in this time frame, the payment will be refunded and the buyer blocked from future auctions We will only ship to the address the buyer has registered with eBay Currently we do not ship internationally inkfrog terapeak", "ItemID": "312340809578", "EndTime": "2018-11-30T19:37:56.000Z", "StartTime": "2018-11-27T19:37:56.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fender-Squier-STRAT-Electric-Guitar-Black-w-Hardcase-1128-/312340809578", "ListingType": "Chinese", "Location": "Alexandria, Virginia", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/3123408095788080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFg1MjU=/z/DA0AAOSwFu1b6b-f/$_10.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTc3WDE1OTk=/z/yMQAAOSwOsFb6b46/$_10.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxMDE2/z/svAAAOSwqLRb6b-g/$_10.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFg0NTI=/z/ErEAAOSw5Ylb6b-f/$_10.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNTk0/z/h~4AAOSwaepb6b-i/$_10.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTEzMVgxNjAw/z/ndoAAOSws99b6b-i/$_10.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxMjgx/z/xMgAAOSwi3xb6b-i/$_10.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNDc0/z/TT0AAOSwa3lb6b-i/$_10.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFg1MzY=/z/dtoAAOSwI~Vb6b-h/$_10.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFg4NzM=/z/w7UAAOSwnWpb6b-i/$_10.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjI2WDE2MDA=/z/6voAAOSw36pb6b46/$_10.JPG?set_id=880000500F"], "PostalCode": "22312", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "salvation_army", "FeedbackRatingStar": "Green", "FeedbackScore": 9833, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 19, "ConvertedCurrentPrice": {"Value": 135.5, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 135.5, "CurrencyID": "USD"}, "HighBidder": {"UserID": "t***z", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 113}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Fender Squier STRAT Electric Guitar Black w/Hardcase (1128)", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Model", "Value": ["Squier STRAT"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Color", "Value": ["Black/Beige"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Size", "Value": ["Full Size"]}]}, "HitCount": 241, "PrimaryCategoryIDPath": "619:3858:33034", "Charity": {"CharityID": "105755", "CharityName": "The Salvation Army Northern Virginia ARC", "CharityNumber": 178887, "DonationPercent": 100.0, "Mission": "The Salvation Army, an international movement, is an evangelical part of the universal Christian church. Its message is based on the Bible. Its ministry is motivated by the love of God. Its mission is to preach the gospel of Jesus Christ and to meet human needs in His name without discrimination.", "LogoURL": "https://i.ebayimg.com/00/s/MTEwOFg5MjY=/z/FlEAAOSwB-1Yy6X~/$_1.JPG?set_id=8800005007", "Status": "Valid"}, "Storefront": {"StoreURL": "https://stores.ebay.com/id=1043237260", "StoreName": "SalvationArmyNOVA"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 138.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "AF", "AM", "AZ", "BD", "BT", "CN", "GE", "IN", "JP", "KZ", "KR", "KG", "MV", "MN", "NP", "PK", "LK", "TJ", "TM", "UZ", "AL", "AD", "AT", "BY", "BE", "BA", "BG", "HR", "CY", "CZ", "DK", "EE", "FI", "FR", "DE", "GI", "GR", "GG", "HU", "IS", "IE", "IT", "JE", "LV", "LI", "LT", "LU", "MK", "MT", "MD", "MC", "ME", "NL", "NO", "PL", "PT", "RO", "SM", "RS", "SK", "SI", "ES", "SJ", "SE", "CH", "UA", "GB", "VA"], "GlobalShipping": false, "ConditionDescription": "This pre-owned Fender STRAT Electric Guitar has been tested and is in good condition. The Case is also in good condition. This Guitar was donated to us and should be considered secondhand.", "QuantitySoldByPickupInStore": 0, "SKU": "PROD_NUM_448082", "NewBestOffer": false}