{"BestOfferEnabled": true, "Description": "B.C. Rich took great care in designing the Chuck Schuldiner Tribute--a Stealth guitar that can proudly represent Chuck's legacy and the indelible mark he left on the death metal genre. Chuck played several B.C. Rich guitar models throughout his short but meaningful career. The most recognized of them had to be his black single pickup, neck-through Stealth guitar. In purposeful style, Chuck laid down many creative and ferocious riffs on his B.C. Rich guitars that launched him into metal icon status. Now it's your turn to play tribute to a legend. A portion of the proceeds from the sale of this tribute guitar goes directly to the family of Chuck Schuldiner. Neck-Through Construction B.C. Rich is known as one of the pioneers in neck through construction. They use it on many of their guitars, because it provides the best possible sustain, resonance, comfort and access to higher frets. Neck-through has long been considered the premium construction method for high-end guitars. This construction starts with a long piece (or pieces) of premium North American maple. That piece runs from the tip of the headstock to the strap button on the opposite end of the guitar. This means that the headstock, fingerboard, pickups and bridge all are mounted to this single sound foundation. Sonically it is a difference you can hear. The neck-through construction also allows more of the body and neck to be cut away at the neck joint, which provides comfort no bolt-on or set-neck could offer. You will find the neck through feature on all top of the line B.C. Rich models. DiMarzio X2N The X2N is a \"take-no-prisoners, in-your-face\" humbucker. Twin, wide-bar pole pieces give the X2N a nasty, dangerous look-and rightly so. Our highest gain pickup was created to push tube amps into total overdrive. Put one in the bridge position for a powerful jolt to the voltage the amp sees from your guitar. The result is a sound that can only be described as blistering. The magnetic field of the X2N is very powerful and focused. It captures the character of whichever guitar it's in. If your guitar is warm sounding, the X2N will act like a sledgehammer. A bright-sounding guitar will go into total scream mode. And the X2N still has versatility: single-coil and series-parallel modes are particularly effective, because the X2N pickup's power gives these sounds more authority than is possible with weaker humbuckers. Recommended For: Bridge position on solid body guitars. Tech Talk: The X2N works in any situation where maximum power and overdrive is required. The dual blade polepieces create a very even, balanced sound. The X2N works best in combination with higher-output pickups. It can also combine well with the Fast Track 1, Chopper and Pro Track. The split option is very effective, because a single X2N coil has similar performance parameters to many Strat-type pickups. Beveled Top Most of B.C. Rich body styles employ a beveled edge around the shape. In many ways bevels on a top are similar to facets on a cut stone. They catch the light and reflect at different angles giving the instrument more of a three dimensional look. FEATURES Construction: neck-through Body wood: alder Top style: bevel top Tuners: Grover Mini Rotomatics Fretboard: ebony Frets: 24 jumbo Scale: 24-5/8\" Bridge: Wraparound Pickup: Dimarzio X2N Controls: 1 volume Case sold separately", "ItemID": "332949380893", "EndTime": "2018-12-20T23:00:01.000Z", "StartTime": "2018-12-13T23:00:01.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Bc-Rich-Chuck-Schuldiner-Electric-Guitar-/332949380893", "ListingType": "Chinese", "Location": "Richmond Hill, New York", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/3329493808938080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg2MDA=/z/TFAAAOSwpLdcEtn7/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDQy/z/7ocAAOSwtcRcEtoA/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5NDg=/z/L5cAAOSwcf9cEtn-/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDY=/z/U4MAAOSwHGJcEtn6/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMTE0/z/32EAAOSwe9VcEtn~/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg4MDI=/z/axAAAOSw~BRcEtn8/$_12.JPG?set_id=880000500F"], "PostalCode": "11418", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "royaqp", "FeedbackRatingStar": "None", "FeedbackScore": 4, "PositiveFeedbackPercent": 100.0}, "BidCount": 27, "ConvertedCurrentPrice": {"Value": 1100.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1100.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***r", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 439}, "ListingStatus": "Completed", "QuantitySold": 1, "ReserveMet": true, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Bc Rich Chuck Schuldiner Electric Guitar", "ItemSpecifics": {"NameValueList": [{"Name": "Body Material", "Value": ["Alder"]}, {"Name": "Brand", "Value": ["B.C. Rich"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["Korea, Republic of"]}, {"Name": "Body Color", "Value": ["Black"]}]}, "HitCount": 731, "PrimaryCategoryIDPath": "619:3858:33034", "Charity": {"CharityID": "113850", "CharityName": "2nd Chances Rescue", "CharityNumber": 2205771, "DonationPercent": 10.0, "Mission": "We rescue and rehabilitate dogs with physical, medical, or emotional issues.  We also help locate new homes if a current owner cannot continue caring for their pet.  Our goal is to educate people about spay/neuter and reducing numbers of unwanted pets born yearly.  ", "LogoURL": "https://i.ebayimg.com/00/s/NjM5WDY3MA==/z/S2EAAOSwaeJbkj6U/$_1.PNG?set_id=8800005007", "Status": "Valid"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 1125.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}