{"BestOfferEnabled": false, "Description": "All photos are of the actual item for sale. Used Item There is a crack on the treble side of the neck near the 22nd fret; also finish cracking next to neck by the body cutaways. The rest of the guitar and case look in great condition. We receive used gear on a daily basis. Some with slight cosmetic flaws, functionality issues, and sometimes it is completely broken. Our goal is to move it out of our warehouse ASAP! After the product is tested and photos are taken, it is boxed, sealed, and stored in our warehouse. We are unable to provide additional pictures. Everything we know about the condition, functionality, and included accessories is stated here. We do our best to describe everything as accurately as we can. Gibson SG High Performance 2019 Solid Electric Guitar w/ Carbon Case - Blueberry Fade Solidbody Electric Guitar with Mahogany body, Figured Maple top, Mahogany neck, Richlite fingerboard, and 2 Humbucking pickups. 7.5 lbs The Gibson SG is a rock icon. But Gibson has upped the ante with the SG High Performance 2019. This guitar's bevy of cutting-edge enhancements includes an eye-popping AA Figured Maple top, a Titanium adjustable nut and bridge saddles, rock-solid Grover tuners, and clear push-pull Top Hats. Take hold of the speedy 24-fret SlimTaper neck with its fast-access heel and silky, bound Plek'd Richlite fretboard. Feel the power generated by two split-coil BurstBucker Pro humbuckers. The SG High Performance 2019 is way more than an update of a classic solidbody electric — it's a force of nature. And get a load of the sweet carbon fiber case this comes with that weighs practically nothing! Features Classic SG style with eye-popping figured Maple top and modern appointments Comfortable, lightweight Mahogany body Fast Mahogany SlimTaper neck Bound Richlite fingerboard with Mother-Of-Pearl trapezoid inlays Plek'd fretboard for effortless playability Burstbucker Pro Rhythm, Burstbucker Pro Lead + humbuckers Dual push-pull volume controls switch pickups between single-coil and humbucking operation Internal 5-position DIP switch circuit for a multitude of tonal variations Noiseless, aviation-grade toggle switch Aluminum Nashville Tune-O-Matic Bridge and Stopbar tailpiece Titanium adjustable nut and bridge saddles Locking Grover Rotomatic tuners with Keystone buttons Tech Specs Body Type: Solidbody Body Shape: SG Left-/Right-handed: Right-handed Number of Strings: 6 Body Material: Mahogany Top Material: AA Figured Maple Body Finish: Nitrocellulose Lacquer Color: Blueberry Fade Neck Material: Mahogany Neck Shape: Slim Taper Radius: 12\" Fingerboard Material: Richlite Fingerboard Inlay: Mother-of-pearl Trapezoids Number of Frets: 24, Medium Scale Length: 24.75\" Nut Width: 1.745\" Nut Material: Titanium (adjustable) Bridge/Tailpiece: Aluminum Nashville Tune-o-matic bridge with Titanium saddles and Aluminum Stopbar Tuners: Grover Locking Rotomatics Neck Pickup: Burstbucker Pro Rhythm Humbucker Bridge Pickup: Burstbucker Pro Lead Plus Humbucker Controls: 2 x volume (push/pull coil-tap), 2 x tone (push/pull phase, coil select), 5-way DIP switch, 3-way toggle pickup switch Case Included: Hardshell Case Manufacturer Part Number: H2SGS19U8CH1 Includes* everything pictured packaged in brown box. *There could be important accessories not included. We do our best to call out the accessories that should be included that are missing, however, we don't research every item to know with certainty what should be included. Please do this research before bidding and know what you are purchasing. Everything included in the auction will be pictured in the photos above. If something is not pictured or mentioned, it is not included with the purchase. Check out my other auction listings! and be sure to add me to your favorites list. CONTACT INFORMATION You can e-mail us with any questions you may have about an item. We are very easy to reach, and we are glad to help. Just click \"Ask a question\" in the questions and answers area below. Please note that we are not in the office after 5:00PM EST on weekdays, or all day Saturdays and Sundays. Questions asked over the weekend will be answered on the following business day. SHIPPING INFORMATION Items are shipped within one business day of payment. To avoid a lost or stolen item, your package may ship \"Signature Required.\" If you have special shipping instructions or would like your item shipped UPS instead of USPS or FedEx, please contact us before you make a purchase. We collect local sales tax here in Indiana. This applies to Indiana residents who we ship to, as well as non-Indiana residents who drive here for local pickups. We also collect sales tax in other states around the country. Please check eBay's tax information on the \"Shipping and payments\" tab above to see if we are collecting tax in your area. PLEASE NOTE Shipping quotes are estimates only. We use eBay’s shipping calculator, which provides estimated shipping charges on listings where “Free Shipping” is not offered. Ebay's FedEx calculator on the item page quotes eBay's discounted FedEx shipping rates, which we honor. At checkout, however, buyers in certain areas will see the calculator attempt to charge the full retail price. FedEx's full retail price is the price you pay if you were to walk into a FedEx retail location. The difference between eBay's discounted rate and this retail price can be as much as 40%. If you estimate shipping with a zip code that is different from the zip code registered to your User ID, eBay’s shipping calculator will make the adjustment at checkout. Additionally, FedEx charges a surcharge for delivery in certain rural areas of the country that does not, for some reason, show up in eBay’s estimate calculator; but it does at checkout (we wish we could control this, but we can’t — we have contacted eBay many times about this issue). FedEx does this based on the +4 extension of your primary 5-digit zip code. For example, eBay’s shipping calculator may quote you one price based on your primary 5-digit zip, and then figure out that your requested street address at checkout places you within the rural surcharge area, changing the shipping price to an alternate amount that was originally quoted. If there is a discrepancy in your shipping cost, please send us a screen shot of the quoted price to you on our item page and we can override the eBay checkout calculation to get you the cheapest rate. RETURN INFORMATION We want you to be completely happy with your purchase. If the item you receive is not as described or has been damaged in shipping, please contact us immediately. We will make every effort to promptly resolve any problem. Your satisfaction is our top priority. We are happy to offer free shipping on some of the items we offer. Please note that if you decide to return something where free shipping was offered, our shipping costs are non-refundable.", "ItemID": "401711211069", "EndTime": "2019-02-27T02:34:18.000Z", "StartTime": "2019-02-20T02:34:18.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-SG-High-Performance-2019-Solid-Electric-Guitar-w-Carbon-Case-Blueberry-/401711211069", "ListingType": "Chinese", "Location": "Fort Wayne, Indiana", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/4017112110698080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTEyOFgxNjAw/z/l6sAAOSwHN9cbAED/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg1ODk=/z/ah0AAOSwuDFcbAEF/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/brEAAOSw5LZcbAEJ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg2Mjk=/z/kTkAAOSw8yxcbAEK/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTM5NFgxNjAw/z/GQoAAOSw5k1cbAEO/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNTc4/z/2QoAAOSwdC5cbAES/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIyOFgxNjAw/z/~scAAOSw04ZcbAEV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjkxWDE2MDA=/z/V7gAAOSwwPtcbAEA/$_57.JPG?set_id=8800005007"], "PostalCode": "46818", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jeffsmusicgear", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 14549, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 1099.95, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1099.95, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***7", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 158}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson SG High Performance 2019 Solid Electric Guitar w/ Carbon Case - Blueberry", "ItemSpecifics": {"NameValueList": [{"Name": "Product Line", "Value": ["Gibson SG"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model Year", "Value": ["2019"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Series", "Value": ["HP Series"]}, {"Name": "Body Color", "Value": ["Blueberry Fade"]}, {"Name": "Model", "Value": ["SG High Performance 2019"]}, {"Name": "MPN", "Value": ["H2SGS19U8CH1"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Body Material", "Value": ["Mahogany / Flamed Maple"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Features", "Value": ["5 position DIP switch for tonal variations", "Push-Pull volume dials for coil spit"]}]}, "HitCount": 329, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=36123540", "StoreName": "jeffsmusicgear"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 1124.95, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "TopRatedListing": true, "GlobalShipping": false, "ConditionDescription": "There is a crack on the treble side of the neck near the 22nd fret; also finish cracking next to neck by the body cutaways. The rest of the guitar and case look in great condition. Please see the photos above; they are of the actual item for sale.", "QuantitySoldByPickupInStore": 0, "SKU": "H2SGS19U8CHU1", "NewBestOffer": false}