{"BestOfferEnabled": false, "Description": "Barely played, Fender Player Series Mexican Stratocaster - Sonic Red w/ Pau Ferro Fingerboard- Beauty! Has small scratch on front included in photos. Absolutely amazing condition! The Fender Player Series Strat The Fender Stratocaster is considered by many guitarists at Sweetwater to be the classic solidbody electric guitar. Introduced in 1954, the Strat has flaunted its svelte body curves, tonal dexterity, and expressive vibrato in the capable hands of guitarists cross-genre. At once a working musician's axe and cultural icon, the Fender Player Series Stratocaster takes the grand tradition into the future with a fast-action 22-fret maple neck, vibrant vintage-inspired finishes, and three Player Series Alnico 5 Strat pickups that deliver all the legendary spank and sparkle you expect from a Strat. NOW PLAYING: Melanie Faye Demos The Player Series Stratocaster® | Fender Fender Player Series Guitars Reviewed Fender Player Series - Sweetwater First Impressions Fender's Player Series: vintage vibe, modern edge For their new Player Series guitars, Fender went back to the drawing board with updated radii for more historically accurate body shapes, new vintage-inspired finishes, and a classic logo that harkens back to the Fenders of yesteryear. But these smooth-playing instruments also look to the future with modern enhancements that include 22 fret necks, upgraded bridges for better sustain, and new Alnico 5 pickups that crank out legendary Fender tone by the boatload. The timeless classic, with Player Series upgrades Though the original Stratocaster was first introduced more than 60 years ago, it's unquestionably more popular now than ever. The Player Series Stratocaster combines the guitar's sleek, elegant lines with the perfect blend of vintage and modern features. You start with the classic comfort-contoured alder body with a gloss polyester finish, then add a 3-ply parchment pickguard and a trio of Player Series Alnico 5 Strat single-coil pickups. The Strat's original master volume plus two tone pot configuration left the bridge pickup without a tone control; but in the Player Series Strat, Tone 1 operates on both the neck and middle pickups, while Tone 2 is dedicated to the bridge pickup. The trademark Strat sound Leo Fender designed the original Stratocaster with three single-coil pickups, enabling it to produce sounds that no other guitar could — particularly once players discovered they could lodge the 3-position blade switch in those in-between positions to access polarity-reversed neck/middle and bridge/middle pickup combinations that produced what is affectionately called the Strat \"quack.\" The Fender Player Series Stratocaster comes with three sweet-sounding single-coil pickups selected by a modern, 5-position blade switch, making it easy to nail those glassy Strat sounds with a flick of the switch. Fast-playing modern C-shaped maple neck In keeping with contemporary player preferences, the Player Series Stratocaster sports a comfortable modern C shape maple neck and a 9.5\"-radius fingerboard with 22 medium-jumbo frets. The neck is finished with a smooth satin polyurethane for a sleek, fast feel. With its sleek body contours and highly playable neck, it's no wonder that the Fender Stratocaster has remained one of the most popular guitars on the planet for decades. Fender Player Series Stratocaster Solidbody Electric Guitar Features: Comfort-contoured alder body, gloss polyester finish Maple, modern C-shaped neck (satin polyurethane finish) 9.5\"-radius fingerboard with 22 medium-jumbo frets 3 Player Series Alnico 5 Strat single-coil pickups Fender 2-point \"Synchronized Tremolo\" floating vibrato bridge/tailpiece Fender standard cast/sealed tuning machines Synthetic bone nut, width: 1.650\" 25.5\" scale Body Type: Solidbody Body Shape: Stratocaster Left-/Right-handed: Right-handed Number of Strings: 6 Body Material: Alder Body Finish: Gloss Polyester Color: Sonic Red Neck Material: Maple Neck Shape: Modern C Radius: 9.5\" Fingerboard Material: Pau Ferro Fingerboard Inlay: Dots Number of Frets: 22, Medium Jumbo Scale Length: 25.5\" Nut Width: 1.650\" Nut Material: Synthetic Bone Bridge/Tailpiece: 2-piece Synchronized Tremolo with Bent Steel Saddles Tuners: Fender Standard Cast/Sealed Neck Pickup: Player Series Alnico V Strat Single-coil Middle Pickup: Player Series Alnico V Strat Single-coil Bridge Pickup: Player Series Alnico V Strat Single-coil Controls: 1 x master volume, 2 x tone (neck/middle, bridge), 5-way blade pickup switch Strings: Fender NPS, .009-.042 Manufacturer Part Number: 0144503525 Customer Reviews Rated 5/5 Based on 4 reviews Write your review Rated 5/5 Oh boy (in a Mickey voice) This guitar is my first actual fender! I was playing a squier before this for about 2 years and when the player series was first announced I fell... read more by Anthony on January 13, 2019 Rated 5/5 Great deal on a fantastic guitar I've bought several guitars from Sweetwater reviews are mixed. But this Fender player series is the best yet. What a guitar! I'm glad I went... read more by Pete Grazaino from Deleon springs fl on January 13, 2019 Music background: Guitar player since age 7 played professional till loss of left index finger. Two years to relearn and I never looked back Rated 5/5 Sweet Strat I received my Fender Player Strat about a month ago and this guitar rocks! This Fender Player has a nice warm, rich sound and has a very... read more by Izzy Talavera from Carpentersville, IL on January 10, 2019 Rated 5/5 I love this guitar I thought I\"d try the new player series stratocaster and I\"m glad I did . The guitar feels , sounds and looks fantastic . Extremely... read more by JRussell from Massachusetts on July 3, 2018 Fender Authorized Dealer It's impossible to imagine a world without Fender guitars, and if you're like many of the guitarists at Sweetwater, Fender not only made the first guitar you ever bought, they made the last one too. From being the first large-scale electric and bass makers in the '50s to pushing the boundaries of quality in the twenty-first century, it's no wonder Fender is one of the biggest names in the business. As one of the world's largest Fender dealers - with thousands of products in stock at all times - we're always getting our hands on their latest guitars, basses, and amps. We love to tell our customers all about them, so whether you're looking for your first axe or a Custom Shop creation, give your Sales Engineer a call.", "ItemID": "264213491454", "EndTime": "2019-02-28T10:17:59.000Z", "StartTime": "2019-02-25T10:17:59.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fender-Player-Series-Mexican-Stratocaster-Sonic-Red-w-Pau-Ferro-Fingerboard-/264213491454", "ListingType": "Chinese", "Location": "Irving, Texas", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2642134914548080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/-8cAAOSwnjZcQh-C/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/KFEAAOSwyeNcQh-E/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/86gAAOSw3fZcQh-F/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/Xq4AAOSwc9VcQh-H/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/L5oAAOSw8~hcQh-I/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/GpkAAOSwYwxcQh-K/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/IqAAAOSwp3dcQh-L/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/9TQAAOSw-FRcQh-N/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/iPoAAOSwQfRcQh-O/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/uIsAAOSwjMtcQh-P/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/XIsAAOSw~5dcQh-R/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/X6MAAOSwDEBcQh-T/$_12.JPG?set_id=880000500F"], "PostalCode": "75038", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "thelonestarretail", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 125, "PositiveFeedbackPercent": 85.7}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 249.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 249.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "p***s", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 313}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Fender Player Series Mexican Stratocaster - Sonic Red w/ Pau Ferro Fingerboard", "ItemSpecifics": {"NameValueList": [{"Name": "Body Material", "Value": ["Alder"]}, {"Name": "Model", "Value": ["Players Strat"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["Mexico"]}, {"Name": "Body Color", "Value": ["Red"]}, {"Name": "Features", "Value": ["Volume Knob"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Brand", "Value": ["Fender"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "MPN", "Value": ["0148100506", "148100506"]}, {"Name": "MPN", "Value": ["0148100506"]}]}, "HitCount": 146, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 251.5, "CurrencyID": "USD"}, "ProductID": {"Value": "131671797", "Type": "Reference"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}