{"BestOfferEnabled": false, "Description": "Vintage 1995 / 1996 Paul Stanley Ibanez PS10 II Iceman Guitar + Case ***As a BONUS I’m including a genuine Paul Stanley guitar pick from the Alive II Tour. (Read below for details) Description: Up for sale is an awesome high quality guitar and of course an amazing KISS collectible. As an added bonus I am including a genuine Alive II Paul Stanley guitar pick! These vintage tour picks have a value from $250 to $350. This is not just any ordinary alive II pick either, read the details below. I thought it would be perfect item to add considering it fits the era! What I like about the PS10-2 is what was going on in the background of KISS during the only 2 years it was manufactured. This guitar is in excellent all-around condition. Not only does it play perfectly but it displays beautifully. Included with the guitar is this original Ibanez case. This comes from a smoke free home, was gently played and is extremely clean. It is even cleaner now than in the pictures. I have properly cleaned it with the correct equipment making sure to prevent any scratching. If you are deciding if you want to purchase his new Ibanez or a vintage one.... here is your answer. Not only is this guitar cheaper than his current signature guitar but this one is a vintage piece of KISS history with the identical look and play. Well I do not like about his new signature line are the three or four different levels in price. It’s kind of silly to spend anything over $1000 when buying a new guitar if it’s not the top of the seriesI believe it cost a minimum of $1800. You really won’t be letdown with this one. This Ibanez has great low action, great for any level of player....whether you are a beginner or expert this guitar is a perfect fit. Turn up the amp, sounds great with a vintage analog distortion pedal... classic KISS! Out of the recent numerous Ibanez releases, this one wins all day long In my opinion when in my opinion when you’re talking about the mid range price. Unfortunately it is very hard to find the 78 guitar in good condition, most of them are beat up pretty bad. What I like about this guitar is it was used during the non-makeup era during 1995 and the reunion transition in 1996. Soon after the reunion he got a big money endorsement deal with Washburn making the PS10ii The most scarce release out there when it comes to his signature Ibanez lines. Condition: This beauty was owned by a beginner who was going to learn how to play but never really ended up getting into it. It was occasionally used but played very lightly. Besides some minor scuffs here and there from use there are no major imperfections to mention. Any of tscuffs would have to be examined under bright shining light to view. It really is in excellent condition all around and and is definitely a head turner. All the knobs and switches are in perfect working order without any problems whatsoever. I can’t find anything to complain with this one. Genuine KISS Paul Stanley Alive II Guitar Pick Details: (last 2 photos) This was purchased in a lot of a handful of picks that were obtained from a former employee of the Capitol theater in New Jersey! Believe it or not these were obtained from the recording sessions of alive 2. This was actually of change in a lot of nine guitar packs that were obtained from a former employee of the Capitol theater in New Jersey! Believe it or not these were obtained from the recording sessions of ALIVE II! Not only did they record the studio tracks in this theater but they also recorded and used a majority of the “live tracks” played inside this empty venue! I know this is something you most likely do not believe but I feel like I have to mention it! Is the honest to God truth, I’m not even adding a premium for this because I didn’t expect buyers to believe… But if you want what I would consider a museum piece of kiss history then here it is! I can guarantee you will not be let down with this beautiful signature Paul Stanley guitar. Please refer to the pictures for the exact item and it’s condition. If you want to see any additional photos send me a message and I will gladly assist you. If you have any questions feel free to contact me. Included below is a list of specifications.3 Paul Stanley Ibanez PS10 II Specifications: Model name: PS10II Years produced: 1995–1996 Sold: Worldwide Made In: Korea Finish: Black Body: Body Type: Solid body Body Material: Mahogany w/ maple top w/ binding Neck Joint: Set-in Bridge: Full Tune II fixed Hardware Color: Chrome Pickguard: Chrome Neck: Neck Type: IC Neck Material: 3-piece maple Fingerboard Material: Rosewood w/ binding Fingerboard inlays: Pearl/ abalone block Frets: 22 / jumbo Electronics: Pickup configuration: HH Bridge pickup: Ibanez AH2 (H) Neck pickup: Ibanez AH1 (H) Controls: 2 volume / 1 tone / 3-way toggle", "ItemID": "123534813183", "EndTime": "2018-12-18T05:43:30.000Z", "StartTime": "2018-12-09T06:19:05.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Vintage-Paul-Stanley-96-Ibanez-PS10-II-Guitar-Case-Iceman-KISS-Alive-II-Pick-/123534813183", "ListingType": "FixedPriceItem", "Location": "Marshfield, Massachusetts", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1235348131838080_2.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/OTYwWDQ4MA==/z/7-gAAOSws2RcDLY5/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTkwWDc1MA==/z/QH0AAOSwwfFcBF6p/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTk1WDc1MA==/z/KTMAAOSwqkRcBF6w/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzUwWDU1OA==/z/MhUAAOSwXedcBF6y/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NTUzWDc1MA==/z/iVcAAOSwE9pcBF6u/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTkyWDc1MA==/z/zWgAAOSwkHFcBF6t/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTk1WDc1MA==/z/O2MAAOSwnG1cBF6x/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAwMVg3NTA=/z/mMkAAOSwt~1cDLMn/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTkyWDc1MA==/z/l64AAOSwIUVcBF6s/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NTYwWDc1MA==/z/cVsAAOSw8VtcBF6t/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/Njk4WDc1MA==/z/KYEAAOSwWI5cDKGx/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/Njg5WDc1MA==/z/~z0AAOSw3bZcDKGz/$_12.JPG?set_id=880000500F"], "PostalCode": "02050", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "smurphytom2018", "FeedbackRatingStar": "Red", "FeedbackScore": 2619, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1375.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1375.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "1***b", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 343}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Vintage Paul Stanley 96 Ibanez PS10 II Guitar & Case Iceman + KISS Alive II Pick", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Ibanez"]}, {"Name": "Model Year", "Value": ["1996"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Model", "Value": ["PS10II"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Featured Refinements", "Value": ["Paul Stanley Memorabilia"]}, {"Name": "Bundle Description", "Value": ["Ibanez Case, KISS Paul Stanley Alive II Tour Guitar Pick"]}, {"Name": "Country/Region of Manufacture", "Value": ["Korea, Republic of"]}, {"Name": "Original/Reproduction", "Value": ["Original"]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "Body Material", "Value": ["Mahogany"]}, {"Name": "Product Line", "Value": ["Paul Stanley PS10-2 Limited Release"]}, {"Name": "Custom Bundle", "Value": ["Yes"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["PS10-2"]}, {"Name": "Size", "Value": ["1995/1996"]}]}, "HitCount": 211, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=97190180", "StoreName": "TAG Productions"}, "Country": "US", "ReturnPolicy": {"Refund": "Money back or replacement (buyer's choice)", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "TopRatedListing": true, "GlobalShipping": false, "ConditionDescription": "This beauty was owned by a beginner who was going to learn how to play but never really ended up getting into it. It was occasionally used but played very lightly. Besides some minor scuffs here and there from use there are no major imperfections to mention. Any of tscuffs would have to be examined under bright shining light to view. It really is in excellent condition all around and and is definitely a head turner.All the knobs and switches are in perfect working order without any problems whatsoever. I can’t find anything to complain with this one.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}