{"BestOfferEnabled": false, "Description": "--> Fender Classic Series '72 Telecaster Deluxe Electric Guitar (Black) Used This item is slightly used and has been thoroughly checked out by our experts to make sure it is in perfect working condition. We then re-sealed it in its original packaging with all factory included accessories. This item is guaranteed to be in \"as new\" condition and has virtually no cosmetic imperfections. This item is covered with a one year warranty from Sam Ash. Adventurous guitarists started hot-rodding their Telecasters in the late 60s and early 70s with big-sounding humbucking pickups that lent new style and swagger to rock music. The Classic Series 72 Telecaster Deluxe brings it all back as an authentic evocation of its early-70s ancestor, including dual Fender Wide Range humbucking pickups, a large pickguard, Stratocaster headstock and bridge, cool skirted amp control knobs and more. A favorite of players from 70s rock to modern U.K. alt-rock and much more. The Modern Wide Range humbucking pickups on this guitar expertly evoke the look of the famous Fender pickup design of the early 1970s, as used on original-era Telecaster Thinline, Telecaster Custom and Telecaster Deluxe models. For 1970s-era authenticity, this guitar features the large Stratocaster headstock adopted in 1965 and the bullet truss rod system introduced in 1971, when the body-end truss rod adjustment mechanism was changed to a bullet-shaped nut at the base of the headstock. This specialized 72 Telecaster model features the nicely authentic touch of sealed tuners stamped with the stylized capital F from the classic Fender script logo. Includes deluxe gig bag.Features:Maple neck with \"C\" profile, \"bullet\" truss rod, three-bolt neck plate, Micro-Tilt and \"large\" Stratocaster headstock12\"-radius maple fingerboard with 21 medium jumbo fretsDual Fender Wide Range humbucking pickupsThree-way toggle pickup switch on upper shoulderFour skirted amp control knobs (volume and tone for each pickup)Vintage-style string-through-body Stratocaster hard-tail bridgeIncludes deluxe gig bagGet your Fender Classic Series 72 Telecaster Deluxe Electric Guitar today at the guaranteed lowest price from Sam Ash Direct with our 45-day return and 60-day price protection policy. Shipping Information Your gear will ship out within 2 days of order confirmation. At this time we can not ship PO Boxes, APO and FPO locations. Industry Leading 45-Day Return Policy We stand by the products we sell, and we'll certainly stand by you as well! We truly appreciate your business, and we want you to be 100% happy with your purchase. However, we know that one of the drawbacks of internet shopping is that you can't try something before you buy it. That's where our money-back guarantee comes in. If you are not completely satisfied with an item, for any reason, you can return it within 45 days of the shipping date for a complete refund of the merchandise price.* Have a question about your order? A Sam Ash Customer Service specialist is available to help! Call 800-472-6274, Monday - Saturday, from 10:00AM - 6:00PM EST. Due to the complexity of international shipping, we are unable to accept any returns on international orders. Before making a purchase outside of the United States, please know that products sold by Sam Ash use the standard 120V/60Hz voltage standard. Sam Ash is not responsible for any damage caused by not adhering to the voltage requirements. *All returns must be within 45 days of the date the item was shipped. Please do not accept any shipment if the packaging appears damaged in any way. We strongly suggest that you check your order after receiving it to be sure that it is in proper working order. Returned items must be in resalable condition. Resalable Condition means that the product(s) is exactly in the same condition as you received it. All exchanges must be pre-paid, returned in original packing, complete with blank warranty cards, owner's manual and show no sign of wear or abuse. In the event that the product is not in the same condition as you received it you may be subject to a minimum 15% restocking fee, repair charge or disqualification. Shipping and handling charges are non-refundable. Please call our Customer Service department if you have any questions about returning an item. CDs, DVDs, video tapes, sheet music, books, strings, computer hardware/software, drum heads, harmonicas, mouthpieces, sound cards, microphones, raw speakers, studio furniture, blank CDs/Tapes or Special Orders are not covered by this return policy.", "ItemID": "192833445965", "EndTime": "2019-02-23T22:43:33.000Z", "StartTime": "2019-02-21T00:41:53.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fender-Classic-Series-72-Telecaster-Deluxe-Electric-Guitar-Black-Used-/192833445965", "ListingType": "FixedPriceItem", "Location": "Tampa, FL", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1928334459658080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTY0WDUwMA==/z/iJ4AAOSwAdhcbfPS/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MzMzWDUwMA==/z/vDYAAOSwa2tcbfPS/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MzMzWDUwMA==/z/uMcAAOSwFalcbfPT/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MzMzWDUwMA==/z/BSAAAOSwRKtcbfPT/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MzMzWDUwMA==/z/VlEAAOSwuJlcbfPT/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MzMzWDUwMA==/z/bzUAAOSwsixcbfPS/$_1.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "samashdirect", "FeedbackRatingStar": "PurpleShooting", "FeedbackScore": 59073, "PositiveFeedbackPercent": 99.3, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 675.88, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 675.88, "CurrencyID": "USD"}, "HighBidder": {"UserID": "c***n", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 706}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Fender Classic Series '72 Telecaster Deluxe Electric Guitar (Black) Used", "HitCount": 40, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1111655870", "StoreName": "Sam_Ash_Music_Direct"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "DiscountPriceInfo": {"OriginalRetailPrice": {"Value": 824.99, "CurrencyID": "USD"}, "PricingTreatment": "STP", "SoldOneBay": false, "SoldOffeBay": false}, "ExcludeShipToLocation": ["Alaska/Hawaii", "APO/FPO", "US Protectorates", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "ConditionDescription": "Like New", "QuantitySoldByPickupInStore": 0, "SKU": "F7702306X", "NewBestOffer": false}