{"BestOfferEnabled": true, "Description": "Worldwide Shipping Rare 2006 Ibanez RGT220A LTD Custom Prestige with Original J-Team Case, Super Pro Guitar Serial Number: F0615488 Made in Japan This is a one of a kind Custom Prestige RG220A, and She is set up the way you could only dream about. From the Pro Scalloped Neck to the Brass Upgraded Trem Block, the pickups are out of this world. This Ibanez was in a class all by itself then it was taken to a higher Professional level. She started out as a Stock RGT220A Ibanez Description: The RGT220A is an RG series solid body electric guitar model introduced by Ibanez in 2005. It is made in Japan by FujiGen as part of the upscale Prestige line. The RGT320F features neck-through-body construction with ash body wings. The neck is a five-piece construction of maple and wenge with a 24-fret rosewood fingerboard with small abalone dot position markers. Components include dual DiMarzio IBZ humbucking pickups, an Edge Pro tremolo bridge, a locking nut and Gotoh tuning machines. This is a one of a kind Custom Prestige RG220A, and She is set up the way you could only dream about. From the Pro Scalloped Neck to the Bass Upgraded Trem Block. Pro Scalloped Fretboard: This Guitar was taken to a Custom Luthier in Tacoma Washington and had this Scallop Job done it is perfect. The Cost was $275.00 Stainless Steel Frets were installed by “Brady Anderson” of Olympia Washington at a cost: $300.00 Brass Trem Block Upgrade and Floyde Setup: Cost $120.00 Pro Installed pickups DeMarizo LiquiFire in the Neck and a Seymore Duncan “Custom Shop Crazy 8” in the Bridge. DeMarzio Liquifire: Born out of a collaboration with Dream Theater guitarist John Petrucci, the DiMarzio LiquiFire DP227 delivers a wide range of clear and articulate tones. Designed to produce fat highs and clean lows, the DP227 is perfect for creating tight bass lines and big solos. You'll love the focused attack and custom voicing of this premium pickup. Sweetwater's guitar experts have played a lot of pickups over the years, and the DiMarzio LiquiFire is a great all-around neck pickup with a smooth voicing and enough punch to push your amp over the edge. DiMarzio LiquiFire DP227 Humbucking Electric Guitar Neck Pickup Features: Standard spacing Color: black Type: neck-position humbucker Wiring: 4-conductor Magnet: ceramic Output: 270mV DC resistance: 11.48 Kohms Tone guide: Treble - 4.5; Mid - 7.5; Bass – 6 Seymore Duncan Custom Shop Crazy 8: The Crazy 8 came out of the Seymour Duncan company’s Custom Shop back around 2007. It started as a fanboy suggestion, based on the growing popularity of Alnico 8 magnets and the affinity for the Parallel Axis design. Coming out a year before the Alternative 8, the Crazy 8 has been advertised as the first Duncan pickup with an Alnico 8 magnet. Now, the Alnico 8 had a phase of being the go-to solution for many of the tone sniffers that dive deep in to modding pickups. They cram an Alnico 8 into an existing product, generally the Duncan Custom, and make their way up to Pride Rock for all to behold. Pickup upgrade Cost: $300.00 We got this in on Trade, we completely disassembled the guitar including the Floyd Rose Trem Bridge. We reassembled it from the Body up, gave it a complete Pro Set up and this is one fantastic Guitar. Comes with the Tremolo Arm and the Ibanez case you see. CONDITION: the condtion is excellent it has been well cared for, it shows the usual digs here and there but all in all it is a Amazing Guitar. VALUE: Hard to put a value on this there has been over $900.00 in upgrades to this highly customized well playing Machine We are a Small Brick and Mortar Music Store, we take our pride in earning the respect and confidence of our customer. We specialize in safe secure worldwide shipping, thanks for thanks for looking at our items. “We always give things a final inspection and going over before shipping”. Need anything just ask Us we love to help. Please like us on “Face Book”,", "ItemID": "163435246500", "EndTime": "2018-12-19T14:36:13.000Z", "StartTime": "2018-12-16T18:29:15.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/RARE-2006-Ibanez-Prestige-RGT220A-CAH-RG20061-NAMM-LTD-Edition-J-Craft-Custom-/163435246500", "ListingType": "FixedPriceItem", "Location": "Olympia, Washington", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1634352465008080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/EscAAOSwpaVcFpje/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/mVsAAOSwhexcFpjk/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/uXEAAOSwp3dcFpjc/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/utkAAOSwx1FcFpji/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/VOcAAOSwzZNcFpjs/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/6PkAAOSwb15cFpja/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/UaAAAOSwvytcFpjq/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/ebwAAOSwIqxcFpju/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/KkIAAOSwIKNcFpjo/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/D9UAAOSwV3dcFpjx/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/K4IAAOSwJFhcFpjv/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/X5gAAOSwKV9cFpjz/$_12.JPG?set_id=880000500F"], "PostalCode": "98501", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "robertvegas", "FeedbackRatingStar": "Red", "FeedbackScore": 4096, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 999.95, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 999.95, "CurrencyID": "USD"}, "HighBidder": {"UserID": "d***d", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 495}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "RARE 2006 Ibanez Prestige RGT220A-CAH / RG20061 NAMM LTD Edition J Craft Custom", "ItemSpecifics": {"NameValueList": [{"Name": "Body Material", "Value": ["Ash Wings , Rosewood Fret board , maple/wenge neck", "Solid Wood"]}, {"Name": "Brand", "Value": ["Ibanez"]}, {"Name": "Model Year", "Value": ["2006"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["RGT220A-CAH"]}, {"Name": "Soundboard Style", "Value": ["Flat Top"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Body Type", "Value": ["Neck Through"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Color", "Value": ["Natural"]}, {"Name": "Dexterity", "Value": ["Right Hand"]}, {"Name": "Size", "Value": ["Full Size"]}]}, "HitCount": 188, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}