{"BestOfferEnabled": false, "Description": "Our eBay Store About Us Gretsch G2420 Streamliner Hollow Body Electric Guitar with Chromatic II Tailpiece (Aged Brooklyn Burst) Big, bold and righteous, the G2420 Streamliner Single Cutaway Hollow Body is designed for the modern guitarist who yearns for something beyond the norm. A commanding guitar for powerful players, the G2420s modern sonics, updated electronics and authentically elegant style create the latest iteration of That Great Gretsch Sound!The secret to the Streamliners sound are the BroadTron humbucking pickup. Specifically designed by the expert engineers at Gretsch for the Streamliner, this high-output pickup spawns robust lows, pristine highs and a throaty midrange for a unique tone that blends well with other instruments in a band context. This sonic power is harnessed and shaped by the traditional control layout—neck and bridge pickup volume controls, a master tone control, master volume control and three-way pickup switching. A fast-playing 12\"-radius rosewood fingerboard with elegant pearloid block inlays and 22 medium jumbo frets sits atop the white-bound nato neck with a thin \"U\"-shaped profile—ideal for chord work or firing off speedy riffs. Enjoy rock-solid tuning stability courtesy of the stylish Gretsch Chromatic II tailpiece, Adjusto-matic bridge with secured rosewood base and synthetic bone nut.All the classic eye-catching style youve come to expect from Gretsch is here—vintage-style gold control knobs, F Holes, elegant two-ply white and black body binding, slick-looking nickel hardware, arched laminated maple construction and single-ply black pickguard with Gretsch logo. Nearly impossible to put down once you pick it up and start playing, the G2420 Streamliner Single Cutaway Hollow Body is an astounding take on the authentic sound and classic style youve come to expect from Gretsch. Case not included.Get your Gretsch G2420 Streamliner Hollow Body Electric Guitar with Chromatic II Tailpiece today at the guaranteed lowest price from Sam Ash Direct with our 45-day return and 60-day price protection policy. Product Details - Fully Hollow Laminated Maple Body w/Parallel Tone Bars - Thin \"U\" Nato Neck w/12\"-Radius Rosewood Fingerboard w/22 Med-Jumbo Frets - Specially-Designed High-Output Broad'Tron Humbucking Pickups - Nickel Hardware Includes Die-Cast Tuners, a Rosewood-Based Adjusto-Matic Bridge, and a Gretsch Chromatic Tailpiece Shipping Information Your gear will ship out within 2 days of order confirmation. At this time we can not ship PO Boxes, APO and FPO locations. Industry Leading 45-Day Return Policy We stand by the products we sell, and we'll certainly stand by you as well! We truly appreciate your business, and we want you to be 100% happy with your purchase. However, we know that one of the drawbacks of internet shopping is that you can't try something before you buy it. That's where our money-back guarantee comes in. If you are not completely satisfied with an item, for any reason, you can return it within 45 days of the shipping date for a complete refund of the merchandise price.* Due to the complexity of international shipping, we are unable to accept any returns on international orders. Before making a purchase outside of the United States, please know that products sold by Sam Ash use the standard 120V/60Hz voltage standard. Sam Ash is not responsible for any damage caused by not adhering to the voltage requirements. *All returns must be within 45 days of the date the item was shipped. Please do not accept any shipment if the packaging appears damaged in any way. We strongly suggest that you check your order after receiving it to be sure that it is in proper working order. Returned items must be in resalable condition. Resalable Condition means that the product(s) is exactly in the same condition as you received it. All exchanges must be pre-paid, returned in original packing, complete with blank warranty cards, owner's manual and show no sign of wear or abuse. In the event that the product is not in the same condition as you received it you may be subject to a minimum 15% restocking fee, repair charge or disqualification. Shipping and handling charges are non-refundable. Please call our Customer Service department if you have any questions about returning an item. CDs, DVDs, video tapes, sheet music, books, strings, computer hardware/software, drum heads, harmonicas, mouthpieces, sound cards, microphones, raw speakers, studio furniture, blank CDs/Tapes or Special Orders are not covered by this return policy.", "ItemID": "173705082427", "EndTime": "2018-12-24T16:50:33.000Z", "StartTime": "2018-12-23T16:39:28.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gretsch-G2420-Streamliner-Electric-Guitar-Chromatic-II-Tailpiece-Used-/173705082427", "ListingType": "FixedPriceItem", "Location": "Tampa, FL", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1737050824278080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTg4WDUwMA==/z/NyIAAOSwQ9lcH7qr/$_1.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "samashdirect", "FeedbackRatingStar": "PurpleShooting", "FeedbackScore": 58755, "PositiveFeedbackPercent": 99.2, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 337.46, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 337.46, "CurrencyID": "USD"}, "HighBidder": {"UserID": "d***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 2732}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gretsch G2420 Streamliner Electric Guitar with Chromatic II Tailpiece (Used)", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gretsch"]}, {"Name": "MPN", "Value": ["2800700537"]}]}, "HitCount": 23, "Subtitle": "Sam Ash - Serving Musicians Since 1924.", "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1111655870", "StoreName": "Sam_Ash_Music_Direct"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalRefund": "MoneyBack", "InternationalReturnsWithin": "30 Days", "InternationalReturnsAccepted": "ReturnsAccepted", "InternationalShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "DiscountPriceInfo": {"OriginalRetailPrice": {"Value": 619.0, "CurrencyID": "USD"}, "PricingTreatment": "STP", "SoldOneBay": false, "SoldOffeBay": false}, "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Central America and Caribbean", "South America", "AS", "CK", "FJ", "PF", "GU", "KI", "MH", "FM", "NR", "NC", "NU", "PW", "PG", "SB", "TO", "TV", "VU", "WF", "WS", "AL", "AD", "AT", "BY", "BE", "BA", "BG", "HR", "CY", "CZ", "DK", "EE", "FI", "FR", "DE", "GI", "GR", "GG", "HU", "IS", "IE", "IT", "JE", "LV", "LI", "LT", "LU", "MK", "MT", "MD", "MC", "ME", "NL", "NO", "PL", "PT", "RO", "SM", "RS", "SI", "ES", "SJ", "SE", "CH", "UA", "VA", "BN", "KH", "HK", "LA", "MO", "MY", "PH", "SG", "TW", "VN", "BM", "GL", "PM", "DZ", "AO", "BJ", "BW", "BF", "BI", "CM", "CV", "CF", "TD", "KM", "CD", "CG", "CI", "DJ", "EG", "GQ", "ER", "ET", "GA", "GM", "GH", "GN", "GW", "KE", "LS", "LR", "LY", "MG", "MW", "ML", "MR", "MU", "YT", "MA", "MZ", "NA", "NE", "NG", "RE", "RW", "SH", "SN", "SC", "SL", "SO", "SZ", "TZ", "TG", "TN", "UG", "EH", "ZM", "ZW", "BH", "IQ", "JO", "KW", "LB", "OM", "QA", "SA", "TR", "AE", "YE", "AF", "AM", "AZ", "BD", "BT", "CN", "GE", "IN", "JP", "KZ", "KG", "MV", "MN", "NP", "PK", "LK", "TJ", "TM", "UZ", "PO Box"], "GlobalShipping": false, "ConditionDescription": "Like New", "QuantitySoldByPickupInStore": 0, "SKU": "G0700537X", "NewBestOffer": false}