{"BestOfferEnabled": true, "Description": "If you are looking at this post, you already know what it is. It is the heavier, non chambered, VERY rare and most highly regarded 1995 Gibson Les Paul Standard in wine red FLAME TOP. I say very rare because if you do your research you will see that there were barely any early to mid 1990’s standards that came with a flame top, but I am sure you are aware of that. It comes with the Gibson case that is very clean as well. The guitar wasn’t really soloed on or played much at all and the original frets have all the life left. Everyone knows that the 90’s were maybe the best years for Gibsons period, and that they don’t make them like this any more. This particular example is excellent condition for a 24-year-old guitar, but I’ll let the pictures do the talking. Other than one minuscule blemish on the back (refer to the pictures) the guitar is in amazing condition, and not just for a 24-year-old guitar, but for a guitar of any age. I must note that the the top is in really nice condition with no chips, or dents at all and is overall very clean just like the headstock front and back and the neck in general. There is no buckle rash at all, just some light swirling that is normal for a dark finish that can easily be buffed out to make look like a mirror again. It has the 60’s slim neck that is also rare. It is not as slim as these newer slim taper necks, but it is definitely thinner than 50’s necks. Again, as mentioned before, this guitar was not played much, which is why it’s in such great condition. It is NON CHAMBERED weighing in at about 9lbs. The pickups are the uncovered Seymour Duncan Slash Alnico, that are a huge upgrade to the original ones and cost $249 alone. Original pickups are not included. The tone and sustain is simply ridiculous, and based on playability and tone alone, it is very hard for me to let go of this one, but I’ll let you be the judge. Unplugged, the strings ring out loudly and endlessly and is well above average and this is the way I determine the quality of my Gibsons. If it sound good unplugged, it’s a keeper, and this one goes beyond that. Plugged in to my Marshall SL5 it is a match made in heaven and being a non chambered model, the tone and sustain is second to none. It has been professionally set up, the frets are smooth and it is ready to rock. Honestly, as stated before, here is that rare opportunity to purchase a very, very rare 24-year-old, beautiful condition Gibson Les Paul Standard flame top from a great year at a really, really good price compared to what other people are selling these for when they do appear and in much, much worse condition. Don’t let this one slip away as I know it will not last and I speak from experience. Due to the very attractive price, I know that I will be contacted a lot and with that said, I won’t be able to hold the guitar for anyone; it’ll be first come first serve. Furthermore, I reserve the right to end this sale at any time should my guitar sell locally or on other websites listed. I’ve described this guitar to the best of my ability. Please ask any questions you may have and I’ll try to answer in a timely manner. Flat rate shipping of $85 anywhere in the CONUS.", "ItemID": "273611220961", "EndTime": "2018-12-18T23:02:17.000Z", "StartTime": "2018-12-15T00:09:45.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1995-Gibson-Les-Paul-Standard-RARE-FLAME-TOP-60-s-Slim-neck-Excellent-Condition-/273611220961", "ListingType": "FixedPriceItem", "Location": "San Diego, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/2736112209618080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/QvUAAOSwjrFcFEXN/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/unMAAOSwEHhcFEW7/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/xCIAAOSwHhFcFEXj/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/~rcAAOSwi1lcFEXJ/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/hccAAOSwhzhcFEXS/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/ln4AAOSwdwVcFEXP/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/Eq4AAOSw5YlcFEXg/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/pw4AAOSwBkBcFEXO/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/eAcAAOSwAzxcFEXh/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/xuQAAOSwLuBcFEXn/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/ex8AAOSwMjpcFEXI/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/-rsAAOSw8VtcFEXl/$_12.JPG?set_id=880000500F"], "PostalCode": "92122", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "us.vejzo", "FeedbackRatingStar": "Blue", "FeedbackScore": 65, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1990.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1990.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "l***9", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 511}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "1995 Gibson Les Paul Standard RARE FLAME TOP! 60’s Slim neck Excellent Condition", "ItemSpecifics": {"NameValueList": [{"Name": "Product Line", "Value": ["Gibson Les Paul"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model Year", "Value": ["1995"]}, {"Name": "Model", "Value": ["Les Paul Standard"]}]}, "HitCount": 124, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}