{"BestOfferEnabled": true, "Description": "1956 GIBSON LES PAUL SPECIAL TV YELLOW GUITAR THE REAL McCOY!! NOT A REISSUE!! See this very guitar played on youtube at:https://www.youtube.com/watch?v=NhRBeOnRSLs I’ve always been mystified by the whole “Reissue” phenomenon, particularly those guitars that have been “Distressed”. Distressed guitars are new guitars that have been cosmetically marred—on purpose!-- in an attempt to mimic the age and play wear—the mojo we see in actual old guitars. People pay thousands of dollars for Reissue and Distressed guitars. For example, I was reading about the Gibson Reissue of the 1956 Les Paul Goldtop, suggested retail of $5645. If you wanted the Distressed look you should “Add 25% for aged finish by Tom Murphy”, which adds $1411, bringing you to $6,876. That’s a LOT of money for a new guitar that’s PRETENDING to be from 1956. And let’s face it, you’re not going to fool anybody. Even if you back up over the damn thing in your pickup, everybody still knows it’s not old. Why wouldn’t you, instead, just spend your hard-earned bucks on an ACTUAL OLD GUITAR?? Genuinely old guitars are valuable for the same reason that land is said to be valuable—as the old saw goes, “People aren’t making any more of it”. There are 3 things I want to say here on the subject of “Reissue” and “Distressed” guitars: 1) Gibson (or anybody) can’t make a 1956 guitar. The statute of limitations on that expired 63 years ago.2) I guess we should all be glad that Gibson is keeping Tom Murphy busy ruining brand-new guitars, so we don’t need to worry about him spending his time pulling the wings off flies or twirling cats around by their tails.3) I can’t remember the third thing This guitar I'm selling is an amazing sounding original 1956 Gibson TV Yellow Les Paul Special. She’s been played and played until nearly all the finish has been worn off the body edges and back of the neck, making it SOOOO smooth to play! Buckle rash on the back, right through the crazed TV Yellow finish. No breaks or repairs, 100% original finish, tuners, pickguard, pickups, knobs, and electronics (caps and pots and wiring, unbroken solder joints all the way). The jack plate has been replaced long ago (see the pics). It’s possible that the stopbar tailpiece is not original, but I haven’t been able to verify this, and it looks like the ones I’m seeing in all the books. The frets have also been replaced some years ago, because the old ones were worn out to the bone! You can see on the pickguard the wear spot from someone’s fingernail, indicating that one player rocked on it for hundreds of hours. The neck is straight and plays like butter. She sounds amazing, like you’d expect from old wood and vintage P-90’s. Comes with a non-original hard case, blue velvet lined, might be a 70’s Les Paul case. That’s all there is. Just a killer, honest-to-God legendary 1956 Gibson Les Paul Special with all the real mojo you’ll only get from thousands of hours of playing. No further disrespect to the reissues intended, but this smokes all those VOS guitars and Custom Shop Repros. So break out that cash you’ve been stuffing under the mattress and buy something precious that you’ll be proud to give to one of the grandkids someday. This one is priced to sell, thanks for looking and please check out our other old guitars on eBay!", "ItemID": "283348272133", "EndTime": "2019-02-18T21:36:41.000Z", "StartTime": "2019-01-22T01:22:30.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1956-GIBSON-LES-PAUL-SPECIAL-TV-YELLOW-GUITAR-REAL-McCOY-NOT-REISSUE-/283348272133", "ListingType": "FixedPriceItem", "Location": "Montpelier, Vermont", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/2833482721338080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/-dwAAOSwYX9cRmp2/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/SzkAAOSwVAtcRmqG/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/eeQAAOSwqLlcRmqX/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/0LUAAOSwolpcRmql/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/OMoAAOSwvGZcRmqy/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/1ccAAOSworNcRmq~/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/-i4AAOSwYX9cRmrJ/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/L6UAAOSwisxcRmrQ/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/oY4AAOSw2~NcRmrc/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/i0EAAOSw6KxcRmrq/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/jG8AAOSwfBlcRmr0/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/iqAAAOSwuZVcRmsC/$_32.JPG?set_id=880000500F"], "PostalCode": "05602", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "rawburl", "FeedbackRatingStar": "Purple", "FeedbackScore": 613, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 7879.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 7879.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "l***c", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 360}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "1956 GIBSON LES PAUL SPECIAL TV YELLOW GUITAR THE REAL McCOY!! NOT A REISSUE!!", "ItemSpecifics": {"NameValueList": [{"Name": "Body Material", "Value": ["Mahogany"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Product Line", "Value": ["Gibson Les Paul"]}, {"Name": "Model", "Value": ["Les Paul Special"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Type", "Value": ["Solidbody Single Cutaway"]}, {"Name": "Body Color", "Value": ["TV Yellow"]}]}, "HitCount": 428, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}