{"BestOfferEnabled": true, "Description": "Fretlight FG-621 Wireless Electric Guitar Black From Owner: Excellent shape, barely used. Had only about 6 months, just never really used it. It is in really great shape, lights work fine. The pick guard still has the protective plastic on it! Will threw in an older gig bag for free. The first couple of pictures are stock photos, the pics with the tan background are of the actual guitar for sale. No returns, but this is the lowest price Fretlight Wireless electric guitar on Ebay in this condition, feel free to check for yourself. Save yourself a bundle vs. other sellers or buying a new one for around $400. Grab it before someone else does! Please be aware, as with any used guitar that is shipped any distance, you may need to have it adjusted (perhaps at a guitar shop, usually around $50 for this) after shipping to you so it plays clean and buzz-free. Many sellers don't mention this, but its good to be very aware of this for any guitar you may purchase so you're not surprised. Please Note: Paypal payment only, No Returns accepted. Does not come in original packaging, does some with USB cord for charging. Ships only to continental US - USPS or UPS ground 5-7 days. Details: The FG-621 has a strat-style body, H-S-S pickup configuration, one volume & two tone controls, 5-way selector switch, fixed bridge, chrome hardware, Stratabond wood neck, advanced polymer fretboard and high bright LED's. Connect to your smartphone or tablet and learn guitar anytime, anyplace! Extra bright LED's, over 100 hours of battery life and a Bluetooth range of nearly 50 feet give you the freedom to learn and play on the go - at the beach, on the road or in the comfort of your home studio. Using your smartphone or tablet makes learning fast, easy and fun. Plenty of Apps to Play Tabs, See Chords, Scales and Interactive Videos At the touch of a button on your mobile device you have a world of learning at hand. Play your favorite tabs, lights up chords and scales in different positions, create playlists for automatic step through and check out the vast library of interactive videos from lessons to artist videos to style videos. Convenience Fretlight Wireless makes it easier than ever to pick up your guitar and play - whenever, wherever. Pairing to your smartphone or tablet is a snap with Bluetooth BLE. Download and launch an app and your learning and playing in seconds. It's that fast. A New Approach to Learning Guitar Traditional learning forces you to look back-and-forth between a book and your guitar. Connect Fretlight wireless technology with your mobile device and watch fingering positions light up right on the neck! The Fretlight method saves you hours of memorizing. You'll be playing songs, riffs, chords and scales that, until now, have been out of reach. Learn and Play Anywhere The Fretlight Wireless Guitar makes it easy to use with your mobile device anywhere - anytime! With over 100 hours of battery life you can fire up your Fretlight on the go for instant learning and playing.", "ItemID": "254050668842", "EndTime": "2019-01-03T05:46:42.000Z", "StartTime": "2019-01-02T22:27:08.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fretlight-FG-621-Wireless-Electric-Guitar-Black-Excellent-Shape-/254050668842", "ListingType": "FixedPriceItem", "Location": "Mooresville, North Carolina", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2540506688428080_2.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTAwMFgxMDAw/z/yXIAAOSwJ~xcLTu1/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAwMFgxMDAw/z/NuoAAOSw5wNcLTuz/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAwMFgxMDAw/z/PMcAAOSwiwZcLTu0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/~PQAAOSwC45cLTiz/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/YqQAAOSw2hxcLThm/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/ihcAAOSwZwdcLTin/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/DhAAAOSwdxVcLThq/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/1mMAAOSwgnJcLTi6/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/gpQAAOSwzEVcLTjA/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Mq0AAOSw55FcLTii/$_57.JPG?set_id=8800005007"], "PostalCode": "28117", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "apex_unlimited", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 162, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 189.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 189.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "f***f", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 211}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Fretlight FG-621 Wireless Electric Guitar Black Excellent Shape!", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fretlight"]}, {"Name": "MPN", "Value": ["USED004000 FG-621BK"]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}]}, "HitCount": 5, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "ConditionDescription": "Excellent shape, barely used.  Had only about 6 months, just never really used it.  It is in really great shape, lights work fine.  The pick guard still has the protective plastic on it!", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}