{"BestOfferEnabled": true, "Description": "LINCOLN PAWN SHOP Kramer Pacer USA Made Electric Guitar Custom I Description: ELECTRIC GUITAR: KRAMER MODEL CUSTOM 1, 6 STRING, RIGHT HANDED Details Additional Details for eCommerceGUITAR IS IN GOOD WORKING CONDITION, PLEASE SEE PHOTOS. Musical Instrument Condition Rating85% - Good - Item in Good Working Order, but Has Some Visual Imperfections Instrument Appearance80% - Noticeable cosmetic scuffs, scratches, nicks that may reduce the items value. May have identifiable markings. Knobs - Tuners - Electronics - Input Jack85% - Guitar shows wear - All original - Scratches and chips maybe present - Controls show normal use and are in working condition - Discoloration maybe present. Musical Instrument CaseOriginal Manufacture Hard Case Included Number of Strings6 STRING Country of ManufactureMade in United States Body StyleSOLID DexterityRight Handed Notes: Guitar is in good working condition. The body has been painted over to be a very dark green tone (original color can be seen on head). Back has some scratches here and there, as well as a couple chips to the edges. Please see photos. Guitar comes in hard case shown. Please feel free to email me with any questions you may have before purchasing. And please take a look at my other web items! We ship all items through USPS & FedEx. All of our items will be shipped no later than the next business day after your payment is received. We do not offer international shipping. If you need any special shipping arrangements please feel free to contact us prior to purchasing the item. If you are satisfied with your transaction we would appreciate your positive feedback once you have received your item. In the unlikely event you have a problem please contact us prior to leaving bad feedback so that we can try to resolve the issue with you. We are very good about leaving feedback for our customers in a timely manner. Payment PayPal is the ONLY online payment method we accept at this time. Your PayPal account must be a Verified U.S. PayPal Account. We also recommend that you use a Confirmed Ship To Address. Shipping Your item will be shipped within 1 business day(s). After shipping your items will be delivered within 1-10 business days. Terms of Sale Tax applies in: CA About Us We have been open since July of 2013! We specialize in gold, electronics, musical instruments, tools and much more! We have an amazing knowledgeable staff who can assist you with any of you pawn / buy needs! Come into our clean and safe store! We do loans and buys for all Gold, Platinum, and all other rare merchandise. We have the combined knowledge of over 20 years of pawn experience! Things I Buy: gold, silver, platinum, diamonds, musical instruments, tools, electronics, and more Bravo Store Systems Point-of-Sale Operating System Bravo Omni-Commerce solutions offers Brick & Mortar stores the only fully integrated eBay API that seamlessly & effortlessly combines the in-store Point-of-Sale to all eBay commerce selling activities. Click here & find out why eBay stated \"Bravo has best solved Brick & Mortars can sell on eBay\"", "ItemID": "264126773722", "EndTime": "2019-01-10T05:22:34.000Z", "StartTime": "2019-01-09T18:44:56.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Kramer-Pacer-USA-Made-Electric-Guitar-Custom-LIN015207-/264126773722", "ListingType": "FixedPriceItem", "Location": "Anaheim, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2641267737228080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NjAwWDgwMA==/z/oT0AAOSwBMpcNkEg/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/zP4AAOSw8kRcNkEh/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/gKwAAOSwr~JcNkEh/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/BeoAAOSwLNxcNkEh/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/uxMAAOSwsGpcNkEi/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/20wAAOSw55FcNkEi/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/O~QAAOSwF0NcNkEi/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/L1UAAOSwrfRcNkEj/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/fNUAAOSwYPNcNkEj/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/5vsAAOSwZNtcNkEj/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/zEAAAOSwdxVcNkEm/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/NjAwWDgwMA==/z/26gAAOSw5cZcNkEm/$_1.JPG?set_id=2"], "PostalCode": "92801", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "lincolnpawn", "FeedbackRatingStar": "Red", "FeedbackScore": 1759, "PositiveFeedbackPercent": 99.1, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 449.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 449.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "b***z", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 841}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Kramer Pacer USA Made Electric Guitar Custom I (LIN015207)", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["kramer"]}, {"Name": "MPN", "Value": ["CUSTOM 1"]}, {"Name": "Model", "Value": ["CUSTOM 1"]}]}, "HitCount": 184, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1166908600", "StoreName": "lincolnpawn"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}