{"BestOfferEnabled": true, "Description": "'85 Ibanez Roadstar II RS140 Presented is an '85 Ibanez Roadstar II RS140! This guitar has a cherry red body and headstock, \"flamey\" maple neck, and is in near mint condition, rare for a used model of over 30 years! This stock guitar includes a generic hard case and the original tremolo arm (whammy bar).Please do not hesitate to contact us with any questions you may have prior to any bid, offer, or purchase! Why MIJ and MIK Guitars? If you are gratified by finding cool, uncommon things that are no longer made, this is for you. Discriminating guitar players began seeking out vintage Made in Japan (“MIJ”)and Made in Korea (“MIK”) solid body guitars after discovering the tremendous value and quality of these instruments. Many of these gems rival their much more expensive American-made counterparts, and are certainly better than comparable price-point instruments available at retail today. Sometimes it is the difference between buying a computer-controlled, machine made guitars that are all exactly alike versus a hand- made instrument or one created in small lots. Also,with diminishing supplies of over-harvested, high-quality tone woods,vintage MIJ and MIK guitars present the opportunity to buy guitars made from woods generally only available now in custom shop or high-end instruments. Two areas in which MIJ and MIK guitars might fall short of the mark,though, are tuning machines and electronics. Although they do not affect the basic function and playability of the instrument,those areas appear to be the components where cost-cutting took place. However, with an abundance of excellent and affordable after-market parts, it is easy to change out these components,usually as a DIY project. Although “upgrading” is purely optional, it presents an opportunity to select components that might better suit your needs or to put your unique spin on the guitar. Another cool aspect of vintage MIJ and MIK solid bodies is that they are often “closet classic” instruments that have been safely stored under a bed or in a closet for decades. They can be time capsules,often with the original strings intact. On the other end of the spectrum are the “pre-distressed” MIJ and MIK guitars that have collected the bumps, bruises, and finish wear that only a genuinely well-played or well-travelled guitar can accumulate over the course of years. Why pay for a new guitar with phony “distressing” when you can buy the genuine article, often for much less.Simply stated, MIJ an MIK guitars rock. Enjoy! DisclaimerPLEASE NOTE: These terms apply to this purchase-sales transaction. This is an auction for a used vintage instrument. I have done my best to describe the item accurately, and to take pictures showing any significant dings, scratches, or other issues. Please ask questions BEFORE you bid. You should assume that the guitar will need new strings and a professional setup to play its best. Shipping costs include the labor and materials needed to properly package the instrument for safe shipping. Ownership of the guitar takes place once the buyer pays in full and the seller relinquishes the packaged instrument to the UPS. This is an as-is where-is auction, with no express or implied warranties of any kind. ALL SALES ARE FINAL.", "ItemID": "183679640155", "EndTime": "2019-02-28T06:34:22.000Z", "StartTime": "2019-02-10T21:25:13.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/NEAR-MINT-VINTAGE-85-IBANEZ-ROADSTAR-II-RS140-w-Tremolo-Bar-Hard-Case-MIJ-/183679640155", "ListingType": "FixedPriceItem", "Location": "Nipomo, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1836796401558080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/hWIAAOSwAn9cYJMn/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/YwUAAOSweedcYJW1/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/pJ8AAOSwea5cYJMn/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/wscAAOSwJVBcYJMn/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/VmsAAOSw5E1cYJMq/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/RQ4AAOSwPF9cYJMn/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/11wAAOSwohVcYJMp/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/c5MAAOSw02FcYJMn/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/zKEAAOSwIVVcYJMl/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/RJ8AAOSwqiRcYJMn/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/0uMAAOSw2RJcYJMp/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/HOgAAOSw2QxcYJMp/$_32.JPG?set_id=880000500F"], "PostalCode": "93444", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "marfeek", "FeedbackRatingStar": "Red", "FeedbackScore": 1116, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 349.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 349.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "e***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 578}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "NEAR MINT VINTAGE '85 IBANEZ ROADSTAR II RS140 w/ Tremolo Bar & Hard Case (MIJ)", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Ibanez"]}, {"Name": "Model", "Value": ["Vintage"]}]}, "HitCount": 470, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}