{"BestOfferEnabled": true, "Description": "Powered by Frooition Pro Shop Search Gretsch Guitars G6122-1962 Chet Atkins Country Gentleman Guitar w/OHSC Click here to view full size. Full Size ImageClick to close full size. Item Description 2013 Gretsch Guitars G6122-1962 Chet Atkins Country Gentleman Electric Guitar in excellent condition. Beautiful gloss Walnut stain finish on the body with faux \"f\" holes, gold pickguard and hardware. The guitar has a nice action and the maple neck with a bound ebony fretboard has a great feel. The frets are in excellent condition.The 2 High Sensitive Filter'tron™ pickups have that great distinct tone with good output. The guitar is equipped with a rocking bar bridge, Bigsby tailpiece, dual dampeners, Grover Imperial tuners and snap on protective pad on the back. Looks, plays and sounds great.Includes original hard shell case. Made in Japan. Serial Number: JT07124674 Weight: 8 lbs. 0 oz. The big, ringing sound of Beatlemania. From driving rhythm to ripping leads, the classic double-cutaway G6122-1962 Country Gentleman Classic has it all! Guitar features include dual High Sensitive Filter'Tron™ pickups, tone switch circuitry, action-flow neck, double mutes, back pad and Bigsby® B6G vibrato tailpiece. Key Features Body Style: Double Cutaway Scale Length: 24.6\" (625mm) Top: Arched Laminated Maple Back And Sides: Laminated Maple Body, 17\" Wide, 2\" Deep Neck: 3-Piece Maple Pickups: 2 High Sensitive Filter'tron™ Pickups Pickup Switching: 3-Position Toggle: Position 1. Bridge Pickup Position 2. Bridge And Neck Pickups Position 3. Neck Pickup Controls: Volume 1. (Neck Pickup), Volume 2. (Bridge Pickup), Master Volume, 3-Position Toggle Master Tone Switch, Standby Switch Width At Nut: 1-11/16\" (43mm) Fretboard: Ebony, 12\" Radius (305mm) Bridge: Ebony-Based Gold Rocking Bar Bridge Tailpiece: Gretsch Bigsby B6G Vibrato Tailpiece Hardware: Gold-Plated Finish: Gloss Urethane No. Of Frets: 22 (Plus Zero Fret) Machine Heads: Grover Imperial™ Gold-Plated Die-Cast Tuners Unique Features: Neo Classic Thumbnail Inlay Position Markers, Zero Fret, Simulated F-Holes, Double Muffler System, Bound Fingerboard and Headstock, Multiple Body Bindings, Gold-Plated Name Plate on Headstock, Gold Plexi Pickguard, Knurled Strap Retainer Knobs, Adjustable Truss Rod About Us Payment Shipping Terms Returns About UsWe offer a large selection of quality pre-owned musical instruments and equipment from the industries finest manufactures including Akai, Ampeg, Boss, Denon, Digidesign, DigiTech, Epiphone, Fender, Gibson, Gretsch, Guild, Ibanez, Korg, Lexicon, Line 6, Mackie, Mesa Boogie, Marshall, Martin, MusicMan, MXR, Neumann, Peavey, Pioneer, PRS, Roland, Shure, Tascam, Taylor, TC Electronic and Yamaha. New gear arrives daily so check our store often. Lighthouse Sound, Inc. is proud to be an authorized dealer of the following brands of guitar effects pedals, pedal boards, amplifiers and accessories: Bearfoot FX, Bigsby, Cooper Stands, Dunlop, Earthquaker Devices, Ernie Ball, EVH, Fender Accessories, Keeley Electronics, Gretsch Accessories, Ken Smith Strings, Lava Cable, Martin Accessories, Mojo Hand FX, RotoSound, SnaKe Oil Strings, Snark Tuners, Suhr Guitars, Amps, Pedals and Pickups, Voodoo Lab and Wampler Pedals About Us Payment Shipping Terms Returns PaymentWe accept PayPal payments. All major Credit Cards are accepted through PayPal including Master Card, Visa, American Express and Discover. About Us Payment Shipping Terms Returns ShippingLighthouse Sound specializes in prompt, safe shipping. We take great care packaging every item to ensure safe shipment to you. We get your gear to you fast, most orders ship within 1 business day of payment clearance. Tracking information is uploaded to eBay and can be viewed from your eBay account. International customers are responsible for any duties, taxes, brokerage or other fees. Please check with your country's customs office to determine what these additional costs will be. These fees vary from country to country and we have no way to calculate them. About Us Payment Shipping Terms Returns TermsSales Tax - 7 % Ohio Sales Tax will be added to the total amount for all purchases delivered to Ohio. We take pride in our customer service and your satisfaction is very important to us. In the rare event that you have a problem with your item please contact us and we'll be happy to help. While all care is taken, any errors, omissions or variations in the item details are unintentional. About Us Payment Shipping Terms Returns ReturnsWe offer a 14 day return policy. Items must be returned to us within 14 days of the original delivery date. We ask that you please return the product in the original product packaging along with all included materials (manual, warranty card, all accessories) and in the original condition that it was received. Buyer is responsible for return shipping and insurance cost. Refunds will be issued upon return of the item less the original shipping charge and a 15% restocking fee will apply. Helpful Links More Items! This listing is currently undergoing maintenance, we apologize for any inconvenience caused. Powered by SixBit's eCommerce Solution", "ItemID": "352583348953", "EndTime": "2019-02-04T20:55:02.000Z", "StartTime": "2019-02-01T03:10:15.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gretsch-Guitars-G6122-1962-Chet-Atkins-Country-Gentleman-Guitar-w-OHSC-/352583348953", "ListingType": "FixedPriceItem", "Location": "Salem, Ohio", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/3525833489538080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA4MFgxNDQw/z/5S4AAOSw11BcS2v5/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTQ0MFgxMDgw/z/xNEAAOSwa1ZcS2vx/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTQ0MFgxMDgw/z/U4EAAOSwIndcS2wF/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTQ0MFgxMDgw/z/zzcAAOSwSudcS2vr/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA4MFgxNDQw/z/yCcAAOSwwPRcS2v~/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA4MFgxNDQw/z/dcwAAOSwh7tcS2vu/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA4MFgxNDQw/z/CEAAAOSwolpcS2v8/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA4MFgxNDQw/z/LM8AAOSw3fZcS2vz/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA4MFgxNDQw/z/amkAAOSwiT1cS2wC/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA4MFgxNDQw/z/MUsAAOSw6CRcS2v2/$_57.JPG?set_id=880000500F"], "PostalCode": "44460", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "lighthouse_sound", "FeedbackRatingStar": "TurquoiseShooting", "FeedbackScore": 33097, "PositiveFeedbackPercent": 99.6, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 2199.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2199.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "0***7", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 401}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "CA", "GB", "DK", "RO", "SK", "BG", "CZ", "FI", "HU", "LV", "LT", "MT", "EE", "AU", "GR", "PT", "CY", "SI", "JP", "CN", "SE", "KR", "ID", "TH", "BE", "FR", "HK", "IE", "NL", "PL", "ES", "IT", "DE", "AT", "BS", "IL", "MX", "NZ", "SG", "CH", "NO", "SA", "UA", "AE", "QA", "BH", "HR", "MY", "PA", "JM", "BB", "BD", "BM", "BN", "BO", "EG", "GF", "GG", "GI", "GP", "IS", "JE", "JO", "KH", "KY", "LI", "LK", "LU", "MC", "MO", "MQ", "MV", "NI", "OM", "PK", "PY", "RE"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gretsch Guitars G6122-1962 Chet Atkins Country Gentleman Guitar w/OHSC", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gretsch"]}, {"Name": "Body Type", "Value": ["Semi-Hollow"]}, {"Name": "Model", "Value": ["G6122-1962"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Color", "Value": ["Walnut"]}, {"Name": "Model Year", "Value": ["2013"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}]}, "HitCount": 81, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=22579709", "StoreName": "LHSound"}, "Country": "US", "ReturnPolicy": {"Refund": "Money back or replacement (buyer's choice)", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": true, "ConditionDescription": "2013 Gretsch Guitars G6122-1962 Chet Atkins Country Gentleman Electric Guitar in excellent condition. Beautiful gloss Walnut stain finish on the body with faux \"f\" holes, gold pickguard and hardware. The guitar has a nice action and the maple neck with a bound ebony fretboard has a great feel. The frets are in excellent condition.\n\nThe 2 High Sensitive Filter'tron™ pickups have that great distinct tone with good output. The guitar is equipped with a rocking bar bridge, Bigsby tailpiece, dual dampeners, Grover Imperial tuners and snap on protective pad on the back.  Looks, plays and sounds great.\n\nIncludes original hard shell case. Made in Japan. \n\nSerial Number: JT07124674\n\nWeight:    8 lbs.    0 oz.", "QuantitySoldByPickupInStore": 0, "SKU": "NO SKU BA11", "NewBestOffer": false}