{"BestOfferEnabled": false, "Description": "Taylor SB1-X in excellent condition. I see a tiny nick on the end of the headstock (see photo) but that looks like it. There may be something else that I am not seeing but, if so, it would be very minor. I am paring down my collection of these guitars and decided to keep my white one … so this one has to go! Nice demo of the same guitar (in white) on YouTube: https://www.youtube.com/watch?v=f0IR8LoIVJY And: https://www.youtube.com/watch?v=K2Asxy3WYpk I wouldn't think this is good for metal but this guy seems to sound pretty good: https://www.youtube.com/watch?v=hOPPZoc5yrU Ships to lower 48 states only. Happy to answer any questions! Made in the USA! (El Cajon, CA) See below for guitar details! ---------------- OVERVIEW Featuring original design pickups, a sleek all-aluminum bridge, fresh body design, proprietary neck-to-body construction, and unique switching capabilities, Taylor's innovative imprints are all over their Classic Electric Guitar. The unique Taylor-designed pickups are the foundation the Taylor solid bodies are built on. The Classic is loaded with 3/4-size high-definition humbuckers featuring a new type of magnet and special winding process. The combination creates vintage humbucker sound with the power and dynamic range of modern pickups. Five pickup settings with carefully chosen voicings give you a great range of tones: 1) Neck pickup 2) \"Skinny neck tone\"--two inside coils from both pickups wired in parallel 3) \"In-between rock tone\"--both coils of neck pickup combined with the inside coil of bridge pickup for classic bright single-coil tone with the added fullness of neck tone. Great for semi-distorted amp setting. 4) Fat single-coil--two inside coils from both pickups in series (north from neck and south from bridge) creating, in effect, a 4\" humbucker. 5) Bridge pickup The swamp ash body is beveled on the back, sides and in the cutaway so you're always playing in comfort and able to easily reach the upper frets. The maple neck features the single bolt T-Lock„¢ neck joint that pulls the neck into the body. The simple yet ingenious jigsaw joint shape provides a set neck feel and accurate intonation. The bridge, also Taylor-designed, is amazing smooth across the top. It looks and feels clean and classy. No exposed adjustment screws to clutter the looks or get caught on. Even the Classic's knobs are a departure from standard fare: elegant looks with a lipped edge that allows great one-finger control. Sweaty hands? Taylor includes rubber O-ring grips that slip over the knobs. For years, Bob Taylor was asked if they were going to build a solid body electric, and for years, the answer was no. Bob's thinking was simple: he wasn't going to build a solidbody electric unless he felt there was a real reason to. In other words, he wouldn't put the Taylor name on a guitar that was just another version of what already existed. For this electric guitar to happen, it had to be innovative, unique and worthy of a place alongside the guitars that electric guitar players have loved for generations. When the design group at Taylor invented new pickups and Bob heard them, he knew the time had come. Starting with the pickups, each element of this solid body was designed from the ground up. The ingenuity that Bob Taylor insisted on resulted in the creation of an electric guitar that's sure to inspire and well-equipped to impress. . FEATURES · Body style: Beveled single-cutaway with contoured back · Body wood: swamp ash · Scale length: 24-7/8\" Taylor short scale · Neck joint: single bolt T-lock „¢ neck joint · Neck wood: maple · Fretboard: rosewood · Neck shape: Taylor neck · Frets: 22 · Fretboard radius: 15\" · Bridge: aluminum Taylor-designed · Pickups: Taylor-designed humbuckers (3/4 size) · Pickup control: 5-way selector: 1- Neck pickup 2- Two inside coils from both pickups in parallel 3- Both coils of neck pickup w/ inside coil of bridge pickup 4- Two inside coils from both pickups in series 5- Bridge pickup · Controls: master volume, master tone · Tuners: Taylor · Inlays: dot · Pickguard: crushed pearl · Finish: trans white · Case: Rectangular hardshell Taylor case Further information:Pickups Taylor's breakthrough pickup design spawned this guitar. Vintage sweetness together with the power to drive an amp gives you the best of both worlds, plus some fresh sounds that'll lead you to a world of your own. Taylor's unique humbuckers balance the sweetness of a vintage pickup sound - where you hear the woods and the ways the guitar is responding to the player - with the power to fully drive an amp without being super hot and overpounding it. No matter what your electric pickup of choice has been, these pickups will appease your sonic cravings, plus dish out some new tonal flavors with the help of the combo settings and tone controls. Bridge Another fully original design, the sleek, all-aluminum bridge looks and feels great, and it's ultra-adjustable. Once you lock it down it holds perfect intonation. Designed entirely from scratch, Taylor's all-aluminum bridge solves the intonation drift and ergonomic problems that often plague other electric bridges. The bridge height can be adjusted both front-to-back and side-to-side. Each of the strings sits in its own saddle, and once the intonation is set, the saddles are locked in place with screws located discretely under the bridge (accessible from the back). Once everything is locked down, you can take the strings off without the saddles moving, maintaining precise intonation. Taylor also tweaked the break angle for the strings, so that no matter where each individual saddle is positioned, it maintains the perfect amount of downward pressure and string length for easy playing and great tone. Taylor specially contoured the bridge to give it a curvy, ultra-smooth feel; your picking hand will be happy to camp out there. Neck Taylor's innovative T-Lock neck joint brings Taylor's trademark consistency and comfort into the solidbody player's hands. Taylor's heritage of easy-playing, superbly intonated necks continues with the single-bolt T-Lock joint first used on the T5 guitar. Like the NT neck, a precisely milled pocket spacer is used to dial-in the perfect neck angle. As the neck is bolted in place, it pulls both down and back toward the bridge for perfect alignment and stability. It?s simple to put on or take off to switch out spacers for angle adjustment. The contouring makes the neck feel and look great, especially up by the body. There's no heel, and the asymmetrical curve where it meets the body creates a smooth aesthetic line that flows into the cutaway. Controls Tone control is the Holy Grail for an electric player. From Taylor's five-way pickup switch to their original control knobs, Taylor's given you more tone and made it easier to tweak it on the fly. The 5-way is laid out in a familiar way, with the neck pickup position located closest to the neck humbucker and the bridge position closest to the bridge pickup. In between the full, fat neck tone and the rockin? bridge tone, the middle settings give the Taylor electric its own distinctive voicings.· The first two-thirds of the tone knob rotation acts like a traditional tone control. The last third, especially when all the way at the end, starts peaking the mids, yielding a killer nasal tone that resembles playing through a semi-cocked Wah-wah pedal. It's ideal for slide playing, or as a different tonal color for solos or throaty rhythm parts. The tone control together with the different pickup settings give you a whole new set of flavors to play with.Link to Taylor's webpage for this guitar: https://www.taylorguitars.com/guitars/electric/solidbody/sb1-x", "ItemID": "163341744359", "EndTime": "2018-11-05T01:10:44.000Z", "StartTime": "2018-10-29T01:10:44.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Taylor-SB1-X-solidbody-guitar-OHSC-ash-body-made-USA-/163341744359", "ListingType": "Chinese", "Location": "Oceanside, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1633417443598080_2.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/s1EAAOSwckVb2lFD/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/kFkAAOSwIBpb2lDY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/8nwAAOSwWW5b2lDc/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/4GYAAOSw1Sdb1l2O/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/CioAAOSwqM9b1l2G/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/5lMAAOSw8sBb2lGG/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/vRQAAOSwcDdb2lDs/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/1JwAAOSwJtJb2lFj/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/P64AAOSwTxhb2lFx/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/O2MAAOSwBkBb2lFR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAyNVgxNTg3/z/moAAAOSw2ptb2lLQ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/80AAAOSwWW5b2lGz/$_57.JPG?set_id=8800005007"], "PostalCode": "92058", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "summersunner", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 186, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 500.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 500.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "8***a", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 177}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Taylor SB1-X solidbody guitar - OHSC - ash body - made in USA!", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Taylor"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Material", "Value": ["Ash"]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}]}, "HitCount": 112, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 510.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}