{"BestOfferEnabled": false, "Description": "--> Kramer SM-1 Seymour Duncan Electric Guitar (Vintage White) Used This item is slightly used and has been thoroughly checked out by our experts to make sure it is in perfect working condition. We then re-sealed it in its original packaging with all factory included accessories. This item is guaranteed to be in \"as new\" condition and has virtually no cosmetic imperfections. This item is covered with a one year warranty from Sam Ash. Powered by the name that is synonymous with tone, The Kramer SM-1 Seymour Duncan Electric Guitar has the classic style that has been at the forefront of hard rock and heavy metal going back to the 1980’s. Sporting a double cutaway mahogany body, this metal machine means business. The body is heavily contoured and features extra beveling along the lower horn for easier access to the upper frets. The SM-1 is powered with a pair of Cool Rails single coil pickups and an Alternative 8 humbucking pickup in the bridge position, with a master volume, master tone, and a 5-way selector. The 2 single coil/bridge humbucker (H-S-S) design has been one of the most popular electronic layouts in today’s landscape of hard rock and heavy metal. These pickups will deliver a wide range of tones from retro, to up to the minute metal. The Volume on the Kramer SM-1 Seymour Duncan Electric Guitar features what Kramer calls the \"treble bleed\" mod that lets you keep your tone bright when backing down the volume control.The “through-neck” design maple 25.5\"-scale neck has been carved into an ultra-fast thin taper profile and topped with 24 Jumbo frets for extremely fast playability and effortless string-bending. Finally, the black hardware includes a set of die-cast tuners; along with a Floyd Rose locking tremolo that will keep you in tune, and withstand even the most aggressive divebomb soloing. The Kramer SM-1 Seymour Duncan Electric Guitar is built to metal approved specs and is ready to rock. Case not included.Order your Kramer SM-1 Seymour Duncan Electric Guitar from Sam Ash Direct today with the security of our 45/60 day return/price protection policy and fast, free shipping. Shipping Information Your gear will ship out within 2 days of order confirmation. At this time we can not ship PO Boxes, APO and FPO locations. Industry Leading 45-Day Return Policy We stand by the products we sell, and we'll certainly stand by you as well! We truly appreciate your business, and we want you to be 100% happy with your purchase. However, we know that one of the drawbacks of internet shopping is that you can't try something before you buy it. That's where our money-back guarantee comes in. If you are not completely satisfied with an item, for any reason, you can return it within 45 days of the shipping date for a complete refund of the merchandise price.* Have a question about your order? A Sam Ash Customer Service specialist is available to help! Call 800-472-6274, Monday - Saturday, from 10:00AM - 6:00PM EST. Due to the complexity of international shipping, we are unable to accept any returns on international orders. Before making a purchase outside of the United States, please know that products sold by Sam Ash use the standard 120V/60Hz voltage standard. Sam Ash is not responsible for any damage caused by not adhering to the voltage requirements. *All returns must be within 45 days of the date the item was shipped. Please do not accept any shipment if the packaging appears damaged in any way. We strongly suggest that you check your order after receiving it to be sure that it is in proper working order. Returned items must be in resalable condition. Resalable Condition means that the product(s) is exactly in the same condition as you received it. All exchanges must be pre-paid, returned in original packing, complete with blank warranty cards, owner's manual and show no sign of wear or abuse. In the event that the product is not in the same condition as you received it you may be subject to a minimum 15% restocking fee, repair charge or disqualification. Shipping and handling charges are non-refundable. Please call our Customer Service department if you have any questions about returning an item. CDs, DVDs, video tapes, sheet music, books, strings, computer hardware/software, drum heads, harmonicas, mouthpieces, sound cards, microphones, raw speakers, studio furniture, blank CDs/Tapes or Special Orders are not covered by this return policy.", "ItemID": "173815255159", "EndTime": "2019-03-01T00:53:57.000Z", "StartTime": "2019-02-27T23:57:17.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Kramer-SM-1-Seymour-Duncan-Electric-Guitar-Vintage-White-Used-/173815255159", "ListingType": "FixedPriceItem", "Location": "Tampa, FL", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1738152551598080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MzMzWDUwMA==/z/H-QAAOSwsv5cdyPf/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MjQwWDM2MA==/z/zAgAAOSwcgNcdyPf/$_1.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "samashdirect", "FeedbackRatingStar": "PurpleShooting", "FeedbackScore": 59073, "PositiveFeedbackPercent": 99.3, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 714.88, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 714.88, "CurrencyID": "USD"}, "HighBidder": {"UserID": "t***3", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1796}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Kramer SM-1 Seymour Duncan Electric Guitar (Vintage White) Used", "HitCount": 22, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1111655870", "StoreName": "Sam_Ash_Music_Direct"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "DiscountPriceInfo": {"OriginalRetailPrice": {"Value": 1533.0, "CurrencyID": "USD"}, "PricingTreatment": "STP", "SoldOneBay": false, "SoldOffeBay": false}, "ExcludeShipToLocation": ["Alaska/Hawaii", "APO/FPO", "US Protectorates", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "ConditionDescription": "Like New", "QuantitySoldByPickupInStore": 0, "SKU": "KMVRVWBF1", "NewBestOffer": false}