{"BestOfferEnabled": false, "Description": "GOLD RUSH PAWN CO. Ibanez JEMJRWH Steve Vai Signature Jem Jr Electric Guitar Description: EXCELLENT CONDITION. COMES WITH CASE AND CORD. SEE PHOTOS. Details Musical Instrument Condition RatingExcellent - almost like new Knobs - Tuners - Electronics - Input Jack95% - Guitar is like new - Very little wear - All original Musical Instrument CaseThick padded case included Notes: Color: White Mahogany Body Wizard III Maple Neck Rosewood Fretboard Tree of Life Fretboard Inlay Jumbo Frets Steve Vai's signature guitars have become almost as iconic as the player himself, and now that mojo is more attainable than ever with the Ibanez JEMJR Steve Vai Signature solid body electric guitar. From the acrylic vine inlay to the instantly-recognizable \"monkey grip\" handle, there's no doubt where the JEMJR Steve Vai Signature came from. For tonal tenacity, you get two Quantum humbuckers and one Quantum single-coil pickup complete with five-way switching. Factor in the double-locking tremolo bridge, and the Ibanez JEMJR Steve Vai Signature is ready to wail. One of Ibanez's fastest necks to date, the Wizard III neck on the JEMJR Steve Vai Signature guitar is an absolute pleasure to play. This slim and super-comfortable neck lets you pull off lighting-fast runs and arpeggios with ease, but still gives you the substance you need for grabbing chords when you need to. From the first time you put your hands on the JEMJR's Wizard III neck, you'll know you've got a guitar that was built with performance in mind. The JEMJR Steve Vai Signature packs Ibanez's standard double-locking bridge, which helps you maintain your tuning stability even after heavy pitch bends.(GR1043012) Payment PayPal is the ONLY online payment method we accept at this time. Your PayPal account must be a Verified U.S. PayPal Account. We also recommend that you use a Confirmed Ship To Address. Shipping Your item will be shipped within 1 business day(s). After shipping your items will be delivered within 1-10 business days. Terms of Sale Tax applies in: MT About Us Gold Rush Pawn Company opened the doors in Kalispell, Montana in 1980. We are the oldest local family owned and operated pawn shop in the Flathead Valley. There is just one Gold Rush Pawn Company. You get our personal attention when you deal at Gold Rush. We have a friendly knowledgeable staff who treat customers right. We are located just 35 miles from Glacier Park. If you are in the area, make sure to stop in! We do pawn loans plus buy, sell and trade on most items of value. We offer layaways for your convenience. With 10% down, 10% due monthly and 10 months to pay for the item. If you are looking for a pawn loan we have many options. We try to loan you the maximum amounts and we never put an item out for sale before 60 days from the original loan date. That way if you are a few days or even a couple of weeks late, your item will still be waiting for you. We offer 1/2 price 7 day loans as well. Our log storefront is also home to Gold Rush American Motorcycle and we have a wide selection of parts and accessories for Harley Davidson cycles plus high quality reasonably priced leathers. Everything on our online Buya store is also for sale in our brick and mortar store. If the item you buy online sells in the store, we will apologize and give you a full refund. We will suggest something similar if we have it. All items and accessories included in our listings are shown the photographs. If you have any questions or requests, please ask. If you don't see what you are looking for in the store, you never know... It could be kickin' around here somewhere. We guarantee everything to be as stated in the listing. We stand behind our products. If we miss something, you will get a full or partial refund including shipping costs – your choice. If you decide to return an item because you don't like it, there is a 20% restocking fee and you will be expected to pay the return shipping. World wide international buyers: We always welcome your business. Most Ebay items are shipped through Ebay's global shipping program. We will also ship directly to you. We won't misrepresent item costs or descriptions. We also ask that you do not buy or bid on any items that are not allowed to be imported into your country. If you do, the item will probably be confiscated by your customs department. Then you will lose both the item and the money you paid for it. Stop by online or in person. We'd love to see you and promise you won't be disappointed. Bravo Store Systems Point-of-Sale Operating System Bravo Omni-Commerce solutions offers Brick & Mortar stores the only fully integrated eBay API that seamlessly & effortlessly combines the in-store Point-of-Sale to all eBay commerce selling activities. Click here & find out why eBay stated \"Bravo has best solved Brick & Mortars can sell on eBay\"", "ItemID": "283340522134", "EndTime": "2019-01-22T19:28:07.000Z", "StartTime": "2019-01-15T23:49:42.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Ibanez-JEMJRWH-Steve-Vai-Signature-White-Jem-Jr-Electric-Guitar-Padded-Case-/283340522134", "ListingType": "FixedPriceItem", "Location": "Kalispell, Montana", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2833405221348080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MzI2WDY3Mg==/z/8lgAAOSwO-hcPnGS/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/NjcyWDMyNg==/z/7E8AAOSwuZ9cPnGT/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/MzI2WDY3Mg==/z/HFoAAOSw64xcPnGT/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/MzI2WDY3Mg==/z/URMAAOSwSudcPnGT/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/MzI2WDY3Mg==/z/RtQAAOSw3s9cPnGT/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/NzIwWDU0MA==/z/zUYAAOSwt0dcPnGU/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/NzIwWDU0MA==/z/PMoAAOSwqRlcPnGU/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/NzIwWDU0MA==/z/yYkAAOSwtYZcPnGU/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/NzIwWDU0MA==/z/0oYAAOSw6KxcPnGU/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/NzIwWDU0MA==/z/lkQAAOSws6dcPnGV/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/NTQwWDcyMA==/z/f-AAAOSw8bpcPnGV/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/NTQwWDcyMA==/z/xmQAAOSwj9hcPnGV/$_1.JPG?set_id=2"], "PostalCode": "59901", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mtgoldrush", "FeedbackRatingStar": "Red", "FeedbackScore": 3340, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 350.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 350.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "r***a", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 0}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "Ibanez JEMJRWH Steve Vai Signature White Jem Jr Electric Guitar & Padded Case", "ItemSpecifics": {"NameValueList": [{"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["JEM JR 1P-01"]}, {"Name": "Model", "Value": ["JEMJRWH"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Product Line", "Value": ["Ibanez JEM"]}, {"Name": "Brand", "Value": ["Ibanez"]}, {"Name": "Body Material", "Value": ["Mahogany"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Color", "Value": ["White"]}]}, "HitCount": 501, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=48289778", "StoreName": "Gold Rush Pawn~American Motorcycle"}, "Country": "US", "ReturnPolicy": {"Refund": "Money back or replacement (buyer's choice)", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "ProductID": {"Value": "219495564", "Type": "Reference"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}