{"BestOfferEnabled": true, "Description": "DJ GEAR INSTRUMENT GEAR LIVE SOUND RECORDING MICROPHONES HEADPHONES ACCESSORIES SOFTWARE LIGHTING BUNDLES Authorized Dealer - Full Warranty Line 6 Variax Shuriken SR250 Satin Black - Used Variax Guitar with custom body style and features - Used - Description Guitars Like No Others Modern Instruments For Modern Guitarists. Shuriken Variax guitars resulted from a collaboration between Shuriken Guitars, Line 6, and Yamaha Guitar Development. They are modern, high-quality instruments featuring unique body shapes with contoured edges, Indian ebony fretboards, custom mid-gain humbucking pickups, and all of the sonic versatility provided by Variax HD technology. Shuriken Variax guitars come with a Shuriken premium padded gig bag. Variax Hd Technology Custom models and tuning presets. Variax HD technology makes it possible to instantly access the sounds of dozens of legendary electric guitars, acoustic guitars, and other fretted instruments with the twist of a knob&mdash;and switching between alternate tunings is just as easy. You can also design custom instruments and tunings, then load them into your guitar as presets using the free Workbench HD application. Optimized For Line 6 Modelers Multi-Effects Venture even further beyond the orthodox. Although Shuriken Variax guitars can easily be incorporated into any guitar rig, pairing them with a Line 6 Helix, POD HD, or Firehawk modeler unlocks their full potential. Create custom presets that change tunings as well as amp, effect, and guitar model settings&mdash;all with the touch of a footswitch. Features/Specs Satin-finished solid alder body 25.5\" scale maple neck with 24-fret, 13.78\"-radius Indian ebony fingerboard Single mid-gain humbucker in bridge, Variax modeling system, 5-way bank selector Thru-body-strung hardtail bridge, locking tuners Body Body shape : Double cutaway Body type : Solid body Body material : Solid wood Top wood Body wood : Alder Body finish : Satin Orientation : Right handed Neck Neck shape : C standard Neck wood : Maple Joint : Bolt-on Scale length : 25.5 in. Truss rod : Standard Neck finish : Gloss Fretboard Material : Indian Ebony Radius : 13.78 in. Fret size : Medium-jumbo Number of frets : 24 Inlays : Dot Offset Nut width : 1.65 in. TUSQ Pickups Configuration : H Neck Middle Bridge : Mid-gain humbucker Brand : Line 6 Active or passive pickups : Passive Series or parallel : Parallel Piezo : No Active EQ : No Special electronics : Variax modeling system Controls Control layout : Master volume, tone, model select, tuning select Pickup switch : 5-way Bank selector Coil tap or split : No Kill switch : No Hardware Bridge type : Fixed Bridge design : 6-saddle string through body Tailpiece : String thru body Tuning machines : Locking Color : Black We are authorized dealers for all these brands. Click a logo to see our listings. We collect NYS Sales Tax for items shipping within New York. Local duties, taxes and fees out of the USA are not included in the sale price or ship charge. Proaudiostar is not responsible for any taxes outside of NY and or the USA. If an item is refused by the buyer, ship costs to and from the destination in which the item was shipped to are not refunded. Please note the cost of return shipping is usually double of what the original ship cost. Shipping is not free to HI, AK, and PR. FREE SHIPPING ONLY TO THE LOWER 48 STATES. We provide free shipping to the contiguous 48 United States, on most items. Shipping fees to ALL OTHER LOCATIONS will be calculated individually and added to customer invoices. Local duties, taxes and charges are not included in the sale price or ship charges. ProAudioStar is not responsible for any taxes outside of NY and or the USA. In the event that the customer refuses a shipment, all shipping costs to and from the country or State in which the item was shipped to are not refunded. Please note, in some cases return shipping can cost as much as double the original ship cost. We operate a 30-day return period. Items must be returned with all original packaging as well as all included items. Items that are not returned in original, resalable condition are subject to a 15% restocking fee. We charge a 15% restocking fee on returned items only if the item is clearly used and or the packaging is tarnished. A 10% re-stock is more likely if the unit comes back in mint condition. The ship cost we paid to ship your item will be deducted as well. In some cases restock fees and ship costs can be applied as a store credit. We will exchange a defective unit for the same unit within the 30-day period. After that period, you will have to work directly with the manufacturer for warranty service. Items that can not be returned include: software, units with contents or packaging that is damaged/missing, and items that are considered for personal use (such as earphones, headphones, microphones, instrument mouthpieces, harmonicas or other items that you wouldn't want to purchase if someone else had previously used them). Also, Items which we do not normally stock (i.e. \"Special Orders\", discontinued products, close-outs, used products, etc.) are non-returnable. We strongly suggest that you check your order after receiving it to be sure that it is in proper working order. Please contact us for a Return Authorization before returning any items.", "ItemID": "303003014259", "EndTime": "2019-01-05T04:07:28.000Z", "StartTime": "2018-12-19T21:56:08.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Line-6-Variax-Shuriken-SR250-Satin-Black-Used-/303003014259", "ListingType": "FixedPriceItem", "Location": "Winchester, Virginia", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/3030030142598080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/OTg0WDEyMTU=/z/H7QAAOSw11BcGBeI/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTg0WDEyMTU=/z/3ZUAAOSwqiJcGBeI/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTg0WDEyMTU=/z/XQ8AAOSwwS5cGBeH/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTg0WDEyMTU=/z/ZhwAAOSwH61cGBeH/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTg0WDEyMTU=/z/xoQAAOSws2RcGBeH/$_1.JPG?set_id=880000500F"], "PostalCode": "22601", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "proaudiostar", "FeedbackRatingStar": "RedShooting", "FeedbackScore": 211095, "PositiveFeedbackPercent": 98.8, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1149.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1149.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***x", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 226}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Line 6 Variax Shuriken SR250 Satin Black - Used", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["PRS"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}]}, "HitCount": 70, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=336450849", "StoreName": "proaudiostar"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "DiscountPriceInfo": {"OriginalRetailPrice": {"Value": 1499.99, "CurrencyID": "USD"}, "PricingTreatment": "STP", "SoldOneBay": false, "SoldOffeBay": false}, "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "BR"], "GlobalShipping": false, "ConditionDescription": "Used", "QuantitySoldByPickupInStore": 0, "SKU": "LN6-SHURIKENSR250-B", "NewBestOffer": false}