{"BestOfferEnabled": true, "Description": "This is a really cool guitar for those slide songs. I used it for example \"Ballad of Curtis Loew\", really groovy sound. She is in great shape, no nicks or scratches, and it comes with a Diamond - Hard Shell Case. If you like that bottleneck sound, try it with \"Electric\". I played this through my Blues Junior and loved it. Anywho, check out the details below, any question feel free to contact me. The best sounding resonator guitar ever! Combines special design piezo in the cone with ‘56 Lipstick® pickup. Volume, tone, and pickup “blend” controls. Diamond plate cover for enhanced tone. Much higher piezo output than anything we have heard. You will dig! - Musicians Friend ’59 DC Shorthorn shape hollow bodyDiamond plate coverScale length: 25″Number of frets: 21Neck finish: clear satin’56 Lipstick® neck pickupPiezo pickup mounted in cone1 master volume1 master tone1 blend pot (Lipstick® or Piezo or both in center) Guitar World GOLD AWARD: Lately I’ve been playing a lot of slide guitar, which has put me on the hunt for an affordable resonator-style six-string with electronics. I didn’t have to look far because Danelectro released their brand-new ’59 Resonator, a bright-sounding resonator with powerful pickups that will certainly appeal to those of us who love the steel guitar tones found in Mississippi Delta blues music and bluegrass. FEATURESThe ’59 Resonator looks similar to the Danelectro 1959 model with a double-cut shorthorn shaped hollow body that gives the guitar its total retro charm. The ’59 features a spun cone biscuit resonator, a perforated diamond plate cover, 25-inch scale length, 21 frets, clear satin maple neck with rosewood fingerboard, polished aluminum nut and vintage-style tuners. The heart of the ’59 is its electronics that combine a Danelectro ’56 lipstick pickup in the neck position and a “special design” Schatten piezo pickup mounted inside the resonator cone. The guitar has three oversized knobs for volume and tone, and a blend control for either the lipstick or piezo. The blend knob has a center detent for a 50/50 mix of the two. PERFORMANCEWhat’s immediately noticeable is the ’59 Resonator’s spot-on setup and easy playability. The action is set at a comfortable height to seamlessly switch between playing slide and fingerpicking, and the polished fretwork is some of the best I’ve seen for a budget-priced resonator. The slim neck profile combined with its bouncy string tension makes playing the ’59 a cakewalk.Acoustically, the guitar is bright and raw sounding, but plugged in to an amp, the ’59 comes alive with raspy sparkle, especially when setting the blend control dead center for what I consider its ideal sweet spot. The higher output resonator pickup can easily mimic some electric banjo tones but needs the balance of its ballsy lipstick pickup that adds warmth and body in order to achieve its steel-cut resonator sound. Vintage Guitar Magazine: Tricked out with the familiar Dano “Coke bottle” headstock, polished aluminum nut, and vintage-style tuners, this modern interpretation of the classic 1959 Dano double-cut shorthorn features a spun cone biscuit resonator, diamond cover plate, stamped tailpiece, and Danelectro’s ’56 lipstick pickup. Three knobs determine volume, tone, and the blend of the lipstick with a Schatten “special design” piezo mounted in the resonator cone assembly.The 21-fret Canadian maple bolt-on neck with rosewood board is an accessible modern carve, with the fingerboard edges nicely rolled over for a comfortable feel. The truss-rod adjustment at the headstock is attached with four countersunk screws. The glossy finish, polished fretwork, and easy setup mean a solid fit and finish for the fussy, but there’s also character galore for vintage freaks seeking that ’60s aura in a modern axe.", "ItemID": "233063200033", "EndTime": "2018-12-30T00:22:32.000Z", "StartTime": "2018-12-23T00:22:32.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Danelectro-59-Acoustic-Electric-Resonator-Guitar-Black-/233063200033", "ListingType": "Chinese", "Location": "Canonsburg, Pennsylvania", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/2330632000338080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/ybsAAOSwliFcHtFp/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/Njg3WDM5OA==/z/O14AAOSwAQVcHtFm/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/4TMAAOSwmOBcHtFn/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/VlcAAOSwFu1cHtFo/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/BJMAAOSwtcRcHtFp/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/D9AAAOSw4m9cHtFp/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/cxAAAOSwsrlcHtFn/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/WmMAAOSwIS9cHtFn/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/UzcAAOSwzqtcHtGQ/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/~rQAAOSw8OFcHtFp/$_32.JPG?set_id=880000500F"], "PostalCode": "15317", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "sbuyan", "FeedbackRatingStar": "Blue", "FeedbackScore": 81, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 400.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 400.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "m***d", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 460}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Danelectro '59 Acoustic-Electric Resonator Guitar Black", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Danelectro"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Danelectro &#39;59 Acoustic-Electric Resonator Guitar"]}, {"Name": "Body Color", "Value": ["Black"]}]}, "HitCount": 178, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 405.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}