{"BestOfferEnabled": true, "Description": "Like Magdon Music on Facebook for all the latest scoop! For your review and consideration- we present you with another fine Epiphone Guitar from the guitar collection at Magdon Music! Please read the description below and review the photos. The exact guitar pictured and in the description is the exact guitar that you will be bidding on. If there is something that you need to know that is not in this description- please contact us at Magdon Music before bidding and we will be very happy to assist! *** Please note that our guitars are tech inspected before they go out the door! Buy with confidence from Magdon Music! ***Flat rate shipping is for the Continental USA (lower 48 only!) If you live outside of this area- please contact us for your ship rate. Pictured here we have a great deal on a 2017 Epiphone Les Paul Standard Plustop Pro Left Handed (Leftie) Electric Guitar in Heritage Cherry Burst. This guitar is on display in our store and is actually new, although it might have the slightest playwear from being a demo model. We do not allow our guitars to be abused in store- so no worries there! Gorgeous guitar and really priced to sell! A Gorgeous Les Paul Standard for a Song!The Epiphone Les Paul Standard Plustop PRO packs a punch. Sporting Pro-Bucker pickups with coil-tapping and a stunning AAA flame maple veneer top, this impressive solidbody electric guitar gives you legendary LP tone and playability - as well as jaw-dropping good looks - at an amazing price. With the Les Paul Standard Plustop PRO, you can play nuanced rhythm parts with a chiming single-coil setting on the neck pickup then launch into a face-melting humbucking lead. We're talking serious tonal versatility. No matter what your musical genre, you'll love the Epiphone Les Paul Standard Plustop PRO.Epiphone Les Paul Standard Plus Pro Solidbody Electric Guitar:A universe of tone from tapped Pro-BuckersThe Les Paul backstoryWith a Les Paul, you're in good companyA universe of tone from tapped Pro-Buckers!The Pro-Buckers on the Les Paul Standard Plustop PRO feature Alnico II magnets - the same as sought-after vintage PAF humbuckers - for rich, warm tone with a crystalline highs and and tight bottom. With a Pro-Bucker-2 in the neck position and a (slightly overwound) Pro-Bucker-3 in the bridge position, crank your gain and you can do some serious damage. We're talking legendary Les Paul fat, snarling tone - served up with days of sustain. Excited? There's more. You also get coil-tapping, controlled by push/pull volume pots, giving you an infinite variety of sounds - from single-coil spank to full humbucker shred. This Les Paul is a tone machine.The Les Paul backstory:The Les Paul backstory actually started with an instrument dubbed The Log. In the early 1940s, in a quest for an electric guitar that would sustain for days, Les Paul - the legendary guitarist and inventor - fashioned what may well have been the first solidbody guitar from a length of common 4\" x 4\" lumber. For appearances (and possibly playing comfort), Les sawed an Epiphone hollowbody in half and attached the two wings to either side of The Log. Les continued to develop the idea through a series of prototypes, ultimately resulting in the classic solidbody guitar we know and love.With a Les Paul, you're in good company!From rock to fusion (and beyond), the Les Paul's surly snarl has virtually defined attitude-laden overdrive guitar sound. Legendary guitarists such as Jimmy Page, Al Di Meola, Alex Lifeson, Slash, and countless others, have forged their signature sounds with a \"sunburst\" Les Paul. Epiphone now gives you the opportunity to experience that one-of-a-kind tone and look at an amazingly affordable price with the Les Paul Standard Plustop PRO. Epiphone Les Paul Standard Plus Pro Lefty Solidbody Electric Guitar Features:Mahogany body with AAA flame maple veneerHeritage cherry colorLeft-handed guitarSingle-ply cream body and neck bindingSet mahogany neck with 1960's SlimTaper D profile12\" radius rosewood fingerboard with trapezoid inlays and 22 medium-jumbo frets2 ProBucker humbucking pickupsLockTone Tune-o-matic bridge; stopbar tailpieceNickel hardware; 14:1 ratio Grover die-cast tunersClipped-ear headstock with gold Les Paul Model silkscreen2-ply truss rod cover with Les Paul Standard Pro inscriptionSingle-ply elevated cream pickguardAmber bell knobs; push/pull coil tapping on volume controls3-way selector switchThe Epiphone Les Paul Standard Plus Pro: a gorgeous Les Paul at an outstanding price! ***Flat rate shipping is for USA ONLY! (Lower 48 only!) (SC38M98.SO)left If there is anything else that you need to know about this guitar or if you would like an in-hand description or more photos- please feel free to give a jingle to our professional guitar department at Magdon Music. 1 8 8 8 Magdon 1 - we will be very happy to assist you! ***Please note that Magdon Music has showrooms full of guitars- both new and used. Not all of them are listed online. If you are looking for something specific and do not see it online- please feel free to contact us! Magdon Music is open Monday thru Friday 11am -7pm (est) and Saturdays from 11am - 4pm. Magdon Music Voted: \"Best Music Store 2018\" byThe Valley Advantage Reader's Poll&\"Times Tribune Reader's Choice Poll\"", "ItemID": "153220238591", "EndTime": "2018-12-22T20:51:28.000Z", "StartTime": "2018-10-15T21:06:46.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Epiphone-Les-Paul-Standard-Plustop-Pro-Lefty-Heritage-Cherry-Burst-/153220238591", "ListingType": "FixedPriceItem", "Location": "Olyphant, Pennsylvania", "PaymentMethods": ["PayPal", "VisaMC", "Discover", "CashOnPickup", "AmEx"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1532202385918080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/WjgAAOSwHWtbxPuh/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/zgQAAOSwapdbxPtw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/cpUAAOSw3ANbxPt7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/eYIAAOSwHSRbxPuF/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/8loAAOSwNDhbxPue/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/nG8AAOSwAwVbxPuQ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/gmQAAOSwrwhbxPu6/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/JtIAAOSwdU9bxPun/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/WRYAAOSwEJlbxPvA/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/RDAAAOSwmXJbxPvF/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/VGkAAOSw3qRbxPvO/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/iV4AAOSwjXZbxPtr/$_57.JPG?set_id=8800005007"], "PostalCode": "18447", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "magdon1", "FeedbackRatingStar": "Green", "FeedbackScore": 7044, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 570.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 570.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "9***9", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 231}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Epiphone Les Paul Standard Plustop Pro Lefty in Heritage Cherry Burst ", "ItemSpecifics": {"NameValueList": [{"Name": "Dexterity", "Value": ["Left-Handed"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "Model", "Value": ["Les Paul Plustop Pro"]}, {"Name": "Body Color", "Value": ["Heritage Cherry Burst"]}, {"Name": "Model Year", "Value": ["2017"]}, {"Name": "Right-/ Left-Handed", "Value": ["Left"]}]}, "HitCount": 267, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=22841680", "StoreName": "Magdon Music"}, "Country": "US", "ReturnPolicy": {"Refund": "Money back or replacement (buyer's choice)", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Brand New Display Model!", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}