{"BestOfferEnabled": false, "Description": "Here's a 2013 Gibson Elliot Easton Tikibird Signature model in a factory original Gold Mist poly finish. It is in excellent condition and has light play wear. No breaks or repairs. The finish on the top is clean and nearly immaculate with just a few micro scratches and several tiny indents. The back clean with a few faint marks as well- see pics. The hardwear still has a good shine and the pickups are the originals. The neck is super smooth and arrow straight. It has just been detailed. The front, back, sides and neck were waxed and buffed with a high grade carnuba wax. The frets were polished and the fingerboard was cleaned, buffed and moisturized with an instrument grade lemon oil. It was set up with 10/46's, adjusted and plays very nicely. All the electronics work well. Here's the specs -- During the 70s and 80s, Elliot Easton's guitar solos were a staple of the airwaves on classic rock hits by the Cars. From early Cars singles like œJust What I Needed\u009d and œMy Best Friend' Girl,\u009d to 1981' œShake It Up\", Elliot' offbeat and frenzied riffs where the engine that drove the bands more energetic side and his influence can be found on plenty of bands from the 80s to today. A longtime fan of Gibson electrics, Elliot has been associated with a Signature SG model, but now the legendary guitarist and Gibson USA have teamed up to create the Elliot Easton œTikibird\u009d Firebird which blends some classic features with plenty of player-approved advances. This stunner features a new, exclusive Gold Mist Poly finish in high-gloss nitrocellulose lacquer over the now legendary œreverse body\u009d Firebird design of the 1963-™65 era. Adding to its aesthetically pleasing appeal is a hot-stamped Tiki graphic on a traditional multi-ply white plastic pickguard. It' powered by a pair of Gibson' most popular humbucking pickups, '57 Classics, with versatile coil-splitting and phase-reverse wiring for a variety of sonic capabilities. The Elliot Easton \"Tikibird\" Firebird's Bigsby vibrato tailpiece with Vibramate Spoiler for easy string loading lets you create emotive dips and tremulous wobbles. Its TonePros locking tune-o-matic bridge with nylon saddles ensures your guitar will get back on pitch quickly when you're dabbling with vibrato. Finally, a set of Steinberger gearless tuners provide incredible tuning efficiency.Body and neck The Elliot Easton œTikibird\u009d Firebird is made in the image of the original œreverse body\u009d Firebirds of 1963-™65, with lines that appeared to be the reverse image of other solidbody styles on the market. It features a through-neck solid multi-piece mahogany design with glued-on mahogany body wings. The neck is carved to Elliot' preferred slim, fast Firebird profile, measuring just 0.8\u009d at the 1st fret and 0.85\u009d at the 12th. It is topped with a Grade-A rosewood fingerboard with traditional trapezoid inlays and 22 medium-jumbo frets. Pickups and electronicsTo fatten up the traditional Firebird tone, Easton's œTikibird\u009d Firebird has a duo of Gibson' popular ™57 Classic humbucking pickups, beloved for their blend of depth and clarity. A custom network of four slider switches mounted in the pickguard give you versatility, accessing individual coil splitting for both pickups, phase-reverse when used together, and Gibson' Pure True Bypass switching. The latter routes the bridge pickup directly to the output jack when engaged, for a quick preset lead tone with no loading. The coil-split switching offers something new, too: wired in Gibson' œFrequency-Tuned Coil Tap\u009d mode, the two pickups are still reverse-wound/reverse-polarity in the center position when tapped, for hum-canceling single-coil tones, and their individual tapped tones are still hum reducing, and more accurate to boot. The remaining controls include the traditional four-knob complement with three-way toggle switch. HardwarePer Easton's request, a genuine Bigsby vibrato is modified with a Vibramate Spoiler string loader to save you from the hassle of restringing this beloved whammy bar. Its TonePros tune-o-matic locks down tight for enhanced resonance and sustain, with nylon saddles to avoid string hitches during Bigsby use. Super-efficient Steinberger gearless tuners give you the smoothest tune-up without spoiling the radical lines of its headstock. The traditional Firebird truss rod cover has a gold Gibson logo hot-stamped on it, while the custom multi-ply white plastic pickguard features a hot-stamped Tiki graphic. Comes with the original Gibson hardshell case and COA as seen in the pictures. This guitar will be safely packed and shipped. Buyer to pay $60 FedEx shipping anywhere in the U.S. Full insurance included in shipping. California residents please add 7.25% sales tax. Local San Diego pickup always welcome. Will ship worldwide. International shipping guidelines: Buyer is responsible for any import duties. FedEx Ground to Canada is $175 with full insurance. FedEx or USPS Express is $245 to most parts of Europe and the UK. FedEx is $295 to Asia and Australia. Full insurance available. Please call or email me if you have any questions - 858-531-2287", "ItemID": "163418041695", "EndTime": "2018-12-25T19:32:39.000Z", "StartTime": "2018-12-06T20:29:03.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-Elliot-Easton-Tikibird-Firebird-Signature-Model-Bigsby-Gold-Mist-/163418041695", "ListingType": "FixedPriceItem", "Location": "San Diego, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1634180416958080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/ibAAAOSwBkNcCYVi/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/eygAAOSwm5xcCYVe/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/WQEAAOSwDEBcCYVg/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/G3oAAOSwNphcCYVk/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/jR4AAOSwqRlcCYVm/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/WRIAAOSwDEBcCYVo/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/gNcAAOSwN5hcCYVp/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/DicAAOSwyPFcCYVr/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/ExIAAOSw76lcCYVt/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/DuwAAOSwAopcCYVu/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/j3wAAOSwTc5cCYVw/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/COIAAOSwGVFcCYVy/$_1.JPG?set_id=8800005007"], "PostalCode": "92109", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "cwh1", "FeedbackRatingStar": "Red", "FeedbackScore": 3938, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1795.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1795.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "e***p", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 39}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson Elliot Easton Tikibird Firebird Signature Model with Bigsby Gold Mist ", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model", "Value": ["Elliot Easton"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Dexterity", "Value": ["Right handed"]}, {"Name": "Body Color", "Value": ["Gold"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}]}, "HitCount": 423, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1897962", "StoreName": "cwh1"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Excellent condition - Scroll down to see 55 HD Images", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}