{"BestOfferEnabled": false, "Description": "If you want a vintage Mustang you can actually play and not just look at, you have found it! Note: the first pics are newer, with straplocks, strap and hardshell case added. The pics below the new ones are older, but they are more detailed. The condition is still the same. Up for consideration today we have a 1966 Fender Mustang in Dakota Red, with a fairly new hardshell case, sized specifically for a Mustang. There is a Carr (amplifiers) sticker on the case, see pic. No dings or scratches on the case. It has never left my house and even still smells new. A new “pre-aged” strap, strap locks and set-up in standard tuning, summer 2018. This is a great guitar and I am selling it for only one reason: I have too much musical equipment so I’m selling off most of it. This guitar maintains its original finish. The neck however has had extensive work done to get it into optimal playing condition and it now plays like a dream. During restoration the neck went through heat treatments before ultimately removing the old frets and planing the fingerboard. After this was done it was re-fretted with Fender Vintage-style frets. There are some repair spots as can be seen in the photos but the backside is super smooth and it almost feels wider and more modern than my '65 Mustang. It could possibly be that Fender had changed the profile at this point. The entire neck was refinished and given a brand new bone nut. The first and last four fingerboard dot markers were replaced. At one point the headstock was drilled out for modern tuners so adapter bushings were fitted so the original F tuners could go back on. The two bass tuners are slightly bent but they can all be used with a winding tool and work perfectly. This guitar has a well worn look to it for a good reason. As you can see it has been played over the years. The body has many dings and there is some wear on the part that your arm goes over when sitting in your lap -- it has a strange orange peel texture to it. There are also faint stripes that can only be seen in the light. This was either from tape or someone had it resting in a case against a strap. Either way this makes it super cool looking and gives it excellent patina. One more note regarding the finish: there is “checking” in the finish at random places as well – which to me is also really cool (see pics). The tailpiece is original and in great condition. The bridge has been replaced with a Jazzmaster unit. This was done because Mustang bridges don't have individually adjustable saddles and Jazzmasters do. This is a common modification. The neckplate on this guitar is original and dates to early '66. The pickguard and control plate are also original. The electronics however have been changed. The pickups were hand wound with the neck being RWRP for hum cancelling. They are hotter than the originals while putting out around 6.5K ohms on the meter. The pots are 1 Meg CTS dating to 1966. The switches are NOS original equipment so you don't have to worry about them crapping out during a show. ITEMIZED RECAP: Original parts: Dakota Red Finish, body Neck plate Pickguard Control plate Tailpiece Pots (see above) Original, but had work: Neck, dated 16MAR66B (see pic), new vintage-style frets, refinished; see above. As noted, A LOT of work was done for maximum playability. Tuners (modern tuners were once installed, but original tuners were re-installed) Replacement items: Bone nut (see above for all neck work done) First and last four fingerboard dot markers Bridge (replaced with Jazzmaster unit, see above) Pickups (hand-wound, see above) Switches (NOS, see above) New, “pre-aged” Fender strap and new strap locks (old strap holders are in case) Non-original hard shell case, specially sized for a Mustang – has never left my house Almost forgot the tremolo arm: this is a knock-off I bought after buying the guitar, but I stopped using it because it falls out too easily. (Please note: I forgot to take a pic of it, but you will find it in the case compartment when you receive the guitar.) --The Usual Details-- PayPal only. Sold as-is. No returns. It will be well packaged and fully insured. I will only ship to the 48 contiguous United States (i.e. not to Alaska or Hawaii -- or anywhere else in the world). I will ship it within 24 hours of receiving payment. I reserve the right to cancel any bids to low feedback bidders (less than 10) and/or bidders whose feedback percentage is uncomfortably low. Email me first if this applies to you. Please ask all questions BEFORE bidding. The description is highly detailed and the pics are good, but if you need more pics of a particular area, just let me know and I'll take them for you. So, please understand what you are bidding on before you place a bid.", "ItemID": "333015199522", "EndTime": "2019-01-21T18:54:37.000Z", "StartTime": "2019-01-14T18:54:37.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1966-Fender-Mustang-Dakota-Red-white-pearl-pickguard-/333015199522", "ListingType": "Chinese", "Location": "Rockwall, Texas", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/3330151995228080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/OTY2WDE2MDA=/z/KUAAAOSwl7dcPNDN/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNDUz/z/ADkAAOSwjoFcPNDh/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTExMlgxNjAw/z/NkoAAOSw~D5cPND0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMTcy/z/gJEAAOSwztVcPNEJ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNTUy/z/wJUAAOSw2hxcPNEW/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA4NFgxNjAw/z/UWEAAOSwptZcPNEh/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA4MFgxMDAw/z/hc8AAOSwAopcPNEr/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE1OVgxMDAw/z/2fIAAOSwtaBcPNEy/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAwMFgxMzA2/z/teoAAOSw11BcPNE7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjQ2/z/L5UAAOSwK9ZcPNFJ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjc1/z/H7cAAOSwjW9cPNFS/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/xNIAAOSwZqlcPNFb/$_57.JPG?set_id=8800005007"], "PostalCode": "75087", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "sixty6tele", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 379, "PositiveFeedbackPercent": 100.0}, "BidCount": 2, "ConvertedCurrentPrice": {"Value": 812.5, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 812.5, "CurrencyID": "USD"}, "HighBidder": {"UserID": "w***w", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 159}, "ListingStatus": "Completed", "QuantitySold": 1, "ReserveMet": true, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "1966 Fender Mustang, Dakota Red, with white pearl pickguard", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["1966"]}, {"Name": "Product Line", "Value": ["Fender Mustang"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}]}, "HitCount": 271, "Subtitle": "FREE SHIPPING! LOW RESERVE", "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 822.5, "CurrencyID": "USD"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "ConditionDescription": "See detailed description and pics.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}