{"BestOfferEnabled": false, "Description": "--> Epiphone Les Paul Standard Electric Guitar (Cardinal Red) Used This item is slightly used and has been thoroughly checked out by our experts to make sure it is in perfect working condition. We then re-sealed it in its original packaging with all factory included accessories. This item is guaranteed to be in \"as new\" condition and has virtually no cosmetic imperfections. This item is covered with a one year warranty from Sam Ash. Epiphones history with legendary guitarist and innovator Les Paul dates back to the early 1940s when Les, working late at night at the Epiphone factory on 14th Street in New York City, created what might have been the worlds first solidbody electric guitar, better known as \"The Log.\" Over the years, Les continued to work closely with Epiphone luthiers reviewing new product ideas and offering suggestions. Epiphone always made a good guitar, Les often said.The Epiphone Les Paul Standard has all of the features that have made the Les Paul one of the icons of rock. It has the same set neck construction as any of the classic Gibson Les Pauls, so that the neck and body act as a single piece of wood. This, along with the dense mahogany body with a maple top gives the Epiphone Les Paul Standard the rich tone and long sustain players have come to expect from a fine Les Paul guitar. You also get the classic look of white binding around the body and neck.Like other classic Les Pauls, the Epiphone Les Paul Standard has a pair of great sounding humbucking pickups with powerful Alnico V pickups and the classic trapezoid configuration of two volume and two tone control knobs. This lets you make fast tone and volume adjustments while holding a note. Its chrome hardware includes the famous Tune-o-matic bridge/Stopbar tailpiece combo for monstrous sustain and quality Grover tuning machines. Case not included. Features: Body: MahoganyNeck: Hand-set, mahoganyScale: 24.75Fingerboard: RosewoodFingerboard Inlay: TrapezoidNut Width: 1.68Neck Pickup: Alnico humbuckerBridge Pickup: Alnico Classic humbuckerTailpiece: Locking Tune-o-matic StopbarMachine Heads: GroverCase: Not includedWhen you get your Epiphone Les Paul Standard from Sam Ash Direct, you get the guaranteed lowest price and fast, free shipping. You also get the security that comes from our more than 85 years of experience and our 45/60 day return/price protection policy. What are you waiting for? Shipping Information Your gear will ship out within 2 days of order confirmation. At this time we can not ship PO Boxes, APO and FPO locations. Industry Leading 45-Day Return Policy We stand by the products we sell, and we'll certainly stand by you as well! We truly appreciate your business, and we want you to be 100% happy with your purchase. However, we know that one of the drawbacks of internet shopping is that you can't try something before you buy it. That's where our money-back guarantee comes in. If you are not completely satisfied with an item, for any reason, you can return it within 45 days of the shipping date for a complete refund of the merchandise price.* Have a question about your order? A Sam Ash Customer Service specialist is available to help! Call 800-472-6274, Monday - Saturday, from 10:00AM - 6:00PM EST. Due to the complexity of international shipping, we are unable to accept any returns on international orders. Before making a purchase outside of the United States, please know that products sold by Sam Ash use the standard 120V/60Hz voltage standard. Sam Ash is not responsible for any damage caused by not adhering to the voltage requirements. *All returns must be within 45 days of the date the item was shipped. Please do not accept any shipment if the packaging appears damaged in any way. We strongly suggest that you check your order after receiving it to be sure that it is in proper working order. Returned items must be in resalable condition. Resalable Condition means that the product(s) is exactly in the same condition as you received it. All exchanges must be pre-paid, returned in original packing, complete with blank warranty cards, owner's manual and show no sign of wear or abuse. In the event that the product is not in the same condition as you received it you may be subject to a minimum 15% restocking fee, repair charge or disqualification. Shipping and handling charges are non-refundable. Please call our Customer Service department if you have any questions about returning an item. CDs, DVDs, video tapes, sheet music, books, strings, computer hardware/software, drum heads, harmonicas, mouthpieces, sound cards, microphones, raw speakers, studio furniture, blank CDs/Tapes or Special Orders are not covered by this return policy.", "ItemID": "173798599214", "EndTime": "2019-02-19T01:36:33.000Z", "StartTime": "2019-02-17T16:38:45.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Epiphone-Les-Paul-Standard-Electric-Guitar-Cardinal-Red-Used-/173798599214", "ListingType": "FixedPriceItem", "Location": "Tampa, FL", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1737985992148080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTY5WDUwMA==/z/QbgAAOSw-JtcZLgT/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTY1WDUwMA==/z/A9gAAOSwwnVcZLgT/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MzgxWDUwMA==/z/IPwAAOSwe9tcZLgT/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MzQ3WDUwMA==/z/segAAOSwW4hcZLgT/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDk4WDUwMA==/z/p2IAAOSwMtJcZLgT/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MjI3WDUwMA==/z/89IAAOSwXNdcZLgT/$_1.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "samashdirect", "FeedbackRatingStar": "PurpleShooting", "FeedbackScore": 59073, "PositiveFeedbackPercent": 99.3, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 368.88, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 368.88, "CurrencyID": "USD"}, "HighBidder": {"UserID": "i***i", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 7}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Epiphone Les Paul Standard Electric Guitar (Cardinal Red) Used", "HitCount": 26, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1111655870", "StoreName": "Sam_Ash_Music_Direct"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "DiscountPriceInfo": {"OriginalRetailPrice": {"Value": 832.0, "CurrencyID": "USD"}, "PricingTreatment": "STP", "SoldOneBay": false, "SoldOffeBay": false}, "ExcludeShipToLocation": ["Alaska/Hawaii", "APO/FPO", "US Protectorates", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "ConditionDescription": "Like New", "QuantitySoldByPickupInStore": 0, "SKU": "ENSRCCH1X", "NewBestOffer": false}