{"BestOfferEnabled": false, "Description": "Description You are looking at a 2002 Gibson SG Electric Guitar.This guitar is a survivor and has been played over the years. As you can see, it is in good cosmetic and sonic condition but has dings and imperfections in spots as shown. The guitar also includes a soft gig bag (not shown). It sounds awesome and both pickups work well. This is an exceptional guitar and USA made. Please scroll down and enjoy the 50+ photos. If you cannot view all the photos, please click here. Condition Report: Cosmetically, it is clean but does have some rash on the back, as well as various dings and dents as shown. We have no way to determine conclusively if the finish is original and there are no neck repairs. Inspections are encouraged on all vintage instruments and we included a wealth of photos to also help. Please review all the photos before bidding. Sonically, it plays well, the neck is fairly straight, and both pickups work. The action is great but as with any guitar, setup is personal taste and may be in need of adjustment or setup. The stand is not included. The patina and mojo are outstanding. We can ship this guitar worldwide and will pack it extremely well. We are very well versed at packing and shipping, and we can ship both USPS and FedEx Great Rate for very competitive rates. We are happy to quote shipping - just drop an email with your postal code or use the eBay shipping calculator. Best of all, we are selling this instrument at NO RESERVE. We will let the market determine the value of this RARE piece. Best of luck in the auction. Photographs The full catalog of photographs appear below the text. Please make sure to scroll down to the bottom of the page to view all the photograph before bidding on the item. General Shipping Information We offer alternative shipping methods, depending on the item and shipping destination, that includes the following: Local pickup of the item is welcome at our Waukesha, Wisconsin location Bidders from Illinois, Iowa, Minnesota, Missouri (St. Louis area only), Nebraska, North Dakota, South Dakota and Wisconsin we can offer you less expensive shipping through a local carrier. Please contact us with your postal code for a quote. International Bidders bidding on items too large to be shipped through USPS services. Please contact us with your postal code for FedEx Great Rate shipping quotes. US bidders on coin operated items can contact North American Van Lines at 1-800-959-8880 and choose option #2 for the eBay/Gaming Team for blanket wrapped shipping service. We have used North American Van Lines in the past with great success. International bidders on items too large for package services can obtain a quote for crate packing and boat shipping to most any destination. We routinely ship to Australia, Austria, The Netherlands, The UK, Germany, France, Belgium, Italy, Hong Kong, China, South Korea, Taiwan, Singapore and Japan. International bidders note that shipping quotes import duties, taxes and charges are not included in the item price or shipping cost. These charges are the buyer's responsibility. Please check with your country's customs office to determine what these additional costs will be prior to bidding or buying. Auction Terms Due to the age and no control over the future use of this item, it is sold strictly as-is as-shown without warranty expressed or implied. We also reserve the right to cancel bids from bidders with excessive negative feedback. You are welcome to schedule an appointment to inspect this item in person while the auction is running. We are not responsible for any small detail left out of the description as we are a consignment store and not experts on the items we list. Please e-mail us with shipping questions or concerns prior to bidding. International bidders, it is against the law to falsify customs documents. Please do not ask us to do so. We need to mark the customs form with the item sold and amount paid for the item at auction end. Payment Terms For items sold to Wisconsin residents or picked up locally we are required to collect Wisconsin sales tax. Any item needs to be paid in full within 3 days if paying by PayPal. Unpaid item cases will be opened with eBay for payments not received within the payment period Would you like us to sell your items? Discover why our experience, reputation, and education makes The Sell It Now Store the premiere auction consignment company. It takes more than an eBay account to sell successfully at or above market value. Creating the right environment to maximize value includes: Access to global niche markets for specialty items Item valuation and online research High quality digital photography in our state-of-the art studio Convenient location for item drop-off Secured and insured storage facilities Turn-key corporate training and liquidation services", "ItemID": "233062508425", "EndTime": "2018-12-31T02:20:01.000Z", "StartTime": "2018-12-24T02:20:01.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Vintage-2002-Gibson-SG-Electric-Guitar-USA-Made-Musical-Instrument-Axe-/233062508425", "ListingType": "Chinese", "Location": "Waukesha, Wisconsin", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/2330625084258080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg3NjM=/z/CbsAAOSwR0dcHmFT/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTQxMlg3Njg=/z/aEQAAOSwVAtcHmHT/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTM4MFg3Njg=/z/fPoAAOSwnjZcHmHV/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIzMVg3Njg=/z/CdUAAOSwlThcHmHW/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTk0WDc2OA==/z/xGcAAOSw2pBcHmHX/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA5NFg3Njg=/z/vtUAAOSwfhlcHmHY/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTI0Mlg3Njg=/z/PiMAAOSwPVFcHmHZ/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/Mzc5WDc2OA==/z/I5cAAOSwMflcHmHa/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NTI5WDc2OA==/z/BR4AAOSwEJ1cHmHa/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MzMxWDc2OA==/z/AysAAOSwCWNcHmHb/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NDg2WDc2OA==/z/3UcAAOSwZddcHmHc/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NTc2WDc2OA==/z/9BkAAOSwEHhcHmHd/$_12.JPG?set_id=880000500F"], "PostalCode": "53187", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "midwest-sellitnowstore", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 10573, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 68, "ConvertedCurrentPrice": {"Value": 520.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 520.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "s***d", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 83}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "Vintage 2002 Gibson SG Electric Guitar USA Made Musical Instrument Axe", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Brown"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Manufacturer", "Value": ["Gibson"]}, {"Name": "Model", "Value": ["SG"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "UPC", "Value": ["Does Not Apply"]}]}, "HitCount": 1974, "Subtitle": "One local owner, hardly played, no reserve!", "PrimaryCategoryIDPath": "619:3858:33034", "SecondaryCategoryID": "118985", "SecondaryCategoryName": "Musical Instruments & Gear:Vintage Musical Instruments:Vintage Guitars & Basses:Electric Guitars", "SecondaryCategoryIDPath": "619:181162:181163:118985", "Storefront": {"StoreURL": "https://stores.ebay.com/id=74629587", "StoreName": "Midwest-Sell It Now Store"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 530.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["US Protectorates", "APO/FPO", "Africa", "Central America and Caribbean", "South America", "AF", "AM", "AZ", "BD", "BT", "GE", "KZ", "KG", "MV", "MN", "NP", "PK", "RU", "LK", "TJ", "TM", "UZ", "AS", "CK", "FJ", "PF", "GU", "KI", "MH", "FM", "NR", "NC", "NU", "PG", "SB", "TO", "TV", "VU", "WF", "WS", "AL", "AD", "BY", "BA", "HR", "CY", "CZ", "EE", "GI", "GG", "HU", "JE", "LT", "MK", "MT", "MD", "ME", "RO", "SM", "RS", "SK", "SI", "SJ", "UA", "BH", "JO", "KW", "LB", "OM", "QA", "SA", "TR", "AE", "YE"], "GlobalShipping": false, "ConditionDescription": "Cosmetically, it is clean but does have some rash on the back, as well as various dings and dents as shown. We have no way to determine conclusively if the finish is original and there are no neck repairs. Inspections are encouraged on all vintage instruments and we included a wealth of photos to also help. Please review all the photos before bidding. It is being sold as-is. Sonically, it plays well, the neck is fairly straight, and both pickups work. The action is great but as with any guitar, setup is personal taste and may be in need of adjustment or setup. The stand is not included. The patina and mojo are outstanding.", "QuantitySoldByPickupInStore": 0, "SKU": "1", "NewBestOffer": false}