{"BestOfferEnabled": true, "Description": "Mint 2016 ES-335. Lived it's life in a case. Played twice in my home, stored in my humidity controlled music room. Comes with COA, original sales receipt from American Musical Supply when I purchased in 2016. Warranty was registered with Gibson at time of receipt. Burstbucker pickups. This faded lightburst finish shows the grain nicely and the cream bindings have a nice vintage color. This is both a looker and a tone monster. With factory case and will ship in original Gibson box. $50 flat shipping for CONUS 48 via Fedex Ground. Please, no offers. Specs from Gibson: The ES-335 has been a legendary tone machine since 1958. Gibson’s 2016 model features a tubeless Historic truss rod, PAF-style Burstbucker 1 and 2 pickups, and redesigned neck shape for increased strength and enhanced playing comfort. Gibson 2016 ES335 Block Nickel Hardware Features F-Hole emblem engraved truss rod coverBone nutBlock inlay fretboardGrover Milk Bottle Rotomatic tuners – a better quality tuner with 18:1 ratio and historic lookRedesigned neck dimensions for improved strengthHistoric truss rod give improved neck adjustability and tension resilienceRolled neck binding for a more comfortable feelABR-1 Bridge with titanium SaddlesBurstbucker 1 and 2 pickups: Pickups are calibrated for each position for balanced output & brighter sound (closer to original PAF’s)Neck pickup capacitor changed from .022mF to .016mF (less treble cut than previous capacitor resulting in a tone with a singing quality)Locking stop bar tailpiece for improved sustain and vibration transferHardshell Case IncludedProduct Specifications Gibson 2016 ES335 Block Nickel Hardware Specifications Top Wood: 3-Ply Plain Maple, Poplar, MapleTop Binding: CreamBack Wood: 3-Ply Plain Maple, Poplar, MapleBack Binding: CreamRims Wood: 3-Ply Plain Maple, Poplar, MapleBody Contour Carve: ES (Semi-Hollow)Neck Wood: 1 Piece MahoganyTruss Rod: HistoricNeck Profile: Rounded ‘C’Thickness at Fret 1: 21.59 mm / .850 inchThickness at Fret 12: 24.13 mm / .950 inchPeg Head: SP-1Peg Head Inlay: Mother of Pearl CrownPeg Head Logo: Mother of Pearl ‘Gibson’Nut: WhiteNut Material: BoneNut Width: 4.2863 cm / 1.6875 inchesFingerboard Wood: 1 Piece RosewoodFingerboard Radius: 30.48 cm / 12 inchesFrets: 22Nut/End of Board: 4.2863 cm / 1.6875 inch at nut, 5.2375 cm / 2.062 inch at end of boardScale Length: 62.865 cm / 24.75 inchesFingerboard Binding: CreamSide Dots (Color): BlackFingerboard Inlays: Pearloid BlockPickups: Burstbucker 1 and Burstbucker 2Tuning Keys: Milk Bottle Grover RotomaticTuning Ratio: 18:01Bridge: ABR-1 with titanium saddlesTailpiece: Locking Stop BarOutput Jack: 1/4 inch monoStrap Buttons: AluminumPick Guard: Multi ply black ES-335Truss Rod Cover: Black and white bell with engraved F-HoleKnobs: Black Top Hat Semi-acoustic construction Since 1958 the \"semi\" has proved itself richly toneful while retaining excellent sustain and good feedback reduction Small-block elegance Capturing the desirable look of the ES-335 of the early to mid '60s Redesigned neck By redesigning the dimensions, Gibson Memphis has improved the strength and playability of the new ES-335's necks Historic truss rod Our historic truss rod has no tube, a proven known to enhance the guitar's resonance and sustain Burstbucker pickups Burstbucker 1 & 2 pickups are made in the image of the hallowed PAF humbucker, with a little extra power in the bridge position Titanium saddles Durable titanium bridge saddles enhance sustain, presence and clarity Locking stopbar tailpiece A locking stopbar tailpiece improves vibrational transfer to maximize sustain High-gloss nitro finish Gibson Memphis has mixed more vintage-correct finish colors, all hand buffed to a high sheen Body: Classic semi-hollow construction with solid center block Fingerboard: Rosewood with small block inlays Neck: Redesigned dimensions for improved strength and feel Truss rod: Historic truss rod Pickups: Burstbucker 1 & 2 Bridge: ABR-1 with titanium saddles Tailpiece: Locking stopbar Finish: High-gloss nitrocellulose lacquer in more accurate vintage colors Normal 0 false false false EN-US X-NONE X-NONE", "ItemID": "283364736787", "EndTime": "2019-02-04T02:09:31.000Z", "StartTime": "2019-02-03T22:34:52.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-Memphis-2016-ES-335-Electric-Guitar-Faded-Lightburst-/283364736787", "ListingType": "FixedPriceItem", "Location": "Minneapolis, Minnesota", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2833647367878080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/FJgAAOSwb-1cQ4n2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/M0MAAOSwMQ1cQ4n7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/9LUAAOSwVXdcQ4n-/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/soYAAOSwpLdcQ4oB/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/1FUAAOSwyshcQ4oE/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/FWQAAOSwj91cQ4oI/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/NsAAAOSwR3tcQ4oM/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/BPsAAOSwXepcQ4oP/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/3JIAAOSwlfNcQ4oS/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/mjgAAOSw6~pcQ4oV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/HrYAAOSwg0dcQ4or/$_57.JPG?set_id=8800005007"], "PostalCode": "55445", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "kragness.glen", "FeedbackRatingStar": "Red", "FeedbackScore": 1040, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 2450.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2450.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "b***s", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 0}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson Memphis 2016 ES 335 Electric Guitar Faded Lightburst ", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Body Type", "Value": ["Semi-Hollow"]}, {"Name": "Model", "Value": ["ES-335"]}, {"Name": "Body Color", "Value": ["Faded Lightburst"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["2016"]}, {"Name": "Soundboard Style", "Value": ["Archtop"]}, {"Name": "Product Line", "Value": ["Gibson ES"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}]}, "HitCount": 34, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Mint in every way.  Virtually unplayed, no marks or swirls", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}