{"BestOfferEnabled": true, "Description": "B.B. King Signature 2005 Gibson LUCILLE BLACK Electric Guitar w/ hard case used >> --> >> --> Description YAMAHA APX1200ⅡElectric Guitar Used with Hard Case From Japan Free Shipping There are fine scratches, but it is in very good condition.Please check photos that show the main damages and flaws on the item [Spec] YAMAHA / APX 1200 IIColor: Natural / grain type Condition: B +: No problem in usual use Top plate material: Spruce side plate material: Rosewood back plate material: Rosewood body size: Other serial number: HJX121500 Accessory: Semihard case included Product description Yamaha's classic electric aeroco is in second hand.Easy to hold with thin body body, handling is also preeminent with small shape.Scratches are present in the entire body. There is a feeling of use.There is no problem in performance. Neck: Almost straightTruss rod: With roomFret: More than 80% leftSemi-hard case included6 months warranty includedString replacement, fret cleaned Read Before Shopping ・We won't undervalue merchandise or mark the item as a gift on customs forms. Doing that is against U.S. and international laws.・We only ship to PayPal registered address.・Please contact us if you reside in countries in which we do not specify shipping service and cost.・Please ask us any questions you may have before bidding.・Also, please see the pictures as they are part of the description.If there is any condition that don't mention, ask us before bid please, we don't accept any reason (for example condition don't mention in photos or description) to return or refund after bid.・We are happy to answer all questions.・This product is also available at Japanese EC sites.We will update as soon as possible, but if this product is sold on another EC site before this is sold on eBay, we are very sorry, but we will cancel the transaction on this site. Please kindly cancel the order if this happens. Please feel free to contact me if you have any questions. ※Please contact us before you leave a negative or neutral feedback after your purchase.※If you have any problems, please let us know as soon as possible. We are ready to solve your problems immediately. Please read [International Buyers -Please Note] on the bottom. PaymentWe only accept PayPal payments. Please pay within 5 days after auction is finished. shipping Shipping DurationShipping MethodAsia, Middle EastAmerica,Canada Australia,MexicoEurope RussiaOtherEMS3 - 6 days4 - 6 days3 - 5 days4 - 6 days We will ship to world wide by EMS (Insured, Trackable, Including handling cost.) EMS (takes 4~7 days, includes with insurance & a tracking number). EMS (Express Mail Service) is international mailing service by Japan Post Office. We will ship your item within 3-5 business days, after your payment. We can ship ONLY to your Paypal address. Term of SaleWe can accept return within 30 days after you receive it. Please make sure to contact us first if you want to return it. It is buyer's responsibility for the return shipping cost when sending back the item to us. The item has to be returned in the original condition from the time you received. No returns on products that show any evidences of use.About UsA specialty shop offering a wide variety of carefully selected Japanese brand items. Unless marked \"used\" all of our inventory is brand new, so you can feel confident about your purchase. Even if you think to yourself, \"But the item I want is only available in Japan.\", make sure to consult with us before giving up hope. We will look for and suggest the best products on your behalf.International Buyers - Please Note:Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer''s responsibility. Please check with your country''s customs office to determine what these additional costs will be prior to bidding/buying. These charges are normally collected by the delivering freight (shipping) company or when you pick the item up - do not confuse them for additional shipping charges.STK-S4m　(Rear) Seymour Duncan TB-5PARTS COLOR: ChromeCONTROLS: Master Volume, Master Tone, 5Way Lever PU SelectorOVATION1281 Preacher '78 CHItem code: 585753Non original original case includedom Japan Free ShippingYAMAHA SA2200 VS Used Electric Guitar with Soft Case From Japan Free Shipping", "ItemID": "223286524031", "EndTime": "2019-01-01T03:05:58.000Z", "StartTime": "2018-12-16T07:37:26.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/YAMAHA-APX1200-Electric-Guitar-Used-Hard-Case-Japan-Free-Shipping-/223286524031", "ListingType": "FixedPriceItem", "Location": "Saga City", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2232865240318080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/ODUzWDEyODA=/z/sWQAAOSwCNlcFf8M/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI3OFgxMjc4/z/VCoAAOSwqoxcFf8D/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODUzWDEyODA=/z/sukAAOSwXitcFf7~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODUzWDEyODA=/z/71YAAOSwOHpcFf8A/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI3OFgxMjc4/z/QgcAAOSw1rpcFf8G/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODUzWDEyODA=/z/SugAAOSwlkpcFf8I/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODUzWDEyODA=/z/eXMAAOSwHGxcFf8K/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODUzWDEyODA=/z/b~YAAOSwIKNcFf8O/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODUzWDEyODA=/z/SvEAAOSwlkpcFf8Q/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODUzWDEyODA=/z/wP8AAOSwmE5cFf8S/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODUzWDEyODA=/z/Ff4AAOSwALpcFf8W/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODUzWDEyODA=/z/ghcAAOSwuZVcFf8U/$_57.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "japanplaza-toshiaki", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 152, "PositiveFeedbackPercent": 98.4}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1100.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1100.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "u***g", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 6}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "YAMAHA APX1200ⅡElectric Guitar Used with Hard Case From Japan Free Shipping ", "ItemSpecifics": {"NameValueList": [{"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Brand", "Value": ["YAMAHA"]}, {"Name": "Model", "Value": ["APX1200Ⅱ"]}, {"Name": "Body Color", "Value": ["Nature"]}]}, "HitCount": 20, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "JP", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "60 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 5, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["APO/FPO", "Africa", "JP"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}