{"BestOfferEnabled": false, "Description": "MIJ, made in japan, Gibson, Lespaul, White, SG, Höfner, Duesenberg, Ibanez, ATELIER Z, ARIA, ESP, Caparison, Killer, COMBAT GUITARS, GUYATONE, Greco, Sugi Guitars, TEISCO, DEVISERA, Nil, Bacchus, VANZANDT, Fernandes, Fender Japan, Fujigen, MOON GUITARS, momose, Yairi Guitar, YAMAHA, TOKAI, Zemaitis, VOX, B, C, Rich, Epiphone, Gibson, Gretsch, Suhr, Schecter, Charvel, Jackson, Dean, Tom Anderson, Fender, Paul Reed Smith, Melancon, Mosrite, Rickenbacker, Robert Benedetto, Washburn, Ibanez, kramer, EDWARDS, Burny, Grassroots, 2013 Bacchus BLS-700CS All Original ~ LIMITED model / Deep Joint ~Excellent Condition !!Made in China Down from here. Photo is dent and scratches, etc.. About scratches that are hard to see. To make it easy to understand the condition of the scratches, I lighted the light strongly. 2013 Bacchus BLS-700CS All Original ~ LIMITED model / Deep Joint ~Excellent Condition !!Made in China Body Maple Top, Mahogany Back. Neck Mahogany, Deep Joint. Scale 22F. 24.75inch (628mm), Gibson Medium Scale. Nut Width About 1.69inch (43mm). Pickup Neck : Bacchus HBC1N-ZF. Bridge : Bacchus HBC1B-ZF. Control 2Volume, 2Tone, 3Way Toggle-SW. Bridge Tune O Machic Stop Tailpiece. Machine heads Bacchus Original. Color Cherry Sunburst. Weight About 7.32pound ( 3.32Kg ) This is Used Guitar. I was shooting a lot of photos. Please confirm with a photograph. PRE-LOVED. Former owner is woman. Long time, It has not been used. It was sleep in warehouse. That evidence are the Frets and very little scratches of the body. The remaining amount of the Frets are many. You do not have to change the frets for some time. It keeps Excellent condition ! It has a shine like a brand new guitar. It is a LIMITED model not listed in the japanese catalog. The usual UNIVERSE Series is Flame Maple Top or Quilted Maple Top. However this model is Maple Plain top. I can say very rare model. And this Maple Plain Top is very beautiful. You can see the birds eye in the maple top by see angle. It was manufactured in 2013. Bacchus dispatched the japanese guitar craftman to china. In that management, Bacchus UNIVERSE Series has made in china. Therefore making is very polite. Dielectric paint has been painted in a wide range. Bacchus is Japanese Brand. Reputation in Japan, very good at high quality. Enjoy the Les Paul sound of High quality. About guitar play, Current state, the space between the strings and the frets is standard. And, remaining amount of the Frets are many. Thanks to that, I feel easy to play the guitar. This Bacchus is Deep joint. Therefore Un pluged sound is very loud. You can feel vibrations transmitted to the body. The pickups are Bacchus original. It gives very good distortion sound and clean sound. It can say that it can correspond to various music. Let's enjoy Bacchus ! It is cleanliness. I polished with guitar exclusive polish, so it is in a very clean state. I after the finger board cleaning, painted beeswax. The aim is moisturizing and and protection. Current neck condition, very good ! roughly straight ! There is no problem with the Truss rod and it can be adjusted. Remaining Frets are 95% on average. You can play immediately after it is delivered to you. I was set new strings. Regular tuning. ( Inch : 009, 011, 016, 024, 032, 042 )Guitar playing, is comfortable. All is working well. It is in a very good condition. The Truss rod Wrench is not included. All Original.Note : I changed the bridge's tone pot and the output jack to new one. The strap pin has been changed to the lock type. Look at the photos, please verify by yourself! It will be professionally pack. Double air packing. And ships inside a sturdy cardboard box. This electric guitar is USED. Please consider it when bidding. Thank you. Payment I accept PayPal only. Please pay within 3 days after the auction closed. Shipping Worldwide shipping from Japan! EMS / Shipping includes a tracking number. / / / Destination cost Delivery time / / / Asia : $1004 ~ 7daysUS Canada : $1205 ~ 8 daysEurope : $1406 ~ 10 daysOceania : $1205 ~ 8 daysSouth America : $2408 ~ 12 days This item is shipped within 3 business days after payment is confirmed. Terms of Sale International buyers - Please Note: Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer's responsibility. Please check with your country's customs office to determine what these additional costs will be prior to bidding/buying. These charges are normally collected by the delivering freight (shipping) company or when you pick the item up -do not confuse them for additional shipping charges. Please contact us first with 30 working days for any returns, Buyer pays shipping cost from buyer's country to Japan when being returned. In case of return, the shipping cost won't be refunded. We sell various kinds of Japanese products to international customers. Our goal is to provide the best quality products and service and your satisfaction is the most important to us. Happy bidding!! Thank you !!", "ItemID": "254123562372", "EndTime": "2019-02-21T05:00:04.000Z", "StartTime": "2019-02-14T05:00:04.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2013-Bacchus-BLS-700CS-All-Original-LIMITED-model-Deep-Joint-Excellent-/254123562372", "ListingType": "Chinese", "Location": "Nagoya-shi,Kita-ku, Aichi", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2541235623728080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTMxNVgxNjAw/z/g5MAAOSwsixcZOrP/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/uIgAAOSwmThcZOra/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/200AAOSwHN9cZOrj/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/HA0AAOSwgW9cZOro/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/Ni4AAOSwDXFcZOrx/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/pSIAAOSwHSVcZOr3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/I9oAAOSwmPFcZOsC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/B6AAAOSwEwNcZOsG/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE4MFgxNjAw/z/j3YAAOSwohVcZOsP/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/fGsAAOSwd5xcZOsW/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg2MDI=/z/tLkAAOSw~9JcZOsm/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg1OTc=/z/O3UAAOSwn2pcZOs8/$_57.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jguitar-shop", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 376, "PositiveFeedbackPercent": 100.0}, "BidCount": 3, "ConvertedCurrentPrice": {"Value": 198.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 198.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": ".***l", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 682}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Americas", "Europe", "Asia", "AU"], "Site": "US", "TimeLeft": "PT0S", "Title": "2013 Bacchus BLS-700CS. All Original. LIMITED model. Deep Joint. Excellent.", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Bacchus"]}, {"Name": "Model Year", "Value": ["2013"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Model", "Value": ["BLS-700CS"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["China"]}, {"Name": "Series", "Value": ["Original"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Cherry Sunburst"]}, {"Name": "MPN", "Value": ["13386"]}]}, "HitCount": 262, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "JP", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 200.5, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["APO/FPO", "Africa"], "GlobalShipping": false, "ConditionDescription": "Excellent Condition. This is Used Electric Guitar. The electric guitar when connect to the amplifier, sound output is normal. There are scratches and Dent. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. Please Read the descriptions for details.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}