{"BestOfferEnabled": true, "Description": "Danelectro 56-U2 Reissue This U2 Reissue in Beautiful Aqua- Marine Burst is a rare color and is in good condition with a couple small dings dents and scratches. Nothing major (see pics). Neck is straight and the frets are in very good condition with plenty of life left on them. All the electronics work as they should. Comes with soft case. COMPARE TO OTHERS ON EBAY SAME EXACT MODEL AND SAME COLOR AS OTHERS PRICED UP TO $800 (Search and see Now)BID NOW NO RESERVE 100% GUARANTEED SATISFACTION! 100% POSITIVE FEEDBACK FOR THE PAST 9 YEARS! -I SHIP FAST AS LIGHTNING THE SAME DAY, BID NOW ON THIS WAY COOL DANO GUITAR! The Danelectro U2 is a dual-pickup hollow bodied guitar made of Masonite and shaped similar to a Les Paul model guitar. It was originally made from the years 1956 to 1958 but was re-issued in the late 90s, in 2006 in a slightly modified form as the '56 Pro, and again in 2010-11 as the '56 Single Cutaway. This is the sought after model and the Aqua-Marine and Seafoam Green both fetch a higher price than bland solid color models.The sound of a U2 is distinctive of the Danelectro guitar, coming from its lipstick pickup which when both selected are wired in series rather than the more standard parallel used today by most big brands.Construction materials used by Danelectro in this period are quite unusual for guitar making. The U2's body is made of a poplar wood frame with Masonite used for both the top and back, with the side of the body being bound with creme colored vinyl. 56-U2 -Re-issue circa 1998-2001 YOU ARE GOING TO LOVE THIS GUITAR NO RESERVE BID NOW!It's no wonder that players who can own every variation of Fender Stratocaster, Telecaster or Gibson Les Paul own at least one Danelectro. There is simply no other guitar like a Dano!... If there is a sound you have been struggling to attain, play a Danelectro 56-U2 and you might discover that the sweet tone that has been eluding you is just two lipstick pickups and a semi-hollow body away. When Nat Daniel made the first Danelectro back in the mid-Fifties, could he have had any clue that his guitar would sound so great and play so majestically? Known for its amazing tone and \"signature sound,\" the U2 guitar was an instant hit when it first appeared in 1956. Thousands of recordings from the '50s and 60's feature its signature sound. Forty-something years later, the U2's sonic magic is superbly replicated in its new reissue incarnation, the 56-U2. Impressively, it's a near-perfect recreation of the original with \"Coke bottle\" headstock and exact replicas of the original's tuners. Just about everything here is identical to the original! This includes those beloved \"lipstick tube\" (so-named because of the originals actually used surplus lipstick tubes), single-coil pickups, the stacked, concentric knobs (combining volume and tone onto one pot); the heavy-duty, industrial-strength toggle switch, and an alloy bridge with a rosewood saddle. The 56-U2's hollowness provides a buxom acoustic voice; amplified, it's a bright, trebly guitar with ample harmonic overtones that cut through a mix. It's simply a great-sounding guitar that delivers jangle (using both pickups) and fatness (the typical front-pickup tone). The pickups kick out a Strat-like output, but with more midrange. The 56-U2 offers great playability and cool vintage looks!Specifications Body Hardboard top and bottom Neck Hard maple with rosewood fingerboard. Scale 25” Frets 21Body Width 42mm Headstock Width 15.5mm Nut Width 40mm Action 1.6mm high 'E' 18mm low 'E' Pickups Original style brass tube w/chrome plating Magnet – Original formula 50’s style Alnico magnet. By bidding, you agree iin any dispute buyer agrees to pay for return shipping.", "ItemID": "223285049130", "EndTime": "2018-12-22T01:58:54.000Z", "StartTime": "2018-12-15T01:58:54.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Danelectro-56-U2-Aqua-Marine-Burst-Electric-Guitar-BEAUTIFUL-PRO-SET-UP-/223285049130", "ListingType": "Chinese", "Location": "Houston, Texas", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2232850491308080_2.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/OTAwWDY3NQ==/z/m4sAAOSwE9pcAik7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDY3NQ==/z/-QMAAOSwwdNcAik8/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDY3NQ==/z/RvoAAOSw5tNcAik9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDY3NQ==/z/EVQAAOSwzXJcAik~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDY3NQ==/z/HLoAAOSwkHxcAilA/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAwWDY3NQ==/z/FnkAAOSwCWRcAilB/$_57.JPG?set_id=8800005007"], "PostalCode": "77055", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "ffle7120", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 278, "PositiveFeedbackPercent": 100.0}, "BidCount": 11, "ConvertedCurrentPrice": {"Value": 271.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 271.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "l***d", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 9}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Danelectro 56-U2 Aqua -Marine Burst  Electric Guitar BEAUTIFUL WITH PRO SET UP", "ItemSpecifics": {"NameValueList": [{"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Color", "Value": ["Aqua -Marine Burst"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Brand", "Value": ["Danelectro"]}, {"Name": "Model", "Value": ["56-U2"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Body Type", "Value": ["Hollow"]}, {"Name": "Exact Year", "Value": ["1998"]}, {"Name": "Pickup", "Value": ["Lipstick"]}, {"Name": "Accessories", "Value": ["soft case"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Modification Description", "Value": ["No modifications all Original"]}, {"Name": "Model Year", "Value": ["1998"]}, {"Name": "Features", "Value": ["Single Cut", "Volume Knob", "With Pickup"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Bundle Description", "Value": ["None All Original"]}]}, "HitCount": 318, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 276.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "ConditionDescription": "EXCELLENT CONDITION ESPECIALLY FOR A 20-YEAR-OLD GUITAR! Two small areas missing paint (see pics) FANTASTIC VINTAGE TWANG FROM THE DANELECTRO LIPSTICK PICKUPS. Beautiful Aqua-Marine Sunburst.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}