{"BestOfferEnabled": false, "Description": ">> --> >> --> Description >> --> The sound and making of domestically produced Burny Les Paul type in the 1980s are very reputable, this individual is also different from its reputation, I think that the state is good for the age. This is about 3.8 kg lightweight class of individualsThere are also left and right truss rods. I think there are 80% of frets. There is a shallow snake on the low fret side, but I think that it is not a serious grime like it affects pitch or performance.Of course it is a fret edge binding. The string is a new Elixir NanoWeb, with 10 to 46 gauge stretched.The pickup has been replaced with the rear only gibson burst backer. Because there is no tester, I do not know the type of burst backer, but not only winding strings but also plain strings are sticky, there is a clear distortion method where the core of sound remains It is with a soft case.There are fine scratches, but it is in very good condition.Please check photos that show the main damages and flaws on the item. Read Before Shopping •We won't undervalue merchandise or mark the item as a gift on customs forms. Doing that is against U.S. and international laws. •We only ship to PayPal registered address. •Please contact us if you reside in countries in which we do not specify shipping service and cost. •Please ask us any questions you may have before bidding.•Also, please see the pictures as they are part of the description.If there is any condition that don't mention,ask usbefore bid please, we don't accept any reason (for example condition don't mention in photos or description) to return or refund after bid.•We are happy to answer all questions. •This product is also available at Japanese EC sites.We will update as soon as possible, but if this product is sold on another EC site before this is sold on eBay, we are very sorry, but we will cancel the transaction on this site. Please kindly cancel the order if this happens. Please feel free to contact me if you have any questions. ※Please contact us before you leave a negative or neutral feedback after your purchase. ※If you have any problems, please let us know as soon as possible. We are ready to solve your problems immediately. Please read [International Buyers -Please Note] on the bottom. Payment We only accept PayPal payments. Please pay within 5 days after auction is finished. shipping Shipping Cost Shipping Method Asia, Middle East America,Canada Australia,Mexico Europe Russia Other Shipping Duration Shipping Method Asia, Middle East America,Canada Australia,Mexico Europe Russia Other EMS4 - 7 days4 - 9 days5 - 12 days8 - 12 days We will ship to world wide by EMS (Insured, Trackable, Including handling cost.) EMS (takes 4~7 days, includes with insurance & a tracking number). EMS (Express Mail Service) is international mailing service by Japan Post Office. We will ship your item within 5 business days, after your payment. We can ship ONLY to your Paypal address. Term of Sale We can accept return within 30 days after you receive it. Please make sure to contact us first if you want to return it. It is buyer's responsibility for the return shipping cost when sending back the item to us. The item has to be returned in the original condition from the time you received. No returns on products that show any evidences of use. About Us A specialty shop offering a wide variety of carefully selected Japanese brand items. Unless marked \"used\" all of our inventory is brand new, so you can feel confident about your purchase. Even if you think to yourself, \"But the item I want is only available in Japan.\", make sure to consult with us before giving up hope. We will look for and suggest the best products on your behalf. International Buyers - Please Note: Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer''s responsibility. Please check with your country''s customs office to determine what these additional costs will be prior to bidding/buying. These charges are normally collected by the delivering freight (shipping) company or when you pick the item up - do not confuse them for additional shipping charges.", "ItemID": "233049054978", "EndTime": "2018-12-19T22:15:59.000Z", "StartTime": "2018-12-16T04:38:11.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Excellent-1980s-Fernandes-Burny-Les-Paul-Custom-Electric-Guitar-soft-case-/233049054978", "ListingType": "FixedPriceItem", "Location": "Kyushu Japan", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2330490549788080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA4MFgxMDgw/z/2y4AAOSwkQhcFdaw/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA4MFgxMDgw/z/bBoAAOSwHjtcFdaZ/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA4MFgxMDgw/z/9vgAAOSwC8pcFdaj/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA4MFgxMDgw/z/W6UAAOSwfwpcFdac/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA4MFgxMDgw/z/K94AAOSws99cFdam/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA4MFgxMDgw/z/GWoAAOSws2RcFdaq/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA4MFgxMDgw/z/HFIAAOSwT2hcFdaf/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA4MFgxMDgw/z/osYAAOSwwqVcFdat/$_1.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "japanpremium-shuichi", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 271, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 579.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 579.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "0***0", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 105}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Excellent 1980s Fernandes Burny Les Paul Custom Electric Guitar with soft case", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fernandes Burny"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["Burny Les Paul Custom"]}, {"Name": "Model", "Value": ["Burny Les Paul Custom"]}, {"Name": "String Configuration", "Value": ["6 string"]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Model Year", "Value": ["1980s"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right Handed"]}, {"Name": "Non-Domestic Product", "Value": ["Yes"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}]}, "HitCount": 251, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1574466282", "StoreName": "japanpremium-shuichi"}, "Country": "JP", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "60 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 5, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "SKU": "20181216005", "NewBestOffer": false}