{"BestOfferEnabled": false, "Description": "Like new, one owner, limited edition 2012 Gibson Explorer Baritone six string electric guitar in Silverburst finish (manufacturers part # DSXBSBCH1). Comes as pictured with original hard shell case and original paperwork. Includes Dunlop strap locks with DSL black studded / black genuine leather adjustable strap. Currently set up in C tuning, also included with this guitar are three full unopened sets of D’Addario EXL148 extra heavy gauge nickel wound guitar strings (12, 16, 20, 34, 46, 60). This is guitar is in excellent, like new, condition. It has been played, so there are lite surface scratches and nicks throughout, but not really so noticeable at all. Sold as is with no returns accepted. Shipping inside the United States only. Please be patient for your item to ship, as I take great care in safely packaging to assure safe transport. It usually ships within 24-48 hours of receiving payment. Features Mahogany body Carved maple top Mahogany neck 28\" scale Preciosa fingerboard 496R neck humbucker 500T bridge humbucker 2 volume, 1 tone, 3-way toggle switch controls Tune-o-matic/stopbar Chrome hardware Here’s some extra details, as found on the Sam Ash website, where this guitar was originally purchased from in December of 2011. Explore Lowdown Guitar Tones! Gibson's Explorer Baritone solidbody electric guitar packs massive, low-tuned tones in a distinctively iconic design. It all starts with the mahogany body and comfortable set mahogany neck, which give the Explorer Baritone a rich midrange character and meaty sustain. Plug it in and you'll be astounded at the huge subterranean sounds you get out of this guitar's hot pair of humbucking pickups. From its impeccable construction to its top-grade components, the Explorer Baritone makes a perfect vehicle for lowdown sounds. Gibson Explorer Baritone Solidbody Electric Guitar at a Glance: Low-tuned Explorer Thunder Hot Pickups, Hot Sound Unbeatable Gibson Quality Low-tuned Explorer Thunder Gibson's Explorer Baritone solidbody electric gives you the best of both worlds: earth-shaking low-tuned tones plus a legendary guitar design. The Explorer has been embraced by hard rockers the world over for decades, and now you can rock those subterranean sounds with it! The Explorer Baritone's long scale, set-neck construction, and fast-playing neck combine to give you an unbeatable sonic weapon onstage or in the studio. Hot Pickups, Hot Sound Plug the Explorer Baritone into your amp and hang on tight! A pair of high-output humbuckers (a 496R in the neck position and a 500T at the bridge) give you all the oomph you'll need to hit your amp hard. Volume and tone controls let you shape your tones, while a 3-position toggle gives you a range of sonic options. Add the rich midrange and sustain you get from the Explorer Baritone's all-mahogany construction and you're in for massive tones, from a very distinctive axe. Unbeatable Gibson Quality When you strap on Explorer Baritone, you can feel the quality Gibson built into it. From the tonewoods to the rock-solid set-neck construction to the top-shelf hardware, this axe is made to do the job. Plus, Gibson threw in a deluxe hardshell case that fits the Explorer Baritone like a glove, so your dream axe stays safe and secure when you're on your way to your next gig. Gibson Explorer Baritone Solidbody Electric Guitar Features: A legendary Gibson solidbody with new lowdown character Hot humbucking pickups, for aggressive tones Solid mahogany body and preciosa-topped mahogany neck, for great midrange and sustain Stage-ready hardware keeps you in tune Perfectly fitted hardshell case, for safe transport and storage Gibson's Explorer Baritone takes an iconic solidbody guitar to outstanding new sonic lows!", "ItemID": "264091206042", "EndTime": "2018-12-23T22:49:38.000Z", "StartTime": "2018-12-16T22:49:38.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Limited-Edition-2012-Gibson-Explorer-Baritone-Silverburst-Guitar-w-OHSC-Papers-/264091206042", "ListingType": "Chinese", "Location": "Munster, Indiana", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2640912060428080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/bkcAAOSwRF1cFltS/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/mgwAAOSwb15cFltV/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/gmwAAOSwM6FcFltX/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/14UAAOSweiFcFlta/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/8IcAAOSwIddcFltc/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/OJoAAOSwiqBcFlth/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/0EcAAOSwIABcFltj/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/ucYAAOSw~D5cFltl/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/NvkAAOSw4vpcFl3m/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/IvUAAOSwkelcFl3o/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/crAAAOSwxL5cFl3r/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/O0QAAOSwVRBcFl3t/$_57.JPG?set_id=880000500F"], "PostalCode": "46321", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "djdfpc", "FeedbackRatingStar": "Purple", "FeedbackScore": 733, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 4, "ConvertedCurrentPrice": {"Value": 2100.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2100.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***c", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 112}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Limited Edition 2012 Gibson Explorer Baritone Silverburst Guitar w/OHSC & Papers", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Model", "Value": ["Explorer Limited Run"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Color", "Value": ["silverburst"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Model Year", "Value": ["2012"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Size", "Value": ["Full Size"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Style", "Value": ["Explorer"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}]}, "HitCount": 204, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 2125.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 5, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}