{"BestOfferEnabled": false, "Description": "Item DescriptionTitle:2008 2009 Limited Edition Washburn Custom Shop HM Series WV 546 Electric GuitarDescription:Washburn USA custom shop HM series WV 546 electric guitar in offfset flying V shape and in yellow color with no binding. Blue Book says these were only USA made in the Taxi yellow finish with the checkered bordering as the WV 548 in 2008-09? I have not seen another yellow one without the checkered bordering like this one. These guitars are apparently highly regarded as one of the best guitars ever produced for shredding. I believe this is a 2008 first year model but it may be a 2009 model; as the 2nd year in production 2009 the Washburn catalog showed the guitar as the WV 548; with more color finish options. These USA HM series guitars were offered in the Washburn catalog for only the 2008 09 production years; and they are the high end Washburn USA custom shop made model and not the later cheap dumbed down imported version without the patented Parker carbon glass composite fretboard or stainless steel frets. Washburn Guitar company which had been owned by US Music for some time; and then US music was acquired by a Canadian company; Jam Industries sometime in 2009. These Washburn USA custom shop HM series guitars are long discontinued and not very many of these were ever manufactured by the Washburn USA custom shop in the first place. According to info found online from sources including Washburn Guitar forums; these were not mass produced guitars at all. The Washburn USA HM series came in a WM 526 super strat shape; and this WV 546 offset V shape both with the reverse hockey stick style headstock; and were limited to the two years in production. Since US Music already owned Parker Guitars; Washburn and Parker custom shop luthiers were combined to produce these USA made HM series guitars; using the patented Parker carbon glass composite fretboard with 24 stainless steel frets and no inlays in the USA custom shop. The body and set neck are mahogany wood which produces a warm and full resonant tone with clarity; better IMO than maple woods which usually produce a brighter tone. The guitar is equipped with the authentic Floyd Rose tremolo the humbucking pickups are EMG 81 neck 85 bridge. This WV 546 guitar has Grover tuners and the Buzz Feiten tuning system which holds tunings better and supposedly makes superior intonation. The guitar plays super fast because of the Parker carbon glass fretboard; also the neck is straight and perfect with no warp or bow at all; and the neck has a thin feel to it. This USA Custom Shop Washburn guitar retains the same factory setup from Washburn; as when I bought the guitar new from a local guitar store in Kansas in early 2009. The local guitar store was a Washburn dealer and this guitar was in their boutique guitar room; I am the only owner of the guitar since then. I also bought from the same dealer the Washburn USA HM series WM 526 super strat variant in 2008; which I do not want to sell at present. This Washburn USA WV 546 is in excellent to more accurate like new and close to mint condition; and has sat in its case in climate and humidity controlled environment since I owned it. These are somewhat rare and HTF guitars now especially in this time capsule super nice like new condition. This guitar is not perfect but about as close as it can get to being like new or mint; it is flawless with no dents or dings or damage to mention on it anywhere. I have never played this WV 546 guitar except maybe to hold it a couple of times very briefly. I have only taken this WV 546 guitar out of its HSC; at most a couple of times in almost 10 years now. This guitar will be well packed in its original HSC. Size: Not provided. Condition: See above. Stock Number: A021796 Terms of Sale Buy It Now: If this item has a Buy It Now option, then we have reviewed comparable sale prices on eBay for this item and have established a Buy It Now price based on our research. If you feel the price is fair, please use the Buy It Now button to immediately purchase and pay for the item. If you are buying multiple items from us, please do not use the Buy It Now button, rather please follow the instructions below for buying multiple items. Make Offer: If this item has a Make Offer option, then please submit a reasonable offer, based on comparable eBay sale prices, which we can accept. We are more likely to accept your offer if the price is close to the Buy It Now price and you add a comment supporting your offer. We want to sell items quickly, so we can continue to bring new items to market, so we will try our best to work with you. Keep in mind that we may be negotiating with multiple buyers at the same time, so the first offer we accept wins the item. If we already have the lowest price on eBay, please use the Buy It Now option. Buying Multiple Items: To purchase multiple items from us using the eBay website: 1) add all the items to your shopping cart by clicking the \"Add to cart\" button on each eBay listing, 2) from your eBay shopping cart, click the \"Request total from seller\" button located at the top right of the page, 3) on the next page (Request total from seller page), click the \"Commit to buy & submit request\" link at the bottom of the page. This will reserve the items in your cart and send us a request to combine the shipping. We will then send you a single combined invoice to pay with the correct combined shipping amount. Please note: the eBay app may not support this functionality. Payment: We accept Paypal on all our listings. If you use the Buy It Now option, an immediate payment will normally be required. If you are buying multiple items from us, please do not use the Buy It Now button, rather please follow the instructions above for buying multiple items. If we accept your offer, we will send you an invoice through eBay, and payment is due within 24 hours. If you win an auction, we will send you an invoice through eBay, and payment is due within 24 hours. Shipping: We ship all of our items in-house using all new boxes and cushioning materials. We use shipping services from the USPS and UPS, so more than one option may be available under the 'Shipping and Payments' tab above. We will ship most of our items internationally directly through the USPS. All international shipments will be declared as commercial and at their full value. Any customs charges and/or import duties are always paid directly by the buyer in their local country. The eBay Global Shipping Program may also be an option for certain items (please contact us before buying the item, so we can add that option to the listing). Please use the eBay shipping calculator to obtain the cost of shipping and handling. In some cases, the eBay shipping calculator may not work, so please contact us directly for a shipping quote. We try to keep our shipping costs as low as possible and only charge our actual cost of shipping. If our actual cost of shipping turns out to be less than what we charged, we will refund you the difference. We always combine shipping on multiple items to save you money (see the instructions above for buying multiple items). Our handling time is one business day. Free local pickup is always available (please contact us before buying the item, so we can add a local pickup option to the listing). Kansas Sales Tax: Sales tax will only be collected on non-exempt shipments within the state of Kansas and on local pickups. If you live in Kansas and are exempt from Kansas sales tax, please email us your Kansas Resale Exemption Certificate, and we will remove the tax at checkout. Sales tax will not be collected on shipments outside the state of Kansas. Return Policy: We carefully inspect all of our items before listing, so we only allow returns if the item you receive differs significantly from the description and photos. Please ask any questions you may have about an item before purchasing the item. Please contact us within 48 hours after receiving the item if there is a problem. If we determine that a return is warranted, we will pay the return shipping. We want happy customers, so we always try to make it right. Feedback: If this transaction has met with your satisfaction, please leave us positive feedback and high seller ratings on eBay. If you cannot leave positive feedback or a 4 or higher seller rating, please contact us directly, before contacting eBay or Paypal, and give us a chance to make it right. We automatically return all positive feedback left for us. About Us Sunflower Auction Gallery is a Top Rated Plus eBay seller located in Overland Park, Kansas. We have been selling on eBay since 1999. We primarily sell items in the following categories: Antiques, Collectibles, Dolls, Pottery & Glass and Toys, although we will list pretty much anything of value on eBay. All of our items come from a smoke and pet-free environment. We look forward to doing business with you.", "ItemID": "223255254859", "EndTime": "2019-01-06T17:48:06.000Z", "StartTime": "2018-11-26T21:38:34.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2008-2009-Limited-Edition-Washburn-Custom-Shop-HM-Series-WV-546-Electric-Guitar-/223255254859", "ListingType": "FixedPriceItem", "Location": "Overland Park, Kansas", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2232552548598080_2.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/ODgxWDM1Nw==/z/TpsAAOSwRYNb~Gk5/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NDgyWDEzOTI=/z/tdAAAOSwy2pb~Gk6/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzA2WDE0NzI=/z/9~IAAOSwzCtb~Gk7/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjE2WDE2MDA=/z/m9kAAOSwQzJb~Gk9/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTAwWDc1MA==/z/q4EAAOSwF5Vb~Gk-/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODYzWDQ0Mw==/z/KRUAAOSwsrlb~Gk-/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIxM1g3MDI=/z/5-MAAOSwcapb~GlA/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTAwWDkzNw==/z/uoIAAOSwLKhb~GlB/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODA3WDY4NA==/z/nGUAAOSwg2lb~GlC/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODI3WDUwOA==/z/uoAAAOSw~vNb~GlD/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjcxWDk0NQ==/z/vjUAAOSwVixb~GlE/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODc5WDEyNjI=/z/Q2UAAOSw9g1b~GlF/$_12.JPG?set_id=880000500F"], "PostalCode": "66223", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "sunflowerauctiongallery", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 10377, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1495.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1495.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "k***k", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 0}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2008 2009 Limited Edition Washburn Custom Shop HM Series WV 546 Electric Guitar", "HitCount": 125, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=47548865", "StoreName": "Sunflower Auction Gallery"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "TopRatedListing": true, "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "SKU": "A021796", "NewBestOffer": false}