{"BestOfferEnabled": false, "Description": "Our eBay Store About Us Epiphone Dot Electric Guitar (Cherry) The Epiphone Dot is Epiphones version of the venerable ES-335 “Dot”, has been wowing guitar players all over the world for over four decades. Vintage models (with vintage problems) can’t complete with our Epiphone Dot, which is simply one of the best deals today for guitar players who want the classic sound of an ES-335 at an affordable price. Epiphone is long famous for its own original semi-hollowbody models from the 1950s Kalamazoo, Michigan era, including the Riviera and the Sheraton. During the same time those guitars were designed and constructed in Kalamazoo, the ES 335, first introduced in 1958, became a favorite of blues, rock, country, and pop acts for its elegant design and wide array of colorful tone combinations. Now, the Epiphone Dot, named in reference to its simple \"Dot\" fingerboard inlays, brings the sustain and resonance of the clsssic semi-hollow design for a bounty less than most solid body guitars. The “Dot” is the same axe that has been the bell weather of every rock and roll breakthrough. And now for the first time, the “Dot” puts that classic sound and over 40 years of refinements in your hands, the Epiphone way. Features:Body Material: Laminated mapleTop Material: Laminated mapleNeck: MahoganyNeck Joint: SlimTaper “D” ProfileFingerboard: Rosewood with pearloid “dot” inlaysFingerboard Radius: 12”Scale: 24.75”Nut Width: 1.68\"Neck Pickup: Alnico Classic HumbuckerBridge Pickup: Alnico Classic Plus HumbuckerControls: 2-Volume, 2-TonePickup Selector: Epiphone 3-way toggleTailpiece: LockTone Tune-o-matic StopBarHardware: NickelMachine Heads: Grover 16:1Case: Not includedOrder your Epiphone Dot today at the guaranteed lowest price from Sam Ash Direct with our 45-day return and 60-day price protection policy. Product Details - Laminated maple body, Set in maple neck - Rosewood fingerboard with dot inlays - 2 chrome covered humbuckers - Adjustable bridge with stop tailpiece, Vintage style tuners Shipping Information Your gear will ship out within 2 days of order confirmation. At this time we can not ship PO Boxes, APO and FPO locations. Industry Leading 45-Day Return Policy We stand by the products we sell, and we'll certainly stand by you as well! We truly appreciate your business, and we want you to be 100% happy with your purchase. However, we know that one of the drawbacks of internet shopping is that you can't try something before you buy it. That's where our money-back guarantee comes in. If you are not completely satisfied with an item, for any reason, you can return it within 45 days of the shipping date for a complete refund of the merchandise price.* Due to the complexity of international shipping, we are unable to accept any returns on international orders. Before making a purchase outside of the United States, please know that products sold by Sam Ash use the standard 120V/60Hz voltage standard. Sam Ash is not responsible for any damage caused by not adhering to the voltage requirements. *All returns must be within 45 days of the date the item was shipped. Please do not accept any shipment if the packaging appears damaged in any way. We strongly suggest that you check your order after receiving it to be sure that it is in proper working order. Returned items must be in resalable condition. Resalable Condition means that the product(s) is exactly in the same condition as you received it. All exchanges must be pre-paid, returned in original packing, complete with blank warranty cards, owner's manual and show no sign of wear or abuse. In the event that the product is not in the same condition as you received it you may be subject to a minimum 15% restocking fee, repair charge or disqualification. Shipping and handling charges are non-refundable. Please call our Customer Service department if you have any questions about returning an item. CDs, DVDs, video tapes, sheet music, books, strings, computer hardware/software, drum heads, harmonicas, mouthpieces, sound cards, microphones, raw speakers, studio furniture, blank CDs/Tapes or Special Orders are not covered by this return policy.", "ItemID": "192837617454", "EndTime": "2019-02-27T14:00:58.000Z", "StartTime": "2019-02-24T15:50:44.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Epiphone-Dot-Electric-Guitar-Cherry-Used-/192837617454", "ListingType": "FixedPriceItem", "Location": "Tampa, FL", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1928376174548080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTkwWDUwMA==/z/I5cAAOSwh0Nccr1o/$_1.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "samashdirect", "FeedbackRatingStar": "PurpleShooting", "FeedbackScore": 59073, "PositiveFeedbackPercent": 99.3, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 339.77, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 339.77, "CurrencyID": "USD"}, "HighBidder": {"UserID": "c***7", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 40}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Epiphone Dot Electric Guitar (Cherry) (Used)", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "MPN", "Value": ["ETDTCHCH1"]}]}, "HitCount": 59, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1111655870", "StoreName": "Sam_Ash_Music_Direct"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalRefund": "MoneyBack", "InternationalReturnsWithin": "30 Days", "InternationalReturnsAccepted": "ReturnsAccepted", "InternationalShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "DiscountPriceInfo": {"OriginalRetailPrice": {"Value": 748.0, "CurrencyID": "USD"}, "PricingTreatment": "STP", "SoldOneBay": false, "SoldOffeBay": false}, "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Central America and Caribbean", "South America", "AS", "CK", "FJ", "PF", "GU", "KI", "MH", "FM", "NR", "NC", "NU", "PW", "PG", "SB", "TO", "TV", "VU", "WF", "WS", "AL", "AD", "AT", "BY", "BE", "BA", "BG", "HR", "CY", "CZ", "DK", "EE", "FI", "FR", "DE", "GI", "GR", "GG", "HU", "IS", "IE", "IT", "JE", "LV", "LI", "LT", "LU", "MK", "MT", "MD", "MC", "ME", "NL", "NO", "PL", "PT", "RO", "SM", "RS", "SI", "ES", "SJ", "SE", "CH", "UA", "VA", "BN", "KH", "HK", "LA", "MO", "MY", "PH", "SG", "TW", "VN", "BM", "GL", "PM", "DZ", "AO", "BJ", "BW", "BF", "BI", "CM", "CV", "CF", "TD", "KM", "CD", "CG", "CI", "DJ", "EG", "GQ", "ER", "ET", "GA", "GM", "GH", "GN", "GW", "KE", "LS", "LR", "LY", "MG", "MW", "ML", "MR", "MU", "YT", "MA", "MZ", "NA", "NE", "NG", "RE", "RW", "SH", "SN", "SC", "SL", "SO", "SZ", "TZ", "TG", "TN", "UG", "EH", "ZM", "ZW", "BH", "IQ", "JO", "KW", "LB", "OM", "QA", "SA", "TR", "AE", "YE", "AF", "AM", "AZ", "BD", "BT", "CN", "GE", "IN", "JP", "KZ", "KG", "MV", "MN", "NP", "PK", "LK", "TJ", "TM", "UZ", "PO Box"], "GlobalShipping": false, "ConditionDescription": "Like New", "QuantitySoldByPickupInStore": 0, "SKU": "ETDTCH", "NewBestOffer": false}