{"BestOfferEnabled": false, "Description": "2013 model made in USA. Comes with strap and gig bag. Guitar was lightly used and is in like new condition. Local pick up only. Payment: PayPal or cash. From the Gibson website:: Rock music might have developed through the 1960s, but it came of age in the 1970s—often played on great Gibson guitars of the era. To capture the look, feel and tone of the instruments that made massive music during a decade when rock was king, Gibson USA introduces the SG Special ’70s Tribute, part of a series that also includes a Firebird Studio and Les Paul Studio with complementary features. The SG Special ’70s Tribute offers all the quality and performance that has made the guitar so popular with hard-gigging guitarists since its introduction in 1983, with crucial updates that ally it to many legendary Gibson guitars of the 1970s. Wrap your hand around the unique thin-to-thick neck carve of the SG Special ’70s Tribute—with a profile that starts out slim at the lower frets and becomes increasingly chunky as you slide toward the joint—and you’re rocketed straight back to an age of fierce, fast soloing. In the tone department, it carries a pair of new Dual Blade Alnico Mini Humbuckers for great, vintage-edged tones with plenty of contemporary versatility. To top it off, the SG Special ’70s Tribute looks great in your choice of Vintage Sunburst, Cherry, Ebony Black or Silver Burst finish, all in grain-textured satin nitrocellulose lacquer. Like the most revered vintage SGs, the SG Special ’70s Tribute starts with a solid mahogany body. This classic tonewood offers superb depth and balance, and is extremely light for optimum playing comfort. Carved to the traditional asymmetrical double-cutaway shape, the SG also offers outstanding upper-fret access. Like many great Gibsons of the ’70s, the neck is made from maple and carved to a profile unique to the era, which measures .800” deep at the 1st fret and increases to .963” at the 12th, with a volute behind the nut to both strengthen the headstock joint and enhance neck resonance. A chocolate-brown baked maple fingerboard carries small block inlays, and terminates in a PLEK-cut Corian™ nut with a width of 1-11/16”. The SG Special ’70s Tribute keeps it all down to basics—and saves you money—by omitting fingerboard binding. Its look is complemented by a cream pickguard and pickup rings and gold knobs (Vintage Sunburst and Ebony Black) or black guard, rings and knobs (Silver Burst and Cherry). To help the SG Special ’70s Tribute rock with unparalleled character and articulation, Gibson USA loads it with a pair of Dual Blade Alnico Mini Humbuckers. Entirely new pickups from Gibson USA, these units improve upon the best attributes of the former Mini Humbuckers seen in the Les Paul Deluxe in the ’70s, and the different Firebird Mini Humbuckers of the early ’60s, in an efficient design that uses dual steel blades and an Alnico magnet for a vintage voice that still retains plenty of chime. These pickups are calibrated for balanced output between the neck and bridge positions, yielding everything from singing bluesy neck tones to crunchy and wailing leads, and are dressed in solid chrome covers. They are routed through the traditional four-knob and three-way switch wiring set up, and partnered with a Tune-o-matic bridge and stopbar tailpiece for optimum sustain and precise intonation. A set of vintage-style TonePros™ tuners with pearloid keys rounds out the package.", "ItemID": "382564608311", "EndTime": "2019-02-28T01:48:34.000Z", "StartTime": "2018-09-14T10:47:02.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-SG-70-Tribute-Heritage-Cherry-Electric-Guitar-Gently-Used-Local-Pick-Up-/382564608311", "ListingType": "FixedPriceItem", "Location": "Bethlehem, Connecticut", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/3825646083118080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg3MDg=/z/e2MAAOSwcW9bm5Ax/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/HWQAAOSwPXdbm5Av/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/AyQAAOSwnOlbm5At/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/u3sAAOSwsl9bm5Au/$_12.JPG?set_id=880000500F"], "PostalCode": "06751", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "pdbooks", "FeedbackRatingStar": "Red", "FeedbackScore": 4354, "PositiveFeedbackPercent": 99.6}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 599.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 599.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "f***i", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1097}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["None"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson SG 70’ Tribute Heritage Cherry Electric Guitar Gently Used Local Pick Up", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model", "Value": ["SG Special"]}, {"Name": "Body Material", "Value": ["Mahogany"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["SGSPGSECH1", "SGSPHCCH1", "SGSPEBCH1"]}, {"Name": "MPN", "Value": ["SGSPEBCH1"]}]}, "HitCount": 5499, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=3675170", "StoreName": "pdbooks"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "ProductID": {"Value": "70294651", "Type": "Reference"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}