{"BestOfferEnabled": false, "Description": "Up for sale, a 2008 Fender Telecaster Custom '62 vintage reissue in a rare left-handed configuration with an equally rare transparent red Cherry gloss finish. This \"Made in Japan\" Telecaster is a rare model, meant only for the Japanese domestic market, and rarely seen outside its country of origin. Not to be confused with the much more common opaque Candy Apple Red finish, this Cherry finish is a transparent red that highlights the grain of the alder body, accented with aged white binding on the top and back of the instrument for a classic Fender look. Officially model TL62B, this guitar comes stock with a traditional Telecaster pickup compliment that delivers a snappy, twangy bridge pickup, an array of great, cutting rhythm tones, and a neck pickup that is sweet and bell-like without lacking clarity. The guitar weighs in at 7lbs 8oz and balances well on a strap. Professionally setup here at Mike & Mike's Guitar Bar, this Tele is strung with 10-52 strings, and has low action and spot-on intonation.The one-piece maple neck profile has a medium C shape that borders on the more slender side of things, with a smooth ambered gloss finish on the profile and zero wear on the maple. The slab rosewood fretboard boasts Fender's traditional 7 1/4\" fretboard radius, with a 1 11/16\" nut and vintage style fretwire. The frets show moderate uniform wear on frets 1-3, extending beneath the plain strings until fret 6. The frets retain their full factory height and play cleanly in all positions with no untoward buzzes or dead spots. The headstock retains a Pre-CBS style Tele logo as well as a set of Gotoh-made, Kluson-style tuners that match vintage spec and turn smoothly.All of the stock electronics work as they should, and the hardware includes a clean chrome control plate, while the \"Pat. Pending\" bridge plate and finely grooved metal saddles show moderate surface patina. Cosmetically, this guitar shows moderate buckle rash on the back, along with an assortment of minor nicks and dings. The cherry red gloss finish is vibrant and rich, while still allowing the grain of the alder body to be seen. There are also a few small shallow nicks on the top as well as some spot of wear through the finish where the forearm crosses the top. With Fender Japan no longer producing this model/color combination, this is a particularly uncommon variant on the classic Tele Custom double bound look.A gigbag is included. Check out our shop \"Mike & Mike's Guitar Bar,\" and please let us know if we can answer any questions!Shipping in the continental USA will be $65, fully insured and shipped via FedEx Ground. Expedited shipping available for an additional fee at buyer's request. We will happily ship WORLDWIDE, but please contact us for an accurate international shipping quote before bidding or buying, as cost varies by buyer location. International orders will be declared as “merchandise,” and the value of merchandise will be declared as the amount paid. We cannot declare anything as a gift or for a lesser value. No exceptions! The customer is responsible for all taxes and duty, which may be collected upon delivery, as well as any additional charges involved with import. We have all necessary CITES paperwork in-hand to ship rosewood worldwide.We do our best to describe all items with honesty and accuracy, but to be sure, please contact us with any questions or concerns prior to bidding or buying. We require payment within 48 hours of auction end. In the unlikely event of a return, buyer pays all shipping costs. Your positive feedback and five star ratings are very important to us, and we appreciate your communication in resolving any issues!", "ItemID": "173716743492", "EndTime": "2019-01-04T17:32:12.000Z", "StartTime": "2018-12-31T22:04:18.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2008-Fender-Telecaster-Custom-62-Vintage-Reissue-Cherry-Left-Handed-Japan-MIJ-/173716743492", "ListingType": "FixedPriceItem", "Location": "Seattle, Washington", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1737167434928080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/mKwAAOSwhr9cKo-7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/5MgAAOSwzwVcKo~G/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/olUAAOSwYUZcKo~I/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/aaoAAOSwiqBcKo~W/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/RjYAAOSwgzBcKo~B/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/QTMAAOSwliFcKo~R/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/ywMAAOSwQqNcKo--/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/iCUAAOSwDmxcKo~T/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/VlEAAOSwEppcKo~D/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/olsAAOSwYUZcKo~O/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/uOMAAOSw5qdcKo~L/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/-WQAAOSwcaBcKo~Y/$_57.JPG?set_id=8800005007"], "PostalCode": "98117", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mmguitarbar", "FeedbackRatingStar": "Red", "FeedbackScore": 2591, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1099.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1099.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "1***m", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 73}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "2008 Fender Telecaster Custom '62 Vintage Reissue Cherry Left Handed Japan MIJ", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "Model", "Value": ["'62 Telecaster Custom"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Cherry Red"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Material", "Value": ["Alder"]}, {"Name": "Right-/ Left-Handed", "Value": ["Left-Handed"]}, {"Name": "Model Year", "Value": ["2008"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}]}, "HitCount": 68, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=269063702", "StoreName": "Mike and Mikes Guitar Bar"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}