{"BestOfferEnabled": false, "Description": "Up for sale, a 1988 Greco EGC68-60 \"Black Beauty\" LP Custom electric guitar in 100% original condition and in perfect working order. Crafted in Japan's famed Fujigen factory as part of Greco's Mint Collection offered in the '80s, this lawsuit-era LP truly delivers the goods, with incredible attention to vintage Gibson spec. And while no legal action was taken against Greco for these guitars, Gibson did commission the same factory to make their \"Orville\" line of instruments which were exclusively sold within Japan.Clearly a direct response to the '68 Les Paul Custom, this model features a carved two-piece maple top, long neck tenon, \"Screamin\" PAF pickups, braided wire, full size pots, and a hand carved bone nut. It's an extremely lively and powerful sounding instrument, and the craftsmanship is evident in the great playability and classic range of Les Paul tones. The bridge pickup has a complex and detailed sound, with a touch of growl, sweet, subtle mids, and focused bass response. The neck position humbucker delivers more girth and fullness while still being clear and present, and it's an ideal sound for saturated lead lines. Weighing 9lbs 10oz, this moderate weight Greco balances well on a strap and has a solid, non-weight relieved body with a big, ringing acoustic tone. We've had this guitar professionally setup here at Mike & Mike's Guitar Bar with low action, solid intonation, and 10-46 strings.The neck has a slender C shaped profile with a bit more depth and shoulder as you travel up the fretboard, consistent with Gibson's modern \"60s\" profiles. The neck features a bound rosewood fretboard, pearl block inlay, and original medium jumbo fretwire. These frets are very similar to what Gibson used in the late '60s, with identical width and a bit more height and crown. The frets show moderate wear on frets 1-2, extending beneath the plain strings until fret 5, with virtually no wear further up the fretboard. The guitar plays cleanly in all positions with no buzzing or dead spots, and the truss rod is responsive and ideally adjusted. The hand carved bone nut is original, measuring 1 11/16\" in width. On the headstock, the guitar features a small volute, multi-ply binding, Greco-branded gold tulip button tuners, and clean pearl inlays that vaguely mimic Gibson's split diamond look.All of the electronics work as they should, with original pots and tone caps, as well as the same high quality braided pickup leads seen on any Gibson. The gold hardware shows notable surface patina and veers towards brass in its tint, and the hardware includes the original Tune-o-Matic bridge and stopbar tailpiece. All of the original platic parts are present too including a quartet of witch hat knobs, multi-ply black pickguard, pickup rings, and switch surround. The top has a nice deep dish carve in the maple, highlighted by the original gloss black finish. Cosmetic wear is limited to some scuffing in the pick path and a few minor finish scratches and dings on the back of the guitar, but shy of what would typically be considered \"buckle rash.\" The neck profile is very clean with no notable wear. This Greco has been extremely well cared for over the past 30 years, and it's one of the nicer examples we've seen from this highly regarded era of Japanese guitar construction. Check out our shop \"Mike & Mike's Guitar Bar,\" and please let us know if we can answer any questions!Shipping in the continental USA will be $60, fully insured and shipped via FedEx Ground. Expedited shipping available for an additional fee at buyer's request. We will happily ship WORLDWIDE, but please contact us for an accurate international shipping quote before bidding or buying, as cost varies by buyer location. International orders will be declared as “merchandise,” and the value of merchandise will be declared as the amount paid. We cannot declare anything as a gift or for a lesser value. No exceptions! The customer is responsible for all taxes and duty, which may be collected upon delivery, as well as any additional charges involved with import. We have all necessary CITES paperwork in-hand to ship rosewood worldwide.We do our best to describe all items with honesty and accuracy, but to be sure, please contact us with any questions or concerns prior to bidding or buying. We require payment within 48 hours of auction end. In the unlikely event of a return, buyer pays all shipping costs. Your positive feedback and five star ratings are very important to us, and we appreciate your communication in resolving any issues!", "ItemID": "153317537524", "EndTime": "2019-01-31T15:41:36.000Z", "StartTime": "2018-12-26T09:41:50.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1988-Greco-EGC68-60-Black-Beauty-Mint-Collection-Guitar-LP-Custom-Japan-Fujigen-/153317537524", "ListingType": "FixedPriceItem", "Location": "Seattle, Washington", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1533175375248080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/tXYAAOSwAopcI0f~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/30QAAOSw7R9cI0gG/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/SO4AAOSw8a9cI0gI/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/wxQAAOSwRWZcI0gP/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/W-oAAOSwYYpcI0gD/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/sHgAAOSwNJJcI0gU/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Q~QAAOSwvERcI0gB/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/5XAAAOSwEvZcI0gR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/nywAAOSw8VtcI0gW/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/R2oAAOSwGIZcI0gK/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/bRwAAOSwEp5cI0gM/$_57.JPG?set_id=8800005007"], "PostalCode": "98117", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mmguitarbar", "FeedbackRatingStar": "Red", "FeedbackScore": 2592, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 849.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 849.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "l***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 103}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "1988 Greco EGC68-60 Black Beauty Mint Collection Guitar LP Custom Japan Fujigen ", "ItemSpecifics": {"NameValueList": [{"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Material", "Value": ["Mahogany, Maple"]}, {"Name": "Brand", "Value": ["Greco"]}, {"Name": "Model", "Value": ["EGC68-60"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["1988"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Ebony"]}]}, "HitCount": 522, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=269063702", "StoreName": "Mike and Mikes Guitar Bar"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}