{"BestOfferEnabled": true, "Description": "Vintage 1985 Aria Pro II RS Bobcat V Electric Guitar - Matsumoku Japan - Black - Excellent Please make your offer before the auction endsThe studio and stage workhorse model in Aria's RS SeriesProduced in 1985 - at the peak of the Aria-Matsumoku collaboration One of the first to feature the ACT-3 locking tremolo (1984 catalog)Ash bodyMaple neck with rosewood fretboard22 regular frets, hand finished edgesModerate curvature, butter smooth neckGraphite nutThree matched single-coil Aria-Maxon pickupsTone and volume controlFive-position pickup selector (seven tones total)Aria ACT-3 locking floating tremolo bridgeSigned MHG machine heads Finish: Black (\"B\")Hardware: ChromeYear: 1985Plant: MatsumokuCountry: Japan An excellent guitar from the golden years of the Matsumoku - Aria collaboration, along with the Knight Warrior, ZZ, and the Inazuma series. The guitar plays and sounds great, and is in excellent condition. The sustain and intonation are everything you would expect from a true vintage, hand-finished, Japanese-made instrument. The finish is very well preserved and shiny, with only light traces of use and some buckle wear on the back. The neck is straight, the frets have practically no wear. All adjustments work as they should, the chrome hardware has no rust or pitting and works flawlessly. The ACT-3 floating tremolo accepts 6 mm threaded tremolo arms, available separately from other merchants. All in all, an elegant and reliable rock and blues instrument with great visual and sonic presence. It is hard to believe it is over 30 years old. I verify my guitars against available Aria catalogs and corroborated information from collectors. Please be aware of the many built-from-parts and look-alike guitars, as well as unauthorized restorations. This is not one of them. Please also do not confuse the Wildcat and the Bobcat lines with the *Cat* or the *Stray*cat* lines that are often offered online. Those other, later *Cats* were hardwood and plywood guitars that were manufactured partially in South Kor. after the Matsumoku plant went bankrupt in early 1986. My instruments are kept in a climate controlled, smoke-free and dust-free environment. They are regularly maintained and never taken to gigs. Any signs of prior use come from previous owners and are carefully documented. Please take a look at the included high-resolution photos and feel free to ask any questions prior to bidding or purchase. The guitar is sold as-is with no returns. It will be packaged safely and shipped promptly with full insurance and tracking. Thanks, and good luck! This auction description and images are Copyright (C) by travellight at cyberalia com. All rights reserved. Unauthorized duplication of these materials is a violation of law.", "ItemID": "232875041986", "EndTime": "2019-02-23T20:32:55.000Z", "StartTime": "2018-08-05T03:01:50.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Vintage-1985-Aria-Pro-II-RS-Bobcat-V-Black-Strat-Electric-Guitar-Matsumoku-Japan-/232875041986", "ListingType": "FixedPriceItem", "Location": "Silver Spring, Maryland", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2328750419868080_2.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/ODAwWDEyMDA=/z/UkwAAOSwjjRbZmX7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODAwWDEyMDA=/z/WvQAAOSwhCBbZmX0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODAwWDEyMDA=/z/Q2kAAOSwzI5bZmXw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODAwWDEyMDA=/z/8SEAAOSwhilbZmXy/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODAwWDEyMDA=/z/lQ4AAOSwKdZbZmX4/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODAwWDEyMDA=/z/1JQAAOSw2kNbZmX2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODAwWDEyMDA=/z/Y-0AAOSwOMtbZmX9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODAwWDEyMDA=/z/j2YAAOSwtbBbZmX~/$_57.JPG?set_id=8800005007"], "PostalCode": "20910", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "travellight", "FeedbackRatingStar": "Purple", "FeedbackScore": 859, "PositiveFeedbackPercent": 99.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 379.95, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 379.95, "CurrencyID": "USD"}, "HighBidder": {"UserID": "o***n", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 1}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Vintage 1985 Aria Pro II RS Bobcat V Black Strat Electric Guitar Matsumoku Japan", "ItemSpecifics": {"NameValueList": [{"Name": "Modified Item", "Value": ["No"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}]}, "HitCount": 1589, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "Oceania", "Southeast Asia", "South America", "BM", "GL", "MX", "PM"], "GlobalShipping": false, "ConditionDescription": "Made in Japan - 1984-1985 production season - stage and studio workhorse - excellent condition.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}