{"BestOfferEnabled": false, "Description": "Previously owned and carefully used, this 34 + year old Vintage Fender 1983 Elite Stratocaster Electric Guitar with Fender Hard Case. Hard case shows some scratches and wear but works fine. Okay... I wish I could tell you more specifics about this guitar however, I am not a guitar guy or musician. Based on a little online research, the serial number claims it was manufactured Between 1983-84. I am not the original owner of the Fender Elite so I don't know the history of it. There are various surface imperfections, scratches, small nicks. Please examine the guitar and zoom in on the detailed photos we provided. Ebay only allows 12 so we attempted to take the correct angles. There may be additional blemishes, dings and scratches but nothing major. We were not the original owner of the guitar but have have had it checked and tested as well as we could. This item is being sold as-is. Understand what you are bidding on... if you have questions, don't hesitate to contact to clarify any concerns. This USA Strat may / will need a set-up by a professional upon receiving, such as a tuned up, tighten, and or adjusted to your liking. (Stand or displays not included) It's not as bad as it sounds, I just want anyone who buys it to be aware. ( It may not.. could be to your liking right of the go, but just in case.... It has been sitting in its case these past 3 years unplayed in a non smoking, climate controlled room. .99 Cent No Reserve Auction Uptown Pawn dba. UptownSalesUSA does not claim to be a specialist or experts on guitars - however, we will represent everything listed to the best of our abilities by taking photos of actual items and more to qualify our standards. If you consider yourself as a expert or knowledgeable on this item, we welcome and or appreciate any insight or data you may have in order to provide the most accurate listing to our buyers. Here is a close, but may not be 100% online description to sort out. I am certain if you are considering this electric guitar, you already know a tremendous amount. Read below: The Elite Stratocaster was introduced in 1983 and discontinued in 1984. It served as a template for the Eric Clapton signature model of 1988. One player of the Elite model is Ty Tabor of King's X, who used this guitar to record the first four albums of that band. His gear setup still retains the preamp from the guitar, now rack mounted.Some of the Elite features have been incorporated into USA-made Fender guitars and basses made after the purchase of the Fender guitar company from CBS by Bill Schultz in 1985. For example the Eric Clapton, Richie Sambora (introduced in 1991) and Buddy Guy (introduced in 1995) signature guitars retain the TBX/MDX design from the Elite. You will receive item exactly as shown in the pictures. Please understand, this listing only contains what is described. Don’t assume it comes with something if not stated in the listing description. If you aren’t certain, send us a note thru eBay messaging system. Photographs often disclose condition far better than verbiage as many people have different ideas on what terms may mean. Please zoom in for more specific condition details. If an identifying mark, inclusion or defect is visible in the images it is considered disclosed to the buyer.Pay attention to the details, Ebay’s defaulted detail catalog is not always correct. correct. Many times Ebay product catalog does not have the correct photo of the item we have for sale may look different. In addition, I have found many of Ebay defaulted catalogues have certain models, MPN, and other specs wrong from previous listers. Double check to see if it is accurate. Most times the buyer knows more than we do. Please ask if there is something specific you need to know. Purchase of the item represents an agreement on the terms and conditions of this listing. This listing is offered and sold as is. Uptown Pawn dba. UptownSalesUSA, a brick and mortar pawnshop located in the heart of the Twin Cities metro area. We are licensed and bonded by the city of Minneapolis and registered with Minnesota Secretary of State since 2002. Check out our feedback and buy with confidence.You can find contact information at the bottom of our Ebay Payment Policy tab in listing. If you have any questions or need to discuss more descriptions, special shipping arrangements, additional photos, or local pick up. 612 823 3001Uptown Pawn dba. UptownSalesUSA makes no express or implied warranties or representations regarding the condition or suitability of the goods and to the extent allowed by law, specifically disclaims any express or implied warranties, including but not limited to any warranty of merchantability or fitness for purpose.We do not offer a warranty on any merchandise: Ebay has a Square Trade program may work. We are not a distributor for any brand. Warranties on the items that I sell may or may not be valid on a non-retail purchase. Indemnity: Buyer shall, at no expense to the Seller, indemnify, defend and hold the Seller harmless against any and all losses, damages and expense (including punitive damages, multiple damages, attorney fees and other costs of defending any action) Seller may incur as a result of any claim made against the seller by any person, including without limitation, Buyer, it's successors, assigns, representatives, agents, employees, insurers, and customers, actually or allegedly arising out of the regarding the transportation, installation or use of the equipment sold hereunder by Seller or out of any products manufactured or sold by Buyer, including, without limitation, any claim which in whole or in part actually or allegedly arises out of (a) Seller's negligent or other wrongful act or omission, (b) danger or default in any equipment sold by Seller to Buyer, (c) infringement by Seller of any patent, copyright, or trade secret relating to any equipment sold by Seller to Buyer.", "ItemID": "192807333963", "EndTime": "2019-02-04T17:51:18.000Z", "StartTime": "2019-01-28T17:51:18.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fender-American-Vintage-1983-Stratocaster-Elite-Electric-Guitar-No-Reserve-99c-/192807333963", "ListingType": "Chinese", "Location": "Minneapolis, Minnesota", "PaymentMethods": ["PayPal", "CashOnPickup"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1928073339638080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTU3N1g3NjA=/z/yMEAAOSwdwVcTzd2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQyNFgxMTg2/z/MPAAAOSwOShcTzej/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU4Nlg5NTM=/z/WugAAOSwgrZcTzf3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/gEUAAOSwBP1cTzjg/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/pesAAOSw8zRcTzgO/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/yYAAAOSwdqNcTzg-/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/D2gAAOSwuA9cTzjE/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/qDQAAOSwYYpcTzi0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTM1OFgxMTg2/z/O6IAAOSwBMpcTzj9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/1fIAAOSwjYVcTzkM/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/UigAAOSwMkdcTzkf/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/SFkAAOSw~xtcTzlI/$_57.JPG?set_id=8800005007"], "PostalCode": "55408", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "uptownsalesusa", "FeedbackRatingStar": "Red", "FeedbackScore": 3020, "PositiveFeedbackPercent": 99.5}, "BidCount": 24, "ConvertedCurrentPrice": {"Value": 910.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 910.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 604}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "CA", "GB", "DK", "RO", "SK", "BG", "CZ", "FI", "HU", "LV", "LT", "MT", "EE", "AU", "GR", "PT", "CY", "SI", "JP", "CN", "SE", "KR", "ID", "TW", "TH", "BE", "FR", "HK", "IE", "NL", "PL", "ES", "IT", "DE", "AT", "BS", "IL", "MX", "NZ", "SG", "CH", "NO", "SA", "UA", "AE", "QA", "KW", "BH", "HR", "MY", "CL", "CO", "CR", "DO", "PA", "TT", "GT", "SV", "HN", "JM", "AG", "AW", "BZ", "DM", "GD", "KN", "LC", "MS", "TC", "BB", "BD", "BM", "BN", "BO", "EG", "GF", "GG", "GI", "GP", "IS", "JE", "JO", "KH", "KY", "LI", "LK", "LU", "MC", "MO", "MQ", "MV", "NI", "OM", "PK", "PY", "RE"], "Site": "US", "TimeLeft": "PT0S", "Title": "Fender American Vintage 1983 Stratocaster Elite Electric Guitar- No Reserve .99c", "ItemSpecifics": {"NameValueList": [{"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}, {"Name": "Series", "Value": ["American Vintage"]}, {"Name": "Model Year", "Value": ["1983"]}, {"Name": "Features", "Value": ["Volume Knob", "With Pickup", "Push Buttons x 3"]}, {"Name": "Body Color", "Value": ["Red"]}, {"Name": "Model", "Value": ["Stratocaster Elite"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Brand", "Value": ["Fender"]}, {"Name": "Body Material", "Value": ["Ash", "Alder"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["113000700", "100100800", "170210735"]}, {"Name": "MPN", "Value": ["100100800"]}]}, "HitCount": 923, "Subtitle": "With Fender Hard Case / Black ", "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1105760823", "StoreName": "Uptown Pawnstars"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 920.0, "CurrencyID": "USD"}, "ProductID": {"Value": "70334207", "Type": "Reference"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "TM", "AZ", "GE", "MN", "UZ", "AM", "TJ", "NP", "AF", "BT", "RU", "KZ", "KG", "IN", "VU", "WF", "NC", "PG", "NU", "AS", "PF", "CK", "MH", "SB", "GU", "NR", "TO", "FM", "FJ", "KI", "PW", "WS", "TV", "BA", "SM", "MK", "MD", "AD", "VA", "AL", "ME", "SJ", "RS", "BY", "VG", "VI", "AI", "HT", "PR", "VC", "AN", "VN", "LA", "PH", "BR", "FK", "AR", "EC", "GY", "SR", "UY", "VE", "PE", "PM", "GL", "MW", "LY", "BI", "TD", "NG", "MG", "LR", "GM", "TG", "BF", "ZW", "KE", "TN", "CF", "NE", "AO", "LS", "GA", "SL", "ZM", "ET", "SZ", "CD", "CI", "ZA", "GW", "NA", "DZ", "SC", "TZ", "UG", "KM", "ML", "CV", "SO", "GN", "BJ", "MZ", "YT", "SH", "ER", "DJ", "CM", "CG", "MA", "MU", "GH", "RW", "EH", "GQ", "BW", "MR", "SN", "LB", "TR", "YE", "IQ"], "GlobalShipping": true, "ConditionDescription": "Certain photos have major reflection, please zoom and understand they are not damage nor imperfects as they may appear from afar. There are various surface imperfections, scratches, small nicks which seem normal for a guitar that has been played and loved for 35 years.", "QuantitySoldByPickupInStore": 0, "SKU": "84086-1 MAS JORY CUSTOMER JESX", "NewBestOffer": false}