{"BestOfferEnabled": false, "Description": "Epiphone Les Paul Custom Electric Guitar Black Free Shipping from Japan 381v04 Description/Product details Width33 cmDepth99 cmHeight8 cmWeight3.69 kgBrandEpiphoneStyleElectric GuitarModelLes Paul CustomMPNDoes not applyBody ColorBlackString Configuration6 stringAction - 1st string at 12F2 mmAction - 6th string at 12F2.5 mmSerial numberU04082181 Description We have tested with 100v voltage about start-up and basic actions. In the case of failure, please let us know within 30 days on receipt of goods. We will fix only initial failure. (The following are not regarded as initial failure: as-is items, consumable goods such as lamp, ink, and battery, parts purchased separately from bidding, installation cost) Please contact us before you leave a negative or neutral feedback. If you have any problems, please let us know as soon as possible. We are ready to solve your problems immediately. We are a second-hand store. Basically our merchandise is used unless we describe it as NEW. Therefore, the merchandise shows sign of wear including scrapes and scratches due to usage, as photos show. We appreciate your looking at photos very carefully. Remarks Read Before Shopping We won't undervalue merchandise or mark the item as a gift on customs forms. Doing that is against U.S. and international laws. We only ship to PayPal registered address. Please contact us if you reside in countries in which we do not specify shipping service and cost. Please ask us any questions you may have before bidding. Also, please see the pictures as they are part of the description. We are happy to answer all questions. Tax International Buyers - Please Note Import duties, taxes, and charges are NOT INCLUDED in item prices or shipping costs. These charges are buyer's responsibility. Please confirm your customs clearance procedure in your country. Goods may not be sent in accordance with the custom rule of your country. Customs clearance fee and other expenses that may occur in your country is your own risk. Shipping We only ship to PayPal registered address. We cannot accept the change of shipping address after the checkout. Please make sure to input and change the shipping address before checkout if the address is different from the Paypal registered one. Otherwise, you have to cancel the transaction and buy the item again from scratch. Service: EMS Delivery Price Tracking EMS [ 3-7day ] [ FREE ] [ YES ] Shipping is FREE worldwide. All products are sent by EMS (Express Mail Service) and you will get a tracking number. If EMS is unavailable, we will contact you. Payment We Accept PayPal Only. Please pay immediately after you buy items. Request to Delay Shipping We are eager to ship the item as soon as payment is confirmed so that buyers can receive the item sooner. Therefore, please let us know in advance if you are absent from home and possibly fail to receive the item. (Delivery time can be calculated by EMS information in the listing.) In that case, we can delay shipping in accordance with your schedule. Yokohama-premium is a reliable shop and abide by the rules of ebay. We appreciate your understanding. Return Policy We accept returns within 30 days of receiving the merchandise if we make mistake or overlook something significant. We will make full refund minus shipping fees as soon as we receive the item back only with the same condition as the original one. When the item returns to our office due to your absense from home, we will refund money after deduction of shipping fee. Privacy Policy We protect the privacy and the personal information of buyers, and help buyers enjoy shopping with security. About us Yokohama-premium is an ebay store based in Yokohama, Japan.We sell a wide variety of goods from antiques to state-of-the-art machines. In particular, we are very active in the field of music instruments and luxury brand items. Thank you for looking! Business Hours (in Japan Standard Time) 9:00 - 18:00 [Holiday] Saturday, Sunday, Golden Week (Spring Holiday Week), Summer BON holidays, Year End & New Year holidays (Golden Week, Summer BON holidays, and Year end & New year holidays are regarded as a long vacation.) Please understand that the above long vacation may cause long delays in terms of reply to your message and shipping, though we can receive your message even out of the business hours and during a long vacation. For your information, please see the following URL when we are in a long vacation: https://www.ebay.com/usr/yokohama-premium Thank you for your visit to our store!", "ItemID": "173698428491", "EndTime": "2018-12-24T07:56:49.000Z", "StartTime": "2018-12-19T06:32:27.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Epiphone-Les-Paul-Custom-Electric-Guitar-Black-Free-Shipping-Japan-381v04-/173698428491", "ListingType": "FixedPriceItem", "Location": "Fujisawa, Kanagawa", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1736984284918080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NTk3WDkwMA==/z/PjsAAOSwo2xbzst8/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NTk3WDkwMA==/z/uxYAAOSwu3dbzst-/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NTk3WDkwMA==/z/wjQAAOSwX6RbzsuA/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NTk3WDkwMA==/z/3uUAAOSwQwRbzst4/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NTk3WDkwMA==/z/caAAAOSwfONbzst5/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NTk3WDkwMA==/z/FMYAAOSw7Vtbzst7/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NTk3WDkwMA==/z/GA4AAOSwg65bzst-/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NTk3WDkwMA==/z/N-IAAOSwXx9bzsuA/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NTk3WDkwMA==/z/qDcAAOSw2-pbzst3/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NTk3WDkwMA==/z/E9wAAOSwW4dbzst5/$_12.JPG?set_id=880000500F"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "yokohama-premium", "FeedbackRatingStar": "Red", "FeedbackScore": 4159, "PositiveFeedbackPercent": 99.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 405.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 405.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "1***7", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 2}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "Epiphone Les Paul Custom Electric Guitar Black Free Shipping from Japan 381v04", "ItemSpecifics": {"NameValueList": [{"Name": "Width", "Value": ["33 cm"]}, {"Name": "Depth", "Value": ["99 cm"]}, {"Name": "Height", "Value": ["8 cm"]}, {"Name": "Weight", "Value": ["3.69 kg"]}, {"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "Style", "Value": ["Electric Guitar"]}, {"Name": "Model", "Value": ["Les Paul Custom"]}, {"Name": "MPN", "Value": ["Does not apply"]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "String Configuration", "Value": ["6 string"]}, {"Name": "Action - 1st string at 12F", "Value": ["2 mm"]}, {"Name": "Action - 6th string at 12F", "Value": ["2.5 mm"]}, {"Name": "Serial number", "Value": ["U04082181"]}]}, "HitCount": 84, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1258068053", "StoreName": "yokohama-premium"}, "Country": "JP", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "South America"], "GlobalShipping": false, "ConditionDescription": "This is a used item. There are signs of wear such as scrapes and scratches on the item. Please see all photos.", "QuantitySoldByPickupInStore": 0, "SKU": "381v040101a-e-xxxx-9", "NewBestOffer": false}