{"BestOfferEnabled": false, "Description": "Up for sale, a 1965 Epiphone Coronet in excellent condition and in perfect working order. 100% original aside from one knob, this Epi is a classic single P-90 gem made by Gibson at their famous Kalamazoo factory. Fundamentally identical to an SG Junior but notably rarer, the Coronet delivers the same rich P-90 growl and midrange kick that you expect from a great Gibson Junior (of the Les Paul or SG variety!). Very resonant and easy to play, the tone is dynamic and clear, responding to your picking dynamics and interacting with your favorite tube amp to push it into singing overdrive. And at only 6lbs 6oz, it's an incredibly light guitar too. Professionally setup here at Mike & Mike's Guitar Bar, this Coronet has been dialed in with fresh 10-46 strings and low action. The one-piece Honduran mahogany neck is fairly slender at the nut, with more depth and shoulder as you move up the fretboard. The original frets have plenty of meat, showing moderate, uniform wear on frets 1-6, with some grooving of the Brazilian rosewood fretboard as well beneath the plain strings in the first position. The frets have smooth crowns and virtually no wear further up the neck and the truss rod is responsive and optimally adjusted so that the action is slinky and comfortable all the way to the last fret. The nut measures 1 9/16\" in width, and the original double line Kluson Deluxe tuners are intact on the headstock, turn smoothly, and hold pitch as they should. On the body, all of the original electronics are intact and untouched, with CTS pots that date to '64. The hardware is consistent with spec for 1964-65, with a nickel pickup cover and vibrola tailpiece, as well as a chrome \"lightning bolt\" bridge. The guitar is currently fitted with a MojoAxe bridge, which like the original can be used as a wraparound tailpiece if desired, with the notable difference that the MojoAxe hardware is intonated for a plain G string. The Maestro vibrola is complete and has a very smooth and fluid response. The original \"spoon\" arm has clean plating, and even the small badge is still present on the vibrola base. Other hardware includes the stock pickguard with \"E\" epsilon sticker as well as the stock tone knob. The volume knob is a similar replacement with correct ribbed edge and aluminum cap, likely from an Epiphone amp from the same era Cosmetically, this Coronet shows some checking and finish chips on the profile, while the body shows plenty of small nicks and scuffs around the contoured edges, particularly on the lower bout. This sort of honest playwear is of course to be expected, and the guitar is structurally sound with zero cracks or repairs. The rich Cherry nitro lacquer finish is 100% original with no overspray, and the finish has been verified under blacklight to further confirm originality. A vintage chipboard case is included. Check out our shop \"Mike & Mike's Guitar Bar,\" and please let us know if we can answer any questions!Shipping in the continental USA will be $65, fully insured and shipped via FedEx Ground. Expedited shipping available for an additional fee at buyer's request. We will happily ship WORLDWIDE, but please contact us for an accurate international shipping quote before bidding or buying, as cost varies by buyer location. International orders will be declared as “merchandise,” and the value of merchandise will be declared as the amount paid. We cannot declare anything as a gift or for a lesser value. No exceptions! The customer is responsible for all taxes and duty, which may be collected upon delivery, as well as any additional charges involved with import. We have all necessary CITES paperwork in-hand to ship rosewood worldwide.We do our best to describe all items with honesty and accuracy, but to be sure, please contact us with any questions or concerns prior to bidding or buying. We require payment within 48 hours of auction end. In the unlikely event of a return, buyer pays all shipping costs. Your positive feedback and five star ratings are very important to us, and we appreciate your communication in resolving any issues!", "ItemID": "163453730783", "EndTime": "2019-01-02T15:54:48.000Z", "StartTime": "2018-12-27T12:00:15.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1965-Epiphone-Coronet-Vintage-Electric-Guitar-Cherry-P90-Maestro-Vibrola-Gibson-/163453730783", "ListingType": "FixedPriceItem", "Location": "Seattle, Washington", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1634537307838080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTI4MVgxNjAw/z/Iy4AAOSwhUtbaAsJ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/7pYAAOSwlOJbaAsZ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/~cMAAOSwdJJbaAsc/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/kd4AAOSwrK1baAsf/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/ypMAAOSwKHBbaAsh/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/GJYAAOSwjW5baAsR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/9I4AAOSwmodbaAsU/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/gBcAAOSwVVpbaAsW/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/5PQAAOSw4LdbaAsL/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/pg0AAOSwy7tbaAsO/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/ArAAAOSwThtbaAsk/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/3SEAAOSwQFhbaAsn/$_57.JPG?set_id=8800005007"], "PostalCode": "98117", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mmguitarbar", "FeedbackRatingStar": "Red", "FeedbackScore": 2591, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1899.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1899.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "0***-", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 5}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "1965 Epiphone Coronet Vintage Electric Guitar Cherry P90 Maestro Vibrola, Gibson", "ItemSpecifics": {"NameValueList": [{"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Body Color", "Value": ["Cherry"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Coronet"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["1965"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Material", "Value": ["Mahogany"]}, {"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}, {"Name": "Body Type", "Value": ["Solid"]}]}, "HitCount": 254, "PrimaryCategoryIDPath": "619:3858:33034", "SecondaryCategoryID": "118985", "SecondaryCategoryName": "Musical Instruments & Gear:Vintage Musical Instruments:Vintage Guitars & Basses:Electric Guitars", "SecondaryCategoryIDPath": "619:181162:181163:118985", "Storefront": {"StoreURL": "https://stores.ebay.com/id=269063702", "StoreName": "Mike and Mikes Guitar Bar"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}