{"BestOfferEnabled": true, "Description": "Gorgeous and super versatile Carvin AE185 Acoustic/Electric Semi-hollow body guitar with a ton of upgrades. The guitar features a AAA Engleman Spruce top, Mahogany body and neck with neck through body neck joint for increased sustain. Also has Ebony fretboard which isnt found on newer guitars because of new regulations limiting the use of exotic woods. Locking tuners, humbucker pickups with independent coil splitting phase switches, and an acoustic guitar pickup in the bridge with a seperate output. This guitar does have a nick and I included a picture of it just below the knobs , but it's in terrific playing condition and looks amazing. Almost zero fret wear, and electronics are excellent. Did I mention how lightweight it is? It weighs in at approximately 6lbs and change.  Fully spec'd out, this is a $1500 guitar DIRECT from Carvin. Plus Carvin USA no longer makes guitars under that brand name anymore so these old carvins are getting collectable. See below for specs.  Here are the upgraded items:  AAA Engleman Spruce top Deep Clear Gloss finish Rear of body Clear finish Matching Headstock Ebony Fingerboard Dot Inlays M22N (neck) pickup & C22T (bridge) pickup & Pizeo Acoustic pickup 2 Coil Splitters/ Phase Switches 3-way electric pickup toggle switch Carvin Hardshell Case I've also included a blue carvin strap Detailed AE185 Specs constructionneck through body, semi-hollowscale length25\"bodymahogany with AAA Engleman spruce top, single ƒ holeneckmahogany with traditional (3 X 3) headstockfingerboardebony, 14\" radiusinlaysstandard white dotsneck width1.69\" wide nut, 2.22\" wide 24th frethardwarechromebridgeebony acoustic with TUSQ saddletunersPremium Carvin locking tuners, 19:1 ratiofrets24 medium-jumbo, .103 wide X .048 tallpickupLR Baggs Ribbon transducer with C22J neck and C22B bridge pickupselectronicsActive electronics: Master volume, 3-way pickup selector & active tone control for the electric pickups. Separate active tone control for the F60 acoustic pickup. Pan control to blend between electric & acoustic pickups. Dual output jacks allow you to separate the electric and acoustic signals to different amps, or combine them into one.stringsElixir Nanoweb 1046Edimensions38.5\" long, 1.79\" thick body, 12.5\" wide bodyaverage weight6.25 lbs From Carvin's site:  The AE185 acoustic/electric guitar, first introduced in 1994, is one of our most popular models. Its unique semi-hollow acoustic/electric configuration allows you to jump from electric lead riffs to acoustic tone with ease, giving you essentially two instruments in one. The AE185 is loaded with features generally only found in boutique instruments, but because we sell direct to you, you don't have to pay a boutique price. And with hundreds of available options, you can build your AE185 exactly the way you want it, and be the proud owner of a totally unique instrument that will last you a lifetime. The AE185 is constructed to the highest possible standards of quality and playability by Carvin Guitars' Custom Shop.  The AE185 has a mahogany body and mahogany neck-through design with a smooth neck heel. Mahogany is a popular tone wood used in many guitars, chosen for it's clear, warm tone and attractive grain. It looks great in any of the Custom Shop's many finishes, including solid colors, translucent finishes and our new metallic solid finishes. The top is constructed from hand-selected premium AAA Engleman spruce, which is the perfect tone wood for this type of design. You can add other premium top woods, such as red cedar, AAAA flamed maple, AAAA quilted maple, flamed koa, and highly figured California Claro walnut. In addition to the many different types of wood Carvin offers, you can add multi-layered tortoiseshell body binding to accentuate the top of the instrument. A single ƒ hole adds to the acoustic/electric vibe of the instrument, while improving the acoustic tone.  The standard mahogany neck adds to the overall tone of the instrument, and optional 5-piece necks of different combinations of maple, mahogany, walnut and koa add to the already great looks of this instrument. All of our necks and fingerboards undergo a long conditioning process in our de-humidification chambers to remove any stress in the wood and prevent future warping or twisting. The dual-action, fully adjustable truss rod helps keep the neck straight and true, and allows you to set the action just the way you like it. The standard headstock is our traditional 3 X 3 style, or you can also choose a 3 X 3 CT-style, V style, or inline design. The AE185's headstock is mahogany, or you can add a headstock overlay from our large selection of premium woods to match your optional top wood.  neck shown (TN &  The AE185 has a standard 25\" scale ebony fingerboard with white pearl dot block inlays, a 14\" radius and 24 medium-jumbo nickel frets. Carvin Guitars offers many fingerboard options - more options than most manufactures offer for their entire guitar lines. You can choose from rosewood, maple or birdseye maple fingerboards; dot, diamond or block inlays in mother-of-pearl or genuine abalone; and fingerboard radii of 10\" or 14\". The Custom Shop also offer a number of fretwire options, including jumbo, low-wide and stainless steel. The \"Rapid Play\" low action neck assures effortless playability throughout the entire fingerboard, while the smooth neck heel allows easy access all the way up to the 24th fret.  An ebony acoustic bridge with TUSQ saddle is standard, with the strings fed through the body. Premium locking tuners with a 19:1 ratio ensure you'll stay in tune no matter what your playing style is. Standard hardware is chrome, and you can upgrade to black or gold. If you want to really dress up your AE185, add our metallic gold headstock logo for just the right touch of class. You can personalize your AE185 with an engraved truss rod cover, adding to the uniqueness of the instrument.  For electric playing, Classic Series C22 humbucking pickups are standard on the AE185. These pickups are custom wound with vintage plain enamel wire that brings out the harmonically rich tone and sustain of the guitar, and also have 11 polepieces per coil. Standard pickups have black coils and bezels, but any combination of black or cream coils and bezels are available. There are many other pickup options available, including our M22 series and H22 series humbuckers. You can also add our new metal-covered S22 humbuckers, which will match your hardware selection, and the standard black bezels can be upgraded to cream. For acoustic playing, an LR Baggs ribbon transducer pickup is standard. Active electronics are standard, consisting of master volume, 3-way pickup selector & active tone control for the electric pickups, separate active tone control for the acoustic pickup, and pan control to blend between electric & acoustic pickups. Dual output jacks allow you to separate the electric and acoustic signals to different amps, or combine them into one.", "ItemID": "192796320418", "EndTime": "2019-01-22T00:18:24.000Z", "StartTime": "2019-01-19T13:25:36.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Carvin-USA-AE-185-w-case-Thinline-Electric-Semi-Hollowbody-acoustic-Rare-/192796320418", "ListingType": "FixedPriceItem", "Location": "North Wilkesboro, North Carolina", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1927963204188080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/ccAAAOSw4zdcQyQ-/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/OP8AAOSwu4dcQySa/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/4esAAOSwMKxcQySc/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/qIIAAOSw~slcQySe/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/K6UAAOSwsrlcQySg/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/whIAAOSwZddcQySj/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/o04AAOSwvapcQySl/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/3fsAAOSwEcdcQySn/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/NwEAAOSw84ZcQySq/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/GhgAAOSwDaBcQySs/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/qoIAAOSw8zNcQySt/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/xEAAAOSwtpJcQySv/$_12.JPG?set_id=880000500F"], "PostalCode": "28659", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "tidalboy1", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 210, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 849.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 849.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "c***c", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 265}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Carvin USA AE-185 w/case. Thinline Electric Semi-Hollowbody + acoustic. Rare", "ItemSpecifics": {"NameValueList": [{"Name": "Body Material", "Value": ["Mahogany"]}, {"Name": "Brand", "Value": ["Carvin"]}, {"Name": "Model", "Value": ["AE-185"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Body Type", "Value": ["Semi-Hollow"]}, {"Name": "Body Color", "Value": ["Blue"]}]}, "HitCount": 125, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}