{"BestOfferEnabled": false, "Description": "Classic Les Paul with Versatile Updates It's hard to beat the Gibson Les Paul Standard T solidbody electric guitar for iconic tone with uncompromising playability. You'll love the Les Paul Standard T's premium features, such as the modern weight-relieved body that still packs ample sustain. The mahogany neck sports the SlimTaper neck profile and compound-radius rosewood fretboard for fast and fluid fretwork. And with the Gibson Les Paul Standard T's dual Burstbucker Pro pickups with coil tapping, phase reversal, and pure bypass, you'll have all the guitar tones you'll need. Gibson Les Paul Standard 2017 T at a Glance:Plek'd for precision playabilityWeight-relieved body for comfortCompound-radius fretboardPAF humbucker tone with coil tappingPlek'd for precision playability This Les Paul Standard 2017 T feels fast and precise, thanks in large part to Plek processing. Typically reserved for top-dollar custom guitars, this process levels the frets with pinpoint precision, providing you with the most playable fretboard you're likely to own. Each note rings loud and clear, and the fret edges feel smooth as silk. Weight-relieved body for comfort Early Les Pauls are glorious, but they are also oftentimes very heavy. Thankfully, Gibson has done something special with this Les Paul Standard 2017 T. It features their Ultra-modern weight-relief design that retains the chime and resonance of vintage Les Pauls with a big reduction in weight. The Gibson Les Paul Standard 2017 T's lighter weight allows you to enjoy yourself onstage for longer and avoid the shoulder and back pain that can sometimes accompany those all-night gigs. Compound-radius fretboard The Les Paul Standard 2017 T features a compound-radius fretboard for fantastic playability. The fingerboard features a standard Gibson 10\" radius near the nut for a familiar feel that offers easy chording and rhythm playing. As you move up the fretboard, it gradually flattens out to a 16\" radius. This flatter feel is extremely popular for the way it enables easier single-note runs and wide string bends that won't fret out. Compound-radius fretboards are the best of both worlds and feel completely natural. PAF humbucker tone with coil tapping When it comes to capturing that classic Les Paul tone, nothing beats the sound of this Les Paul Standard 2017 T's PAF-style Burstbucker humbucking pickups. You'll love the tight low end, complex midrange, and sweet highs you'll get out of these pickups. And for more tonal flexibility than ever, the Les Paul Standard 2017 T sports coil-tapping, phase-reversal, and pure-bypass electronics, all at the touch of a push-pull knob. Gibson Les Paul Standard 2017 T Features:Flagship Les Paul with modern updatesModern weight-relieved body reduces weight while maintaining sustainCompound-radius fretboard facilitates chording and single-note workDual push-pull volume controls switch between single-coil and humbucking operationPush-pull neck tone controls pickup phase reversalPush-pull bridge tone control activates Pure Bypass modeSelf-lubricating TekToid nutDurable and precise locking Grover kidney-button tunersPlek'd for precision playability There are some light scratches on the body. They show up well in photos.", "ItemID": "254019467576", "EndTime": "2018-12-16T21:24:20.000Z", "StartTime": "2018-12-09T21:24:20.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-Les-Paul-Standard-2017-Bourbon-Burst-/254019467576", "ListingType": "Chinese", "Location": "Sanford, North Carolina", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2540194675768080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTU4NFg0ODg=/z/vxkAAOSwnv9cBEvT/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/w8oAAOSwPrtcBEnL/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/wLoAAOSwVIBcBEnN/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/LrMAAOSwjt1cBEnO/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/YEEAAOSw8MxcBEnQ/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/UO4AAOSwa3lcBEnS/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/wcIAAOSwqoxcBEnT/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/KAMAAOSwwtdcBEnV/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/mdkAAOSwLr1cBEnX/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/iQgAAOSw87JcBEnY/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/gucAAOSw84ZcBEna/$_12.JPG?set_id=880000500F"], "PostalCode": "27330", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "skyhook2004john", "FeedbackRatingStar": "Yellow", "FeedbackScore": 49, "PositiveFeedbackPercent": 100.0}, "BidCount": 3, "ConvertedCurrentPrice": {"Value": 1650.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1650.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "r***j", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 8}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson Les Paul Standard  2017 Bourbon Burst", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "MPN", "Value": ["LPSTDPITCH1 LPSTDITCH1", "LPSTDPITCH1", "LPSTDITCH1", "LPSTDHSCH1"]}, {"Name": "MPN", "Value": ["LPSTDHSCH1"]}]}, "HitCount": 272, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 1675.0, "CurrencyID": "USD"}, "ProductID": {"Value": "137019569", "Type": "Reference"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}