{"BestOfferEnabled": true, "Description": "This Dave Murray Strat is in pristine, like new condition! There is not a single mark on the entire guitar and still has the protective plastic on the pickguard and rear tremolo cover plate. It also comes with every piece of case candy that is included with the guitar new. This case candy has never been opened. The Fender case is also in mint condition. This guitar new with a case would be in the $1200 range. You can save $ and still get a guitar that is near new in condition. Please feel free to ask any questions! Shipping is actual calculated UPS ground. About this Dave Murray Workhorse Strat Among classic metal heads, Iron Maiden guitarist Dave Murray remains one of the industry's most iconic axe men. This Fender Dave Murray California Series Stratocaster gives you a chance to get your hands on the workhorse guitar of a legendary player. It combines traditional Strat style and playability with the rampant energy of three Seymour Duncan humbuckers (two Hot Rails with a JB Jr in the middle). And for an added performance boost, Fender gave the Dave Murray California Series Stratocaster a compound-radius fretboard, making it ideal for both rhythm and lead work. Fender Dave Murray California Series Stratocaster Solidbody Electric Guitar at a Glance: Seymour Duncan humbuckers deliver seriously aggressive tone Compound-radius fretboard lets you chord and solo with ease Floyd Rose 2-point locking trem adds epic stability to your action Seymour Duncan humbuckers deliver seriously aggressive tone Hot Rails are some of the highest-output pickups Seymour Duncan makes, and their ceramic-magnet-driven tone is a staple among garage rockers and metal heads the world over. That makes them a perfect fit for a guitarist like Dave Murray, whose specialty is old-school, high-octane lead tone with mind-blowing sustain. But there's an element of classic rock to his sound, too, which is where the JB Jr in the middle position of the Dave Murray California Series Stratocaster comes into play, offering you an awesome array of additional tonal character. Compound-radius fretboard lets you chord and solo with ease The Dave Murray California Series Stratocaster features a super-playable 9.5\"-14\" compound-radius fretboard. That means its fingerboard has a traditional 9.5\" radius down by the nut, which makes it easy to grab chords and strum rhythms. As you move up the fretboard where you're more likely to bend notes, the fretboard flattens out to a 14\" radius, which allows you to more easily bend notes - effectively offering you extra fretboard space so you're less likely to run off the edge. Ultimately, the Dave Murray California Series Stratocaster's compound-radius makes transitioning between rhythm and lead playing effortless. Floyd Rose 2-point locking trem adds epic stability to your action If you're looking for an axe you can suspend by the whammy bar (how metal is that?) without knocking it out of tune, then you're going to be happy with the Dave Murray California Series Stratocaster. With its 2-point locking Floyd Rose tremolo, you'll not only get the buttery-smooth bending action only a real Floyd rose can deliver, but you'll also virtually never have to worry about yanking your strings out of tune. Fender Dave Murray California Series Stratocaster Solidbody Electric Guitar Features: An updated signature Strat made in collaboration with longtime Iron Maiden guitarist Dave Murray Loaded with Seymour Duncan humbuckers (Hot Rails and a JB Jr in the middle) for an aggressive sound Traditional Strat style and format includes a fast and comfortable C-shaped maple neck Compound-radius fretboard makes chording low and soloing high more ergonomic Equipped with a classic 2-point locking Floyd Rose tremolo for smooth bending Get the ultimate metal playing experience with a Fender Dave Murray California Series Stratocaster!", "ItemID": "323632877366", "EndTime": "2019-01-08T00:35:24.000Z", "StartTime": "2019-01-03T00:35:24.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fender-Stratocaster-Dave-Murray-Floyd-Rose-Seymour-Duncan-PU-s-Mint-New-Cond-/323632877366", "ListingType": "Chinese", "Location": "Chillicothe, Ohio", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/3236328773668080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/8nAAAOSw6EpcLVHz/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDg2/z/JWwAAOSwWrxcLVH7/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjMw/z/OaAAAOSwi7VcLVHq/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg4ODY=/z/4MYAAOSwhspcLVHt/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNDYw/z/3LIAAOSwhEhcLVH2/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/7VgAAOSwBktcLVht/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/Njk0WDE2MDA=/z/f0gAAOSw2hxcLVH4/$_12.JPG?set_id=880000500F"], "PostalCode": "45601", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jdgstdvcgc", "FeedbackRatingStar": "Blue", "FeedbackScore": 81, "PositiveFeedbackPercent": 100.0}, "BidCount": 10, "ConvertedCurrentPrice": {"Value": 615.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 615.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "e***s", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 638}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Fender Stratocaster Dave Murray Floyd Rose, Seymour Duncan PU’s. Mint/New Cond.", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "Body Material", "Value": ["Alder"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "MPN", "Value": ["141010303"]}]}, "HitCount": 629, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 625.0, "CurrencyID": "USD"}, "ProductID": {"Value": "219506599", "Type": "Reference"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 0, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}