{"BestOfferEnabled": true, "Description": "The Godin Multiac Spectrum is their top line steel-string member of their esteemed acoustic-electric series. It's equipped with the latest custom electronics, a Seymour Duncan lipstick pickup and a 13 pin synth access, giving it three distinct voices and a multitude of tone shaping capabilities. Whatever the job may be, the Multiac Spectrum can help you get it done in style. This guitar was owned by a regular customer and is in great condition with original gig bag. The Godin Multiac Spectrum is a great guitar for live performances and recording and features:Solid spruce topChambered mahogany bodyMahogany Neck with 16\" radius with Richlite® fingerboard25.5\" scale with 1.71\" width at the nutSeymour Duncan lipstick pickup with separate volume and tone controlsCustom RMC electronics 13-pin Synth Access 3 Band active EQ1/4\" output jackSchaller strap lock buttonsIncludes deluxe Godin padded gig bagOriginal MAP $1750 The Multiac Spectrum is a sophisticated looking guitar with a nicely detailed binding, glossy headstock and chambered mahogany back. Like all Multiac guitars the playability is first rate, and for what is essentially an chambered acoustic guitar, the action is very comfortable. This is a guitar you can gig with all evening long, and players used to electric guitars will not find the Multiac a chore or fatiguing. To see how it sounded we tested the Spectrum through our master of clean tone, the Fender Bassman. Unlike the lower priced A6 line, the Spectrum uses a spruce top, and has much larger chambered body with bracing, so the sound is noticeably more brilliant and articulate. The bridge pickup has a very natural acoustic tone with sparkling high end, and smooth midrange content. Compared to a \"real\" acoustic it might be more like folk or concert guitar than a dreadnaught. The Seymour Duncan lipstick pickup by itself is a nice jazz sound. It's warm but not too wobbly and it enhances the low end attack. The real fun begins when you start blending in the bridge pickup. It adds a crisp edge to the highs and the acoustic atmosphere helps to open up the bass response. Overall, the pickup combination is well balanced and the controls make it possible to navigate completely different genres with a single slider. While we did not test the synth on this guitar, we have tried it on other Godin models like the XTSA. The tracking is spot-on and it is an essential tool for today's solo artists or anyone who wants to add an extra dimension to their music. As with other Godin synth models, you can blend the natural guitar tone with the synth sounds to create a multi-layered musical soundscape. In the end, the Godin Multiac Spectrum is certainly a top grade instrument. It sings like an acoustic, plays like an electric and has the technology for a modern musician. Whether you are playing to a coffee shop, a stadium, or in Pro-Tools, the Multiac Spectrum can give you the best of many worlds. We are an authorized Godin dealer and this is a new guitar with all tags, tools, paperwork and certificates. We have over 30 Godin-family guitars stock at all times, and please feel free to browse our other listings, or contact us for delivery time and availability on other Godin models.Orders received by 12:00pm EST will be shipped the next business day. All merchandise is subject to prior in-store sales and we reserve the right to end this auction early. Thank you for your interest. Payment I accept the following forms of payment: PayPalDirect Offline Credit Card Payment: Visa/Master Card, Discover Card, American Express", "ItemID": "292852659319", "EndTime": "2018-12-17T12:45:45.000Z", "StartTime": "2018-12-06T20:32:04.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Godin-Multiac-Steel-Spectrum-Black-Authorized-Godin-Dealer-/292852659319", "ListingType": "FixedPriceItem", "Location": "Bellingham, Massachusetts", "PaymentMethods": ["PayPal", "VisaMC", "Discover", "AmEx"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2928526593198080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NjY4WDEwMDA=/z/-10AAOSwKSlcCYaR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAwMFg2ODU=/z/juoAAOSwqRlcCYaQ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjY4WDEwMDA=/z/9lQAAOSw1dtcCYaZ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjY3WDEwMDA=/z/y6IAAOSwkFZcCYaT/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjY3WDEwMDA=/z/S9MAAOSwXMxcCYaU/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjY3WDEwMDA=/z/DegAAOSw~D5cCYaN/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjY4WDEwMDA=/z/doUAAOSwEUdcCYaO/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAwMFg2ODU=/z/VroAAOSwhEhcCYaW/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjY4WDEwMDA=/z/i2AAAOSwVBRcCYaX/$_57.JPG?set_id=8800005007"], "PostalCode": "02019", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "upfrontguitars", "FeedbackRatingStar": "Red", "FeedbackScore": 1812, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1099.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1099.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "p***d", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 21}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Godin Multiac Steel Spectrum Black Authorized Godin Dealer", "ItemSpecifics": {"NameValueList": [{"Name": "Country of Manufacture", "Value": ["Canada"]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "Model", "Value": ["Steel Spectrum"]}, {"Name": "Country/Region of Manufacture", "Value": ["Canada"]}, {"Name": "MPN", "Value": ["031245"]}, {"Name": "Brand", "Value": ["Godin"]}, {"Name": "Body Type", "Value": ["Semi-Hollow"]}]}, "HitCount": 73, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=12205009", "StoreName": "UpFront Guitars LLC"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": true, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "This guitar was owned by a regular customer and is in great condition with original gig bag.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}