{"BestOfferEnabled": false, "Description": "BIG DEAL PAWN & SHOP Alex Chase Neck-Through Cobra Telecaster Electric Guitar Description: This is an Alex Chase electric guitar with the pictured NBT hardshell case. It is wide open for offers and we welcome any info you may have on the guitar. The case hinges are not quite right so the two halves of the case have to be aligned before you can close the latches. The guitar is well worn and has a lot of scratches, dings gouges, etc. As you would expect, the frets are worn, but are far from unplayable. It's a good player though. We don't know a lot about them, but this one looks pretty nice with multi-ply, neck-through construction and typical a traditional Tele layout. It plays well, and the pickups and pots work fine. The pots are clean as well. Please ask us any questions that you may have. We have excellent customer service and will answer you promptly. Details Notes: This is an Alex Chase electric guitar with the pictured NBT hardshell case. It is wide open for offers and we welcome any info you may have on the guitar. The case hinges are not quite right so the two halves of the case have to be aligned before you can close the latches. The guitar is well worn and has a lot of scratches, dings gouges, etc. As you would expect, the frets are worn, but are far from unplayable. It's a good player though. We don't know a lot about them, but this one looks pretty nice with multi-ply, neck-through construction and typical a traditional Tele layout. It plays well, and the pickups and pots work fine. The pots are clean as well. Please ask us any questions that you may have. We have excellent customer service and will answer you promptly. Payment PayPal is the ONLY online payment method we accept at this time. Your PayPal account must be a Verified U.S. PayPal Account. We also recommend that you use a Confirmed Ship To Address. Shipping Your item will be shipped within 1 business day(s). After shipping your items will be delivered within 1-10 business days. Terms of Sale Tax applies in: GA About Us Big Deal Pawn & Shop always offers \"Bigger Loans, Bigger Stuff and Bigger Deals.\" Serving Woodstock, Acworth, Kennesaw, Marietta, and Canton Georgia, Big Deal Pawn and Shop makes big deals on everything from electronics and jewelry to tools. We offer sales and loans on many items. Our store makes browsing our high-quality inventory easy to get to. Drop by and visit us today for great deals! Things I Buy: Jewelry, Gold, Silver, Coins, Diamonds, TV's, Laptops, Guns Bravo Store Systems Point-of-Sale Operating System Bravo Omni-Commerce solutions offers Brick & Mortar stores the only fully integrated eBay API that seamlessly & effortlessly combines the in-store Point-of-Sale to all eBay commerce selling activities. Click here & find out why eBay stated \"Bravo has best solved Brick & Mortars can sell on eBay\"", "ItemID": "382663247326", "EndTime": "2018-12-15T17:54:43.000Z", "StartTime": "2018-12-08T17:54:43.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Alex-Chase-Neck-Through-Cobra-Telecaster-Electric-Guitar-BD1061321-/382663247326", "ListingType": "Chinese", "Location": "Acworth, Georgia", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/3826632473268080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/2TUAAOSw1nZboAJs/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/CkQAAOSwuGhboAJs/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/A3EAAOSwAnlboAJs/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/OlUAAOSwdZdboAJt/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/VbUAAOSwnBRboAJt/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/gVQAAOSw1vVboAJt/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/0NQAAOSwkJNboAJu/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/feQAAOSwzMhboAJu/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/HxUAAOSwoIpboAJv/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/ywEAAOSwWQpboAJv/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/NjAwWDgwMA==/z/OloAAOSwdZdboAJw/$_1.JPG?set_id=2", "https://i.ebayimg.com/00/s/ODAwWDYwMA==/z/XSEAAOSwLTpboAJx/$_1.JPG?set_id=2"], "PostalCode": "30102", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "bigdealpawn", "FeedbackRatingStar": "Green", "FeedbackScore": 8208, "PositiveFeedbackPercent": 99.7, "TopRatedSeller": true}, "BidCount": 10, "ConvertedCurrentPrice": {"Value": 157.5, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 157.5, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***g", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 123}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Alex Chase Neck-Through Cobra Telecaster Electric Guitar (BD1061321)", "ItemSpecifics": {"NameValueList": [{"Name": "Model", "Value": ["CUSTOM TELE"]}, {"Name": "Brand", "Value": ["ALEX CHASE"]}]}, "HitCount": 491, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=987312942", "StoreName": "BIG DEAL PAWN AND SHOP"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 160.0, "CurrencyID": "USD"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "Oceania", "Southeast Asia", "South America", "BM", "GL", "MX", "PM"], "TopRatedListing": true, "GlobalShipping": false, "ConditionDescription": "This is an Alex Chase electric guitar with the pictured NBT hardshell case. It is wide open for offers and we welcome any info you may have on the guitar. The case hinges are not quite right so the two halves of the case have to be aligned before you can close the latches. The guitar is well worn and has a lot of scratches, dings gouges, etc. As you would expect, the frets are worn, but are far from unplayable. It's a good player though. We don't know a lot about them, but this one looks pretty nice with multi-ply, neck-through construction and typical a traditional Tele layout. It plays well, and the pickups and pots work fine. The pots are clean as well. Please ask us any questions that you may have. We have excellent customer service and will answer you promptly.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}