{"BestOfferEnabled": false, "Description": "All photos are of the actual item for sale. Great Condition This was taken in as a trade. Besides minor scuffs and scratches from normal use, guitar is in great condition. Our service department tested the unit and no issues were found. Please see the photos above; they are of the actual item for sale. We receive used gear on a daily basis. Some with slight cosmetic flaws, functionality issues, and sometimes it is completely broken. Our goal is to move it out of our warehouse ASAP! After the product is tested and photos are taken, it is boxed, sealed, and stored in our warehouse. We are unable to provide additional pictures. Everything we know about the condition, functionality, and included accessories is stated here. We do our best to describe everything as accurately as we can. Jackson X Series Soloist SLX Solidbody Electric Guitar - Satin Red Pearl The Jackson X Series Soloist SLX electric guitar is a modern metal player's dream. With a Basswood body, oil-finished Maple neck, and lightning-fast Rosewood compound-radius fingerboard, you'll be free to explore and hone your own style. In addition, two Duncan Designed HB-103N and high-output ceramic HB-103B humbucking pickups give you a massive array of tonal possibilities. A Floyd Rose double-locking, 2-point tremolo also gives the X Series Soloist some serious dive-bombing capability. Topped off with eye-catching black nickel hardware, the Jackson X Series Soloist SLX is gig-ready when you are. Tech Specs Body Type: Solidbody Body Shape: Soloist Left-/Right-handed: Right-handed Number of Strings: 6 Body Material: Basswood Body Finish: Satin Color: Red Pearl Neck Material: Maple Neck Shape: Speed Neck Radius: 12\"-16\" compound Fingerboard Material: Rosewood Fingerboard Inlay: Pearloid Sharkfin Number of Frets: 24, Jumbo Scale Length: 25.5\" Nut Width: 1.6875\" Nut Material: Floyd Rose Special Locking Bridge/Tailpiece: Floyd Rose Special Double-locking 2-point Tremolo Tuners: Jackson Sealed Die-cast Neck Pickup: Seymour Duncan HB-103N Humbucker Bridge Pickup: Seymour Duncan HB-103B Humbucker Controls: 1 x volume, 1 x tone, 3-way blade pickup switch Strings: NPS, .009-.042 Manufacturer Part Number: 2916221552 Includes* Guitar Only *There could be important accessories not included. We do our best to call out the accessories that should be included that are missing, however, we don't research every item to know with certainty what should be included. Please do this research before bidding and know what you are purchasing. Everything included in the auction will be pictured in the photos above. If something is not pictured or mentioned, it is not included with the purchase. Check out my other auction listings! and be sure to add me to your favorites list. CONTACT INFORMATION You can e-mail us with any questions you may have about an item. We are very easy to reach, and we are glad to help. Just click \"Ask a question\" in the questions and answers area below. Please note that we are not in the office after 5:00PM EST on weekdays, or all day Saturdays and Sundays. Questions asked over the weekend will be answered on the following business day. SHIPPING INFORMATION Items are shipped within one business day of payment. To avoid a lost or stolen item, your package may ship \"Signature Required.\" If you have special shipping instructions or would like your item shipped UPS instead of USPS or FedEx, please contact us before you make a purchase. We collect local sales tax here in Indiana. This applies to Indiana residents who we ship to, as well as non-Indiana residents who drive here for local pickups. We also collect sales tax in other states around the country. Please check eBay's tax information on the \"Shipping and payments\" tab above to see if we are collecting tax in your area. PLEASE NOTE Shipping quotes are estimates only. We use eBay’s shipping calculator, which provides estimated shipping charges on listings where “Free Shipping” is not offered. Ebay's FedEx calculator on the item page quotes eBay's discounted FedEx shipping rates, which we honor. At checkout, however, buyers in certain areas will see the calculator attempt to charge the full retail price. FedEx's full retail price is the price you pay if you were to walk into a FedEx retail location. The difference between eBay's discounted rate and this retail price can be as much as 40%. If you estimate shipping with a zip code that is different from the zip code registered to your User ID, eBay’s shipping calculator will make the adjustment at checkout. Additionally, FedEx charges a surcharge for delivery in certain rural areas of the country that does not, for some reason, show up in eBay’s estimate calculator; but it does at checkout (we wish we could control this, but we can’t — we have contacted eBay many times about this issue). FedEx does this based on the +4 extension of your primary 5-digit zip code. For example, eBay’s shipping calculator may quote you one price based on your primary 5-digit zip, and then figure out that your requested street address at checkout places you within the rural surcharge area, changing the shipping price to an alternate amount that was originally quoted. If there is a discrepancy in your shipping cost, please send us a screen shot of the quoted price to you on our item page and we can override the eBay checkout calculation to get you the cheapest rate. RETURN INFORMATION We want you to be completely happy with your purchase. If the item you receive is not as described or has been damaged in shipping, please contact us immediately. We will make every effort to promptly resolve any problem. Your satisfaction is our top priority. We are happy to offer free shipping on some of the items we offer. Please note that if you decide to return something where free shipping was offered, our shipping costs are non-refundable.", "ItemID": "132920593249", "EndTime": "2019-01-24T01:45:00.000Z", "StartTime": "2019-01-17T01:45:00.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Jackson-X-Series-Soloist-SLX-Solidbody-Electric-Guitar-Satin-Red-Pearl-/132920593249", "ListingType": "Chinese", "Location": "Fort Wayne, Indiana", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1329205932498080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg2MzM=/z/h6oAAOSwaaNcHU0F/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMTYw/z/NLoAAOSwb8BcHU0H/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU5OVg2MzI=/z/NcsAAOSwdUJcHU0I/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMTc3/z/XbMAAOSwNTNcHU0K/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDE=/z/zL4AAOSwiJZcHU0M/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5NzY=/z/7DIAAOSwA3xcHU0O/$_57.JPG?set_id=8800005007"], "PostalCode": "46818", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jeffsmusicgear", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 14342, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 249.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 249.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "b***a", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 6}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Jackson X Series Soloist SLX Solidbody Electric Guitar - Satin Red Pearl", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Jackson"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "MPN", "Value": ["2916221552"]}, {"Name": "Body Color", "Value": ["Satin Red Pearl"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["Indonesia"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Model", "Value": ["X Series Soloist SLX"]}, {"Name": "Model Year", "Value": ["2017"]}, {"Name": "Size", "Value": ["Full Size"]}, {"Name": "Product Line", "Value": ["Jackson Soloist"]}, {"Name": "Body Material", "Value": ["Basswood"]}, {"Name": "Features", "Value": ["Floyd Rose Special vibrato", "1-piece through-body Maple neck", "Graphite neck reinforcement"]}]}, "HitCount": 194, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=36123540", "StoreName": "jeffsmusicgear"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 252.49, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "TopRatedListing": true, "GlobalShipping": false, "ConditionDescription": "Great Condition. This was taken in as a trade. Besides minor scuffs and scratches from normal use, guitar is in great condition. Our service department tested the unit and no issues were found. Please see the photos above; they are of the actual item for sale.", "QuantitySoldByPickupInStore": 0, "SKU": "SLXSRPRLU", "NewBestOffer": false}