{"BestOfferEnabled": false, "Description": "Dean Vendetta 4.0 Electric Guitar with Floyd Rose, Classic White w/ Deluxe Case Click images to enlarge Description Welcome to Our-Great-Goods! Dean Vendetta 4.0 Electric Guitar with Floyd Rose, Classic White w/ Deluxe Case In very nice used condition!! This was identified by pictures: please take a good look, not positive my description is totally correct Dean's Vendetta 4 electric guitar is made from solid mahogany with a quilted maple top and maple neck-thru construction that provide jaw-dropping good looks and amazing, fat sound. Mahogany's warm tone and sustain meets the bright edge of maple for a full spectrum of tone. Powerful Dean USA DMT Time Capsule humbuckers faithfully carry every shred and crunch to your amp. Your pilot's license is waiting in the form of the guitar's Floyd Rose-licensed tremolo, fueled up and ready to dive-bomb the very next crowd you play for. Razor wire style inlay will inspire you to really tear it up. FEATURES Neck through construction Solid mahogany body with quilted maple top and back Maple neck with rosewood fingerboard Dean USA DMT Time Capsule humbuckers Licensed Floyd Rose tremolo system Classic Dean V Ferrule pattern 24 frets 25-1/2\" scale Nickel hardware In very good used condition, minor scratches.  I really can't find anything really wrong with this, looks great.  Has been stored and the strings look like they have a residue, you will probably want to replace the strings. Noticed one chip on the front near some of the hardware, see photo. Included: Dean Vendetta 4.0 Electric Guitar with Floyd Rose, Classic White w/ Deluxe Case, extra bolts, pick, strap, key to case and allen wrenches.  All pictured is included! I Have Attempted to Photograph and Describe Any and All Imperfections But May Have Missed a Few! Please view photos carefully We combine shipping on mulitple orders! Payment We accept & prefer Paypal for all payments All sales are expected to be paid within 4 days otherwise an unpaid case will be opened. No exceptions to payment rules. Shipping We do not allow local pickup! We will ship all purchases the next business day after payment is made. We Will Combine Shipping On All Items You Purchase from us. Please wait for invoicing before paying to receive combined shipping. Continental US shipping is quoted in the auction. We no longer will sell or ship overseas or internationally. Shipping & handling is quoted flat rate first class or priority for the continental U.S. Hawaii, Alaska & Puerto Rico is 2x quoted price. Larger packages will be assessed according to the current shipping carrier prices. All items selling for over $750.00 will include signature confirmation. Please contact us for a quote on larger items. If you feel that our shipping & handling is too high---PLEASE do not bid. Handling charges are included in the shipping charges. We do not include insurance on our packages, If the package arrives with any damage, please do not open & return to sender via the carrier it was sent with. Terms of Sale We stand behind all products we sell. If you have any issue, please contact us & allow us the opportunity to make it right. We do not entertain Buy It Now offers We do not offer local pick up We accept returns within 30 days after end of auction. Payments are required within 4 days after end of auction. Unpaid cases will open on unpaid items after that time. NO EXCEPTIONS! Please wait for invoicing on combined shipping items to receive discounted rates. Do not pay before receiving invoice. We do not reimburse paid shipping expenses. About Us We are OUR-GREAT-GOODS Please read all of our terms & conditions carefully! We do sell used items, in addition to our new items, and will do our best to describe its functionality & condition. This is our business & if you bid, please intend to buy. We do not accept buy it now offers once it is up as an auction PLEASE address all questions before bidding. You may contact us through Ebay messages with questions. We are open 10-6 EST Mon-Fri. & will respond to all questions within those times We will only respond to e-mail through Ebay! We take pride in our sales & will strive to make all sales smooth & effortless. We reserve the right to cancel the bid from suspicious or bad history bidders We reserve the right to end any auction early! This is a full time operation. We will answer questions during business hours only. 10-6 EST Monday-Friday If you are unhappy with your sale, please contact us & we will do our best to fix the problem. Returns are accepted within 30 days of receipt of item. Refunds are given as money back. Return shipping is the responsibility of the buyer. Contact Us Please contact us through eBay messages. We respond to eBay messages ONLY! Images sell! Get Supersized Images & Free Image HostingCreate your brand with Auctiva's Customizable Templates. Attention Sellers - Get Templates Image Hosting, Scheduling at Auctiva.com. Track Page Views WithAuctiva's FREE Counter", "ItemID": "123528418432", "EndTime": "2018-12-13T02:06:41.000Z", "StartTime": "2018-12-06T02:06:41.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Dean-Vendetta-4-0-Electric-Guitar-Floyd-Rose-Classic-White-w-Deluxe-Case-/123528418432", "ListingType": "Chinese", "Location": "Coatesville, Pennsylvania", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1235284184328080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTAyNFg2ODI=/z/-G4AAOSwLNxcCIRH/$_1.JPG?set_id=880000500F"], "PostalCode": "19320", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "our-great-goods", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 16045, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 30, "ConvertedCurrentPrice": {"Value": 132.23, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 132.23, "CurrencyID": "USD"}, "HighBidder": {"UserID": "b***4", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 242}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Dean Vendetta 4.0 Electric Guitar with Floyd Rose, Classic White w/ Deluxe Case", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Dean"]}, {"Name": "MPN", "Value": ["Vendetta 4.0"]}]}, "HitCount": 317, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller"}, "MinimumToBid": {"Value": 134.73, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "TopRatedListing": true, "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}