{"BestOfferEnabled": false, "Description": "This is a NO RESERVE AUCTION FOR A GIBSON 2006 Les paul Classic. This wonderful 2006 Les Paul Classic has been \"improved\" ...The original pickups have been replaced with Epiphone humbuckers... (no additional holes or weirdities. Easily retrofit...)The word \" Classic\" has been eradicated from the peghead ..The trussrod cover that said \" classic\" has been replaced with a plain one.The pickguard has been replaced with one that doesn't say \" 1960\" .We are including two Gibson pickups that can be installed . The neck profile is wonderful; wide and flat.The finish is beautiful and the guitar plays great..except: the open D string is buzzing; the nut should be looked at...The guitar weighs 9.7 poundsComes with what I assume is the original black Gibson case, in good, functional condition. ....We charge 9.75% sales tax on all Sales made in California. There is no sales tax if we are shipping your item outside of California or out of the U.S.A. We do appreciate your payment within 48 hours of the auctions close. We normally ship USPS within the USA. We ship most international packages USPS priority. WE ship ANYWHERE! Quotes for international shipping are ONLY AN ESTIMATE, and all bidders agree to pay the actual shipping cost. International shipping costs VARY according to destination .Some international destinations are far more expensive than others: Australia,Spain and Brazil for example have size restrictions that impose limits on packages. The result is that SHIPPING LARGE BOXES TO THESE PLACES IS EXPENSIVE. ALL buyers agree to pay ACTUAL shipping cost! We do NOT undervalue International purchase prices .The buyer is fully responsible for any and all import and customs fees charged by your country. We ship within 5 business days of receipt of payment. Unless other arrangments are made, we only ship to addresses within the USA via usps parcel post. Please understand that shipping time via USPS can vary , and we have no control over the actual transit time, once an item has left our hands. Both Fed Ex and USPS offer faster services, but are considerably more expensive than USPS parcel post or international priority mail services. We greatly appreciate your patience. All items we sell are used unless otherwise stated. Actual Images of item are shown. You may return this item to us for a refund for ANY REASON! Items must be returned in the same condition as recieved. Items must reach us within 14 days of receipt by buyer. All shipping fees to be paid by Buyer. No customs or shipping fees will be refunded. We go to great lengths to insure that our items are described and pictured accurately . We are happy to discuss any problems you may have and strive to provide a positive experience. Although we are happy to share any knowledge we may possess about items we sell, we cannot offer technical help on the use, installation, applicability, or repair of any of our items. We are not electrical engineers, nor are we repair technicians .", "ItemID": "132907935135", "EndTime": "2019-01-14T03:45:11.000Z", "StartTime": "2019-01-04T03:45:11.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-Les-Paul-Classic-2006-Gorgeous-Sunburst-Plays-and-Looks-Great-NO-RESERVE-/132907935135", "ListingType": "Chinese", "Location": "Los Angeles, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1329079351358080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NDczWDE2MDA=/z/3JcAAOSws99cLsWY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODk2WDE2MDA=/z/f8cAAOSwQZVcLsWa/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/LsQAAOSwHrlcLsWg/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA3MlgxNjAw/z/wj0AAOSw6CRcLsWc/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNDUz/z/iJ4AAOSw8L5cLsWd/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/E-EAAOSwDmxcLsWf/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ4NlgxNjAw/z/PPAAAOSw69tcLsWi/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDkzWDE2MDA=/z/-0wAAOSw29JcLsWk/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/-T8AAOSwt3hcLsWm/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/-tsAAOSwxL5cLsXo/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/Njg0WDE2MDA=/z/-PEAAOSwnfRcLsXp/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDMxWDE2MDA=/z/Z0QAAOSwjfpcLsWn/$_57.JPG?set_id=8800005007"], "PostalCode": "90065", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "danalexanderaudio", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 137, "PositiveFeedbackPercent": 96.2}, "BidCount": 43, "ConvertedCurrentPrice": {"Value": 1159.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1159.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***a", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 31}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson Les Paul Classic 2006 Gorgeous Sunburst Plays and Looks Great NO RESERVE ", "ItemSpecifics": {"NameValueList": [{"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Model", "Value": ["Les Paul Classic"]}, {"Name": "Body Color", "Value": ["Sunburst"]}, {"Name": "Model Year", "Value": ["2006"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Modified Item", "Value": ["Yes"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Modification Description", "Value": ["see item description"]}]}, "HitCount": 2027, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "14 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 1184.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 5, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "A genius put epiphone pickups on this beautiful 2006 Gibson Les Paul Classic. I am including a pair of appropriate Gibson pickups. Plays great, but (only) the open D string has a slight buzz ....Im assuming that the nut needs to be looked at.  Action is low; the neck profile is wide and flat; super nice. Im assuming the same genius tried to remove the word \"classic\" from the peghead,installed a plain truss rod cover, and a pickguard that doesn't say \" 1960\" .  In any case, this is a beautiful guitar.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}