{"BestOfferEnabled": false, "Description": "Great condition used piece.The otherwise flat black finish has become shiny in the usual places, (back of the neck, arm rest area, etc.)A few small dings at the top back of the headstock, (see photos) otherwise the finish is in good overall condition.From the manufacturer:Melody Maker Les PaulBlend the guitar world's most desirable solid-body electric design of the past six decades and Gibson's original high-quality \"student line\" of 1959 and what have you got? The new Melody Maker Les Paul from Gibson USA, that's what! Since 1959 the Melody Maker series has brought full and uncompromised Gibson quality and tone to top-grade electric guitars priced for the student, novice, or the pro on a budget. As one of four great models in an all-new Melody Maker line up, the Melody Maker Les Paul stays true to this tradition in spades. Like their predecessors, these Melody Makers designed for the tonal demands of the second decade of the 21st century possess everything you need to rock, with none of the superfluous extras that get in the way. All are crafted from select tonewoods, carry a genuine Gibson USA humbucking pickup, and are built with traditional high-quality features such as a set-in neck, 24 3/4\" scale length and 1 11/16\" width at the nut. This great looking model is crafted in the image of a classic Gibson Les Paul with a gorgeous nitrocellulose finish. In short, nothing is spared in the effort to make these genuine Gibson guitars, but they come in a format that saves you a bundle. Maple has a long history in electric guitar making, and is one of the strongest tonewoods used in luthiery. A body crafted from solid maple gives the Melody Maker Les Paul outstanding clarity and sustain, and helps it retain sharp note definition even through a heavily cranked amp, while also allowing a thinner body than most electric guitars. The guitar's glued-in neck is crafted from solid quarter-sawn mahogany for superior strength and resonance, and carved to a superbly fast yet comfortable \"Melody Maker profile\" that measures .835\" at the 1st fret and .930\" at the 12th. In a contemporary departure from the norm, this neck carries a fingerboard made from baked maple, a heat-treated form of maple that has the rich brown look of rosewood but is superior in strength and durability, and totally sustainable besides. Rendered in the seminal shape of the original Les Paul Junior and Special of the mid-1950s—long a favorite of rock, blues and punk players and others—the Melody Maker Les Paul has deadly looks, tone, and playability. To give this guitar a punch equal to its heritage, Gibson USA loads the Melody Maker Les Paul with one of its most versatile pickups. The single 491T humbucker in the bridge position is crafted in the image of Gibson's acclaimed PAF (\"Patent Applied For\") humbucker of the late '50s, but updated with a ceramic magnet for great power, clarity and sustain, and routed through a single volume control to keep it all simple. Go easy and it purrs sweetly; hit it hard, and there's as much crunch, wail and sustain on tap as any rocker will ever need. Anchored by a timeless and tuneful stud-mounted wraparound bridge at the body end and a set of efficient enclosed tuners at the headstock, with a PLEK-cut Corian nut for enhanced sustain and ultimate intonation precision, it's an incredible package for the player who wants a slice of full-bore Gibson USA quality at a stripped-down price. Listing is for guitar and gig bag only. No other accessories are included in this sale. See photos for cosmetic condition.", "ItemID": "264203346525", "EndTime": "2019-03-01T04:46:49.000Z", "StartTime": "2019-02-18T22:05:10.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-Melody-Maker-2011-Black-w-Original-Bag-/264203346525", "ListingType": "FixedPriceItem", "Location": "Madison, Wisconsin", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/2642033465258080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg2MTU=/z/LSAAAOSwtJxbtnw9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/KV0AAOSw4Ulbtnw~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/dkwAAOSwZhtbtnxB/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDYy/z/0rAAAOSwV45btnxD/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg1OTU=/z/7ZwAAOSwK9lbtnxF/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/4-0AAOSwVx5btnxI/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjQ4WDYyNg==/z/QmwAAOSwk-9btnxJ/$_57.JPG?set_id=8800005007"], "PostalCode": "53704", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "ggandelvis", "FeedbackRatingStar": "Red", "FeedbackScore": 1844, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 550.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 550.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "r****", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 653}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson Melody Maker 2011 Black w/ Original Bag", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Black"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model", "Value": ["Melody Maker"]}, {"Name": "Model Year", "Value": ["2011"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}]}, "HitCount": 69, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "UsedFully tested and functionalSee photos for cosmetic condition", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}