{"BestOfferEnabled": true, "Description": "Free FedEx Shipping! Check out the 12 clear close-up super-size pictures to help describe this item. Up for sale or best officer is one vintage 1991 U.S.A. Fender Stratocaster Left Handed Guitar with original hard shell case. I detailed and cleaned the guitar and it looks great! This guitar is already 28 years vintage!The serial number on this made in the U.S.A. model is N993209 which you would assume dates it at 1999. But if you go on to Fender's main website and look under the N serial numbers you'll see they have a note there that some of the \"99\" serial numbers were actually 1991. To further prove that please look at pic #6 as both the body and neck are date stamped 1991, cool! The body says 02 16 1991 and the neck says Mar 15 1991. The pot dates are 46th week of 1990 and 0? of 1991(can't read the second digit). I can email you more inside pictures if needed, including closeups of the original pickups and pots. It's all good as this guitar is absolutely 100% original un-molested!!American standard with nice white finish. They called it Artic White #780. It has aged nicely in color in 28 years, more creamy then white. Goes great with the nicely grained maple neck. This model has the nice TBX tone pot (250k / 1 meg) tone control that extends the treble and bass frequencies when turned up past half way. It's on the lowest tone control. Standard on this years Strat's! 5 way pickup selector switch too. I love these smoother style bridge saddles, very easy to rest your palm against for muting. Nice quality Fender Tuners too! I have some string radius gauges so I set the strings exactly right at the bridge and set the intonation with the Strobotuner. String height is 2/32nd on the .010 E at the fret that joins the body, and 3/32nd on the 0.46 E.The case is a very high quality version of Fender guitar cases. It is hard shell molded with the anvil style latches and nice Fender embossed logo on the top and sides. Guitar fits like a glove inside case, form fitted for a lefty for sure. I see one of these exact high end cases just sold for $165.00 just by itself.Additional condition notes: 1) Outside top of case has marks and scuffs from probably being on the road; 2) there are a couple nicks on the back of the neck, pic #5 shows one just above the skunk stripe; 2) Pic #10 shows nicks on the back of the headstock 3) pic #11 shows a crack in paint on the body by the neck, it's exactly the same on the opposite side. It is only paint deep. I've had this exact symptom show up on other Fenders as well, and I don't know what causes that to happen. 4) pic #12 shows a nice sized \"hit\" on the bottom of the body. Obviously it was bumped against an amp or another guitar player(or something). 5) Inside the case are two black straps, I didn't know what they were for and then I figured it out. They are the \"stops\" that were once mounted on the left and right insides of the case that allowed the lid to open half way. They will be included with the case, maybe you can re-glue them in place. This is an absolutely 100% fully disclosed listing on this guitar, sorry if it was a little long. I want the buyer to feel good about it. Please email with any questions or concerns as I will return all e-mails. This item is used therefore it is being offered “as pictured, as is, all sales final“ with no warranty implied or refund, but feel safe in bidding as I have described it honestly and you have the 12 super-size pictures to help judge condition by. Free FedEx home delivery or ground shipping to you(a $80.00+ value), so you will get it fast! Please make sure your \"ship to\" address does Not have a PO box, as FedEx cannot deliver to a post office mail box. Street address only. I'll put it in a FedEx Guitar Box that's heavy duty extra thick, and with tons of bubble wrap around it so it arrives safely to you. I always ship within 24 hours, as long as payment is made promptly. General Terms and Conditions: Payment: PayPal only. Sales Tax: Residents of Washington State: Sales Tax will be added to your winning bid (10.0%), and Minnesota State (7.0%). No International shipping! Policy: VF's policy, your complete satisfaction!!........ end of policy! Thanks for looking & come again soon! Thanks!", "ItemID": "173739105519", "EndTime": "2019-01-14T05:02:20.000Z", "StartTime": "2019-01-13T18:49:30.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Vintage-1991-USA-Fender-Stratocaster-Left-Handed-OHSC-100-Original-Lefty-Strat-/173739105519", "ListingType": "FixedPriceItem", "Location": "Seattle, Washington", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1737391055198080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/~BYAAOSw~2VcFUWF/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/9VcAAOSwrfRcFUWI/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Wk8AAOSw9xJcFUWL/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/J9wAAOSwXc9cFUWO/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/qUoAAOSwWI5cFUWR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/UFoAAOSwF8FcFUWU/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/4x0AAOSwmFxcFUWX/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/6zIAAOSwFSNcFUWa/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/kUMAAOSwa55cFUWe/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/dJkAAOSw~D5cFUWh/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/JEoAAOSw9g1cFUWk/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/OEsAAOSw4bhcFUWn/$_57.JPG?set_id=8800005007"], "PostalCode": "98101", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "vintage-flip", "FeedbackRatingStar": "Purple", "FeedbackScore": 619, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 949.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 949.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "r***r", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 218}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Vintage 1991 USA Fender Stratocaster Left Handed OHSC 100% Original Lefty Strat!", "HitCount": 59, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "Cleaned up nicely and looks great!. Some player use marks noted in description.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}