{"BestOfferEnabled": false, "Description": "Guitar in quicksilver metallic with black hardware, is all original, works great, and is in excellent condition. Currently tuned a whole-step down. It has no fret wear and nice low action. It's a slim neck thru with awesome sustain and excellent upper fret access. This guitar has a Floyd Rose Special on board as well. Trem arm not in pictures (was in case shown at the time) but comes with guitar.This 7 string guitar has a 26.5 scale, and is currently set up in standard tuning with a recent set of 9s; battery works fine too. There's one marr in the finish under the clear coat on the back near the bottom, and a 1/2\" scratch on the actual guitar bottom by the strap button, both shown in pictures. Comes with strap pins but no strap.Guitar ships in a free soft case which is in decent shape. It ships to your confirmed Ebay account address in the 48 continental United States of America only, with tracking, insurance, and delivery and signature confirmations required, via USPS priority mail. No returns allowed. Jackson Soloist SLATMGX3-7 Solidbody Electric Guitar at a Glance:High-performance design puts you in touch with your musicGenuine Floyd Rose Special for huge dive bombs7-string design gives you massive low endA tried-and-true set of EMG active humbuckers offer huge tonesHigh-performance design puts you in touch with your musicOne of Jackson's mottos is \"Choose wisely. Play better.\" That's not just hype either. The fact is, a well made guitar, like a Soloist SLATMGX3-7, gives you a closer connection to your music. For instance, the Soloist SLATMGX3-7 features a compound radius fretboard, which is more rounded at the nut and flatter higher up the neck. This makes it easy to fret chords near the nut, while opening up the fretboard for soloing. The flatter higher frets also let you keep your action low, without bottoming out when you bend notes. And thanks to its neck-through-body design, the Soloist SLATMGX3-7 also gives you epic sustain.Genuine Floyd Rose Special for huge dive bombsIn typical Jackson fashion, this incredible guitar was built with nothing but quality hardware onboard. That's why they gave the Jackson Soloist SLATMGX3-7 guitar a real 2-point, double-locking Floyd Rose tremolo tailpiece. The light-weight Floyd Rose Special tremolo tailpiece gives you the real feel of an original Floyd Rose, adding to the SLATMGX3-7's amazingly responsive feel.7-string design gives you massive low end7-string guitars are a breed apart. The Jackson Soloist SLATMGX3-7 solidbody electric sports a 26.5\" scale that keeps your low B sounding nice and tight; this also imparts a unique sound to the rest of the instrument. This axe was designed as a 7-string from the ground up to provide a huge low end and a 7th string that isn't floppy and muddy sounding.A tried-and-true set of EMG active humbuckers offer huge tonesTo match the Soloist SLATMGX3-7's amazing performance, Jackson turned to a time-tested pair of active EMG pickups. When it comes to modern rock and cutting edge metals, you just can't beat the sound of EMG's EMG 81-7 and EMG 707 humbuckers. This combination gives you the deep, thunderous lows and brilliant highs you need to stand out in the mix. One second, you can hold down the rhythm with thick, chunky riffs, and the next, flip your Soloist SLATMGX3-7 into high gear and tear into a solo. Simply put, this is the sound the music you love was built on.Jackson Soloist SLATMGX3-7 Solidbody Electric Guitar Features:A performance-built solidbody electric guitar made for metal and rockStreamlined Jackson Soloist body styleCompound radius fretboard lets you easily fret chords and pull off highly technical solosNeck-through-body design adds phenomenal sustainA pair of EMG 81-7 and 707 humbucking pickups gives you a huge range of tone", "ItemID": "253730810309", "EndTime": "2019-02-21T00:25:50.000Z", "StartTime": "2018-07-04T20:40:49.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Jackson-Soloist-7-string-SLATXMG3-7-silver-Exc-Condition-w-free-soft-case-/253730810309", "ListingType": "FixedPriceItem", "Location": "North Attleboro, Massachusetts", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/2537308103098080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/t58AAOSwdTJaV7W~/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/fuoAAOSw6lRaV7TX/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/eQQAAOSws5BaV7XX/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/-3EAAOSwKIdaV7Xl/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/PxAAAOSwX7BaV7X1/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/9-YAAOSwUd9aV7Yo/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Y~EAAOSwkvdaV7Yy/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/FR4AAOSwt4xaV7Y5/$_32.JPG?set_id=880000500F"], "PostalCode": "02760", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "xurelle", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 119, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 429.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 429.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "t***o", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 217}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Jackson Soloist 7 string SLATXMG3-7 silver Exc Condition w/ free soft case", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Silver"]}, {"Name": "String Configuration", "Value": ["7 String"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Brand", "Value": ["Jackson"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}]}, "HitCount": 921, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}