{"BestOfferEnabled": false, "Description": "Petrucci Music Man Majesty 7-String. It's in very good condition, Straight Neck as an Arrow, frets are in Very good condition and.. it plays like a dream. It has some scratches on the back, and that's about it. Please see the pictures!! Please ask any question you might have. Note:Those white spots on top of the guitar are \"Dust\" Not \"Scratches\" The Majesty of Shred Never one to rest on their laurels, Ernie Ball Music Man and Dream Theater guitarist John Petrucci once again bring a touch of evolution to the guitar world with the Ernie Ball Music Man John Petrucci Majesty 7-string solidbody electric guitar. The sleek new body style utilizes a neck-through design to give you huge sustain and killer tone. Couple that with premium tonewoods, DiMarzio Illuminator pickups, a piezo tremolo bridge, and custom switching, and you have a guitar that's ready to rock any stage. The Ernie Ball Music Man John Petrucci Majesty 7-string is the evolution of a long line of shred machines from this prolific artist and guitar company. Call your Sweetwater Sales Engineer to learn more about this amazing instrument. Ernie Ball Music Man John Petrucci Majesty 7-string Solidbody Electric Guitar Features:Take command of your toneThe sounds you need for any style of musicFloating piezo tremolo and Schaller locking tuners for perfect pitchTake command of your toneThe Ernie Ball Music Man John Petrucci Majesty makes you a master of the tonal universe. Its comfortable, contoured body consists of a mahogany neck-through design with basswood wings that's topped with a maple cap - a unique tone cocktail that gives you wonderful warmth and resonance you don't expect in a solidbody, along with massive sustain. Another unique aspect of the Majesty is its laser-etched maple cap. Not only is it etched in the shape of a shield, but it resembles the cool look of carbon fiber.The sounds you need for any style of musicTwo DiMarzio Illuminator humbuckers - designed by DiMarzio and Petrucci - serve up a universe of tone that takes the Ernie Ball Music Man John Petrucci Majesty from chimey cleans through a wide range of delectable crunch, all the way to fearsome, face-melting shred. But there's more: a custom piezo floating vibrato bridge lets you engage in vigorous whammy action with absolute tuning stability, while giving you access to a range of gorgeous, nuanced acoustic sounds. Tonally speaking, there's very little this exquisite axe can't do for you. The guitar experts at Sweetwater love an instrument with tons of tonal flexibility, and the Ernie Ball Music Man John Petrucci Majesty is sure to please.Floating piezo tremolo and Schaller locking tuners for perfect pitchThe custom John Petrucci Ernie Ball Music Man Piezo floating tremolo is constructed of chrome-plated hardened steel with bent steel saddles. With the flick of a switch you'll be able to get great-sounding acoustic tones from your John Petrucci Majesty, making this one of the most versatile guitars in your collection. The headstock is adorned with Schaller M6 locking tuners that make string changing a cinch. Just insert the string, tighten the clamp screw, and tune it up to pitch. Strings won't be wound around the shaft so your tuning will be reliable, no matter how hard you play. Ernie Ball Music Man John Petrucci Majesty 7-string Solidbody Electric Guitar Features:Signature John Petrucci guitar with premium tonewoods and componentsUnique body design incorporates a mahogany neck-through design with basswood wings that's topped with a maple capMahogany neck sports an ebony fretboard with a 17\" radiusRecessed neck heel gives you clear access to all 24 fretsDiMarzio John Petrucci signature Illuminator pickupsCustom-designed tremolo with piezo pickup for expressive playing with reliable performanceLocking tuners offer tuning stability and easy string changesStainless steel frets will last a lifetime", "ItemID": "254076787759", "EndTime": "2019-02-27T22:00:56.000Z", "StartTime": "2019-01-17T01:07:48.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Ernie-Ball-Music-Man-John-Petrucci-Majesty-7-String-Guitar-Polar-Noir-/254076787759", "ListingType": "FixedPriceItem", "Location": "California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2540767877598080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/wPsAAOSwMpFcMdLI/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/UQcAAOSwUMBcM6uu/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/syoAAOSwXc9cM6uw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/RzIAAOSwAopcM6uz/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/v10AAOSwsQJcM6u4/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/PUQAAOSworNcM6u7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/SIsAAOSwXgxcM6u9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/YDQAAOSwaJ9cM6vC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/RgcAAOSw7HhcM6vE/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/-T8AAOSwy6NcM6vG/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/AcsAAOSw11BcM6vJ/$_57.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "rocknroll_19_71", "FeedbackRatingStar": "Purple", "FeedbackScore": 811, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1899.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1899.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 19}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "Ernie Ball Music Man John Petrucci Majesty 7-String Guitar \"Polar Noir\"", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Ernie Ball"]}, {"Name": "String Configuration", "Value": ["7 String"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Model", "Value": ["Majesty"]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}]}, "HitCount": 2442, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=900238257", "StoreName": "musiciansmarket"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Oceania", "South America", "PO Box"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}