{"BestOfferEnabled": false, "Description": "MIJ, made in japan, Gibson, Lespaul, White, SG, Höfner, Duesenberg, Ibanez, ATELIER Z, ARIA, ESP, Caparison, Killer, COMBAT GUITARS, GUYATONE, Greco, Sugi Guitars, TEISCO, DEVISERA, Nil, Bacchus, VANZANDT, Fernandes, Fender Japan, Fujigen, MOON GUITARS, momose, Yairi Guitar, YAMAHA, TOKAI, Zemaitis, VOX, B, C, Rich, Epiphone, Gibson, Gretsch, Suhr, Schecter, Charvel, Jackson, Dean, Tom Anderson, Fender, Paul Reed Smith, Melancon, Mosrite, Rickenbacker, Robert Benedetto, Washburn, Ibanez, kramer, EDWARDS, Burny, Grassroots, 1981 Aria proII LS-600 MATSUMOKU Factory ~ Archtop / Deep Joint ~ Very Good conditionMade in Japan Down from here, Photo is dent and scratches etc.. About scratches that are hard to see. To make it easy to understand the condition of the scratches, I lighted the light strongly. 1981 Aria proII LS-600 MATSUMOKU Factory ~ Archtop / Deep Joint ~ Very Good conditionMade in Japan Body Maple Top, Mahogany Back. Neck 3 Piece Maple. Deep Joint. Frets 22F. Scale 24.75inch (628mm) Gibson Medium Scale. Nut Width About 1.69 inch (43mm). Pickup Neck : Jack Johnes. Bridge : EXTRA-I. Control 2 Volume, 2 Tone, 3-Way PU Toggle switch. Bridge GOTOH Japan. Tune O Machic & Stop Tailpiece. Color Sunburst Weight About 9.00 Pound ( 4.08 Kg ). This is Used Guitar. The neck pickup has been changed to the Jack Johnes. The neck has a scratches and a dent, and painted on it. The capacitor has been changed to the Orange drop. The Bridge and the Tailpiece are upgraded to the GOTOH. A hole in the strap pin was added, but the hole was filled and painted on it. There are scratches and dents. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. It was manufactured in 1981 by MATSUMOKU factory. It is one valuable item made in 1981. It was about 37 years ago. This LS-600 uses high quality woods. If you get this LS, you will soon understand it. The very beautiful Archtop. The wood-grain of the top above will entertain you. This LS is Deep joint. From the guitar body, the vibration of the sound is transmitted well. Accuracy of the product is high. Thanks to that, Un pluged sound is be powerful. In the past, Arai Trade ( Aria proII ) was Gibson 's agency. It is not well known. It is Ariapro II that faithfully reproduced Gibson. Among mania is very famous. Arai Trade was teaching technology to greco. The body of greco was Ariapro's offering. Greco's EG-800 and EG-900 series, It is Ariapro II 's LS-500 and LS-600 series. Aria proII set the price reasonably compared to Greco. About guitar play, Current state, the space between the strings and the frets is standard. There are scratches and dents on the back of the neck, but you can play the guitar comfortably. I think the pickups is excellent ! I feel very good distortion sound. I recommend Heavy Metal Music !! This LS-600 has dignity of vintage guitar. Aria proII is Great !! It is cleanliness. I polished with guitar exclusive polish, so it is in a very clean state. I after the finger board cleaning, painted beeswax. The aim is moisturizing and and protection. Current neck condition, very good ! roughly straight ! There is no problem with the Truss rod and it can be adjusted. Remaining the frets are 92% on average. You can play immediately after it is delivered to you. Guitar playing, is comfortable. All is working well. It is in a very good condition. The Truss rod Wrench is not included. Look at the photos, please verify by yourself! It will be professionally pack. Double air packing. And ships inside a sturdy cardboard box. This electric guitar is USED. Please consider it when bidding. Thank you. Payment I accept PayPal only. Please pay within 3 days after the auction closed. Shipping Worldwide shipping from Japan! EMS / Shipping includes a tracking number. / / / Destination cost Delivery time / / / Asia : $1004 ~ 7daysUS Canada : $1205 ~ 8 daysEurope : $1406 ~ 10 daysOceania : $1205 ~ 8 daysSouth America : $2408 ~ 12 days This item is shipped within 3 business days after payment is confirmed. Terms of Sale International buyers - Please Note: Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer's responsibility. Please check with your country's customs office to determine what these additional costs will be prior to bidding/buying. These charges are normally collected by the delivering freight (shipping) company or when you pick the item up -do not confuse them for additional shipping charges. Please contact us first with 30 working days for any returns, Buyer pays shipping cost from buyer's country to Japan when being returned. In case of return, the shipping cost won't be refunded. We sell various kinds of Electric guitars to international customers. Our goal is to provide the best quality products and service and your satisfaction is the most important to us. Happy bidding!! Thank you !!", "ItemID": "253985619548", "EndTime": "2018-11-24T04:30:12.000Z", "StartTime": "2018-11-17T04:30:12.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1981-Aria-proII-LS-600-MATSUMOKU-Archtop-Deep-Joint-Made-Japan-/253985619548", "ListingType": "Chinese", "Location": "Nagoya-shi,Kita-ku, Aichi", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2539856195488080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMDY3/z/qswAAOSwenJb75B0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/JrQAAOSwiqBb75CI/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/p8EAAOSwP8db75CO/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIxOFgxNjAw/z/OmQAAOSwC85b75CX/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/Bz0AAOSwgSpb75Ci/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU5OVgxNjAw/z/8~YAAOSwtaBb75Co/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/d6kAAOSwBfhb75Cu/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU5OVgxNjAw/z/dHcAAOSwvytb75C4/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/pbUAAOSw8R9b75C~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/g3kAAOSw2gNb75DT/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/QRkAAOSwYh5b75Da/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg2Mjc=/z/dJwAAOSw9m5b75C7/$_57.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jguitar-shop", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 369, "PositiveFeedbackPercent": 100.0}, "BidCount": 2, "ConvertedCurrentPrice": {"Value": 303.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 303.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "i***s", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 83}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Americas", "Europe", "Asia", "AU"], "Site": "US", "TimeLeft": "PT0S", "Title": "1981 Aria proII LS-600. MATSUMOKU. Archtop. Deep Joint. Made in Japan.", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Aria proII"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "MPN", "Value": ["101063"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Sunburst"]}, {"Name": "Model", "Value": ["LS-600"]}, {"Name": "Model Year", "Value": ["1981"]}, {"Name": "Modified Item", "Value": ["Yes"]}, {"Name": "Modification Description", "Value": ["Pickup and Bridge and Tailpiece and Capacitor."]}]}, "HitCount": 432, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "JP", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 308.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["APO/FPO", "Africa"], "GlobalShipping": false, "ConditionDescription": "Very Good Condition. This is Used Electric Guitar. The electric guitar when connect to the amplifier, sound output is normal. There are scratches and Dents. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. Please Read the descriptions for details.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}