{"BestOfferEnabled": true, "Description": "My husband, Gary Stroup, a luthier, passed away recently. He made handcarved archtop guitars but also loved many others. He played a Fender Jaguar in his country western dance band and was so impressed in recent years with the quality of the inexpensive guitars which made it possible for everyone to have one. As a kid, he couldn’t afford one, so during his career he gave many guitars to young people that wanted to learn. He never owned a Gibson Les Paul guitar but was very impressed with this Epiphone Les Paul Special. Collecting guitars became a hobby for him. Molded case is included that is made for this guitar. Guitar is in mint condition and was played very little. OVERVIEWWith new Vintage Worn finishes and powered by Open Coil HumbuckersEpiphone introduces the Les Paul Special VE (Vintage Edition) electric guitar featuring the classic Les Paul profile with a lightweight Poplar body. The Les Paul Special VE is powered by Epiphone Open Coil humbuckers and is available in beautiful “Vintage Worn” color finishes. For decades, the Les Paul Special has been one of Epiphone’s best selling electric guitars. And the new Les Paul Special VE—inspired by the Les Paul, the greatest electric guitar in rock—continues the tradition of giving new both players and pros a real Les Paul at a price anyone can afford. Case sold separately. Classic Les Paul profile The Les Paul Special VE has a Poplar body with a sleek look thanks to the Vintage Worn finish and no binding on the neck or body. The Les Paul VE is cut to the same classic profile of all Les Pauls and has a comfortable and fast Mahogany bolt-on neck with a 1960's SlimTaper D profile. The Rosewood fingerboard has traditional Pearloid \"Dot\" inlays, a 24.75” scale, a 14” radius, 22 medium jumbo frets, and a standard 1-11/16” nut. Just below the headstock is the famed “bell” shaped truss rod cover found on every Les Paul since the early '50s with “Vintage Edition” in white. Epiphone Open Coil Humbuckers The Les Paul Special VE features Epiphone’s world famous open-coil humbuckers with a warm 650R in the neck position and a slightly hotter 700T in the bridge or lead position.Controls include a 3-way pickup selector switch, a Master Volume, and a Master Tone control, each with traditional “Black Speed Knobs” pots with long lasting 500K Ω potentiometers. All-Metal Hardware Epiphone features all-metal rock solid hardware on all of its instruments. The Les Paul Special VE comes standard with the legendary Locktone Tune-o-matic bridge and Stopbar tailpiece for easy set up. Tuning is fast and reliable with Epiphone Premium Covered tuners with a 14:1 ratio.The higher the ratio, the more accurate your tuning. The tuners are mounted on an Epiphone Clipped Ear headstock with Les Paul Model in gold and the Epiphone log in silver. In addition, a \"2016\" Edition logo is on the back of the headstock. All Epiphones come with a Limited Lifetime Warranty and Gibson’s world famous 24/7/365 Customer Service.FEATURESBody Body shape: Single cutaway Body type: Solid body Body material: Solid wood Top wood: Not applicable Body wood: Poplar Body finish: Satin Orientation: Right handed Neck Neck shape: '60s SlimTaper D Neck wood: Mahogany Joint: Bolt-on Scale length: 24.75 in. Truss rod: Standard Neck finish: Satin Fretboard Material: Rosewood Radius: 14 in. Fret size: Medium jumbo Number of frets: 22 Inlays: Dot Nut width: 1.687 in. (42.8 mm) Pickups Configuration: HH Neck: 650R Middle: Not applicable Bridge: 700T Brand: Epiphone Active or passive pickups: Passive Series or parallel: Series Piezo: No Active EQ: No Special electronics: None Controls Control layout: Master volume, tone Pickup switch: 3-way Coil tap or split: No Kill switch: No Hardware Bridge type: Fixed Bridge design: Tune-o-matic Tailpiece: Stopbar Tuning machines: Die-cast Color: Chrome", "ItemID": "153341107874", "EndTime": "2019-01-17T16:29:26.000Z", "StartTime": "2019-01-15T21:42:18.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Epiphone-Les-Paul-Special-Vintage-Edition-Electric-Guitar-Molded-Case-/153341107874", "ListingType": "FixedPriceItem", "Location": "Eckley, Colorado", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1533411078748080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/QIkAAOSw0rdcPgTY/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg3NTY=/z/MEkAAOSwnKFcPgTV/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTU5OVgxMDM4/z/zGUAAOSwj91cPgTY/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/5aoAAOSwAP9cPgTY/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/N4gAAOSwolpcPgTV/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTU5OVg3Mzc=/z/lY8AAOSw0vJcPgTU/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg3MDE=/z/sLsAAOSwew9cPgTV/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/1DQAAOSwlkpcPgTZ/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/k38AAOSwy6NcPgTc/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/JoIAAOSwAx9cPgTd/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg2ODc=/z/bT8AAOSwfTlcPgTc/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTE5OFgxNTk5/z/xMoAAOSwc6ZcPgTc/$_32.JPG?set_id=880000500F"], "PostalCode": "80727", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "rainymac", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 315, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 170.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 170.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "1***2", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 2035}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Epiphone Les Paul Special Vintage Edition Electric Guitar with Molded Case", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "Model", "Value": ["Vintage"]}]}, "HitCount": 70, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}