{"BestOfferEnabled": false, "Description": "USED EPIPHONE CASINO LIMITED EDITION JOHN LENNON REVOLUTION 1965 ELECTRIC GUITAR WITH CASE The John Lennon \"1965\" Casino is a faithful reproduction of John's beloved Vintage Sunburst Casino as he purchased it in 1966. In 1968, Lennon decided to \"strip\" the finish off his Casino. The John Lennon \"Revolution\" Casino is a faithful reproduction of his Casino with a \"stripped\" natural finish as it was then and as it remains today.This Guitar is in very good condition showing some signs and wear which include the following: Slight dulling of metal hardware & tuners, a few slight marks and dings located throughout (not entirely sure which is from use or which is stock as it is a reproduction) frets are in very good condition showing very minor indentation on the first fret but still have plenty of life left. The headstock was repaired previously by an unknown luthier, the repair was inspected and appears to be stable. However, because of this we are selling the instrument \"as is\" and returns will not be accepted (some exemptions may apply) The repair can be seen in photos above.This instrument includes the original case, pick guard, certificate of authenticity, JL bag, and original warranty card. The only item that is missing is the gold volume knob for the volume of the neck pickup (this limited edition came with one gold and one black tone knob as John Lennon had used a black knob on his). The case is in good condition showing some very minor fabric degradation as well as a couple scrapes located on the top as seen in photos above.Production Number: 1506 of 1965SPECS:Model: CasinoOriginal Body Shape - Mid '60's Kalamazoo, Michigan tooling specsBody Materials - 5-layer (Maple/Birch/Maple/Birch/Maple)Top Contour Bracing - Spruce with original relief spacing and depthOne-piece Mahogany neck with 14 degree grain orientation (Repaired - See Description)Rosewood fingerboard with .062\" thick pearloid, parallelogram fret markersOriginal Fingerboard support spacer height, .071\"Neck shape (elliptical - Neck joint at 16th fret)Neck binding covers fret-endsScale - 24.750\"Original Nut material \"Corian\" - 1.62\" widthHeadstock Logo, mother of pearl - inlay thickness, .062\"Larger original style headstock - 17 degree pitch\"Gibson-Factory\" electronicsNickel-Plated, dog-eared P-90 Pickup Covers with original pole spacingSwitchcraft, 3-way toggle with old style black washerNickel ABR Bridge with nylon saddlesNickel Gibson-Factory HardwareVintage style case with shroudStamped with John's original serial numberAssembled in U.S.AWhite Pickguard IncludedOriginal Hardshell Case IncludedCertificate of Authenticity Included We will do our best to make this the BEST eBay experience for you! Promised!A 7% Tax will be added to items shipped to Florida International buyers please contact us and provide a postal code for a shipping quote before purchase. US shipping charges do not apply to international shipments.If the item is listed with FREE “Standard Shipping” it means UPS Ground, FedEx Home Delivery, FedEx Ground, FedEx Smart Post or USPS First Class or Parcel Post and it only applies to the lower 48 continental states. International and other US customers may inquire for quotes and shipping options. For customers in Alaska, Puerto Rico and Hawaii there is a $35.00 surcharge that is added at check out. FedEx and UPS do not deliver to PO Boxes (only USPS does). For items that we advertise with standard shipping (FedEx), the item must ship to a physical street address. Buyers using Paypal MUST have a physical street address as the ship-to address and it MUST appear in the shipping details of the Paypal receipt that we receive. No exceptions.Note that ebay and Paypal policy mandates that we require a signature on all items of $250 or more to be eligible for “seller protection”. This is for the seller’s protection, as well as the protection of the buyer’s merchandise. It is the buyer’s responsibility to be available to sign for and receive the package for delivery or to contact the shipper to arrange a pickup at a local center or to make other arrangement with the shipper, if possible. Also based on Paypal policy, we must ship to the address in the shipping details of the Paypal invoice we receive for the item purchase. We cannot ship to a secondary or gift address, unless it has been added to the Paypal account and selected before payment is made for an item.Shipping to Hawaii, Puerto Rico and other US territories are not eligible for “Standard Shipping” rates. There will be a $35.00 surcharge that is added at check out to those shipping locations. Also, buyers with certain government and/or military (APO/FPO, etc.) addresses are NOT eligible for lower 48 US shipping rates and need to inquire for a shipping quote before initiating a purchase.Seller reserves the right to use alternate mode of shipping (USPS, FedEx, etc.) at seller's discretion. Our official hours of operation are 11:00 Am to 8:00 Pm Monday through Friday and 11:00 Am to 6:00 Pm Saturday Eastern Standard Time. We are closed Sundays. Our regular shipping days are Monday through Friday.In addition to PayPal, we accept Visa, MC and Discover and American Express over the phone.Message us for any questions or for additional photos. Florida residents to include 7% sales tax. New eBay guidelines regarding returns make it impossible for us to offer a reasonable return policy therefore all of our items for sale are listed with the \"no returns allowed\" policy. Please look for our own online store and take advantage of our own return policy and, in many cases, take advantage of a better price.", "ItemID": "183698971177", "EndTime": "2019-02-23T05:46:03.000Z", "StartTime": "2019-02-22T21:34:23.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/USED-EPIPHONE-CASINO-LIMITED-EDITION-JOHN-LENNON-REVOLUTION-1965-ELECTRIC-GUITAR-/183698971177", "ListingType": "FixedPriceItem", "Location": "Fort Lauderdale, Florida", "PaymentMethods": ["PayPal", "VisaMC", "Discover", "CashOnPickup", "AmEx"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1836989711778080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFg5MDA=/z/-qIAAOSwUPlccGow/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFg5MDA=/z/3KUAAOSwUR9ccGoc/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFg5MDA=/z/j94AAOSwgW9ccGoz/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI1OFg5MDA=/z/LxgAAOSwDXxccGon/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFg5MDA=/z/WNoAAOSw3mxccGoT/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFg5MDA=/z/i64AAOSwTHlccGou/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFg5MDA=/z/XK8AAOSwyXtccGoa/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFg5MDA=/z/knsAAOSwroJccGoq/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFg5MDA=/z/53UAAOSw9bpccGpi/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFg5MDA=/z/n1IAAOSw2EJccGoW/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFg5MDA=/z/H4EAAOSwUPpccGoh/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFg5MDA=/z/1pkAAOSwuJlccGoe/$_57.JPG?set_id=8800005007"], "PostalCode": "33316", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "pennylanemusicemporium", "FeedbackRatingStar": "Red", "FeedbackScore": 1258, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1400.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1400.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "c***m", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 630}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "USED EPIPHONE CASINO LIMITED EDITION JOHN LENNON REVOLUTION 1965 ELECTRIC GUITAR", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "Model", "Value": ["Casino Revolution 1965"]}, {"Name": "Body Type", "Value": ["Hollowbody"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Size", "Value": ["Full Size"]}, {"Name": "Soundboard Style", "Value": ["Archtop"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}]}, "HitCount": 24, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=38908793", "StoreName": "penny_lane_emporium"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 0, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Middle East", "Oceania", "Southeast Asia", "South America", "RU", "PO Box"], "GlobalShipping": false, "ConditionDescription": "Very Good - See Description for Details", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}