{"BestOfferEnabled": true, "Description": "DJ GEAR INSTRUMENT GEAR LIVE SOUND RECORDING MICROPHONES HEADPHONES ACCESSORIES SOFTWARE LIGHTING BUNDLES Authorized Dealer - Full Warranty Gretsch G5230T Electromatic Jet FT Single-Cut with Bigsby - Used 6-String Electric Guitar w/ Bigsby in Firebird Red - Used - Description Pure Jet Power In its 65 year existence the Gretsch Jet has been the hallmark sound for iconic players. The all-new G5230LH Electromatic Jet FT Single-Cut with V-Stoptail captures that essential Jet power and fidelity at an incredible price. Chambered Mahogany Bodies &mdash; Loud And Clear Classic Jet tone begins with a chambered mahogany body with maple top that produces full lows and mids with an exceptionally smooth and present high end. The result is a deep acoustic foundation that is robust, yet balanced. Black Top Filter'tron Pickups &ndash; Quintessential Power And Clarity Black Top Filter'Tron pickups amplify and accentuate the Electromatic Jet FT's chambered body to produce a wide, balanced and transparent tone. Loud and punchy, this Jet sounds out with remarkable definition at any level of gain. Together, the body and pickups thunder with full, responsive lows and mids with a high end that sparkles without spikes. Total Tonal Control The Electromatic Jet FT is equipped with essential features that give you complete tonal control. The combination of individual pickup volume controls, master tone and master volume with treble bleed circuit provides intuitive global control over your pickup and tone settings. Features/Specs General Model Number : 2507210516 Series : Gretsch Electromatic Collection Color : Firebird Red Orientation : Right-Hand Body Body Finish : Gloss Body Shape : Jet Body Material : Mahogany Bracing : Chambered Body Binding : White with Black/White Purfling Body Back : Mahogany Body Top : Laminated Maple Body Depth : 1.85\" (47 mm) Neck Neck Material : Mahogany Neck Finish : Gloss Neck Shape : Thin \"U\" Neck Binding : White Scale Length : 24.6\" (625 mm) Fingerboard Radius : 12\" (305 mm) Fingerboard Material : Black Walnut Number of Frets : 22 Fret Size : Medium Jumbo Nut Width : 1.6875\" (42.86 mm) Position Inlays : Pearloid Neo-Classic Thumbnail Neck Plate : None Electronics Bridge Pickup : Blacktop Filter'Tron Neck Pickup : Blacktop Filter'Tron Controls : Volume 1. (Neck Pickup), Volume 2. (Bridge Pickup), Tone Pickup Switching : 3-Position Toggle: Position 1. Bridge Pickup, Position 2. Bridge And Neck Pickups, Position 3. Neck Pickup Pickup Configuration : Filter'Tron / Filter'Tron Hardware Bridge : Anchored Adjusto-Matic Tuning Machines : Diecast with Round Button Pickguard : Silver Plexi with Black Gretsch Logo Control Knobs : G-Arrow Miscellaneous Strings : NPS, .010-.046 Gauges. We are authorized dealers for all these brands. Click a logo to see our listings. We collect NYS Sales Tax for items shipping within New York. Local duties, taxes and fees out of the USA are not included in the sale price or ship charge. Proaudiostar is not responsible for any taxes outside of NY and or the USA. If an item is refused by the buyer, ship costs to and from the destination in which the item was shipped to are not refunded. Please note the cost of return shipping is usually double of what the original ship cost. Shipping is not free to HI, AK, and PR. FREE SHIPPING ONLY TO THE LOWER 48 STATES. We provide free shipping to the contiguous 48 United States, on most items. Shipping fees to ALL OTHER LOCATIONS will be calculated individually and added to customer invoices. Local duties, taxes and charges are not included in the sale price or ship charges. ProAudioStar is not responsible for any taxes outside of NY and or the USA. In the event that the customer refuses a shipment, all shipping costs to and from the country or State in which the item was shipped to are not refunded. Please note, in some cases return shipping can cost as much as double the original ship cost. We operate a 30-day return period. Items must be returned with all original packaging as well as all included items. Items that are not returned in original, resalable condition are subject to a 15% restocking fee. We charge a 15% restocking fee on returned items only if the item is clearly used and or the packaging is tarnished. A 10% re-stock is more likely if the unit comes back in mint condition. The ship cost we paid to ship your item will be deducted as well. In some cases restock fees and ship costs can be applied as a store credit. We will exchange a defective unit for the same unit within the 30-day period. After that period, you will have to work directly with the manufacturer for warranty service. Items that can not be returned include: software, units with contents or packaging that is damaged/missing, and items that are considered for personal use (such as earphones, headphones, microphones, instrument mouthpieces, harmonicas or other items that you wouldn't want to purchase if someone else had previously used them). Also, Items which we do not normally stock (i.e. \"Special Orders\", discontinued products, close-outs, used products, etc.) are non-returnable. We strongly suggest that you check your order after receiving it to be sure that it is in proper working order. Please contact us for a Return Authorization before returning any items.", "ItemID": "401686989868", "EndTime": "2019-01-16T19:09:23.000Z", "StartTime": "2019-01-15T14:34:26.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gretsch-G5230T-Electromatic-Jet-FT-Single-Cut-Bigsby-Firebird-Red-Used-/401686989868", "ListingType": "FixedPriceItem", "Location": "Winchester, Virginia", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/4016869898688080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/OTg0WDEyMTU=/z/NcQAAOSw-yJcPe9z/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTg0WDEyMTU=/z/fBsAAOSwoURcPe9z/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTg0WDEyMTU=/z/2fIAAOSwwZVcPe9z/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTg0WDEyMTU=/z/9oAAAOSwdgxcPe9z/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTg0WDEyMTU=/z/sNAAAOSwWtFcPe9z/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTg0WDEyMTU=/z/yPUAAOSwgGNcPe9z/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTg0WDEyMTU=/z/SKQAAOSwviBcPe9z/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTg0WDEyMTU=/z/3C0AAOSwJ7RcPe9z/$_1.JPG?set_id=880000500F"], "PostalCode": "22601", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 2, "Seller": {"UserID": "proaudiostar", "FeedbackRatingStar": "RedShooting", "FeedbackScore": 211095, "PositiveFeedbackPercent": 98.8, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 299.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 299.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "9***9", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 945}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gretsch G5230T Electromatic Jet FT Single-Cut with Bigsby Firebird Red - Used", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gretsch"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}]}, "HitCount": 55, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=336450849", "StoreName": "proaudiostar"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "DiscountPriceInfo": {"OriginalRetailPrice": {"Value": 549.99, "CurrencyID": "USD"}, "PricingTreatment": "STP", "SoldOneBay": false, "SoldOffeBay": false}, "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "BR"], "GlobalShipping": false, "ConditionDescription": "Used", "QuantitySoldByPickupInStore": 0, "SKU": "GRE-25072105-16-B", "NewBestOffer": false}