{"BestOfferEnabled": false, "Description": "GIBSON SG 60's Tribute FADED Electric Guitar 2013 An excellent Gibson SG satin faded electric guitar!!! It has the beautiful Vintage Sunburst Satin Faded finish, a 24 fret Rosewood fretboard with Pearl Trapazoid inlays, Chrome hardware, Tune-o-matic bridge/stop tailpiece, Chrome Grover tuners, Blackface peghead with Gold Gibson Logo, layered black pickguard, and it has 2 chrome covered burstbucker pickups that sound great! It is 24.75 scale, the neck width at the nut is 1 11/16\". Weighs 6.8 pounds. The condition is excellent(a 9 out of 10) with few light signs of use and shows no fret wear, the guitar is really excellent all around with no problems except for a few very light playing scratches and a few light dings(See pics). Serial#12992054*, made in USA in 2013, includes the excellent Gibson Gig Bag. Lots of emails about this rare guitar, no one seems to be able to identify what model it actually is, here's an email I got: Ahoy! I was checking out your 2013 SG 60s Tribute, and I thought I would help clear up any confusion there may be about it. It is definitely a 60s Tribute, and the guitar pictured DOES have 24 frets. There have been 60s Tributes of other model years which differ, but the 2013 SG Tributes had 24 frets and crown fret markers. There were 4 models: the 50s Tribute, 60s Tribute, 70s Tribute, and Future Tribute. They all differed slightly, but each had the same body and neck with 24 frets and crown fret markers, silk screened logos, but NONE came with a pick guard. Yours has a nice aftermarket pick guard. The 50s Tributes had P90 pickups and \"PROTOTYPE\" stamped on rear of headstock. The 70s Tributes had Dirty Fingers humbuckers and the Norlin style headstock volute. 50s, 60s, and 70s Tributes had satin finishes and Grover tuners, which could be upgraded to E-tune. The Future Tributes had vintage gloss finishes, 57 Classic humbuckers, and either E-tuners or Steinberger banjo style 19:1 tuners. USA Shipping, handling, and insurance charge will be $50 in USPS's deliverable USA 48 states. International shipment and handling is $150 for most other countries via USPS's deliverable Priority Mail International delivery plus you may have to pay import taxes/duties to import and it may take 45 days or longer to receive(Only the smaller less populated countries will take that long, not the mainstream well populated countries). The shipping and handling charge will be $100 for Canada delivery. I reserve all rights. I always declare and insure for the full purchase price, no exceptions. Check out my other auctions as I usually have guitars and parts for sale. I buy and sell quality musical instruments and have over 7000 positive Ebay feedbacks so bid with confidence that you will receive quality merchandise as described, shipped promptly and securely. I also have been playing lead guitar since 1979. I try to describe the condition of the guitars I sell the best I can using the Bluebook of Electric Guitars photo grading system and the shipping rates stated above are a flat fixed rate and covers the shipping, handling, and insurance. Colorado sales must add 4.6% sales tax. No trades. Please... Only bid if you have all the money NOW, and will send me the payment if you are the winning bidder. I sometimes miss a day checking my email so please be patient and I will try to respond to all questions ASAP. Thanks, and good luck bidding.", "ItemID": "113634247491", "EndTime": "2019-02-17T01:18:17.000Z", "StartTime": "2019-02-12T02:21:32.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/GIBSON-SG-60s-Tribute-Faded-Electric-Guitar-2013-/113634247491", "ListingType": "FixedPriceItem", "Location": "Golden, Colorado", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1136342474918080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NTU0WDE1ODc=/z/chIAAOSw1Ihb-1E~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTU4WDE1ODc=/z/BD0AAOSwlelb-1Fe/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/qaoAAOSwa~Fb-1Fq/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/lXYAAOSwk4Rb-1F2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/kXMAAOSwoEFb-1GE/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/HdoAAOSw6X1b-1Gh/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/heoAAOSwzd9b-1G1/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjExWDE1ODc=/z/XIMAAOSwysFb-1HV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/GxMAAOSwTDpb-1Hj/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTkwWDE1ODc=/z/8eEAAOSwzhZb-1IG/$_57.JPG?set_id=8800005007"], "PostalCode": "80401", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "carrguitar", "FeedbackRatingStar": "Green", "FeedbackScore": 7480, "PositiveFeedbackPercent": 99.6, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 649.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 649.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "1***5", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 56}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "GIBSON SG 60's Tribute Faded Electric Guitar 2013   ", "ItemSpecifics": {"NameValueList": [{"Name": "MPN", "Value": ["Does Not Apply"]}]}, "HitCount": 212, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=5569370", "StoreName": "carrguitar"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}