{"BestOfferEnabled": false, "Description": "USA Auction Only! This is an excellent condition 2018 MIM Charvel Pro Mod San Dimas 1HH Guitar and it comes with a Gator hardshell case. These MIM Charvel guitars are made extremely well, look great, play great and come with high quality parts! *These sell for new for $899.99 and come to you in a cardboard box, no gig bag or case. You can get this one for much less and it comes with the Gator hardshell case that is pictured! Charvel Pro-Mod San Dimas Style 1 HH FR at a Glance:Classic Seymour Duncan humbuckers deliver iconic rock toneFloyd Rose tremolo delivers killer action and reliable tuningFast, stable, and comfortable neck provides epic playabilityClassic Seymour Duncan humbuckers deliver iconic rock toneYou'll rarely come across a more broadly liked combination of pickups than the duo loaded into this Pro-Mod San Dimas Style 1 HH FR guitar. In fact, at Sweetwater, sticking a Seymour Duncan JB model at the bridge and one of their '59 humbuckers at the neck is a pretty popular mod. Why? Because these pickups come together to give you a wide range of amazing tone. When you rock a Charvel Pro-Mod San Dimas Style 1 HH FR guitar, you'll get the toothy grit you need for riffing plus the fat and smooth lead tones you love.Floyd Rose tremolo delivers killer action and reliable tuningTrue to the high standards guitarists expect from Charvel, this incredible guitar was built with nothing but quality hardware onboard. That's why they gave the Pro-Mod San Dimas Style 1 HH FR guitar a real 2-point, double-locking Floyd Rose tremolo tailpiece. Floyd Rose bridges stay in tune, holding up to the abuse any hard rocking guitarist dishes out. The lightweight Floyd Rose double-locking tremolo tailpiece gives you the real feel of an original Floyd Rose, adding to the Charvel Pro-Mod San Dimas Style 1 HH FR's amazingly responsive feel.Fast, stable, and comfortable neck provides epic playabilityComplementing the sonic spank of a 2-piece maple neck with the unshakable support of graphite reinforcement rods, the Pro-Mod San Dimas Style 1 HH FR offers traditional Charvel sound with extreme stability. If your idea of playing out involves cross-country road trips or air travel, then this guitar may be your new best friend. The Pro-Mod San Dimas Style 1 HH FR also offers the extraordinary playability of a compound-radius fretboard, which flattens out from 12\" at the nut to 16\" at the 12th fret. That makes it ideal for chording and solo runs. Top it off with a hand-rubbed urethane finish and rolled fingerboard edges, and you've got a guitar that's a pure pleasure to play.Charvel Pro-Mod San Dimas Style 1 HH FR at a Features:An amazing axe that gives you hot-rodded Fender style, Charvel feel, and classic-rock-style humbucker toneCombination of Seymour Duncan JB and '59 humbuckers delivers tried-and-true rock soundLightweight and resonant alder body topped with eye-catching quilt-maple veneerGraphite-reinforced maple neck provides you with extraordinary stabilityCompound-radius maple fingerboard with rolled edges makes chords and soloing easy and comfortableFloyd Rose tremolo bridge delivers tight action and response, without sacrificing tuning stabilityCondition:Please review all the photos as they are a part of the description and show the guitars condition and what's included. This guitar is very clean, no chips, dings or dents, just some minor pick swirl marks in the clear coat on the front, The frets are in great condition with no noticeable wear. The Gator case is in very good condition as well and comes with 2 keys. It just has some light scuffs here and there. Condition is very subjective but I describe everything as best I can and I do have a 100% positive seller rating. If you have any questions please ask. *I'm willing to negotiate a little on the price. But, if you make an offer, please be realistic. Low ball offers will be auto declined. *Shipping indicated is for the lower 48 States only. Shipping to Alaska and Hawaii would be additional. Please check my other auctions for more guitar and bass gear!", "ItemID": "264209861088", "EndTime": "2019-02-28T19:52:21.000Z", "StartTime": "2019-02-22T23:27:51.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Charvel-Pro-Mod-San-Dimas-1-HH-FR-Purple-Burst-Guitar-Gator-Case-EXC-/264209861088", "ListingType": "FixedPriceItem", "Location": "Jacksonville, Florida", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2642098610888080_2.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/6XQAAOSwSjpccIfJ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIzMVgxNjAw/z/bbkAAOSwCR9ccISj/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA5N1gxNjAw/z/9mgAAOSwgrtccISn/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/4lAAAOSwTGNccISr/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzYzWDE2MDA=/z/l-wAAOSw7aNccISu/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTEzMlgxNjAw/z/jU4AAOSwwXRccISx/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzU1WDE2MDA=/z/i9kAAOSwo61ccIS6/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI4OVgxNjAw/z/QvoAAOSwbrZccIS1/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/5rwAAOSwoOxccIS4/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/Njc1WDE2MDA=/z/-XAAAOSwuDFccIS9/$_57.JPG?set_id=8800005007"], "PostalCode": "32226", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "poprocks2004", "FeedbackRatingStar": "Red", "FeedbackScore": 4934, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 579.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 579.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "t***n", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 269}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Charvel Pro Mod San Dimas 1 HH FR Purple Burst Guitar + Gator Case, EXC", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Charvel"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["Mexico"]}, {"Name": "Model", "Value": ["Pro Mod"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Purpleburst"]}, {"Name": "Size", "Value": ["Full Size"]}, {"Name": "Model Year", "Value": ["2018"]}]}, "HitCount": 524, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "excellent condition", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}