{"BestOfferEnabled": false, "Description": "We're proud to introduce our \"Master Series\" guitar relics here at Dax&Co. We choose a Gibson Custom Shop model or actual vintage guitar as our inspiration and recreate it using a genuine Gibson guitar. This is our version of the 2017 Gibson Limited Run Heavy Aged Pelham Blue SG for $5999(google it:) We started with a 2018 Gibson Pelham Blue SG Standard and completely aged and upgraded it to look and feel like an actual 1960's guitar The nitro lacquer finish was thinned and yellowed as they tend to do with age to more of a green color. Even the binding has been yellowed. It's the small things like the wear spots that show brighter colors that really makes this look convincing. Lacquer checking has been added to the entire guitar, and every single detail has been meticulously aged to look vintage. The edges of the fretboard have been hand rolled for a super smooth, vintage feel. This has the ultra-comfy 60's neck profile. The pickups are Seymour Duncan \"Seth Lover's\" and they are nothing short of amazing...especially with the \"Bumblebee\" caps and 500k CTS pots! If you just cant justify spending Custom Shop or vintage prices for a guitar like this...well...here you go! This comes with a new aftermarket brown tolex, pink lined Gator case and signed Dax&Co. COA! Good luck and Happy Jamming! Read our reviews and find us online at daxcocustom WE WANT YOU TO LOVE your new guitar! If not, send it back within five days in its original packaging for a full refund (minus all shipping costs) Here are some testimonials about guitars we've sold… \"Love it! Custom shop at a working man's price! Thanks!!\" \"After 15 years of collecting aged and relic’d guitars, I’ve a amassed quite the collection; Including many Fender instruments Masterbuilt by John Cruz, Jason Smith and Dale Wilson, Suhr Extreme Antiques and Tom Murphy painted & aged guitars. I can honestly say that upon close inspection, the Heavily Aged Les Paul Gold Top that I purchased from Dax & Co. is on the SAME level as the instruments fabricated by the master builders listed above. Dax has brilliantly painted the guitar top in satin gold along with his signature “checking,” aged EVERY single part of the instrument with unabashed detail, rolled the edges of the fretboard perfectly and masterfully dressed the frets. I honestly could not believe the quality, playability and sound that my new instrument possessed as I played it for the very first time. It felt EXACTLY as if I had ordered a $7K US Gibson Custom Shop instrument! Believe me— I know!! “This guitar is incredible. Haven't put it down for hours and I doubt I'll want to pick up another guitar anytime soon. It's everything it was advertised as and Dax shipped it out immediately. The next time I'm in the market for a guitar I'm definitely going to check Dax's shop first.” “What a fantastic guitar and everything about it is exactly what I had hoped it would be. I can't get over how absolutely effortless it is to play up and down the neck and how beautifully smooth it is. You have created a truly wonderful guitar and everything about the transaction has been a true pleasure.” Thanks so very much.\" \"I am in awe of the craftsmanship on display here in this instrument...it has such character...I fell in love instantly upon placing this beauty into my hands. The tone is out of this world, the neck pocket is precise, resonance throughout the instrument and the noiseless pickup set is spectacular. Dax is a top notch builder and his relic work is just phenomenal. I knew when I first laid eyes on this Tele it had to be mine and it's showing me everyday how true it is! Thank you Dax.\" \"I took a chance on using Dax & Co and I'm so glad I did! Dax took a cheap Squire Strat and turned it into an absolute Gem!! The work he did on it is absolutely amazing, my guitar now looks like a 1956 Stratocaster! The neck and fretboard are silky smooth. Great Job! Looking forward to using your company again!\" \"I own 12 teles including a Nash T52, various Fenders, 2 MJTs, and this guitar went straight to the top of the class. It looks killer and feels like it's actually 60 years old. Packed well, shipped fast.\" Dax&Co. is NOT affiliated with Fender Musical Instrument Corp., Nash, Murphy, Palir, Gibson Brands inc. or any other musical instrument company. The guitar may have a faint smell of paint which is the nature of nitrocellulose lacquer, but will dissipate over time. We recommend storing it out of the case in a spare room for the first week or two. Want the finish removed from the back of the neck? No problem! Just specify at checkout and we'll remove all of the finish before shipping (this option does not qualify for a return since it is customized for you.)", "ItemID": "273615364099", "EndTime": "2018-12-24T11:23:38.000Z", "StartTime": "2018-12-17T21:45:22.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Dax-Co-Heavy-Aged-2018-Gibson-SG-Standard-Pelham-Blue-Relic-W-Case-COA-/273615364099", "ListingType": "FixedPriceItem", "Location": "Columbia, Pennsylvania", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2736153640998080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjM2/z/INQAAOSwM6FcAxTQ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDE1/z/sngAAOSwFO1cAxTU/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODk3WDE2MDA=/z/QoMAAOSwRbpcAxTA/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTI2WDE2MDA=/z/VmsAAOSwVIBcAxTH/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODExWDE2MDA=/z/xaYAAOSwqkRcAxTK/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTEyM1gxNjAw/z/4igAAOSwIGxcAxTM/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/0L0AAOSwrAFcAxTW/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIzNVgxNjAw/z/2zAAAOSwyUFcAxTZ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMTEy/z/gmYAAOSwK5tcAxTd/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDEy/z/D7wAAOSwXi9cAxTh/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/x6wAAOSwpTBcAxTk/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/eqEAAOSwaiBcAxTF/$_57.JPG?set_id=8800005007"], "PostalCode": "17512", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "thedaxman", "FeedbackRatingStar": "Red", "FeedbackScore": 1004, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1995.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1995.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "o***o", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 415}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Dax&Co. Heavy Aged 2018 Gibson SG Standard Pelham Blue Relic W/ Case & COA! ", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model", "Value": ["SG Standard"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Pelham Blue"]}, {"Name": "Model Year", "Value": ["2018"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}]}, "HitCount": 85, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "ConditionDescription": "Dax&Co. Custom Shop \"Master Series\" relic!", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}