{"BestOfferEnabled": false, "Description": "Up for sale, a 1963 Harmony Meteor H70 in exceptional, 100% original condition and in perfect working order. A rare Airline-branded variant made by Harmony in the USA for the Montgomery Ward catalog (and not to be confused with modern imported Airline instruments), this guitar has a few distinct cosmetic tweaks that set it apart including an ornate harp tailpiece and brown \"cupcake\" knobs. This vintage Meteor is a real stunner visually and an excellent player, sporting a pair of original DeArmond \"moustache\" gold foil single coils. What has made the Meteor an enduring favorite and a unique instrument among Harmony hollowbodies is the spruce top, which has a more complex and rich tone than the maple tops seen on all the Rockets, Rebels, and assorted H prefix models (as well as Meteors made late in the decade)! It's no wonder that Meteors found their way into the hands of players such as Keith Richards and Dave Davies early in their respective careers, as this model is particularly versatile, powerful, and detailed sounding.There's really nothing that can match the balance, clarity, and overall tonal character of a good pair of gold foil pickups. They have a percussive snap and twang, tight bass, and a harmonically rich midrange that sounds great when each pickup is singled out or when paired together. Both pickups have strong and consistent output, and when mated with the fully hollow body and spruce/maple tone wood combination, the sound benefits from both the immediate attack of the maple and the warmth and fullness of the hollow construction. The guitar weighs in at 7lbs and has been professionally setup here at Mike & Mike's Guitar Bar with fresh 10-46 strings and low, comfortable action.The maple neck has a deep and round C shaped profile that's firmly in \"baseball bat\" territory, with big shoulders and a very substantial feel. This profile fills the palm yet is still very manageable for smaller hands and chords easily. The original slender fretwire is intact on the bound Brazilian rosewood fretboard, and the frets are remarkably clean with their full factory height and well rounded crowns. The frets show just a touch of wear on the crowns of frets 1-2, with virtually no wear further up the fretboard. The guitar plays cleanly up the neck with no buzzing or dead spots and the neck is very straight with ideal relief. The original hand-carved bone nut measures 1 3/4\" in width. On the headstock, the original raised metal \"Airline\" badge is present, and the stock Waverly chrome tuners are intact too and very clean.On the body, the guitar retains all of the original hardware including the nickel harp tailpiece, Brazilian rosewood floating bridge with bone saddle, rosewood pickup risers, deep brown \"tortoise\" pickguard, and clean \"cupcake\" Volume and Tone knobs. The original pickups have clean chrome covers and matching date stamps on the baseplates from January 25th, 1963, along with the original Rowe Industries foil stickers noting DeArmond's parent company. Visible through the segmented F hole, the original 1963 date stamp is still clean and intact on the inside back of the body.Cosmetically, the guitar is truly one of the finest vintage Harmony examples we've ever had in the shop, with a vibrant and positively glossy original nitro lacquer Tobacco Sunburst finish. There is light vertical lacquer checking as well as a few minor scuffs, and light patina on the nickel tailpiece yet overall it's an extremely clean example.This very early and uncommon Meteor is in many ways Harmony's quintessential model. Check out our shop \"Mike & Mike's Guitar Bar,\" and please let us know if we can answer any questions!Shipping in the continental USA will be $75, fully insured and shipped via FedEx Ground. Expedited shipping available for an additional fee at buyer's request. We will happily ship WORLDWIDE, but please contact us for an accurate international shipping quote before bidding or buying, as cost varies by buyer location. International orders will be declared as “merchandise,” and the value of merchandise will be declared as the amount paid. We cannot declare anything as a gift or for a lesser value. No exceptions! The customer is responsible for all taxes and duty, which may be collected upon delivery, as well as any additional charges involved with import. We have all necessary CITES paperwork in-hand to ship rosewood worldwide.We do our best to describe all items with honesty and accuracy, but to be sure, please contact us with any questions or concerns prior to bidding or buying. We require payment within 48 hours of auction end. In the unlikely event of a return, buyer pays all shipping costs. Your positive feedback and five star ratings are very important to us, and we appreciate your communication in resolving any issues!", "ItemID": "173703249938", "EndTime": "2019-02-27T09:53:37.000Z", "StartTime": "2018-12-22T10:38:17.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1963-Harmony-Meteor-H70-Airline-Branded-Vintage-Guitar-w-DeArmond-Gold-Foils-/173703249938", "ListingType": "FixedPriceItem", "Location": "Seattle, Washington", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1737032499388080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/U3cAAOSwqnVcHg9l/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/sg8AAOSwyRdcHg9s/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/MYcAAOSwctJcHg9v/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/yNwAAOSw~xtcHg93/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/vYQAAOSwa1ZcHg95/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/O3sAAOSwukZcHg90/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/1CcAAOSwjfpcHg9o/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/NfAAAOSwlAFcHg9y/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/TC8AAOSw4m9cHg9q/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Hu0AAOSwXAxcHhB-/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/vrcAAOSwa1ZcHhCA/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/wMcAAOSw4VpcHhB7/$_57.JPG?set_id=8800005007"], "PostalCode": "98117", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mmguitarbar", "FeedbackRatingStar": "Red", "FeedbackScore": 2613, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1299.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1299.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "b***o", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 242}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "1963 Harmony Meteor H70 Airline-Branded Vintage Guitar w/ DeArmond Gold Foils", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Harmony"]}, {"Name": "Body Type", "Value": ["Hollow"]}, {"Name": "Model", "Value": ["Meteor H70"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Color", "Value": ["Sunburst"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Material", "Value": ["Spruce, Maple"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["1963"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}]}, "HitCount": 1072, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=269063702", "StoreName": "Mike and Mikes Guitar Bar"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}