{"BestOfferEnabled": true, "Description": "It’s a good guitar, it comes with this circuit board but just means the quick connects. It also shows signs of normal wear and tear. The neck was cracked, but was re-done professionally. It plays fine, just needs to be prepared. A celebration of the Les Pauls that rocked the world. The 2013 Les Paul ™60s Tribute captures the look, feel, and tone of a classic evolution of this legendary single-cutaway solidbody, the Les Paul of 1960. Like the final guitars in the original run of Les Paul Standards, the Les Paul ™60s Tribute carries a pair of PAF-style humbucking pickups, the most revered pickup ever created, along with the fast, comfortable slim neck profile characteristic of the start of that decade. Gibson' most acclaimed hardware set ensures smooth playability and offers precise tuning and intonation. In the image of the greatest Les Paul Standards ever made, the Les Paul ™60s Tribute starts with the classic tonewood combination of a mahogany body with solid carved maple top. When paired together, these woods offer a tonal depth and complexity unmatched by any single-wood construction, with warmth and richness from the mahogany, and superb clarity and œsnap\u009d from the maple, all of which translates beautifully to the guitar' amplified sound. The mahogany back is strategically weight relieved to both lighten your load and improve resonance. A solid mahogany neck is glued into the body in Gibson' time-tested tradition, and carved to a fast, slim 60s profile that measures .800\u009d at the 1st fret and .875\u009d at the 12th. It is topped with a genuine rosewood fingerboard that carries 22 medium-jumbo frets and traditional trapezoid inlays. In keeping with the stripped-down ethos of this powerful performer, both body and ™board remain unbound, and there' no pickguard to obscure the finish. A PLEK-cut nut made from black Corian„¢ subtly complements the black speed knobs and black pickup rings, while enhancing resonance and sustain. The traditional back-angled headstock is silkscreened with a gold Gibson logo and Les Paul Model. The Les Paul ™60s Tribute takes its firepower from a pair of BurstBucker„¢ humbucking pickups; a BurstBucker 1„¢ at the neck and a slightly hotter BurstBucker 2„¢ at the bridge. The BurstBuckers„¢ humbuckers are some the most accurate recreations of vintage PAF humbuckers available today. These great pickups adhere strictly to Seth Lover' original formula, which includes a genuine Alnico II bar magnet in each pickup and slightly mismatched coils wound with 42-AWG enamel-coated wire for the characteristic edge and bite that has made original PAFs legendary. The traditional wiring complement of an independent volume and tone control per pickup plus a three-way toggle selector switch allows a broad range of sonic variations. To anchor it all down, Gibson USA loads in a Tune-o-Matic bridge and Stopbar tailpiece, with a set of genuine Grover„¢ kidney button tuners, a hardware set that partners up for solid sustain and precision tuning. Put it all together, and the Les Paul ™60s Tribute presents the perfect celebration of Les Paul' genius and achievement, wrapping it all into a great guitar that brings the look, feel, and sound of the original humbucker-loaded Les Pauls to the hands of players of today. Each guitar includes a black Gibson gig bag, owner' manual and truss-rod wrench. FEATURES Mahogany body with solid carved maple top Mahogany neck with a fast, slim '60s profile Rosewood fingerboard with trapezoid inlays BurstBucker 1 and BurstBucker 2 humbucking pickups in the neck and bridge Grover„¢ Kidney button tuners Includes a black Gibson gig bagOn Feb-01-19 at 06:34:33 PST, seller added the following information: *needs gibson quick connectors", "ItemID": "113599194369", "EndTime": "2019-02-02T17:19:44.000Z", "StartTime": "2019-01-26T17:19:44.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/gibson-les-paul-60s-tribute-/113599194369", "ListingType": "Chinese", "Location": "Albuquerque, New Mexico", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1135991943698080_2.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/ENwAAOSwhH1cTJRy/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/WZEAAOSwQGFcTJR4/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Wa4AAOSwUXFcTJR1/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/GXMAAOSwxFVcTJRu/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/F-4AAOSw4b1cTJR8/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/exAAAOSwd7FcTJRs/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/dwgAAOSwseFcTJRq/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/pEMAAOSwxs9cTNbQ/$_12.JPG?set_id=880000500F"], "PostalCode": "87111", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "crazyrobots", "FeedbackRatingStar": "Yellow", "FeedbackScore": 29, "PositiveFeedbackPercent": 100.0}, "BidCount": 26, "ConvertedCurrentPrice": {"Value": 405.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 405.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "y***r", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 16}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "gibson les paul 60's tribute", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Product Line", "Value": ["Gibson Les Paul"]}, {"Name": "Model", "Value": ["Les Paul '60s"]}]}, "HitCount": 846, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 410.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}