{"BestOfferEnabled": true, "Description": "Vintage 1995-96 Fender Standard Stratocaster Electric Guitar White Made in Mexico MIM with gig bag. ( see conditions but I will repeat, It will need a bit of love in certain areas. I wish could tell you more specifics about this guitar however, I am not a guitar player, guitar reseller or musician! In addition, I do not know the history of this guitar, original vs replacement parts. It has been stored in the back of my store in a climate controlled environment. Double check the all details for accuracy before bidding or buying. We recently are blowing out out complete back-stock of 40-50 guitars. Many at .99 cent auctions. See current and past deals. You should expect it will need a set-up upon receiving... such as a tuned up, tightened, cleaned, and or adjusted to your liking. We will ship carefully, packing well and un-tuning the strings. Guitar setups and strings are not warranted since rough handling, travel/shipping can affect the setup. This is especially so if being shipped through many zones and atmospheric differences. You will receive item exactly as shown in the pictures. Please understand, this listing only contains what is described. Don’t assume it comes with something if not stated in the listing description.If an identifying mark, inclusion or defect is visible in the images it is considered disclosed to the buyer.Purchase of the item represents an agreement on the terms and conditions of this listing.Once you make the purchase, it cannot be cancelled. Ebay will respond to the unpaid purchase and if it remains unpaid will result in a non-payer strike which can result in a loss of your eBay privileges. Uptown Pawn dba. UptownSalesUSA, a brick and mortar pawnshop located in the heart of the Twin Cities metro area. We are licensed and bonded by the city of Minneapolis and registered with Minnesota Secretary of State since 2002. Check out our feedback and buy with confidence.You can find contact information at the bottom of our Ebay Payment Policy tab in listing. If you have any questions or need to discuss more descriptions, special shipping arrangements, additional photos, or local pick up. Six 12 823.Three 001 Uptown Pawn dba. UptownSalesUSA makes no express or implied warranties or representations regarding the condition or suitability of the goods and to the extent allowed by law, specifically disclaims any express or implied warranties, including but not limited to any warranty of merchantability or fitness for purpose.We do not offer a warranty on any merchandise: Ebay has a Square Trade program may work. We are not a distributor for any brand. Warranties on the items that I sell may or may not be valid on a non-retail purchase. Indemnity:Buyer shall, at no expense to the Seller, indemnify, defend and hold the Seller harmless against any and all losses, damages and expense (including punitive damages, multiple damages, attorney fees and other costs of defending any action) Seller may incur as a result of any claim made against the seller by any person, including without limitation, Buyer, it's successors, assigns, representatives, agents, employees, insurers, and customers, actually or allegedly arising out of the regarding the transportation, installation or use of the equipment sold hereunder by Seller or out of any products manufactured or sold by Buyer, including, without limitation, any claim which in whole or in part actually or allegedly arises out of (a) Seller's negligent or other wrongful act or omission, (b) danger or default in any equipment sold by Seller to Buyer, (c) infringement by Seller of any patent, copyright, or trade secret relating to any equipment sold by Seller to Buyer.", "ItemID": "173811024226", "EndTime": "2019-02-28T03:13:00.000Z", "StartTime": "2019-02-25T05:06:03.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1995-96-Fender-Standard-Stratocaster-Electric-Guitar-White-MIM-60s-Style-/173811024226", "ListingType": "FixedPriceItem", "Location": "Minneapolis, Minnesota", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1738110242268080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/5SAAAOSw8VNcc3Ux/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/ZGQAAOSwfeZcc3YQ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ2M1gxMTg2/z/oCYAAOSwyMRcc3VJ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTUxMlgxMDY4/z/giYAAOSwIxVcc3V4/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/J~4AAOSwGoRcc3X4/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQwMlgxMTg2/z/snAAAOSwMexcc3Vs/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTM4OVgxMDk4/z/b2gAAOSw24hcc3VZ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/tiUAAOSw4d5cc3WE/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/iuQAAOSwoG1cc3W6/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/DX4AAOSwxL1cc3Wp/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/PEUAAOSwUTZcc3Ww/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/3bUAAOSwDNRcc3XB/$_57.JPG?set_id=8800005007"], "PostalCode": "55408", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "uptownsalesusa", "FeedbackRatingStar": "Red", "FeedbackScore": 3062, "PositiveFeedbackPercent": 99.6}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 350.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 350.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "e***i", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 1}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "1995-96 Fender Standard Stratocaster Electric Guitar White MIM  60's Style ", "ItemSpecifics": {"NameValueList": [{"Name": "Size", "Value": ["Standard"]}, {"Name": "Model Year", "Value": ["1995-96"]}, {"Name": "Model", "Value": ["Standard"]}, {"Name": "Series", "Value": ["Standard"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Soundboard Style", "Value": ["Flat Top"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Country/Region of Manufacture", "Value": ["Mexico"]}, {"Name": "Brand", "Value": ["Fender"]}, {"Name": "Body Material", "Value": ["Alder"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["White"]}, {"Name": "MPN", "Value": ["144602580"]}]}, "HitCount": 817, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1105760823", "StoreName": "Uptown Pawnstars"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "ProductID": {"Value": "219517125", "Type": "Reference"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "ConditionDescription": "Vintage... Various types surface imperfections, scratches, nicks and play wear which seem normal for a guitar that has been played and loved for 23 years. There is play wear on the body, frets are rough and some rusting on the strings. Will need a set up and strings.. We take lots of detailed photos so you can make the fairest evaluation of the item's physical condition using your own skilled observation; independent of ours yet subjective, opinion. Sold as described, as is.", "QuantitySoldByPickupInStore": 0, "SKU": "68783-1 MAS JXX", "NewBestOffer": false}