{"BestOfferEnabled": false, "Description": "First introduced in the late 1970’s, the Super Swede has always been considered one of Hagstrom’s flagship models. Each Super Swede is crafted using a mahogany body, maple top, and set mahogany neck. With a 25.5” scale length and a pair of coil-split-capable Custom 58 AlNiCo pickups, the Super Swede provides a brighter sounding, longer sustaining, and more flexible single-cutaway guitar for players looking for something more than any regular single-cut can offer. Naturally, the Super Swede is equipped with Hagstrom’s renowned H-Expander truss rod and Resinator fretboard for a playing surface that provides the ultimate in stability, comfort and tone. Hagstrom Machine Heads Hagstrom models use 18:1 or 15:1 gear ratio machine heads based on designs to insure accurate tuning. Viking and HB series basses machine heads with a 17:1 gear ratio. H-Expander All Hagstrom electric guitars and basses include patented H-Expander truss rod. Providing tension at both ends and running the entire length of the neck, the rigid yet light-weight alloy truss rod allows for a very low action and thin neck, two factors that were instrumental in earning Hagstrom its reputation as the world’s fastest playing guitar. The H-Expander truss rod not only provides ultimate neck stability, but it also contributes to Hagstrom’s unique tone. Longer sustain and a round attack are some of the sonic characteristics the H-Expander adds to the tonal essence of Hagstrom. Resinator Wood Resinator wood is a wood composite material that is both more uniform in density and more stable than any standard wood product. These characteristics eliminate dead spots or “wolf tones” sometimes associated with conventional wood fingerboards. Resinator wood has an articulate sound similar to high quality ebony, but without any of the problems associated with ebony. It provides a stable and clear tone, and also adds higher overtones and harmonics which uniquely detail each note. Like our H-Expander truss rod, Resinator wood is a major contributor to the distinctive “Hagstrom tone”. Sustain Block Tailpiece Hagstrom’s unique Sustain Block Tailpiece was the result of design work starting in 1976 and made its first appearance on Swede and Super Swede guitars produced in 1978. Since then it has been a signature on many solid body models. Each string terminates in a single, massive brass block coupled directly to the guitar’s body. The blocks are detached from one another to reduce interference between the strings, maximizing each string’s unique contribution. BodyMaterial: MahoganyTop: 10 mm Carved MapleStyle: Single CutawayNeckJoint: Set NeckMaterial: MahoganyTruss Rod: H-Expander™Fingerboard/NutMaterial: Resinator™Radius: 15\"Inlays: Super Swede BlockFrets: 22 Medium JumboScale Length: 25.5\" (648 mm)Nut: GraphTech Black Tusq XLNut Width: 43 mmElectronicsPickups: 2 x Hagstrom Custom 58 AlNiCoPickup Selector: 3-Way Toggle SwitchControls: 2 x Volume / 2 x Tone Mini Toggle coil tap switchPartsBridge: Long Travel Tune-O-Matic with Hagstrom Stop Tailpiece and Single Brass String BlocksTuning Keys: Hagstrom Design 18:1 Shipping Policy: We ship Fedex or USPS in the continental USA free. Alaska, Hawaii and US territories have a $40.00 charge. International shipping is by USPS Priority Mail International. International buyers pay all costs involved in shipping and import including all transport costs, duties, fees, taxes or other costs. Return Policy: 30 days, buyer pays all return shipping costs.", "ItemID": "264208325516", "EndTime": "2019-02-24T17:11:20.000Z", "StartTime": "2019-02-22T00:35:03.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Hagstrom-Super-Swede-M-Electric-Guitar-Iceland-Ash-Solid-Body-Matte-w-Case-/264208325516", "ListingType": "FixedPriceItem", "Location": "Kinderhook, New York", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2642083255168080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg1MzE=/z/37YAAOSwq6VcD75A/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg1MzE=/z/VNsAAOSw-4JcD75H/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5ODk=/z/20gAAOSwhrpcD75C/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5ODY=/z/SDQAAOSw~D5cD75I/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5NTY=/z/NbUAAOSwgyZcD75D/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5NTY=/z/cy0AAOSwsO5cD75K/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg2NDc=/z/HjUAAOSwEphcD75E/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg1OTk=/z/9ugAAOSwGq5cD75G/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA3MVgxNjAw/z/LSgAAOSwc6ZcD8L8/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg2ODY=/z/RyUAAOSwOGFcQPGx/$_57.JPG?set_id=8800005007"], "PostalCode": "12106", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "allusedguitars", "FeedbackRatingStar": "Red", "FeedbackScore": 3777, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 425.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 425.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "0***n", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 368}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "CA", "JP"], "Site": "US", "TimeLeft": "PT0S", "Title": "Hagstrom Super Swede M Electric Guitar Iceland Ash Solid Body Matte w/ Case", "ItemSpecifics": {"NameValueList": [{"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "MPN", "Value": ["Super Swede M"]}, {"Name": "Brand", "Value": ["Hagstrom"]}, {"Name": "Model", "Value": ["Super Swede"]}, {"Name": "Body Material", "Value": ["Ash"]}, {"Name": "Country/Region of Manufacture", "Value": ["Iceland"]}, {"Name": "Body Type", "Value": ["Solid"]}]}, "HitCount": 32, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1075578741", "StoreName": "All Used Guitars"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Central America and Caribbean", "Europe", "Middle East", "Oceania", "Southeast Asia", "South America", "BM", "GL", "MX", "PM", "AF", "AM", "AZ", "BD", "BT", "CN", "GE", "IN", "KZ", "KR", "KG", "MV", "MN", "NP", "PK", "LK", "TJ", "TM", "UZ", "RU", "PO Box"], "GlobalShipping": false, "ConditionDescription": "The guitar plays and sounds great. It is setup and ready to play. It had a repair to the neck that left some rough finish on the neck binding, as shown. The repair is solid, the truss rod works and the action is 3/32\" or lower at the 12th fret. Ships in a free hard shell case.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}