{"BestOfferEnabled": true, "Description": "Up for sale is a Sweetwater Exclusive. They only made a few of these in a CU24. It's used, but barely. Maybe 2 hours of practice time. Immaculate. Classic PRS Electric at a Great Price Paul Reed Smith has been a name in custom guitars for decades, winning over legendary players such as Carlos Santana and David Grissom, who only play PRS guitars onstage. With their line of PRS SE customs, the expert craftsmanship of this legendary company becomes available to the next generation of players. The superb SE Custom 24 Sweetwater Exclusive solidbody electric guitar gives you classic PRS playability while serving up vibrant humbucker tone from its pair of PRS SE 85/15 S pickups. This gorgeous instrument has a comfortably contoured mahogany double-cutaway body topped with eye-catching maple and sports a satisfying wide-thin profile neck with a rosewood fingerboard, 24 frets, and classic PRS bird inlays. The headstock has been redesigned to now sport Paul Reed Smith's signature, adding an extra cool factor. Guitarists here at Sweetwater are big fans of the PRS SE Custom 24 and know you will be too. PRS-designed SE 85/15 S humbucking pickups The two humbucking pickups in this SE Custom 24 Sweetwater Exclusive are Paul Reed Smith-designed SE 85/15 S humbuckers. An update on PRS's original humbuckers, the 85/15 S pickups are designed to hit a wide range of tonal and stylistic colors and nuances — from gritty and crunchy to open and light — these pickups move easily through rock, country, and blues. They also offer you plenty of output for driving your amp hard while still producing beautifully clear, thick tone. Mahogany topped with maple looks and sounds amazing The PRS SE Custom 24 solidbody electric guitar has a rich yet balanced sound that comes from the popular combination of mahogany topped with maple. The mahogany body offers natural tonal warmth while the maple top brings out the brighter tones. These tonewoods join forces with the guitar's SE 85/15 S pickups to deliver a balance of depth, snap, and great midrange projection that propels you through the mix. PRS wide-thin profile neck feels right at home Get the SE Custom 24's wide-thin profile neck in your hands, and you'll understand why it has been a favorite among guitarists in every genre for years. PRS luthiers know that the shape and feel of a neck is critical to the playing experience, so they have designed a neck that feels immediately comfortable and playable. The wide-thin neck carve is very comfortable for players desiring a faster feel than the wide-fat, while maintaining plenty of wood for optimal sustain. PRS SE Custom 24 Sweetwater Exclusive Features: Mahogany topped with maple looks and sounds amazing PRS SE 85/15 S humbucking pickups Maple neck with rosewood fingerboard provides comfortable playability PRS bird fingerboard inlays impart an elegant touch PRS-designed tremolo bridge works smoothly and maintains tuning stability", "ItemID": "223297162753", "EndTime": "2018-12-29T22:21:53.000Z", "StartTime": "2018-12-24T15:57:33.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/PRS-SE-Custom-24-Sweetwater-Flat-Black-matte-guitar-/223297162753", "ListingType": "FixedPriceItem", "Location": "Loveland, Colorado", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/2232971627538080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/Nzc4WDE2MDA=/z/dIwAAOSw7wFcIQEJ/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/Nzc4WDE2MDA=/z/dxoAAOSwF7lcIQEK/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/Nzc4WDE2MDA=/z/pCgAAOSw~rhcIQEL/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/Nzc4WDE2MDA=/z/dBQAAOSwC85cIQEM/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/Nzc4WDE2MDA=/z/YAgAAOSwo1lcIQEO/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/Nzc4WDE2MDA=/z/MEoAAOSwV3dcIQEQ/$_12.JPG?set_id=880000500F"], "PostalCode": "80537", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "sungkiti", "FeedbackRatingStar": "Purple", "FeedbackScore": 628, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 600.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 600.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "i***n", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 9}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "PRS SE Custom 24 Sweetwater Flat Black matte guitar", "ItemSpecifics": {"NameValueList": [{"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Brand", "Value": ["PRS"]}, {"Name": "Model", "Value": ["24"]}, {"Name": "Body Material", "Value": ["Mahogany"]}, {"Name": "String Configuration", "Value": ["6 String"]}]}, "HitCount": 224, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "ProductID": {"Value": "70306863", "Type": "Reference"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}