{"BestOfferEnabled": false, "Description": "I know I’m probably gonna regret selling this axe, but as a former guitar amp builder, I’ve acquired more guitars and gear over the years than I can count, so it’s time to thin the herd. This guitar is a Customized right-handed Limited Edition Fender USA American Deluxe Stratosonic. These are rare guitars, as Fender only made them for a few years after introducing them at the Winter NAMM show in 2003. The serial number shows that this axe was made in 2003 - 2004 at Fender’s plant in Corona, California. She sports a chambered mahogany Strat body with 5 tone chambers, traditional Strat front and back contours, wrap-around tailpiece, gorgeous crimson red/cherry finish and original Fender hardshell case. She’s in exceptional condition, almost totally mint. This axe is a true Closet Queen. I’ve only played her a handful of times over the years, never gigged her or taken her out of the house. She’s been quietly sitting in my closet in her original Fender case for many years and needs to find a player that can appreciate her beauty, comfort, tone and versatility. Cosmetically, I went over this axe from top to bottom and examined every square inch. She has no visible dings, scratches or buckle rash on the body. You’re only gonna find normal extremely light surface swirls on the body that are difficult to see unless you’re holding the guitar at an angle in direct light. These are the light surface swirls that you typically get from a polishing cloth or light contact with clothing. The pickguard has the same extremely light swirls and one barely perceptible “ding/scratch”? That one on the pick guard is so small and insignificant, I don’t even know what to call it. It’s smaller than a flea but since it’s a little bit more than just a typical light swirl, I’m reporting it. A couple of insignificant “blips” about the size of the head of a pin on back near the controls cover, and on the front around the tone knob. I don’t even know what to call these, looks like they were a result of Fender’s finishing process. I tried to photograph them but they’re so small they won’t show up. I never noticed them before and you wouldn’t know they were there unless you knew they were there, and held the guitar at the right angle in direct light. Really insignificant but since I did notice them during an intense inspection, I’m reporting them. The Neck is in perfect condition with a smooth satin finish and plays effortlessly. No scratches, dings, nada. Same with the black headstock. Fretboard is perfect, no dings or scratches and frets show no visible signs of wear. This Closet Queen just might be the cleanest example of a pre-owned Stratosonic that you’ll ever find. Overall, I’d give the condition of this axe an easy 9+/10. The only way this guitar could be in better shape is if it came brand new direct from the factory. What’s really unique about this axe is that although it’s a Strat design, it has the shorter Gibson 24 ¾” scale, along with a Chambered Honduran Mahogany Body, and wraparound tailpiece. By the way, this axe has been customized. The previous owner replaced the so-so stock P90’s with DiMarzio Humbucking Soapbars (sorry, I don’t remember which models) and push-pull volume and tone pots with chrome knurled knobs. Need an axe with versatility? Here ya go. With the push-pull pots, both Humbuckers can be split into single coils, offering a mixture & variety of single and/or humbucking tones giving the player the best of both worlds. You can now go from sweet jangly single coil tones to raunchy humbucking tones with the push-pull volume & tone knobs. Since you’ll have a choice of using the DiMarzio’s in Humbucking or Single Coil mode, and/or mixing between the two, you’ll get a total of 8 different tones instead of just the 3 you’d get with the stock P-90’s. If you’re running through a high gain amp or using distortion pedals and don’t want single coil hum, then just pop those pup’s into humbucking mode and enjoy the silence. Wanna play Hard Rock? Blues? Country? Jazz? No problem. From clean spank to hard grind to singing sustain, this axe gives up the goods. SPECS · Strat style Honduran Mahogany Body with 5 Tone Chambers (light weight & sweet sustain) · Gorgeous Crimson Red/Cherry Finish with black painted headstock · Maple Neck (Modern C-Shape w/9.5 inch radius) finished in smooth satin polyurethane · Indian rosewood fretboard with 22 Medium Jumbo frets & abalone dot position markers · Fender Tech-Tonic 6-saddle locking wraparound bridge/tailpiece, fully adjustable · Fender/Schaller deluxe cast/sealed Chrome Tuners · Master Volume, Tone Control and 3-Way Pickup Selector Switch · Customized with 2 DiMarzio Humbucking Soapbars with split coil wiring · Chrome Knurled Control Knobs with Push/Pull pots on both Master Volume & Master Tone Controls. · Push/Pull pots split Humbuckers into Single Coils, giving 8 different tone options. · Fender/Schaller Straplock Strap Buttons · 3-ply black/white pickguard · Chrome Hardware · 1-11/16\" nut width · 24 3/4-inch Scale Length · Original Fender Hardshell Molded Case. · Made in the USA. What’s Included in this Auction, i.e., what you’ll get: · 2003 - 2004 Fender American Deluxe Stratosonic guitar, as seen in the photos. · Original Fender Hardshell Case as seen in the photos. What’s Not included in this Auction: · No Warranty – guitar is sold as-is, as depicted in the photos. · Guitar stand used for photos is NOT included. · Anything other than the guitar and case is NOT included. $75.00 for insured shipping to the Continental U.S. Only. Alaska & Hawaii add additional $95.00 shipping ($170.00 Total). Guitar will be shipped insured, in its original case and then professionally packaged and shipped. Once shipped, I’ll provide the buyer with the tracking number. Note: I detuned the guitar to reduce tension on the neck during shipping. You’ll need to retune after unpacking. Please ask any questions you may have before bidding. No zero feedback buyers! Immediate payment is required. Seller's payment instructions: Please make sure you give me your phone number for the shipping label, in case the shipper needs to contact you during delivery. Normal 0 false false false EN-US X-NONE X-NONE", "ItemID": "253957542636", "EndTime": "2018-11-04T21:19:26.000Z", "StartTime": "2018-10-30T21:19:26.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2003-Fender-USA-Strat-O-Sonic-Guitar-w-OHSC-Customized-DiMarzio-s-RARE-/253957542636", "ListingType": "Chinese", "Location": "Nottingham, Maryland", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2539575426368080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/wfcAAOSwoYFbqYB5/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/uXsAAOSwOuBbqYCB/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/wasAAOSwc1ZbqYCI/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/NIoAAOSwcbRbqYCW/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/BiAAAOSw0NRbqYCc/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Z00AAOSwpE5bqYCj/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/O7EAAOSw8MJbqYC2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/60wAAOSwj81bqYC~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/4gMAAOSwkfRbqYDF/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/PpAAAOSwuGhbqYDL/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/ZHAAAOSwvdxbqYDQ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/1L0AAOSwaelbqYDY/$_57.JPG?set_id=8800005007"], "PostalCode": "21236", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "aikisgr8", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 131, "PositiveFeedbackPercent": 100.0}, "BidCount": 7, "ConvertedCurrentPrice": {"Value": 760.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 760.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "u***h", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1080}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2003 Fender USA Strat-O-Sonic Guitar w/OHSC - Customized with DiMarzio’s - RARE!", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "Model Year", "Value": ["2003"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Type", "Value": ["Semi-Hollow"]}, {"Name": "Body Color", "Value": ["Crimson Red / Cherry"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Body Material", "Value": ["Mahogany"]}, {"Name": "Features", "Value": ["Split Coil DiMarzio Pickups", "Push-Pull Volume & Tone Knobs"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Soundboard Style", "Value": ["Chambered Mahogany Body w/5 Tone Chambers"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}, {"Name": "Modified Item", "Value": ["Yes"]}, {"Name": "Modification Description", "Value": ["The stock P90’s were replaced with DiMarzio Split-Coil Humbucking Soapbars and push-pull volume and tone pots with chrome knurled knobs to split between humbucking & single coil tones."]}, {"Name": "California Prop 65 Warning", "Value": ["N/A"]}, {"Name": "Size", "Value": ["24-3/4 inch Scale Length"]}, {"Name": "Product Line", "Value": ["Limited Edition Fender USA American Deluxe"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Model", "Value": ["Fender USA American Deluxe Strat-O-Sonic"]}]}, "HitCount": 231, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 770.0, "CurrencyID": "USD"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "ConditionDescription": "This axe is a true Closet Queen, and just might be the cleanest example of a pre-owned Stratosonic that you’ll ever find. Overall, I’d give the condition of this axe an easy 9.5/10. The only way this guitar could be in better shape is if it came brand new direct from the factory. No visible dings, scratches, or buckle rash. The only thing you can potentially see, if you hold this axe at the right angle under light, is extremely light swirls, like the kind you get from polishing the guitar with a polishing cloth. The Neck is in perfect condition with a smooth satin finish and plays effortlessly. No scratches, dings, nada. Same with the black headstock.Fretboard is perfect, no dings or scratches and frets show no visible signs of wear.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}