{"BestOfferEnabled": false, "Description": "Powered by Frooition Pro Shop Search 2005 Fender Custom Shop Custom Classic Stratocaster \"V\" Neck - Sunburst w/ Case Click here to view full size. Full Size ImageClick to close full size. Item Description 2005 Fender Custom Shop Custom Classic Stratocaster V-Neck Electric Guitar in very good condition with little to no playwear. There are a couple of ultra-fine scratches that cannot be seen by the camera. Classic 3-tone Sunburst finish with 3-ply white parchment pickguard and chrome hardware. The guitar has a nice action and the figured birds-eye one-piece maple neck with a \"V\" profile has a very good, quality feel. The medium jumbo frets are in excellent condition. The Modern Classic pickups and the Hot Classic bridge pickup with an induction plate have great tone with nice output. The No-Load tone circuit lets the sound of the pickups shine. The guitar features a two point tremolo with polished stainless saddles and staggered height locking tuners for great tuning stability. There is a Fender Custom Shop Logo on the back of the headstock and on the neck plate. Another great quality instrument from the Fender Custom Shop with lots of great player features. Includes a nice tweed hard shell case and a replacement tremolo arm. Serial Number: CZ506620 Weight: 7 lbs. 14 oz.The American Strat Goes Upscale with the Custom ClassicThe magic of the Fender Custom Shop is in the hands of the builders! Their years of experience, range of skills and expertise at their craft make every Fender guitar they build highly sought-after by players, celebrities and collectors. That's the case with the Custom Classic Stratocaster V-Neck! Fender Custom Classic Stratocaster V-Neck at a Glance: An American Strat with custom features Select alder body and \"V\" maple neck Modern Classic single-coil pickups and Hot Classic bridge pickup The Custom Classic Stratocaster is the Custom Shop's version of Fender's American Series Strat. It offers custom detailing, classic Fender contours and legendary Strat tone. The aged white plastic parts contribute to the Strat's classic looks, and a new deluxe 2-point synchronized tremolo with polished solid stainless steel saddles and block make it fun to play. Select alder body and “V” maple neckThe Fender Custom Classic Stratocaster includes additional upgraded features. It’s built with a thin-finished select alder body. The Strat’s birds-eye figured, soft (slightly rounded) “V”-shaped one-piece maple neck is complemented by 22 medium-jumbo frets, and Fender Deluxe staggered height locking machine heads. The one-piece maple neck/fretboard is what gives the Custom Classic Strat that bright, “poppy” classic Fender attack. The alder body wood brings the classic rock sounds of Jimi Hendrix, Stevie Ray Vaughn, and John Mayer to the table. Modern Classic single-coil pickupsFender has upgraded the Custom Classic Stratocaster pickup section, too. The Strat's three Modern Classic single-coil pickups include the Hot Classic bridge pickup with a custom steel inductance plate. Also onboard this Strat is a 3-ply parchment pickguard and a Custom Classic 2-point synchronized tremolo with milled solid-stainless saddles, solid steel spring block. Fender Custom Classic Stratocaster V-Neck Features: Model Name: Custom Classic Stratocaster \"V\" Neck Series: Custom Classic Series Color: 3-Color Sunburst Body: Select alder Neck: Figured \"Birs-eye\" maple, soft \"V\" shape, polished satin urethane finish Fretboard: Maple, 9.5\" radius No. of Frets: 22 medium jumbo frets Pickups: 2 Modern Classic single-coil pickups (neck, middle), 1 Hot Classic single-coil pickup (bridge) with custom steel inductance plate All pickups have modern magnet stagger Controls: Master Volume, Tone 1 (neck pickup), tone 2, no-load tone control (middle and bridge pickups) Pickup switching: 5-position blade Bridge: New Deluxe 2-point synchronized tremolo with polished solid stainless steel saddles and block Machine Heads: Fender/Schaller Deluxe staggered locking tuning machines Hardware: Chrome Pickguard: 3-ply parchment Scale Length: 25.5\" Width at Nut: 1.6875\" Unique features: Aged white plastic parts About Us Payment Shipping Terms Returns About UsWe offer a large selection of quality pre-owned musical instruments and equipment from the industries finest manufactures including Akai, Ampeg, Boss, Denon, Digidesign, DigiTech, Epiphone, Fender, Gibson, Gretsch, Guild, Ibanez, Korg, Lexicon, Line 6, Mackie, Mesa Boogie, Marshall, Martin, MusicMan, MXR, Neumann, Peavey, Pioneer, PRS, Roland, Shure, Tascam, Taylor, TC Electronic and Yamaha. New gear arrives daily so check our store often. Lighthouse Sound, Inc. is proud to be an authorized dealer of the following brands of guitar effects pedals, pedal boards, amplifiers and accessories: Bearfoot FX, Bigsby, Cooper Stands, Dunlop, Earthquaker Devices, Ernie Ball, EVH, Fender Accessories, Keeley Electronics, Gretsch Accessories, Ken Smith Strings, Lava Cable, Martin Accessories, Mojo Hand FX, RotoSound, SnaKe Oil Strings, Snark Tuners, Suhr Guitars, Amps, Pedals and Pickups, Voodoo Lab and Wampler Pedals About Us Payment Shipping Terms Returns PaymentWe accept PayPal payments. All major Credit Cards are accepted through PayPal including Master Card, Visa, American Express and Discover. About Us Payment Shipping Terms Returns ShippingLighthouse Sound specializes in prompt, safe shipping. We take great care packaging every item to ensure safe shipment to you. We get your gear to you fast, most orders ship within 1 business day of payment clearance. Tracking information is uploaded to eBay and can be viewed from your eBay account. International customers are responsible for any duties, taxes, brokerage or other fees. Please check with your country's customs office to determine what these additional costs will be. These fees vary from country to country and we have no way to calculate them. About Us Payment Shipping Terms Returns TermsSales Tax - 7 % Ohio Sales Tax will be added to the total amount for all purchases delivered to Ohio. We take pride in our customer service and your satisfaction is very important to us. In the rare event that you have a problem with your item please contact us and we'll be happy to help. While all care is taken, any errors, omissions or variations in the item details are unintentional. About Us Payment Shipping Terms Returns ReturnsWe offer a 14 day return policy. Items must be returned to us within 14 days of the original delivery date. We ask that you please return the product in the original product packaging along with all included materials (manual, warranty card, all accessories) and in the original condition that it was received. Buyer is responsible for return shipping and insurance cost. Refunds will be issued upon return of the item less the original shipping charge and a 15% restocking fee will apply. Helpful Links More Items! This listing is currently undergoing maintenance, we apologize for any inconvenience caused. Powered by SixBit's eCommerce Solution", "ItemID": "352558337645", "EndTime": "2019-01-04T12:43:17.000Z", "StartTime": "2019-01-02T02:40:02.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2005-Fender-Custom-Shop-Custom-Classic-Stratocaster-V-Neck-Sunburst-w-Case-/352558337645", "ListingType": "FixedPriceItem", "Location": "Salem, Ohio", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/3525583376458080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/bfwAAOSwOWdcLCRk/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/IVMAAOSwO-hcLCRn/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/9CYAAOSw8kRcLCRp/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/DA4AAOSw6eRcLCRs/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/W6oAAOSwXItcLCRu/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/9oQAAOSwohVcLCRx/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/pa0AAOSwikBcLCRz/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/w~0AAOSwEwhcLCR2/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAwOVgxNDIx/z/hWwAAOSwhrpcLCR6/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/D-EAAOSwF7lcLCR4/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/ywUAAOSw8U9cLCR9/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/e3EAAOSwALlcLCR~/$_57.JPG?set_id=880000500F"], "PostalCode": "44460", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "lighthouse_sound", "FeedbackRatingStar": "TurquoiseShooting", "FeedbackScore": 33092, "PositiveFeedbackPercent": 99.6, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1699.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1699.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "p***7", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 2}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "CA", "GB", "DK", "RO", "SK", "BG", "CZ", "FI", "HU", "LV", "LT", "MT", "EE", "AU", "GR", "PT", "CY", "SI", "JP", "CN", "SE", "KR", "ID", "TH", "BE", "FR", "HK", "IE", "NL", "PL", "ES", "IT", "DE", "AT", "BS", "IL", "MX", "NZ", "SG", "CH", "NO", "SA", "UA", "AE", "QA", "KW", "BH", "HR", "MY", "CO", "PA", "JM", "BB", "BD", "BM", "BN", "BO", "EG", "GF", "GG", "GI", "GP", "IS", "JE", "JO", "KH", "KY", "LI", "LK", "LU", "MC", "MO", "MQ", "MV", "NI", "OM", "PK", "PY", "RE"], "Site": "US", "TimeLeft": "PT0S", "Title": "2005 Fender Custom Shop Custom Classic Stratocaster \"V\" Neck - Sunburst w/ Case ", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Model", "Value": ["Stratocaster"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Color", "Value": ["Sunburst"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Model Year", "Value": ["2005"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Series", "Value": ["Custom Shop"]}, {"Name": "Fender Styles", "Value": ["Stratocaster"]}, {"Name": "Type", "Value": ["Custom Classic V-Neck"]}, {"Name": "Accessory Specifics", "Value": ["Replacement tremolo arm"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}]}, "HitCount": 87, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=22579709", "StoreName": "LHSound"}, "Country": "US", "ReturnPolicy": {"Refund": "Money back or replacement (buyer's choice)", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": true, "QuantitySoldByPickupInStore": 0, "SKU": "43515", "NewBestOffer": false}