{"BestOfferEnabled": false, "Description": "This guitar was played very little and has never left the house. It comes with a Gibson soft shell carry bag. In excellent condition. Please note 2 small nicks in the posted images. its worth reading the review on this limited release Gibson. Listed retail was $1059. NOTE: The tuners are the original tuners and NOT the Grover tuners stated in the modified section. This guitar is all original and no changes have been made. The 2014 Les Paul Melody Maker has a mahogany body with a carved (!) maple top. The body is thinner than a standard Les Paul (about the same thickness as a Les Paul Custom Lite or SG Standard), which helps keep the Les Paul Melody Maker's weight down. The rear of the body features a tummy cutout, making it even more comfortable. I was surprised to learn that this Melody Maker / Les Paul has a maple neck. This is rather interesting, since most Les Pauls and even Melody Makers in the past have had mahogany necks. The neck has a rounded 50s profile. Being relatively short-fingered, I usually prefer Gibson's 60s SlimTaper neck profile, but while it's a bit larger than I normally look for, the shape and overall contour of the neck are very comfortable. The neck has a nice rosewood fretboard, with 22 cryogenically-treated medium-jumbo frets, a 24.75\" scale length and 12\" fingerboard radius. The cryogenic treatment is said to give the frets longer life, making them stronger without being harder, with increased resistance to abrasive wear. The neck position marker inlays are acrylic dots, with white dots on the side of the fingerboard. As with all of Gibson's 2014 guitars, there's a distinctive inlay at the 12th fret commemorating Gibson's 120th anniversary. The nut is a low friction TekToid (TM) unit, and the nut slots are cut with the assistance of the PLEK system. The tuners are white button Klusons, which give the guitar a bit of vintage-inspired flair. They hold their tune fine, and turn smoothly. The gear ratio is 14:1. The headstock is a full-sized Gibson style and shape, and not the thinner, straight-sided version seen on most previous Melody Maker models. The bell-shaped truss rod cover is stamped \"MELODY MAKER\", while the headstock has a traditional \"Les Paul Model\" logo silkscreened in gold, which matches the gold silkscreened Gibson logo at the top of the headstock. The review unit is finished in what Gibson calls Charcoal Satin. It's a pleasing color; a very dark smooth matte satin grey. For some reason, this color is slightly less expensive than the other color options, which cost an extra $50 \"street\" price. In addition to Charcoal, it's also offered in TV Yellow Satin, Wine Red Satin and Manhattan Midnight Satin. Unlike some previous Melody Maker models, there are no wood pores visible in the finish. The 2014 Les Paul Melody Maker's Charcoal Satin finish extends to the back, and up the back of the neck, giving it a very uniform appearance. I found the \"feel\" of the finish quite smooth and comfortable, and not the least bit sticky, even when playing it with sweaty hands. The bridge is a one piece Lightning Bar wrap-around unit with a satin chrome finish that visually ties in well with the satin finish of the guitar. It has pre-set, non-adjustable saddles built-in, so the intonation adjustment is relatively limited, and can only be done by adjusting the two allen screws on either end of the bridge. Fortunately, the intonation was excellent straight out of the box.The pickups are a P-90ST in the bridge and a P-90SR in the neck position. They are both top-mounted \"soap bars\" with black plastic covers and individual, non-adjustable AlNiCo V \"slug\" magnets instead of the adjustable polepieces and bar magnets of most P-90 pickups. They are based on a version of the P-90 that was originally used on the ES-125 from 1946 to 1950. The sound of the pickups is similar to, but a bit brighter and crisper than other P90s you might be familiar with, and the pickups snarl and growl in a very cool way when used with a overdrive pedal or cranked-up amp. Want warmer tones? Use the neck pickup, or just roll down one of the tone knobs a bit. While I'd characterize this guitar as leaning towards the brighter side of things, it does offer a variety of cool sounding tones.The three-way pickup selector switch is from Switchcraft, and it is positioned in the traditional Les Paul location above the neck, as opposed to being pickguard-mounted like on most earlier two-pickup Melody Maker models. It's more work in the building process, with more routing involved to put it where it is on the 2014 model, but I think it looks cooler and it is much less likely to get in the player's way than a pickguard-mounted switch is. In another departure from traditional Melody Maker specs, the 2014 Les Paul Melody Maker model has two volume and two tone controls, as you'd expect to find on a two pickup Les Paul model. The potentiometers are 500k units with a non-linear response, which makes them very fast and easy to adjust. The new Supreme Grip speed knobs have indentations in the top edges that make them easier to grab and manipulate, as well as larger numbers that are easier to see. The output jack is mounted on the side of the guitar, like you'll find on a standard Les Paul. While most Melody Makers in the past have had pickguard-mounted output jacks, I greatly prefer the 2014 model's configuration. Again, it's more work to build it this way, but it's out of the player's way. The new 2014 Gibsons now ship with Cleartone coated strings. Regardless of your personal opinions regarding coated strings (and I like the feel of these strings), they offer superior corrosion resistance and longer life over traditional strings, and that means the chances of you having a decent first encounter with the Les Paul Melody Maker in the store are greater, even if it's been on display for a couple of weeks and auditioned by multiple players. After all, no one likes trying out a guitar with grimy, rusted-out strings. The new, larger sized aluminum strap buttons are yet another nice touch. They're big enough that it was a bit more difficult to attach my strap to the guitar, but the upside to that is that it's less likely to come off accidentally. I'll gladly take that tradeoff. At this price, expecting a hardshell case would be pretty unreasonable, and while one is not included, Gibson does toss in a very nice gig bag. It's a USA-built Gibson, and it comes with their standard limited lifetime warranty.", "ItemID": "264087017379", "EndTime": "2018-12-20T20:54:11.000Z", "StartTime": "2018-12-13T20:54:11.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/GIBSON-LES-PAUL-melody-maker-120th-anniversary-black-electric-guitar-/264087017379", "ListingType": "Chinese", "Location": "Flanders, New Jersey", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2640870173798080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/nsoAAOSwAD9cEsBX/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/KTAAAOSwmaJcEsBt/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/CPYAAOSwwfFcEsCE/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/18MAAOSwqjhcEsCd/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/FGMAAOSw8BdcEsC6/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/qegAAOSwSudcEsEB/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/70AAAOSwtaBcEsEV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/JdMAAOSwVEFcEsEr/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/A2oAAOSwu4dcEsFO/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/u2MAAOSwAQVcEsFw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/R2wAAOSwEwhcEsKB/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/KbAAAOSwhexcEsKa/$_57.JPG?set_id=8800005007"], "PostalCode": "07836", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "bikegarage", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 362, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 385.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 385.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***j", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 2}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "GIBSON LES PAUL melody maker 120th anniversary black electric guitar.", "ItemSpecifics": {"NameValueList": [{"Name": "Body Material", "Value": ["solid wood"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Product Line", "Value": ["Gibson Les Paul"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}, {"Name": "Model Year", "Value": ["120th anniversary"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Melody Maker"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Modification Description", "Value": ["grover heads"]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "Features", "Value": ["Single Cut", "Volume Knob", "With Pickup"]}, {"Name": "Modified Item", "Value": ["No"]}]}, "HitCount": 596, "Subtitle": "Satin Black LIMITED FINISH", "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "14 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 390.0, "CurrencyID": "USD"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}