{"BestOfferEnabled": true, "Description": "US SHIPPING ONLYA Travel-sized RGREAD THE DETAILS - this is a professional guitar. Cost $699.99 when new. No longer available. If you are looking for this guitar you know what it is. Comes with original hang tags.Want a smaller-sized guitar for travel but still want it to rock? Ibanez has the solution with the RGM55 miKro solidbody electric guitar. Sporting a 22.75\" scale length, the RGM55 miKro is perfect for stowing in overhead compartments or playing on the tour bus. Yes, it's also great for young players who need a smaller guitar. You'll love the tone you get from the basswood body, maple neck, rosewood fretboard, and dual DiMarzio humbuckers. The Ibanez RGM55 miKro is a serious guitar in a small body.Ibanez RGM55 miKro Series Solidbody Electric Guitar at a Glance:Small size, big toneDiMarzio Tone Zone at the bridge, a hot humbucker with a super-wide dynamic range, and DiMarzio Air Norton at the neck.The ideal travel companionSmall size, big toneDon't let the small size of the Ibanez RGM55 miKro fool you - this baby has big tone. Just like its big brothers, this mini-RG has a basswood body, a 3-piece maple neck, and a rosewood fretboard. It's like somebody put this axe in the dryer just a little too long. You even get cool shark tooth inlays and a pair of American-made DiMarzio pickups. Ibanez's RGM55 miKro is a full-blown RG on a smaller scale.A pair of DiMarzio pickups give you big toneThere's no denying the massive range of tone you can get out of an H/H configuration, but with the Ibanez RGM55 miKro's combo of DiMarzio pickups, you're in a whole new league altogether. First, there's the DiMarzio Tone Zone at the bridge, a hot humbucker with a super-wide dynamic range. It's a perfect complement to the RGM55's DiMarzio Air Norton at the neck, which is deep, warm, and remarkably clean. The guitarists here at Sweetwater love this ultra-flexible pickup combination.The ideal travel companionThe shorter scale length and smaller body size make the Ibanez RGM55 a perfect travel guitar. Whether you're shoving it in the extra few inches in your trunk or stowing it in an overhead compartment, the RGM55 will fit. You'll also have peace of mind knowing that this isn't some watered-down axe, but rather an all-out Ibanez RG with a slightly smaller frame. If you travel and want to take a real guitar on the road, reach for the Ibanez RGM55 miKro!Ibanez RGM55 miKro Series Solidbody Electric Guitar Features:An ideal compact electric guitar for young players and travelersDiMarzio Air Norton and Tone Zone humbucking pickups deliver quintessential rock and metal toneUndersized body and 22.75\"-scale neck are perfect for shorter armsJumbo frets provide easier fretting for smaller handsAlso great for use when traveling light or buskingThe Ibanez miKro series RGM55 solidbody electric guitar is the perfect compact guitar!", "ItemID": "183700476986", "EndTime": "2019-02-25T04:24:00.000Z", "StartTime": "2019-02-23T21:44:47.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Ibanez-RGM55-miKro-Metallic-Blue-Travel-professional-electric-Guitar-rare-w-tags-/183700476986", "ListingType": "FixedPriceItem", "Location": "Brookhaven, Pennsylvania", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1837004769868080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/Yf4AAOSwGZRccbuu/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/4aIAAOSwnI9ccbtV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/UBUAAOSwTGNccbvl/$_57.JPG?set_id=8800005007"], "PostalCode": "19015", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "garcir00", "FeedbackRatingStar": "Red", "FeedbackScore": 1025, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 299.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 299.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "c***d", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 310}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Ibanez RGM55 miKro Metallic Blue Travel professional electric Guitar rare w/tags", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Ibanez"]}, {"Name": "Body Color", "Value": ["Blue"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}]}, "HitCount": 14, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "ConditionDescription": "Great Condition with some fret wear on the first 3 frets/strings 1-2, plays fine with many years of life left.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}