{"BestOfferEnabled": true, "Description": "For sale, a very nice 1965 Epiphone Coronet in excellent condition and in perfect working order. 100% original. This Epi is a classic single P-90 gem made by Gibson at their famous Kalamazoo factory. Fundamentally identical to an SG Junior but notably rarer, the Coronet delivers the same rich P-90 growl and midrange kick that you expect from a great Gibson Junior. Very resonant and easy to play, the tone is dynamic and clear, responding to your picking dynamics and interacting with your favourite tube amp to push it into singing overdrive. And at only 6lbs 6oz, it's an incredibly light guitar too. Professionally set-up here at Mike & Mike's Guitar Bar, this Coronet has been dialled in with fresh 10-46 strings and low action. The one-piece Honduran mahogany neck is fairly slender at the nut, with more depth and shoulder as you move up the fret board. The original frets have plenty of meat, showing moderate, uniform wear on frets 1-6, with some grooving of the Brazilian rosewood fret board as well beneath the plain strings in the first position. The frets have smooth crowns and virtually no wear further up the neck and the truss rod is responsive and optimally adjusted so that the action is slinky and comfortable all the way to the last fret. The nut measures 1 9/16\" in width and the original double line Kluson Deluxe tuners are intact on the headstock, turn smoothly, and hold pitch as they should. On the body, all of the original electronics are intact and untouched, with CTS pots that date to '64. The hardware is consistent with spec for 1964-65, with a nickel pickup cover and vibrola tailpiece, as well as a chrome \"lightning bolt\" bridge. The guitar is currently fitted with a MojoAxe bridge, which like the original can be used as a wraparound tailpiece if desired, with the notable difference that the MojoAxe hardware is intonated for a plain G string. The Maestro vibrola is complete and has a very smooth and fluid response. The original \"spoon\" arm has clean plating, and even the small badge is still present on the vibrola base. Other hardware includes the stock pick guard with \"E\" epsilon sticker as well as the stock tone knob. The volume knob is a similar replacement with correct ribbed edge and aluminium cap, likely from an Epiphone amp from the same era Cosmetically, this Coronet shows some checking and finish chips on the profile, while the body shows plenty of small nicks and scuffs around the contoured edges, particularly on the lower bout. This sort of honest playwear is of course to be expected, and the guitar is structurally sound with zero cracks or repairs. The rich Cherry nitro lacquer finish is 100% original with no over spray, and the finish has been verified under blacklight to further confirm originality. Will be sent by tracked - sign for mail. Normal 0 false false false EN-GB X-NONE X-NONE", "ItemID": "292987699866", "EndTime": "2019-03-01T18:49:10.000Z", "StartTime": "2019-03-01T15:22:26.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Vintage-Electric-Guitar-Cherry-P90-Maestro-Vibrola-Gibson-1965-Epiphone-Coronet-/292987699866", "ListingType": "FixedPriceItem", "Location": "Redditch", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2929876998668080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NDA1WDUwMA==/z/~w8AAOSwBlRceUh9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDk5WDY2OQ==/z/lDwAAOSw359ceUfp/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTE3WDY3NA==/z/neoAAOSwCA5ceUfr/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTAyWDY3Ng==/z/P1kAAOSw6JZceUfu/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDY1WDY3Mw==/z/fOMAAOSwXL1ceUfw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/Mzc0WDUwMA==/z/AkMAAOSw5E1ceUjF/$_57.JPG?set_id=8800005007"], "PostalCode": "B98 0HY", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "suzannjone-25", "FeedbackRatingStar": "Blue", "FeedbackScore": 56, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1729.13, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1300.0, "CurrencyID": "GBP"}, "HighBidder": {"UserID": "t***n", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 314}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Americas", "Europe", "JP", "AU"], "Site": "UK", "TimeLeft": "PT0S", "Title": "Vintage Electric Guitar Cherry P90 Maestro Vibrola Gibson 1965 Epiphone Coronet", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Model", "Value": ["Coronet"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Body Colour", "Value": ["Cherry"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model Year", "Value": ["1965"]}, {"Name": "Body Material", "Value": ["Mahogany"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Modified Item", "Value": ["No"]}]}, "HitCount": 68, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "GB", "ReturnPolicy": {"ReturnsWithin": "30 days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "All offers seriously considered: Plus carry-case also included: This item that has been previously used. The item may have some signs of cosmetic wear, but is fully operational and functions as intended. Also any imperfections are due to long storage", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}