{"BestOfferEnabled": false, "Description": "Our eBay Store About Us Epiphone Riviera Custom P93 Electric Guitar The Epiphone Riviera Custom P93 is modeled after one of Epiphone’s most enduring classics, the Riviera. First introduced in the early ‘60s, the Epiphone Riviera’s semi-hollow design has been a favorite of players from all genres and generations including blues great Otis Rush, Lou Reed of the Velvet Underground, and The Strokes’ Nick Valensi, who have all found that the Riviera’s legendary ES-body shape could produce great tones with any pickup variation. Over the years, the Riviera has been seen with humbuckers, mini-humbuckers, and P-90s. But now the Custom P-93 has the rare distinction of giving players a new sound and a new distinctive look.The Riviera Custom P-93 uses 3 Epiphone “Dogear” Alnico™-V P-90 pickups for a punch that leaves all other three-single coil pickup guitars in the dust. And when matched with the bell-like tones of the ES-style body, a Bigsby® B70 tremelo plus a stunning Wine Red finish with gold hardware, the Riviera Custom P93 truly becomes of our era’s great instruments.The Epiphone Riviera Custom P93 is protected by our famous Epiphone Limited Lifetime Warranty featuring Gibson 24/7/365 Customer Service which guarantees the instrument against defects in materials or workmanship. Case not included. Product Details - Maple body with Wine Red finish - Mahogany SlimTaper “D” profile Set Neck with Rosewood fingerboard - 3-Epiphone P-90 “Dogear” pickups - Bigsby B70 Trem with LockTone Tune-o-matic Shipping Information Your gear will ship out within 2 days of order confirmation. At this time we can not ship PO Boxes, APO and FPO locations. Industry Leading 45-Day Return Policy We stand by the products we sell, and we'll certainly stand by you as well! We truly appreciate your business, and we want you to be 100% happy with your purchase. However, we know that one of the drawbacks of internet shopping is that you can't try something before you buy it. That's where our money-back guarantee comes in. If you are not completely satisfied with an item, for any reason, you can return it within 45 days of the shipping date for a complete refund of the merchandise price.* Due to the complexity of international shipping, we are unable to accept any returns on international orders. Before making a purchase outside of the United States, please know that products sold by Sam Ash use the standard 120V/60Hz voltage standard. Sam Ash is not responsible for any damage caused by not adhering to the voltage requirements. *All returns must be within 45 days of the date the item was shipped. Please do not accept any shipment if the packaging appears damaged in any way. We strongly suggest that you check your order after receiving it to be sure that it is in proper working order. Returned items must be in resalable condition. Resalable Condition means that the product(s) is exactly in the same condition as you received it. All exchanges must be pre-paid, returned in original packing, complete with blank warranty cards, owner's manual and show no sign of wear or abuse. In the event that the product is not in the same condition as you received it you may be subject to a minimum 15% restocking fee, repair charge or disqualification. Shipping and handling charges are non-refundable. Please call our Customer Service department if you have any questions about returning an item. CDs, DVDs, video tapes, sheet music, books, strings, computer hardware/software, drum heads, harmonicas, mouthpieces, sound cards, microphones, raw speakers, studio furniture, blank CDs/Tapes or Special Orders are not covered by this return policy.", "ItemID": "183612008357", "EndTime": "2019-01-01T00:15:23.000Z", "StartTime": "2018-12-30T16:00:09.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Epiphone-Riviera-Custom-P93-Electric-Guitar-Used-/183612008357", "ListingType": "FixedPriceItem", "Location": "Tampa, FL", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1836120083578080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTg4WDUwMA==/z/GOIAAOSwEGBcKOuL/$_1.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "samashdirect", "FeedbackRatingStar": "PurpleShooting", "FeedbackScore": 58755, "PositiveFeedbackPercent": 99.2, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 428.77, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 428.77, "CurrencyID": "USD"}, "HighBidder": {"UserID": "e***9", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 889}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Epiphone Riviera Custom P93 Electric Guitar (Used)", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "MPN", "Value": ["ETR3WRGB3"]}]}, "HitCount": 16, "Subtitle": "Sam Ash - Serving Musicians Since 1924.", "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1111655870", "StoreName": "Sam_Ash_Music_Direct"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalRefund": "MoneyBack", "InternationalReturnsWithin": "30 Days", "InternationalReturnsAccepted": "ReturnsAccepted", "InternationalShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "DiscountPriceInfo": {"OriginalRetailPrice": {"Value": 999.0, "CurrencyID": "USD"}, "PricingTreatment": "STP", "SoldOneBay": false, "SoldOffeBay": false}, "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Central America and Caribbean", "South America", "BN", "KH", "HK", "LA", "MO", "MY", "PH", "SG", "TW", "VN", "BM", "GL", "PM", "DZ", "AO", "BJ", "BW", "BF", "BI", "CM", "CV", "CF", "TD", "KM", "CD", "CG", "CI", "DJ", "EG", "GQ", "ER", "ET", "GA", "GM", "GH", "GN", "GW", "KE", "LS", "LR", "LY", "MG", "MW", "ML", "MR", "MU", "YT", "MA", "MZ", "NA", "NE", "NG", "RE", "RW", "SH", "SN", "SC", "SL", "SO", "SZ", "TZ", "TG", "TN", "UG", "EH", "ZM", "ZW", "BH", "IQ", "JO", "KW", "LB", "OM", "QA", "SA", "TR", "AE", "YE", "AF", "AM", "AZ", "BD", "BT", "CN", "GE", "IN", "JP", "KZ", "KG", "MV", "MN", "NP", "PK", "LK", "TJ", "TM", "UZ", "AS", "CK", "FJ", "PF", "GU", "KI", "MH", "FM", "NR", "NC", "NU", "PW", "PG", "SB", "TO", "TV", "VU", "WF", "WS", "AL", "AD", "AT", "BY", "BE", "BA", "BG", "HR", "CY", "CZ", "DK", "EE", "FI", "FR", "DE", "GI", "GR", "GG", "HU", "IS", "IE", "IT", "JE", "LV", "LI", "LT", "LU", "MK", "MT", "MD", "MC", "ME", "NL", "NO", "PL", "PT", "RO", "SM", "RS", "SI", "ES", "SJ", "SE", "CH", "UA", "VA", "PO Box"], "GlobalShipping": false, "ConditionDescription": "Like New", "QuantitySoldByPickupInStore": 0, "SKU": "ETR3WRGB3", "NewBestOffer": false}