{"BestOfferEnabled": true, "Description": "NOTE: Before I get in to the description of the guitar, I would like to mention that this guitar is in close to Mint condition, which is hard to believe and beyond rare for a Gibson Les Paul Standard that is almost 30 years old. It is in collectors condition and shows barely any wear and play for an almost 30-year-old instrument, but please refer to the pictures and my track record. Whoever is lucky enough to purchase this will be beyond happy and satisfied as these do not come up for sale often and almost never in this condition. Good luck. If you are looking at this post, you already know what it is. It is the heavier (about 10.1lbs), non chambered and most highly regarded 1991 Gibson Les Paul Standard in the most beautiful and sought after cherry burst finish. What you don’t know is that this guitar is in excellent to mint condition and it shows almost no wear for an almost 30-year-old guitar. I am sure it is hard to believe that a guitar of this age can be in this great of condition and pretty much blemish free, but it really is and whoever is fortunate enough to purchase it can consider themselves beyond lucky. Furthermore, it has aged beyond beautifully and it looks and sounds more like a vintage custom shop Gibson Les Paul than a USA standard. It actually sounds identical to my 2007 ‘59 Reissue. The original frets have 100% life left and show pretty much no wear. They are polished and as smooth as can be. The very hard to find original hard shell case with pink furry lining is included and other than a couple blemishes on the front, it looks new. The guitar is 100% original and not modified in any way. Original pickups, original tuners down to the strap buttons and everything else as well. Everyone knows that the early 90’s were maybe the best years for Gibsons period, and that they don’t make them like this any more. There is NO buckle rash on this guitar. It was purchased in 1990/1991, set up, played for a month or so by the original owner I bought it from at the most, and then put away in its case til now; I’ll let the pictures do the talking. He is a collector, who had 30 Les Pauls at the time and this one never got its turn, which is why it was so well preserved. It was only cleaned periodically and then put back in the case. Honestly, it is almost impossible coming across a Gibson Les Paul Standard from this year in this amazing of condition. It has the 60’s slim neck like mentioned, that is not as slim as these newer slim taper necks, but it is definitely thinner than 50’s necks. It is heavier in weight, weighing in at a little over 10lbs. The tone and sustain is simply ridiculous as it’s an early 90’s non chambered model, but I’ll let you be the judge. Unplugged, the strings ring out loudly and endlessly and is well above average and this is the way I determine the quality of my Gibsons. If it sound good unplugged, it’s a keeper, and this one goes beyond that. Plugged in to my Marshall SL5 it is a match made in heaven and being a non chambered model, the tone and sustain is second to none. It has been set up, the frets are amazing and it is ready to rock. It is an almost 30-year-old guitar and it may have a blemish somewhere from cleaning and storing, but it does not photograph and it’s not noticeable. The top is absolutely amazing. Honestly, as stated before, here is that rare opportunity to purchase a vintage, excellent condition Gibson Les Paul Standard from the best year at a really, really good price compared to what other people are selling these for when they do appear and in much, much worse condition. Don’t let this one slip away as I know it will not last and I speak from experience. Due to the very attractive price, I know that I will be contacted a lot and with that said, I won’t be able to hold the guitar for anyone; it’ll be first come first serve. Furthermore, I reserve the right to end this sale at any time should my guitar sell locally or on other websites listed. I’ve described this guitar to the best of my ability. Please ask any questions you may have and I’ll try to answer in a timely manner. Flat rate shipping of $85 anywhere in the CONUS.", "ItemID": "273643475870", "EndTime": "2019-01-09T22:46:17.000Z", "StartTime": "2019-01-07T05:47:35.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1991-Gibson-Les-Paul-Standard-Cherry-Sunburst-Collectors-Condition-OHSC-60s-Neck-/273643475870", "ListingType": "FixedPriceItem", "Location": "San Diego, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2736434758708080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/cmcAAOSwLeFcMuec/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/fqIAAOSwlfNcMueq/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/2wgAAOSwyTtcMuen/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/zqIAAOSwVIZcMuea/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/nAQAAOSwSidcMued/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/QdoAAOSwtYZcMuee/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/g7kAAOSwnLtcMueg/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/QGIAAOSwxDJcMuei/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/JJEAAOSwNJJcMueh/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/QesAAOSwtYZcMuep/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/lxwAAOSwtvZcMuem/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/Jh4AAOSwysFcMuek/$_12.JPG?set_id=880000500F"], "PostalCode": "92122", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "us.vejzo", "FeedbackRatingStar": "Blue", "FeedbackScore": 65, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 2690.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2690.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "e***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 207}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "1991 Gibson Les Paul Standard Cherry Sunburst Collectors Condition OHSC 60s Neck", "ItemSpecifics": {"NameValueList": [{"Name": "Product Line", "Value": ["Gibson Les Paul"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model Year", "Value": ["1991"]}, {"Name": "Model", "Value": ["Les Paul Standard"]}]}, "HitCount": 85, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}