{"BestOfferEnabled": true, "Description": "Gretsch G6620TFM Players Edition Nashville Center-Block, Orange Stain, Bigsby Tailpiece (2017 Model) Barely Used; Excellent Condition. Semi-hollowbody Electric Guitar with Maple Body, Maple Neck, Ebony Fingerboard, 2 Humbucking Pickups, and Bigsby Vibrato.Tiger Flame Maple with Orange Stain(For Demos, see \"Spanish Moon by Tampa Bay Travelers at Sea Hags\" & \"Raunchy by Tampa Bay Travelers\" on YouTube.)Nashville Goes Center BlockFor classic Gretsch tone and style, you can't beat the Nashville —now enhanced with a chambered spruce center block. The Gretsch G6620TFM Players Edition Nashville Center Block semi-hollowbody guitar sports a comfortable,lightweight 16\" double-cut tiger flame maple body and a lower neck set for the ultimate in playing comfort. This elegant axe comes with luxurious touches like gold hardware, a classic Gretsch horseshoe headstock inlay, and a silky-smooth ebony fingerboard that will let your fingers fly. A duo of High-Sensitive Filter'Tron pickups serve up legendary Gretsch bark and bite, making the Gretsch G6620TFM Players Edition Nashville Center Block your go-to axe for studio and stage.Chambered spruce center block enhances your soundYou get a lot of tonal bang for your buck with the Gretsch G6620TFM, thanks to its long spruce center block. Running the full length of the body, this chambered center block allows the otherwise hollow body to resist resonant-frequency feedback. That means you can rock out louder with more gain, without your amplifier squealing out of control. Spruce is a snappy tonewood too, and since the center block connects with the bridge, the note definition, clarity and sustain on the G6620TFM are amazing.No-load pots won't color your soundGuitarists who avoid a buffered-bypass pedal or cables over 15 feet long will love Gretsch's new no-load tone pots. The pots' design allows them to be completely bypassed from your G6620TFM's circuit when run wide open.You'll notice a stronger signal with more high-end clarity. And these tone pots use Gretsch's Squeezebox paper-in-oil capacitors for a wider tonal landscape between settings 0 and 10 that's easy to fine-tune with a roll of the knob.Lower-set neck for a more comfortable feelNot all players are comfortable with the \"traditional\" hollowbody guitar feel, which is why Gretsch has set the neck lower on the G6620TFM for greater playing comfort. If some Gretsch semi-hollowbody guitars feel cumbersome to you, get your hands on the G6620TFM — it was made just for you.Gretsch G6620TFM (Tiger Flame Maple ) Players Edition Nashville, Center Block Features: Classic Gretsch Nashville styling, gold hardware 16\" double-cut tiger flame maple body Chambered spruce center block enhances your sound Two High-Sensitive Filter'Tron pickups Lower-set neck for greater playing comfort Studded Adjusto-Matic bridge for precise intonation Treble bleed circuit and no-load tone controls for greater sonic clarity and detail Premium electronics include \"Squeezebox\" paper-in-oil capacitors String-through Bigsby B7GP vibrato adds expressive textures Gotoh locking tuners Specification Detail Body Type Semi-hollowbody Body Shape Center Block Doublecut Left-/Right-handed Right-handed Number of Strings 6 Body Material Laminated Flamed Maple Top Material Laminated Flamed Maple Body Finish Gloss Polyurethane Color Orange Stain Neck Material Maple Neck Shape Standard U Radius 12\" Fingerboard Material Ebony Fingerboard Inlay Pearloid thumbnails Number of Frets 22, Medium Jumbo Scale Length 24.6\" Nut Width 1.6875\" Nut Material Tusq XL Bridge/Tailpiece Anchored adjusto-matic bridge with Bigsby B7GP string-thru vibrato tailpiece Tuners Gotoh locking Neck Pickup High-Sensitive Filter'Tron Humbucker Bridge Pickup High-Sensitive Filter'Tron Humbucker Controls 2 x independent volumes, 1 x master volume, 1 x master tone, 3-way toggle pickup switch Strings 11-54Case Included Hardshell case SHIPPING: WITHIN CONTIGUOUS 48 STATES ONLY. UPS GROUND: $75 (Insured). NO INTERNATIONAL SHIPPING. IMMEDIATE PAYMENT REQUIRED FOR \"BUY IT NOW.\"", "ItemID": "292877897927", "EndTime": "2019-01-08T02:35:45.000Z", "StartTime": "2018-12-18T19:08:51.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gretsch-G6620TFM-Nashville-Guitar-Center-Block-Double-Cutaway-Near-Mint-/292877897927", "ListingType": "FixedPriceItem", "Location": "Saint Petersburg, Florida", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2928778979278080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTI4MFg5NjA=/z/epMAAOSwrWdb2hog/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg2MTE=/z/J8sAAOSwG-xb9Cjq/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/qsEAAOSw4Vpb9CjU/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTI4MFg5NjA=/z/IRAAAOSwZBRb9Cjh/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTU2MVg5MDA=/z/y8wAAOSww7tb2hoX/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/BAAAAOSwTxhb2hop/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/JEYAAOSwwj5b2hou/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTI4MFg5NjA=/z/fxEAAOSwGYhb3F3G/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTUxM1gxMjAw/z/~I4AAOSw7fxb2hpf/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NzczWDEyMDA=/z/1qcAAOSw7rlb2hpi/$_32.JPG?set_id=880000500F"], "PostalCode": "33713", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "ufoetproject", "FeedbackRatingStar": "Purple", "FeedbackScore": 883, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1950.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1950.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "l***h", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 644}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "MX", "BM"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gretsch G6620TFM Nashville Guitar, Center-Block, Double-Cutaway, Near Mint", "ItemSpecifics": {"NameValueList": [{"Name": "Style 1", "Value": ["Orange Stain"]}, {"Name": "Brand", "Value": ["Gretsch Guitars"]}, {"Name": "Non-Domestic Product", "Value": ["Yes"]}, {"Name": "Model Year", "Value": ["2017"]}, {"Name": "Model", "Value": ["Nashville G6620"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Soundboard Style", "Value": ["Archtop"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Body Color", "Value": ["Orange"]}, {"Name": "Features", "Value": ["Cutaway"]}, {"Name": "Body Material", "Value": ["Maple"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Type", "Value": ["Semi-Hollow"]}, {"Name": "MPN", "Value": ["2401355822"]}, {"Name": "Size", "Value": ["Full Size"]}]}, "HitCount": 128, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "14 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": true, "ConditionDescription": "Barely Used; Excellent Condition.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}