{"BestOfferEnabled": false, "Description": "This is an awesome midi guitar that I have had for a long time. Took the strings off to clean it up. It plays great. . Also gotta fix the glitch in the midi power switch. Midi Guitar - means plug it into any synth, computer etc with midi jack and you can play the synth sounds on the guitar. Pretty cool. Also a great electric guitar. Very similar to a Fender strat. These are selling for $600 and up on Ebay (used, they don't make em anymore) I am going to sell it tonight only, as is for $279 Price goes up after I put strings on and fix up. Made in Japan by Ibanez by by Fuji Gen Gakki. The best place guitars have ever been made.The MG-500 and MG-510, and the PG-300, PG-310, and PG-380. These guitars were part of Casio's second generation of professional instruments (which also included the VZ-series synthesizers and the FZ-series samplers). The guitars themselves were produced under contract for Casio by Fuji Gen Gakki, who also built the Roland and Ibanez MIDI guitars. Most of them were based on the Fender Stratocaster design. Common Elements: Both the MG- and PG- systems convert pitch to MIDI, deriving the pitch information from a magnetic hex pickup next to the bridge. Both put out MIDI pitch, velocity and program change data over standard MIDI jacks--the only instruments made to date to accomplish these tasks completely within the guitar. (No add-on units or expensive special cables!) And, not surprisingly, both include built-in tuners. (Since pitch detection is the first step of a pitch to MIDI process, it'd be kinda stupid NOT to hang a couple LEDs on the output of the pitch detector, wouldn't it?) The tuners, however, work only for standard EADGBE tuning. Also common to both systems are controls located inside the instrument body, but quickly accessible by removing a pair of rubber plugs on the back of the guitar. Under one plug, there's a row of six tiny pots, for adjusting the sensitivity of the pitch/velocity detection system for each string individually. Microswitch Charts: -MG-500, MG-510 -PG-300, PG-310, PG-380 Under the other, there's a row of microswitches, AKA DIP switches-- nine in the MG guitars, ten for the PGs. These switches toggle MIDI Poly and Mono modes, select the MIDI channel(s) on which data is transmitted, set the MIDI pitch bend range, and determine the standard A4 pitch. A rugged metal structure recessed into the back of the guitar's lower right bout mounts the input/output ports--MIDI out, audio out (one on the MGs, two on the PGs) and 9-volt DC in. Both models allow use of battery power from six AA cells. MG-Series Electronics: The MG-series electronics also feature a MIDI volume control, which puts out MIDI Continuous Controller #7 data when rotated. A trio of three-way switches handle selection of guitar sound, MIDI sound, or both; octave selection (down one, normal or up one); chromatic or normal (bend- transmitting) configuration, and program change. This last is ingenious: Flip the program change switch up, pick a single string while fretting it anywhere in the lowest 16 frets, and a program change message is sent over the MIDI cable. The system allows selection of 96 different programs; it does not allow program changes while playing, as the switch must be returned to its center (chromatic) or normal (down) position in order for note and velocity information to be output via MIDI. MG-510: Apparently the most widely produced MG-series guitar, listing for about US$900. Body: Basswood; a close copy of the Strat, with slightly pointier horns. Pickups: Same as PG-380, bridge humbucker splittable by a toggle switch located between the guitar volume and tone controls. Bridge: very similar to standard Strat non-locking vibrato. Neck: Maple with rosewood 22-fret fingerboard; graphite low-friction nut. On Dec-14-18 at 09:29:33 PST, seller added the following information: The guitar now has new strings. Also fixed the glitch in the midi power switch. Switch to change the back pickup to single coil is missing, never actually used that switch anyway.On Dec-14-18 at 09:42:41 PST, seller added the following information: One of the tuning pegs is not the original, different color. Works fine.", "ItemID": "113432594309", "EndTime": "2018-12-15T05:50:27.000Z", "StartTime": "2018-12-08T05:50:27.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1987Casio-MG-510-MIDI-Electric-Guitar-Made-Ibanez-Fuji-Gen-Gakki-/113432594309", "ListingType": "Chinese", "Location": "Saint Petersburg, Florida", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1134325943098080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/Mzk0WDUyNg==/z/xowAAOSwujJcC1qw/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/NaYAAOSwvwRcE-sN/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/6bEAAOSwm-FcE-z7/$_32.JPG?set_id=880000500F"], "PostalCode": "33712", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "optahealth", "FeedbackRatingStar": "None", "FeedbackScore": 7, "PositiveFeedbackPercent": 100.0}, "BidCount": 2, "ConvertedCurrentPrice": {"Value": 201.5, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 201.5, "CurrencyID": "USD"}, "HighBidder": {"UserID": "r***u", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 100}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "1987Casio MG-510 MIDI Electric Guitar. Made By Ibanez In The Fuji Gen Gakki", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Casio"]}]}, "HitCount": 230, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 204.0, "CurrencyID": "USD"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}