{"BestOfferEnabled": true, "Description": "Up for sale...............Yamaha Revstar RS502 T electric guitar. This guitar has been on display in our electric guitar room, there is some slight tarnishing/discoloration on the tailpiece and top of the control knobs. This guitar plays great and sounds excellent, Yamaha got it right with this one. This guitar is also on display on our sales floor, we reserve the right to end this listing early if it sells in our store. Buy it nor or best offer, send us an offer! $30 shipping in the continental USA, International and elsewhere email or call for a shipping quote. More on the RS502T from Yamaha...........Stripped down, rev'd up and ready to rock. Japanese minimalist style is simple to describe but hard to capture. With just enough of everything you need, and nothing that you don’t, the RS502T is exactly what it should be–beautifully simple. Includes gig bag. PickupsDesigned from the ground up, Revstar features specially wound YGD pickups that are perfectly matched to each guitar. More than 50 prototype pickups were tested featuring different combinations of wire, windings, magnets and base plates. Eventually, a spec was settled on for each guitar model and the Revstar pickup series was born. This model features VP5 pickups (8.3k DCR) with Alnico V magnets, German silver baseplate and plain enamel wire for clear, vintage tone with bite. Dry SwitchDesigned especially for Revstar, Yamaha's proprietary Dry Switch gives you the versatility of a coil split, but with a tone that's miles ahead. Using a passive filter circuit painstakingly designed to give the perfect frequency response, the Dry Switch filters out low frequencies to give the punch and clarity of a single coil pickup minus the inevitable hum and hollow tone often associated with split humbucking pickups. And because it's a filter circuit, the Dry Switch works on both humbuckers and P90s for a totally unique, usable tone. Custom HardwareInspired by the stripped-down custom Café Racer motorbikes popularized on the streets of London in the 1960s, Revstar's hardware captures the high-performance, individual character of those bikes with a wide range of totally unique, customized hardware. From the unique pickup covers and raw copper scratchplate on the Revstar Professional, to the totally custom floating aluminum tailpiece on the RS502T, each and every component is perfectly calibrated for great performance and unmistakable style—capturing the very essence of a Café Racer. Sound ImageInspired by raw power and performance, Revstar's sound is as unique and bold as its aesthetic. Working to evoke a visceral, unbridled power and an individual, organic tone that is made possible only by considering every detail, Yamaha's engineers chose materials carefully and designed custom pickups to make sure Revstar sounds as stunning as it looks. Tech Specs Body Type SolidbodyBody Shape RevStarLeft-/Right-handed Right-handedNumber of Strings 6Body Material MahoganyTop Material MapleBody Finish High glossColor Bowden GreenNeck Material MahoganyNeck Shape MediumFingerboard Material RosewoodNumber of Frets 22, JumboScale Length 24.75\"Nut Width 1.692\"Nut Material ResinBridge/Tailpiece Tune-o-matic bridge with aluminum tailpieceNeck Pickup Alnico YGD P-90 single-coilBridge Pickup Alnico YGD P-90 single-coilControls 1 x volume, 1 x tone (push-pull dry switch EQ engage), 3-way pickup selectorCase Included Gig bagManufacturer Part Number RS502T BGR We are Muncie Music Center. A brick & mortar guitar store in the downtown area of Muncie, Indiana. We are an authorized Yamaha dealer. If you have any questions about this item or any thing else please give us a call at or just stop in at our brand new facility at 600 S Mulberry St., Muncie, IN 47305. Be sure to check out our Website (just Google Muncie Music Center) or our Facebook page. We'd love to get to know you. We're focused on providing great customer service. We're your friends out here. Our hours are:Monday - Friday 9am-6pm ESTSaturday 9am-3pm EST Payment must be made using Paypal or Credit Card over the phone. We offer safe and secure credit card transactions over the phone, we are a brick and mortar store in Muncie, Indiana in business for over 65 years! Ask around/check our feedback and you will find we have a great reputation! Indiana residents pay 7% sales tax. Even though we have a 14 day return policy, we need to hear from you with any problems within 2 days (48 hours) of receiving your item, so please inspect your item upon arrival. We are not responsible for any issues after the 48 hour inspection period! If there is any issue, immediately call us at Mon-Fri 10-6 Eastern time (ask for Tim). We will respond to phone calls much quicker than e-mails. We always do our best to describe items the best we can. Our main goal is customer satisfaction! Shipping cost is for lower 48 only. Alaska/Hawaii shipping is available but much more expensive. INSURANCE IS MANDATORY THROUGH UPS, WE HAVE ALREADY INCLUDED INSURANCE COST IN THE SHIPPING. International Buyers International buyers contact us before bidding. We reserve the right to cancel International bids. International buyers please e-mail me for shipping rates. Feel free to contact us for exact rates. International buyers are responsible for ALL customs, duty, taxes, and other fees that may be charged when importing American Made goods. No returns on Internationally shipped items. Please take this into consideration before bidding. We take pride in well packing our products to make sure they arrive at your door with no problems. For more information on any item please message us or feel free to call Thanks for looking and please check out our other listings!Even though Ebay has a new 30 return policy, we ask that you inspect your item within 48 hours with any concerns or problems.........We are not responsible for any issues after the 48 hour inspection period! If there is any issue, immediately call us Mon-Fri 10-6 Eastern time (ask for Tim). We will respond to phone calls much quicker than e-mails.", "ItemID": "303017984739", "EndTime": "2019-02-01T14:31:31.000Z", "StartTime": "2019-01-03T22:42:19.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Yamaha-Revstar-RS502T-electric-guitar-w-gigbag-/303017984739", "ListingType": "FixedPriceItem", "Location": "Muncie, Indiana", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/3030179847398080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NTczWDE2MDA=/z/MY4AAOSwsupb~ucQ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTI3WDE2MDA=/z/Pp0AAOSw19db~ucT/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODIzWDE2MDA=/z/71cAAOSwXAxb~ucV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODIyWDE2MDA=/z/0RgAAOSwkFZb~ucY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjUyWDE2MDA=/z/uoUAAOSwwTFb~uca/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTU3WDE2MDA=/z/LMIAAOSwM5tb~ucb/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTAyWDE2MDA=/z/uvIAAOSwk4Rb~ucd/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTcxWDE2MDA=/z/tTsAAOSwIsdb~ucg/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/Nzk4WDE2MDA=/z/U64AAOSwH1pb~uci/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTE4WDE2MDA=/z/tUkAAOSwIsdb~ucl/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MVgxNjAw/z/-k0AAOSw~xtb~ucn/$_57.JPG?set_id=8800005007"], "PostalCode": "47305", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "munciemusiccenter", "FeedbackRatingStar": "Red", "FeedbackScore": 1051, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 629.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 629.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "8***8", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 267}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Yamaha Revstar RS502T electric guitar w/gigbag", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Yamaha"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["RS502T"]}, {"Name": "MPN", "Value": ["RS502T BGR"]}, {"Name": "Body Color", "Value": ["Bowden Green"]}, {"Name": "Size", "Value": ["Full Size"]}, {"Name": "Model Year", "Value": ["2018"]}, {"Name": "Country/Region of Manufacture", "Value": ["Indonesia"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Material", "Value": ["Mahogany w/Maple top"]}, {"Name": "Product Line", "Value": ["Revstar"]}]}, "HitCount": 64, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=20879179", "StoreName": "munciemusiccenter"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "In-store demo, see description and pictures", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}