{"BestOfferEnabled": true, "Description": "CALL OR TEXT G-BRAT’S GUITARS ANYTIME; (972)816-7736 You are looking at a 2015 Knaggs Keya tier 2 flame top, with an Ocean Blue gloss finish, rosewood fretboard with morning star inlays and Seth Lover pickups. In case you’re not familiar with Joseph Knaggs, you may have seen his signature on the back of a PRS Private Stock. He was previously the director of of R & D and PRS’s Private Stock division, before he went off on his own, and now builds his own guitars. The guy is nothing short of a rock star when it comes to design and finishing out a guitar… and this one is exceptional. The action is smooth and easy and she sounds delicious! She’s 100% original and ready to rock! Here is the lowdown on the features:Model: Keya Tier 2Color: Ocean Blue, gloss finishTop: Carved flamed maple, tier 2 grade figuring with natural bindingBack: MahoganyNeck: Mahogany, set neckNeck Profile: Medium rounded, 1-21/32” to 2-7/32\"Fretboard: RosewoodFret Inlays: Morning starsFretboard Radius: 12\" Frets: Medium, 24 fretsNut: BoneHeadstock Overlay: Ebony, with morning star inlayHardware: GoldTruss Rod Cover: Ebony, KeyaPickups: Seymour Duncan Seth Lover bass & treble humbuckers Controls: 1 volume, 1 tone, 3-way toggleBridge: Influence, stoptailTuners: Kluson revolution, with green keystone knobsStrap Locks: Waverly, goldWeight: 6.4 lbs.Serial # 96 She was just born recently in 2015 and has only been played gently and sparingly in a smoke free home, She’s in excellent condition with only some mild wear on the pickup covers, and a very tiny light nick on the back of the neck. She’s otherwise flawless. The neck is straight, with no cracks or repairs… the frets are excellent, with their entire life ahead… and she sounds amazing! Also included is the original hard shell case, and even includes the case candy and strap locks, just as shown in the last picture! Whoever brings this baby home is gonna be STOKED!! LET'S GO!! WHILE YOU ARE HERE, GO AHEAD AND LOOK AT MY OTHER LISTINGS!! OUR CLIENTS ARE THE BEST IN THE WORLD!! Me- I have a 100% positive feedback rating, and intend to keep it that way! So please don't worry! You're in good hands here!! Shipping- We take pride in packing our guitars well, and shipping them quickly. Please note, if you are paying with Pay Pal, we will only ship to the address that is listed in Pay Pal. Here are the shipping rates, covering the planet earth:USA - $49 with UPSCanada, Hawaii, Alaska, Puerto Rico - $119Brazil, Argentina - $159Australia, New Zealand, Switzerland - $219 USPS Express or $249 UPSAll Other Worldwide Shipping - $219 - UPS Worldwide Expedited (in most cases); However, if UPS is more costly in certain countries, USPS will then be used instead. Payment Methods- Pal Pal is preferred!! We do also accept direct payment with Mastercard, Visa, American Express and even Discover! ~ TEXAS RESIDENTS ARE REQUIRED TO ADD 8.25% SALES TAX ~ Factory Warranty- We are an authorized dealer for: Knaggs, Ken Smith, Trussart, Warwick, Breedlove and Warrior, so for these instruments, if listed as NEW, there is a full factory warranty. For all other brands, or for instruments listed as USED, there is no warranty available. Return Policy- We do accept returns up to 14 days from the point of the initial sale, which means that the guitar must be back in our possession within this 14 day period. However, please be aware of the following conditions: If for any reason you wish to return the guitar, just call or email me directly, within 24 hours of your receiving the item, and let me know that you want to return it. Once we receive the guitar back, in the same condition, you will receive a refund, less a $50 restock fee. Also be aware that the initial shipping fee is not refundable under any circumstances. International Bidders- We, at G-Brat's Guitars, are HONORED to do business with anybody on the planet earth... So international buyers are VERY welcome here! That being said, please observe the following conditions: If you are paying with Pay Pal, please be completely registered with Pay Pal, prior to the purchase; this will help avoid shipment delays, and will assure that you will get your guitar as quickly as possible!International shipments usually require additional \"Customs Fees\" or \"Import Taxes\". These fees will vary, depending on the country, and are the responsibility of the buyer. If you want more information on what these fees entail, please contact your local customs office for this information. THANK YOU SO MUCH FOR LOOKING!!! _gsrx_vers_827 (GS 7.0.13 (827))", "ItemID": "362528381768", "EndTime": "2019-01-22T22:41:44.000Z", "StartTime": "2019-01-08T07:26:21.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2015-KNAGGS-KEYA-TIER-2-FLAME-TOP-w-SETH-LOVERS-GLOSS-FINISH-OCEAN-BLUE-/362528381768", "ListingType": "FixedPriceItem", "Location": "Midlothian, Texas", "PaymentMethods": ["PayPal", "VisaMC", "Discover", "AmEx"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/3625283817688080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/lycAAOSw3qRbvNg7/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/lqkAAOSwUQ5bvNg7/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/vAAAAOSwCgNbvNg8/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/nokAAOSwvdxbvNg8/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/CdsAAOSwhntbvNg-/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/yh4AAOSwAclbvNg-/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/4lwAAOSwfdNbvNg~/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/zuYAAOSwxOVbvNg~/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/upwAAOSwRQFbvNhA/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/KWcAAOSwXy1bvNhB/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/SpYAAOSwDQhbvNhC/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/gvIAAOSwaY9bvNhC/$_3.JPG"], "PostalCode": "76065", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "guitarbrat1", "FeedbackRatingStar": "Red", "FeedbackScore": 3672, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 2999.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2999.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "0***0", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 150}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "2015 KNAGGS KEYA TIER 2 FLAME TOP w SETH LOVERS & GLOSS FINISH ~ OCEAN BLUE", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Knaggs"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Model", "Value": ["Keya Tier 2 Flame Top"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Color", "Value": ["Ocean Blue"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Model Year", "Value": ["2015"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}]}, "HitCount": 81, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=43416548", "StoreName": "guitarbrat1"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "14 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Excellent condition", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}