{"BestOfferEnabled": false, "Description": "This is a guitar designed and used by the shred God himself, EVH. Very high qaulity for price range. Designed by a Fretboard Legend This EVH Wolfgang Special solidbody electric guitar is a well-designed, ferocious shred-machine that was built to Eddie Van Halen's exact specifications. This Wolfgang Special's basswood body generates insane tonal resonance and sustain, which will lend a fluid, glasslike quality to your legato phrases. This Wolfgang Special's maple top and dual custom-designed humbuckers add just enough edge to your sound to make your amp bark and bite. You'll be delighted by the hand-rubbed oil finish on this guitar's fast-playing neck as your hand slides effortlessly down its smooth maple fingerboard. So, check out this EVH Wolfgang Special solidbody electric guitar and give your Sweetwater Sales Engineer a call! EVH Wolfgang Special Solidbody Electric Guitar at a Glance: A complete and total shred machine Quartersawn neck for stability and playability Floyd Rose tremolo allows for twisting, bending, and huge dive-bombs A complete and total shred machine From its basswood body and arched, flame maple top to its maple neck and fingerboard, this EVH Wolfgang Special just screams quality - and that's just the tonewoods! This gorgeous guitar is made for serious playing, with a compound-radius fingerboard, an EVH Floyd Rose bridge and locking nut, and direct-mounted EVH humbuckers. The controls are top-notch, too: you get a handy 3-way pickup selector switch and low-friction volume and tone pots for total control over your tone and volume. All the components come together to make a guitar that looks absolutely stunning and plays even better. Quartersawn neck for stability and playability The neck is one of the most important aspects of any instrument, which is why this EVH Wolfgang Special features a quartersawn maple neck. Besides looking good, the straight grain of quartersawn necks is significantly more stable than plain-sawn necks and less likely to warp, twist, or shrink. You'll also love the playability and feel of the compound-radius fretboard on this Wolfgang Special. The fretboard radius goes from 12\" at the nut to a comfortable and flat 16\" radius on the upper frets. Floyd Rose tremolo allows for twisting, bending, and huge dive-bombs First gaining popularity in the 1980s, the Floyd Rose tremolo's locking design keeps your guitar in tune, even if you like to perform extreme pitch pyrotechnics. You can force the whammy bar all the way down to the guitar's body for psychotic dive-bombing. You can pull the whammy bar up to the stratosphere, raising your tone by as much as a seventh. No matter how hard you're shredding, you'll maintain your tuning stability, thanks to the Floyd Rose tremolo's locking design. On top of that, you can easily switch to drop D tuning, courtesy of the Wolfgang Special's D-Tuna tremolo device! EVH Wolfgang Special Solidbody Electric Guitar Features: Designed by rock legend Eddie Van Halen for ultimate shredability Basswood body, maple top, and dual EVH pickups deliver resonant tone with bite Compound-radius allows for exceptional speed and comfort EVH-branded Floyd Rose tremolo allows for twisting, bending, and dive-bombing D-Tuna tremolo device gives you instant drop-D tuning Belly cut allows the guitar to fit comfortably against your torso The EVH Wolfgang Special solidbody electric guitar puts the tonal tool of a legendary guitarist in your hands", "ItemID": "223301075318", "EndTime": "2018-12-30T04:27:41.000Z", "StartTime": "2018-12-27T22:48:43.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/EVH-Wolfgang-Special-Tobacco-Sunburst-Highly-Sought-Japan-model-No-Hardcase-/223301075318", "ListingType": "Chinese", "Location": "Georgetown, Texas", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2233010753188080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/WqUAAOSwS2lcJTO0/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/rQEAAOSwlLlcJTPM/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/ry4AAOSwL-xcJTPd/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/LcYAAOSw6n9cJTPu/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/FKQAAOSw6X1cJTP-/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTU5OFg5NzI=/z/kRMAAOSwzodcJTQY/$_12.JPG?set_id=880000500F"], "PostalCode": "78626", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "daniellgran_95", "FeedbackRatingStar": "None", "FeedbackScore": 3, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 725.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 725.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "j***v", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 31}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "EVH Wolfgang Special Tobacco Sunburst - Highly Sought Japan model/No Hardcase", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["EVH"]}, {"Name": "Model Year", "Value": ["2010"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}, {"Name": "Model", "Value": ["Wolfgang Japan"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Soundboard Style", "Value": ["Flat Top"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Body Color", "Value": ["Sunburst"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}]}, "HitCount": 106, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 735.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}