{"BestOfferEnabled": false, "Description": "Very rare Fender Stratocaster JR. Made in Mexico. 2004 Serial number MZ4045414 Short Scale, travel guitar 22.75\" scale, 35\" Overall length. This is not a Squier Mini Strat. It is much better quality. These were made for only a couple of years, in the early 2000's. It is in good shape, with following flaws noted. There is a finish crack in neck pocket. A finish chip on the end of lower horn, and some cracks on the edge. Minor dust, dirty, handprints from normal useage. This is the first Fender JR, I have ever seen. I thought it was a fake until I did some research. I am showing a product description I got from MF/GC website when this was a new product in early 2000's. ONLINE SPECS........In response to popular demand Fender has created a smaller version of the Standard Stratocaster, perfect for players with smaller hands, for travel, or just kickin' back on the couch and riffin'. The Junior Strat has an alder body, 22-3/4\"-scale C-shape neck, 3 single-coil pickups, rswd fretboard, and a hardtail bridge. 5-way switching with volume and tone controls. FEATURES Alder body Modern C-shape maple neck 22-3/4\" scale length Rswd fingerboard Fender hardtail bridge 3 Fender single-coil pickups 5-way switching Volume and tone controls Shipping quote is for USA 48 State Ground address, not PO BOXES. If you need a quote for shipment to Alaska, Hawaii, Guam, Puerto Rico, APO, US Territories, please contact us before bidding ABOUTSounds Cheap Music is a family owned & operated guitar shop located in the Kansas City Metro suburbs. SCM specializes in guitars, amps, effects & accessories. Come visit us in store or online! If that's not enough, just call us! We are available 9 AM to 5 PM, Monday through Friday, Central Time so you can talk to an actual human being! We're available 9am-5pm Central Time and would be happy to help you however we can. Thank you for checking out our shop. We'll talk to you soon! SHIPPING Sounds Cheap Music ships worldwide via UPS, FedEX, and USPS with tracking information available. With our centralized Missouri location and same business day shipments, most orders are received within 5 days of purchase! Alaska, Hawaii, and international shipments may incur additional charges.RETURNSIf for any reason you are not completely satisfied with your Sounds Cheap Music purchase, you may exchange or return the accepted item(s) within 30 days of purchase. The following items are non refundable: Instrument StringsCleaning and Instrument care product(s)Instrument upgrade or installment parts such as: pickups, tuners, and pre-wired kitsGift Cards. In rare cases, if an item shows additional wear or product packaging is missing or destroyed the refund may be subject to a minimum 10% restocking fee or possible disqualification for return. If you do not agree to these terms and conditions, please feel free to contact our store immediately by email or phone. We strive to offer our customers with 100% satisfaction.*Buyer assumes responsibility for all return shipping costs unless return is a result of incorrect shipment or shipping damage. REFUNDSRefunds are processed as quickly as possible at Sounds Cheap Music. If you do choose to return an item, We ask that you please keep transit, inspection and processing time in mind while you await your refund. We promise, we won't forget about you. If you have any questions regarding our return process, please contact a member of our sales team. INTERNATIONALSounds Cheap Music is proud to provide our customers with gear worldwide via USPS Priority & First Class Services. Most shipments enter customs within 7-10 days of shipment. Any and all shipping rates provided during checkout do not include VAT, import taxes, brokerage fees, and any other applicable charges which may vary around the world. Any and all fees accrued are the responsibility of the receiving party.*Some products are not available to be shipped internationally due to manufacturer regulations. These brands include, but are not limited to, Vox, Korg, Voodoo Lab, MXR, Dunlop, Way Huge, Music Man, & Tech 21. If you have questions regarding these regulations, please contact one of our sales representatives.", "ItemID": "143064661372", "EndTime": "2018-12-31T21:16:12.000Z", "StartTime": "2018-12-24T21:16:12.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fender-Stratocaster-Strat-JR-Short-Scale-2004-MIM-Electric-Guitar-5414-/143064661372", "ListingType": "Chinese", "Location": "Pleasant Hill, Missouri", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1430646613728080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NTQ5WDE2MDA=/z/i1oAAOSwTDpcIRbV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg1NDk=/z/WXsAAOSw19dcIRbY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDYz/z/Kj4AAOSwkelcIRbb/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDYz/z/utIAAOSwLktcIRbf/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTM1MVgxNjAw/z/sjcAAOSwxO9cIRbi/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDYz/z/23EAAOSwPuRcIRbk/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MFgxNjAw/z/MMkAAOSwenJcIRbn/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDYz/z/XxsAAOSwydZcIRbr/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDYz/z/z1gAAOSw2bFcIRbw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2M1gxNjAw/z/lJMAAOSwkvtcIRb0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2M1gxNjAw/z/KrsAAOSwCCRcIRb2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2M1gxNjAw/z/vwkAAOSwsRVcIRb5/$_57.JPG?set_id=8800005007"], "PostalCode": "64080", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "soundscheapmusic", "FeedbackRatingStar": "TurquoiseShooting", "FeedbackScore": 39744, "PositiveFeedbackPercent": 99.3, "TopRatedSeller": true}, "BidCount": 2, "ConvertedCurrentPrice": {"Value": 255.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 255.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "7***h", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1303}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "Fender Stratocaster Strat JR, Short Scale 2004 MIM Electric Guitar #5414", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "Model Year", "Value": ["2004"]}, {"Name": "Model", "Value": ["Stratocaster JR"]}, {"Name": "Soundboard Style", "Value": ["Flat Top"]}, {"Name": "Type", "Value": ["Electric Guitar"]}, {"Name": "Country/Region of Manufacture", "Value": ["Mexico"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Size", "Value": ["Full Size"]}]}, "HitCount": 346, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=91162", "StoreName": "Sounds Cheap Music"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 260.0, "CurrencyID": "USD"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["US Protectorates", "PR"], "GlobalShipping": false, "ConditionDescription": "Very rare Fender Stratocaster JR.  Made in Mexico.  2004  This is not a Squier Mini Strat.  It is much better quality.   These were made for only a couple of years, in the early 2000's.    It is in great shape.  There is a finish crack in neck pocket.   A finish chip on the end of lower horn, and some cracks on the edge.   Minor dust, dirty, handprints from normal useage.   This is the first Fender JR, I have ever seen.  I thought it was a fake until I did some research.  I am showing a product description I got from MF/GC website when this was a new product in early 2000's.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}