{"BestOfferEnabled": false, "Description": "Up for sale, a 2010 Gibson Les Paul Studio '50s Tribute model in excellent condition and in perfect working order. This model combines the slimmer neck profile of a 1960s Gibson with the cosmetic appointments and P-90 pickups found on the Les Paul model from 1952-57! This guitar features an Goldtop satin finish and comes complete with a padded tweed gigbag.Gibson describes the genesis of this model as such:\"In honor of the final incarnation of the original Les Paul, Gibson USA is proud to present the acclaimed Les Paul Studio in an exciting new package. The new Les Paul Studio ’50s Tribute model embodies the look and tone of the great original Les Pauls from the 1950s, at a price that fits the wallets of today’s hardworking musicians. Ever since its introduction in 1983, the Les Paul Studio model has been enormously popular with players seeking the power and versatility of the original Les Paul Standard in a ready-for-action package, with a price to match. The Les Paul Studio '50s Tribute sticks to the script entirely, and its meaty dual single-coil P-90 pickups give it a look akin to classics from the decade of the Les Paul's birth. Meanwhile, its fast SlimTaper neck profile reflects the feel of Les Paul Standards from 1960, the year before this legendary solidbody was deleted (temporarily!) from the Gibson lineup.\"This Les Paul '50s Tribute delivers plenty of growl and bark through the two P-90 pickups. Through your favorite tube amp, the pickups can chime with great fullness and clarity, and it's easy to push an amp into full tube saturation, with a cutting overdriven tone that has rich harmonic content and sustain. Weighing 7lbs 6oz, this Les Paul is a particularly light example and has a sweet, pleasing acoustic tone. Professionally setup here at Mike & Mike's Guitar Bar, we've dialed in this Les Paul with low action, spot-on intonation, and fresh 10-46 strings.The neck is the previously noted slimmer 60s profile, yet the 1 11/16\" nut width and thick slab fretboard give you plenty to grab on to, and the neck still feels solid and substantial. The frets retain their full factory height, with well rounded crowns and only light wear beneath the plain strings on frets 1-3. The headstock has Gibson Deluxe machines with lightly greened tulip buttons, and these tuners turn very smoothly and hold pitch as they should.All of the electronics work well and the hardware shows no visible wear, with spotless chrome, clean cream pickup covers, pickguard, switch surround and tip, and minty gold reflector cap knobs. Cosmetically, this guitar show sparingly little wear, with a few light finish scratches and minor nicks on the back and body edges, but overall it's a very nice example.A padded tweed gigbag is included. Check out our shop \"Mike & Mike's Guitar Bar,\" and please let us know if we can answer any questions!Shipping in the continental USA will be $65, fully insured and shipped via FedEx Ground. Expedited shipping available for an additional fee at buyer's request. We will happily ship WORLDWIDE, but please contact us for an accurate international shipping quote before bidding or buying, as cost varies by buyer location. International orders will be declared as “merchandise,” and the value of merchandise will be declared as the amount paid. We cannot declare anything as a gift or for a lesser value. No exceptions! The customer is responsible for all taxes and duty, which may be collected upon delivery, as well as any additional charges involved with import. We have all necessary CITES paperwork in-hand to ship rosewood worldwide.We do our best to describe all items with honesty and accuracy, but to be sure, please contact us with any questions or concerns prior to bidding or buying. We require payment within 48 hours of auction end. In the unlikely event of a return, buyer pays all shipping costs. Your positive feedback and five star ratings are very important to us, and we appreciate your communication in resolving any issues!", "ItemID": "153319288837", "EndTime": "2018-12-29T20:56:09.000Z", "StartTime": "2018-12-27T19:32:41.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2010-Gibson-Les-Paul-Studio-50s-Tribute-Goldtop-Electric-Guitar-w-Gigbag-/153319288837", "ListingType": "FixedPriceItem", "Location": "Seattle, Washington", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1533192888378080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/PycAAOSwhfRcJSY1/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/Su0AAOSwoDFcJSZH/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/nAAAAOSw9z1cJSZE/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/Ei0AAOSwukZcJSZC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/UkIAAOSwQqNcJSZN/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/TCAAAOSwEKxcJSY4/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/XN4AAOSwC45cJSY~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/LFUAAOSwVRBcJSZL/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/hpcAAOSwyRdcJSZJ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/wfYAAOSwa3lcJSY6/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/x7AAAOSwVNNcJSY9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Vx0AAOSwxDJcJSZR/$_57.JPG?set_id=8800005007"], "PostalCode": "98117", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mmguitarbar", "FeedbackRatingStar": "Red", "FeedbackScore": 2591, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 774.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 774.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "i***l", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 54}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "2010 Gibson Les Paul Studio 50s Tribute Goldtop Electric Guitar w/ Gigbag", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model", "Value": ["Les Paul Studio 50s Tribute"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Material", "Value": ["Mahogany, Maple"]}, {"Name": "Model Year", "Value": ["2010"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Body Color", "Value": ["Goldtop"]}]}, "HitCount": 203, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=269063702", "StoreName": "Mike and Mikes Guitar Bar"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}