{"BestOfferEnabled": false, "Description": "Up for sale, a 2011 Gibson Custom Shop Firebird VII Non-Reverse in exceptional condition and in perfect working order with an Inverness Green nitro lacquer finish. This custom color model has been discontinued, is a faithful reissue of the Firebird's 1965 specifications, and is a particularly rare custom color example, complete with the original COA and hardshell case. Boasting a non-reverse body with Grover Rotomatic tuners on the headstock and a long frame Maestro Lyre Vibrola, this guitar has great tuning stability and the added functionality of a vibrato unit that works well for expressive shakes and warbles. Powerful, chimey, and wound particularly hot, the pickups have a distinct tonal character that sets them apart from a traditional mini humbucker. Whether you're looking for detailed cleans or saturated overdriven tones, the mahogany construction of this Firebird and the top notch pickups help you achieve tones applicable to a wide range of genres. Weighing in at a mere 8lbs 5oz, the guitar is fairly easy on the back too. Professionally setup here at Mike & Mike's Guitar Bar, we've dialed in this Firebird with 10-46 strings and low action.The mahogany neck features a chunky and full C shaped profile with lots of shoulder, worthy of the “baseball bat” moniker and consistent in depth as you travel up the fretboard. On the rosewood fretboard, the original frets have plenty of meat and height, showing zero wear and playing cleanly in all registers with no buzzing or dead spots. The guitar conforms to vintage Gibson spec with a 1 11/16\" nut width and 24 3/4\" scale. On the headstock, the mini Grover tuners turn smoothly, and the black truss rod cover with \"Gibson\" silkscreened logo tops things off.All of the electronics work as they should and the Lyre Vibrola is both undeniably cool visually and a unit that cements the top-tier reissue look while being quite usable (not every vibrato can make this claim). The nickel hardware shows a tiny bit of patina on the vibrato claw, and otherwise the metal parts are particularly clean. Cosmetic wear is extremely minimal, with a bit of finish yellowing from a guitar wall hanger at the nut but not into the nitro lacquer, and light discoloration from a strap near the rear strap button. Barring a stray light finish scuff or tiny nick, this is an impressively clean and very rare Firebird reissue in one of Gibson's most popular custom colors!The original black tolex Gibson hardshell case with plush red interior is included, along with the original COA. Check out our shop \"Mike & Mike's Guitar Bar,\" and please let us know if we can answer any questions!Shipping in the continental USA will be $80, fully insured and shipped via FedEx Ground. Expedited shipping available for an additional fee at buyer's request. We will happily ship WORLDWIDE, but please contact us for an accurate international shipping quote before bidding or buying, as cost varies by buyer location. International orders will be declared as “merchandise,” and the value of merchandise will be declared as the amount paid. We cannot declare anything as a gift or for a lesser value. No exceptions! The customer is responsible for all taxes and duty, which may be collected upon delivery, as well as any additional charges involved with import. We have all necessary CITES paperwork in-hand to ship rosewood worldwide.We do our best to describe all items with honesty and accuracy, but to be sure, please contact us with any questions or concerns prior to bidding or buying. We require payment within 48 hours of auction end. In the unlikely event of a return, buyer pays all shipping costs. Your positive feedback and five star ratings are very important to us, and we appreciate your communication in resolving any issues!", "ItemID": "163483345614", "EndTime": "2019-02-22T03:19:08.000Z", "StartTime": "2019-01-12T10:58:29.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2011-Gibson-Custom-Shop-Firebird-VII-Non-Reverse-Inverness-Green-w-COA-Case-/163483345614", "ListingType": "FixedPriceItem", "Location": "Seattle, Washington", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1634833456148080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/nnYAAOSwusdcOcU~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/l58AAOSwq2xcOcVT/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/MsQAAOSw29JcOcVR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/ICYAAOSwsrlcOcVZ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/zQwAAOSwckVcOcVE/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/FYsAAOSwESRcOcVJ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/JikAAOSwjMtcOcVW/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/osMAAOSw0wJcOcVB/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/hJYAAOSwzEVcOcVG/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/mXAAAOSw~wVcOcVM/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/3b4AAOSwu3ZcOcVO/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NVgxNjAw/z/V84AAOSw0~pcOcVb/$_57.JPG?set_id=8800005007"], "PostalCode": "98117", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mmguitarbar", "FeedbackRatingStar": "Red", "FeedbackScore": 2613, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 3799.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 3799.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "z***x", "FeedbackPrivate": false, "FeedbackRatingStar": "Green", "FeedbackScore": 5723}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "2011 Gibson Custom Shop Firebird VII Non-Reverse Inverness Green w/ COA & Case", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Inverness Green"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Material", "Value": ["Mahogany"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model", "Value": ["Firebird VII Non-Reverse"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["2011"]}]}, "HitCount": 310, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=269063702", "StoreName": "Mike and Mikes Guitar Bar"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}