{"BestOfferEnabled": true, "Description": "A beautiful Collectors Choice #30 \"Gabby\" Gibson Les Paul 1959 Reissue In MINT condition. For a more detailed description of the specs on the CC #30 reissue please visit the Gibson website but here is a basic rundown:Weight: 8.21 lbsNeck/Fingerboard: Mahogany neck with a '59 profile taken matched to the original, with one-piece rosewood fingerboard with trapezoid cellulose inlays. Electronics: Custom Buckers with Alnico III magnets to re-create the original PAFs. Individual volume and tone controls with \"bumble bee\" capacitors and a three-way switch. Period correct Tune-o-Matic bridge, lightweight aluminum tailpiece, and reissue Kluson™ tuners, all in aged nickel. Original Hardshell casewith Certificate of Authenticity.*Regular online store hours are 10:00 – 19:00 PST Monday – Friday. We will respond as soon as possible during regular hours. After hours we will do our best to respond quickly, but may be unable to answer specific questions that require having the item in hand. Trades:We are only able to process trades on items brought in person to our store. We are unable to accommodate trades over the internet/long distance. We are happy to assess any trades you can physically bring to our shop! WHO WE ARE:Guitar Showcase, located in the heart of Silicon Valley in San Jose, CA has been serving musicians since 1965 offering the widest selection of new musical instruments as well as the most sought after vintage instruments on the planet. Our staff of seasoned musicians is ready to help you find the best instrument for you, whether you are a beginner looking for your first instrument, or a vintage collector looking for the crown jewel of your collection. Guitar Showcase is an authorized dealer for many of today’s biggest brands including Fender, Gibson, Paul Reed Smith, Mesa/Boogie, Ibanez, Marshall, Taylor, Martin, and many more… visit us at or contact us to ask about our massive selection of new, used and vintage instruments, and when in Silicon Valley, please stop by for a visit and see the Vintage Vault with hundreds of iconic Vintage and Collector Instruments as well as hundreds of other instruments. PAYMENT TERMS:Guitar Showcase accepts PayPal or Reverb Direct payment for most listings. The exceptions are some products sold outside the United States, and some Vintage or Consignment Instruments, please call or email for details. SALES TAX:Guitar Showcase collects sales tax on all orders shipped to California at the San Jose. CA rates. SHIPPING TERMS:Orders are shipped 1-3 business days after payment is received and verified. All items are professionally packaged and fully insured. Signature confirmation is required. If you need special arrangements, please call or email us before buying. RETURNS - NEW GEAR:Defective items can be taken to the nearest Factory Authorized Service Center. For items damaged in shipping, please email us for help in processing a claim. If you just changed your mind or are unhappy with your purchase of a new item, please contact us directly before proceeding. Most new items may be returned within 14 days of receipt (see exceptions below). The buyer is responsible for shipping cost both out and back, any Credit Card Fees, and a standard 15% restocking fee. (If you received Free Shipping on your order, the value of the uncharged shipping cost will be deducted from your refund.) Items must be returned complete with all original packaging/manuals/warranties/accessories/etc., in brand-new condition, and showing no signs of wear or use; if any of these conditions is lacking, the return may be subject to a further handling or re-stocking fee at Guitar Showcase’s discretion. Refunds will be processed only after evaluation of the returned item. (Exceptions: copyrighted works such as books/cds/dvds/software are non-returnable; due to health regulations, mouth-blown instruments, headphones,earbuds or in-ear monitors, or any other product that has bodily contact - including microphones - are also non-returnable. Also see Used/Vintage Gear below.) USED/VINTAGE GEAR:Used and Vintage gear is, by definition, old and fragile. This gear is subject to age and handling wear. Scuffs and scrapes, dents and dings, repairs, modifications and replacements all are to be expected. So, while Guitar Showcase strives to accurately document and describe each piece we list, we can only accept responsibility for what we detail in the listing and what is visible in the photos. Guitar Showcase is eager to verify any additional details necessary to address any concerns you may have: just make sure to contact us with any questions you may have before bidding or buying. Beyond this, Guitar Showcase can offer no guarantee and can accept no returns on Used or Vintage gear. Please be sure you know what you are buying, and please do not think that older, used and Vintage Instruments should be set up in perfect playing condition.For high priced Vintage instruments, we highly recommend that you either have a local friend try the Instrument or come in and try it in person. CONSIGNED GEAR:Some of the gear in the Guitar Showcase eBay store is listed on behalf of a consignor. These pieces are not the property of Guitar Showcase and as such we can accept no returns on any consigned equipment. Consigned gear is also subject to the same stipulations as Used and Vintage gear, as described above. Please make sure to contact us with any questions you may have before bidding on or buying any consignment item. INTERNATIONAL SALES:Some listed items that contain Rosewood and other protected species may be ineligible for international sale; please make sure to read listing details carefully. For eligible sales, Guitar Showcase is happy to offer international shipping through USPS to select countries, with calculated shipping cost based on location. Please contact us PRIOR to purchase for an exact shipping quote to your country. Due to additional expense and complication, we are unable to accept returns on any international sales and all payments must be pre-arranged, please contact us for details. CAUTION, SEE BELOW! Beginning Jan.2, 2017, CITES documention is required for import and re-export of many newly listed wood species (including all Rosewoods, not just Brazilian) and items made from them (like Guitars and their parts). These new rules will not allow the import or export of most Vintage Guitars and many newer Guitars and other instruments. We are not able to furnish the required permits at this time, and in the foreseeable future. You may be able to carry a personally owned Instrument across your border, but we cannot guarantee this, nor be responsible for the consequences and you are advised to check with your Country’s authorities before attempting to do so. The Instruments may be confiscated by Customs or Border Authorities! For more information, see: California Proposition 65 WARNINGS: California's Proposition 65 requires special warnings for products that contain chemicals known to the State of California to cause cancer and birth defects or other reproductive harm if those products expose consumers to such chemicals above certain threshold levels. We cannot reliably determine which products may contain such chemicals, so we are warning you that all the products we sell, INCLUDING, BUT NOT LIMITED TO: New Electrical cords and cables, and especially used and vintage products, such as Guitars, Basses, Horns, Amplifiers, PA gear, Mixers, Patch Bays, Effects Pedals, Speakers, Keyboards, Processors, Interfaces, Microphones, Headphones, Cables, parts and accessories which were typically made using LEAD SOLDER, may contain chemicals known to the State of California to cause cancer and birth defects or other reproductive harm, wash hands after handling. For More information, please visit California’s Proposition 65 Warnings websites.", "ItemID": "153331959108", "EndTime": "2019-01-07T19:41:31.000Z", "StartTime": "2019-01-07T19:28:44.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-Collectors-Choice-CC-30-Gabby-Appraisal-Burst-1959-LP-Reissue-/153331959108", "ListingType": "FixedPriceItem", "Location": "San Jose, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1533319591088080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTU5OVgxNTk3/z/6ToAAOSwgTJbKvS7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjA5/z/iZsAAOSwrzhbKvST/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMzAy/z/0TwAAOSwkSxbKvS0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjE5/z/~y4AAOSwCXJbKvSx/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMTI3/z/JrcAAOSwwAdbKvSl/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMTM2/z/gcYAAOSwlzZbKvSr/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjYx/z/0TQAAOSwkSxbKvSu/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/W0sAAOSwlCdbKvSp/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/y~MAAOSwJo5bKvUn/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/0RQAAOSwkSxbKvSf/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMzg1/z/aMkAAOSwlo9bKvSj/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/i2UAAOSw48dbKvUk/$_57.JPG?set_id=8800005007"], "PostalCode": "95124", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "guitarshowcase", "FeedbackRatingStar": "Purple", "FeedbackScore": 912, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 7500.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 7500.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "m***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 161}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson Collector's Choice CC #30 \"Gabby/Appraisal Burst\" 1959 LP Reissue", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["SUNBURST"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["CC 30A"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Body Type", "Value": ["Solid"]}]}, "HitCount": 4, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=50223671", "StoreName": "Guitar Showcase"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}