{"BestOfferEnabled": true, "Description": "I have a collection of JET guitars because JET guitars are the best of the best. You like PRS guitars? Gibson? Alembic? Well JET blows them all away. I'm selling my precious guitars because I need to get my affairs in order and my family needs the money after I'm gone. You can play any kind of music with a JET guitar. See below for more specs. Serious inquiries only please.JET guitars are hand built in a one man shop by Jeffrey Earle Terwilliger. At a capacity of about 50 guitars per year, each guitar takes about 3 months start to finish.Conical (compound radius) fingerboard profile. The fingerboard radius starts at 8.5” at the nut and contours to a flatter 12” radius at the other end. The benefit to this design feature is that it gives you very low action without fretting out when bending notes on the higher end of the neckJumbo frets help your fingers speed across the fretboard.Natural maple binding all around.Hand inlaid pearl logo and headstock trim.Top-shelf components by Schaller, Seymour Duncan, Grover and TonePros.Through the body stringing for maximum tone transfer and sustain.The headstock overlay is not merely the same color as the body top wood; they go for broke and cut it from the very same billet of wood.Scale Length is 25.0″ which many people believe is the ideal scale length for a guitar as it is right between the Fender (which is longer and tends to have too much string tension) and the Gibson (which is shorter and some players feel is too “slack” of a string tension).The back side of the headstock is hand-signed by Jeffrey on every guitar. He also hand numbers every guitar.A gentle volute is used to ensure strength in the neck joint/headstock area without interfering with left hand technique. There are no joints in a JET neck other than longitudinal laminations.Grover Locking tuners are used.Wood control and tremolo cavity covers are recessed and finished to match the body on JET guitars.The back body contour is placed in just the right spot forThree pieces of hard maple are hand selected for flawlessness and grain orientation, then laminated and shaped by hand. Maple as neck wood gives the strongest, purest attack and the most strength.The brass string anchor on the back side is recessed flush with the body. This gives a more even response and attack to the strings than individual ferrules, and also provides proper string grounding.The bridge is Tone Pro’s Tune-o-Matic style. It is accurately placed for a full intonation adjustment range across all strings.The strings anchor through the body, giving a fuller tone. They then pass over a wood tailpiece at a low ramp angle, not as steep as it is with a stop tailpiece. This contributes to a 'slinkier' feel.The Seymour Duncan pickups, custom built for JET Guitars, are direct mounted, and the holes in the body are trimmed with exotic wood. Direct mounted pickups give the guitar a deeper, more complex tonal character because they are not suspended from the body by bezels and springs. They also have better microphinic coupling.The Earlewood neck joint sports a heel that is about as small as it can get, and still be there. It is hand carved to a gentle slope on the Caldera model. The precision milled joint extends more than three inches into the body. The knobs are threaded brass, not pressed-on plastic. These Innovations Are Found ONLY On JET Guitars:The top wood is joined to a chambered body with a peaked shape. This gives JET guitars their characteristic rich, complex resonance. They weigh less than thick carved tops, too.The 24th fret is a crowned and polished brass plate attached to the end of the fingerboard. This way you get 24 frets, without knocking the neck pickup out of its sweet spot. Why should you be forced to choose one or the other?Direct mounted pickups are trimmed with exotic hardwood. No ugly holes showing,The output jackplate is recessed into an angled bevel, and points upward.", "ItemID": "123507690262", "EndTime": "2018-11-30T22:03:32.000Z", "StartTime": "2018-11-23T22:03:32.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/JET-Earlewood-2009-Caribbean-Burst-Emerald-Hand-Made-Electric-Guitar-/123507690262", "ListingType": "Chinese", "Location": "Miami, Florida", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1235076902628080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/jjsAAOSwWSlb0440/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/GtUAAOSweIlb044z/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/d64AAOSwfoJb044z/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/vHgAAOSwYCRb044v/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/RigAAOSwElxb044w/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/TrQAAOSwd2Zb044y/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/2BIAAOSwv-xb044z/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/cdEAAOSwMO9b0441/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/x3wAAOSwNVxb044w/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/C6YAAOSwfB9b0440/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/N~AAAOSwzSdb0440/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/NpUAAOSwMi9b0441/$_32.JPG?set_id=880000500F"], "PostalCode": "33134", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "tonyt66", "FeedbackRatingStar": "Red", "FeedbackScore": 1600, "PositiveFeedbackPercent": 97.1}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 3000.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 3000.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "h***0", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 61}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "JET Earlewood 2009 Caribbean Burst Emerald Hand Made Electric Guitar", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["JET"]}, {"Name": "Model Year", "Value": ["2009"]}, {"Name": "Model", "Value": ["2000's Earlewood"]}, {"Name": "MPN", "Value": ["2000's Earlewood"]}]}, "HitCount": 46, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 3050.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}