{"BestOfferEnabled": false, "Description": "MIJ, made in japan, Gibson, Lespaul, White, SG, Höfner, Duesenberg, Ibanez, ATELIER Z, ARIA, ESP, Caparison, Killer, COMBAT GUITARS, GUYATONE, Greco, Sugi Guitars, TEISCO, DEVISERA, Nil, Bacchus, VANZANDT, Fernandes, Fender Japan, Fujigen, MOON GUITARS, momose, Yairi Guitar, YAMAHA, TOKAI, Zemaitis, VOX, B, C, Rich, Epiphone, Gibson, Gretsch, Suhr, Schecter, Charvel, Jackson, Dean, Tom Anderson, Fender, Paul Reed Smith, Melancon, Mosrite, Rickenbacker, Robert Benedetto, Washburn, Ibanez, kramer, EDWARDS, Burny, Grassroots, 1985 Greco SS63-55 Deep joint The Mint Collection Very Good+++ condition.Made in Japan Down from here, Photo is dent and scratches etc.. About scratches that are hard to see. To make it easy to understand the condition of the scratches, I lighted the light strongly. 1985 Greco SS63-55 Deep joint The Mint Collection Very Good+++ condition.Made in Japan Body Mahogany. Neck Mahogany. Deep joint. Frets 22F. Scale 24.75inch (628mm) Gibson Scale. Nut Width About 1.69 inch (43mm). Pickup Nisshin onpa. Control 2 Volume, 2 Tone, 3-Way PU Toggle switch. Bridge Tune O Machic. Stop Tailpiece. Weight About 6.83 Pound ( 3.1 Kg ). This is Used Guitar. The Truss rod cover has been changed. The Pickups has been changed to Nisshin-Onpa. I think the pickup cover has been changed to new ones. I was shooting a lot of photos. Please confirm with a photograph. It was manufactured by Fujigen factory in 1985. It's the Mint Collection, most popular series from Greco. It was made about 33 years ago. The Mint Collection, I feel Greco's policy very much. Accuracy of the product is high, It is deep joint. From the body, the vibration of the sound is transmitted well. Distinctive luster, I predict Lacquer paint. And, clear coating is very thin. About the condition of this guitar, I did not give \" excellent condition \" . Because, the truss rod was very hard in the clockwise direction. Therefore I gave \" Very good+++ condition \" . My first impression is that all is very beautiful. The Metal parts and the Machine heads keep an excellent state. These have shine. I can not think that it is a guitar of 33 years ago. Old japanese guitar used high quality wood. The wood grain of mahogany is very beautiful. There are scratches on the pick guard. Although it is an old guitar, I think that the scratch is little on the body. If you got this guitar, you will understand that the former owner cherished this guitar. \" The High quality guitars at a Low price \". It is brand concept of Greco at the time. And current... It has became high price. 1980, Gibson filed a lawsuit. The cause is copyright issues. And more than anything, Greco's ( Fujigen's ) high degree of perfection. Perhaps Gibson had a feeling of crisis. I think this Greco is very good. Make of Greco (Fujigen) is very polite. Accuracy of the product is high, It is deep joint. It is cleanliness. I polished with guitar exclusive polish, so it is in a very clean state. I after the finger board cleaning, painted beeswax. The aim is moisturizing and and protection. Current neck condition, very good ! roughly straight ! The truss rod was very hard in the clockwise direction. It may be close to the limit. Remaining the frets are 85% on average. You can play immediately after it is delivered to you. All is working well. It is in a very good condition. GIG BAG Included. Look at the photos, please verify by yourself! It will be professionally pack. Double air packing. And ships inside a sturdy cardboard box. This electric guitar is USED. Please consider it when bidding. Thank you. Payment I accept PayPal only. Please pay within 3 days after the auction closed. Shipping Worldwide shipping from Japan! EMS / Shipping includes a tracking number. / / / Destination cost Delivery time / / / Asia : $1004 ~ 7daysUS Canada : $1205 ~ 8 daysEurope : $1406 ~ 10 daysOceania : $1205 ~ 8 daysSouth America : $2408 ~ 12 days This item is shipped within 3 business days after payment is confirmed. Terms of Sale International buyers - Please Note: Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer's responsibility. Please check with your country's customs office to determine what these additional costs will be prior to bidding/buying. These charges are normally collected by the delivering freight (shipping) company or when you pick the item up -do not confuse them for additional shipping charges. Please contact us first with 30 working days for any returns, Buyer pays shipping cost from buyer's country to Japan when being returned. In case of return, the shipping cost won't be refunded. We sell various kinds of Electric guitars to international customers. Our goal is to provide the best quality products and service and your satisfaction is the most important to us. Happy bidding!! Thank you !!", "ItemID": "253961263454", "EndTime": "2018-11-09T04:00:12.000Z", "StartTime": "2018-11-02T04:00:12.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1985-Greco-SS63-55-Deep-joint-Mint-Collection-Made-Japan-/253961263454", "ListingType": "Chinese", "Location": "Nagoya-shi,Kita-ku, Aichi", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2539612634548080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/ybkAAOSwrAFb2pqz/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/BJwAAOSwBRdb2prE/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/CD8AAOSwHrlb2prQ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTM4NVgxNjAw/z/zuIAAOSwQTRb2prd/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNTk5/z/rVgAAOSwPrdb2pri/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/vZEAAOSwyodb2psl/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg2NTE=/z/I~oAAOSwy-5b2prq/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/maAAAOSwxLdb2pr3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/YrMAAOSw5Ylb2pr9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/-Q8AAOSwcrZb2psC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTMwNVgxNjAw/z/Z9EAAOSwiE1b2psH/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/iAEAAOSwoZJb2psP/$_57.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jguitar-shop", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 369, "PositiveFeedbackPercent": 100.0}, "BidCount": 2, "ConvertedCurrentPrice": {"Value": 303.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 303.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***a", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 362}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Americas", "Europe", "Asia", "AU"], "Site": "US", "TimeLeft": "PT0S", "Title": "1985 Greco SS63-55. Deep joint. The Mint Collection. Made in Japan.", "ItemSpecifics": {"NameValueList": [{"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Brand", "Value": ["Greco"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Model", "Value": ["SS63-55"]}, {"Name": "Model Year", "Value": ["1985"]}]}, "HitCount": 478, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "JP", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 308.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["APO/FPO", "Africa"], "GlobalShipping": false, "ConditionDescription": "Very Good+++ Condition. This is Used Electric Guitar. The electric guitar when connect to the amplifier, sound output is normal. There are scratches and Dents. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. Please Read the descriptions for details.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}