{"BestOfferEnabled": true, "Description": "Gibson (used, 1957) ES-225TD Cutaway Thinline Hollow Body The history of this guitar is as follows: I am listing this guitar for a close friend whose father purchased it used for his Birthday from his guitar teachers shop in (1975) Brooklyn NY and has been the owner since. The Listing description below is from when we brought it to the famous Mandolin Brothers in Staten Island NY for consignment. The guitar has been serviced by some of the top Luthier’s in NYC and not one of them ever questioned the authenticity of this instrument. Some offered to purchase it. This is a beautifully looking and playing instrument that has been regularly serviced by Guitartech NYC - Paul Nieto Paul's recent work to this instrument was replacing the original pickguard that was damaged from the original owner (still have original pick guard and will up date with a pic) and replacing the tuning buttons. #U2240-4, sunburst top, original double black P-90 pickups, with brown Gibson hard shell original case.According to Wikipedia, which derives its research from books by Tom Wheeler and Andre’ Duchossoir: “The Gibson ES-225 is a thinline hollowbody electric guitar model produced by the Gibson Guitar Corporation between 1955 and 1959. It is notable as the first thinline hollowbody guitar produced by Gibson. The ES-225 was originally introduced in 1955 as the ES-225T, a thinline hollowbody guitar featuring a Florentine cutaway, the Les Paul combined bridge and tailpiece (also used on the Les Paul from 1952–1953 and on the ES-295), a laminated pickguard, and a single P-90 pickup mounted in an unusual position mid-way between the bridge and the end of the fingerboard. From 1956 the ES-225TD, a twin pickup model with conventional pickup positioning, was also available. Both models had a tobacco sunburst finish, with more expensive natural finish models (ES225TN and ES-225TDN) also available from 1956. The specifications remained the same during the period the guitars were manufactured, with the exception that in 1959 a few guitars were made with separate trapeze-style tailpieces and floating Tune-o-matic bridges. When the guitar was initially marketed it was the first thinline hollowbody guitar Gibson had produced] preceding the Byrdland and ES-350T models. In 1959 the ES-225 was phased out in favor of the ES-330 and ES-125T models. ES-225T is has a body width of 16 ¼” at the widest part, nominally 9 ¼” at the waist, and 11 7/16th” in width at the upper bout. It has a total length of approximately 40”, a depth at the bottom side of 1 7/8”, and a “Florentine” or sharp cutaway on the upper treble bout. It ostensibly has 14 frets to the body joint on the bass side and 20 frets total; a crème bound Brazilian rosewood fingerboard, a black (presumably polished ebony) headplate inlaid with the postwar script “Gibson” logo in mother of pearl and under that a white-white bordered black bell-shaped truss rod cover held in place by two screws. The nut width is 1 11/16th” and the string spacing at the bridge is 2”. The finish on the back of the neck on this particular example has been removed down to the 12thfret; There are scuffs and chips around the headstock. It has its original wraparound tailpiece, It has its original bumblebee capacitor(s). There are scuffs through the finish on its treble side and there are other normal signs of use here and there as well including light buckle wear on the back, scratches, scuffs and scrapes. A strap button has been inserted in the upper bass side centered around a half inch from the neck heel. Visually this is an extremely handsome instrument, and a fairly uncommon one at that.", "ItemID": "163529468328", "EndTime": "2019-02-23T15:24:31.000Z", "StartTime": "2019-02-07T01:21:39.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-1957-ES-225TD-Electric-Guitar-Used-Hard-Case-/163529468328", "ListingType": "FixedPriceItem", "Location": "Brooklyn, New York", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1635294683288080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/g-IAAOSwyHxcW4Fu/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/F68AAOSwM7lcW4Fv/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/8h8AAOSwLdJcW4Fp/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/K~MAAOSwnDRcW4Fp/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/L6QAAOSwbmFcW4Fu/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/nxAAAOSwyhVcW4Fu/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/xzsAAOSww35cW4Fq/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/yLoAAOSwk~VcW4Fr/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/Xq4AAOSwCcZcW4Fs/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/PXIAAOSwW0tcW4Ft/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/qykAAOSwHN9cW4Hq/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/dXYAAOSwJ-xcW4Jp/$_32.JPG?set_id=880000500F"], "PostalCode": "11231", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "bibs207", "FeedbackRatingStar": "Blue", "FeedbackScore": 82, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 2800.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2800.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "z***h", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 691}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson 1957 ES-225TD Electric Guitar (Used) with Hard Case", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model", "Value": ["ES-225"]}, {"Name": "Body Type", "Value": ["Hollow"]}, {"Name": "Features", "Value": ["Cutaway"]}]}, "HitCount": 248, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}