{"BestOfferEnabled": false, "Description": "--> Epiphone ETBKPWGB3 Wildkat Royale Hollow Body Electric Guitar Used This item is slightly used and has been thoroughly checked out by our experts to make sure it is in perfect working condition. We then re-sealed it in its original packaging with all factory included accessories. This item is guaranteed to be in \"as new\" condition and has virtually no cosmetic imperfections. This item is covered with a one year warranty from Sam Ash. The Epiphone Wildkat is truly an Epiphone original! This smaller-body, semi-hollow guitar has great vintage sound and is remarkably comfortable to play! Now the Wildkat is new again. The stunning Wildkat Royale has been outfitted with a pearl white finish, gold sparkle binding, and gold hardware to make a guitar totally unlike anything Epiphone has offered before.Epiphone is a leader in archtop design and has been since the 1930s. An early pioneer in archtops even before they were electrified, Epiphone was never afraid to do something out of the ordinary. With no notable changes in archtop design by anybody in decades, Epiphone took the archtop and practically married it to a solid body guitar. And with a sharp new look, the Wildkat Royale now takes its place among Epiphones all-time great designs.The Wildkat Royale’s innovative design starts with a solid piece of warm, sustain-rich mahogany that is computer-routed to create an acoustic guitar-like body except with a “center block” area like an ES-335. The body is then covered with a beautiful pearl white finish with gold sparkle binding and gold hardware to create a semi-hollow body masterpiece. The Wildkat Royale’s mahogany body is matched with a hand-fitted, glued-in maple neck for maximum tone and sustain. It features a rosewood fingerboard and an authentic gold B70 licensed Bigsby vibrato for even more sonic versatility. The vintage voice of this ‘Kat comes from a pair of Epiphone gold \"dog ear\" P- 90 Classic pickups specifically designed by Epiphone.Other appointments include the historic metal Epiphone name “badge” on the headstock as well as a unique control configuration of 1-bridge volume, 1-neck volume, 1-master tone and 1-master volume. These controls are powered by Epiphone’s full-size 1” 500K potentiometers and matched with Epiphone’s superior all-metal toggle switch and heavy-duty output jack.The Wildkat Royale also features premium 16:1 Grover machine heads for superior tuning stability. All of this great design comes together with fabulous vintage semi-hollow tone and great sustain plus, being slightly larger than a Les Paul and smaller than an ES-335 size, its lightweight and really comfortable to play! Case not included.Features:Body Material: MahoganyTop Material: MapleNeck: Maple, Slim Taper “D” Profile, Glued-in;Dimensions: 24.75” scaleNut width: 1.68”Fingerboard: Rosewood with pearloid dot inlaysFingerboard radius: 12”Neck Pickup: P-90R Dogear ClassicsBridge Pickup: P-90T Dogear ClassicsControls: 1 Master Volume, 2 Pickup Volume, 1-ToneHeadstock: Gold vintage-style Epiphone badgeBinding: Gold sparkle on body and fingerboardFrets: 22 medium jumboBridge: LockTone Tune-o-matic/StopBarTailpiece: Bigsby B70 VibratoHardware: GoldMachine Heads: Grover 16:1Case: Not includedOrder your Epiphone Wildkat Royale from Sam Ash Direct today with the security of our 45/60 day return/price protection policy and be sure to take advantage of our fast, free shipping. Shipping Information Your gear will ship out within 2 days of order confirmation. At this time we can not ship PO Boxes, APO and FPO locations. Industry Leading 45-Day Return Policy We stand by the products we sell, and we'll certainly stand by you as well! We truly appreciate your business, and we want you to be 100% happy with your purchase. However, we know that one of the drawbacks of internet shopping is that you can't try something before you buy it. That's where our money-back guarantee comes in. If you are not completely satisfied with an item, for any reason, you can return it within 45 days of the shipping date for a complete refund of the merchandise price.* Have a question about your order? A Sam Ash Customer Service specialist is available to help! Call 800-472-6274, Monday - Saturday, from 10:00AM - 6:00PM EST. Due to the complexity of international shipping, we are unable to accept any returns on international orders. Before making a purchase outside of the United States, please know that products sold by Sam Ash use the standard 120V/60Hz voltage standard. Sam Ash is not responsible for any damage caused by not adhering to the voltage requirements. *All returns must be within 45 days of the date the item was shipped. Please do not accept any shipment if the packaging appears damaged in any way. We strongly suggest that you check your order after receiving it to be sure that it is in proper working order. Returned items must be in resalable condition. Resalable Condition means that the product(s) is exactly in the same condition as you received it. All exchanges must be pre-paid, returned in original packing, complete with blank warranty cards, owner's manual and show no sign of wear or abuse. In the event that the product is not in the same condition as you received it you may be subject to a minimum 15% restocking fee, repair charge or disqualification. Shipping and handling charges are non-refundable. Please call our Customer Service department if you have any questions about returning an item. CDs, DVDs, video tapes, sheet music, books, strings, computer hardware/software, drum heads, harmonicas, mouthpieces, sound cards, microphones, raw speakers, studio furniture, blank CDs/Tapes or Special Orders are not covered by this return policy.", "ItemID": "192841513623", "EndTime": "2019-03-01T20:50:40.000Z", "StartTime": "2019-02-28T00:36:25.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Epiphone-ETBKPWGB3-Wildkat-Royale-Hollow-Body-Electric-Guitar-Used-/192841513623", "ListingType": "FixedPriceItem", "Location": "Tampa, FL", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1928415136238080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTgwWDUwMA==/z/AhUAAOSwcwdcdy0K/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MzMzWDUwMA==/z/zDoAAOSw02Fcdy0K/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MzMzWDUwMA==/z/V3QAAOSwwW5cdy0K/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MzMzWDUwMA==/z/-LwAAOSwF59cdy0K/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MzIyWDUwMA==/z/2XoAAOSwsnNcdy0K/$_1.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "samashdirect", "FeedbackRatingStar": "PurpleShooting", "FeedbackScore": 59073, "PositiveFeedbackPercent": 99.3, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 405.88, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 405.88, "CurrencyID": "USD"}, "HighBidder": {"UserID": "6***7", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 517}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Epiphone ETBKPWGB3 Wildkat Royale Hollow Body Electric Guitar Used", "HitCount": 11, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1111655870", "StoreName": "Sam_Ash_Music_Direct"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "DiscountPriceInfo": {"OriginalRetailPrice": {"Value": 915.0, "CurrencyID": "USD"}, "PricingTreatment": "STP", "SoldOneBay": false, "SoldOffeBay": false}, "ExcludeShipToLocation": ["Alaska/Hawaii", "APO/FPO", "US Protectorates", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "ConditionDescription": "Like New", "QuantitySoldByPickupInStore": 0, "SKU": "ETBKPWGB3", "NewBestOffer": false}