{"BestOfferEnabled": true, "Description": "ibson USA’s Guitar of the Month for July 2008, the Longhorn Double-cutaway in Trans Blue, is also Gibson’s newest body design, consisting of slightly extended, asymmetrical cutaways on a solid piece of mahogany topped with a AA figured maple top. White three-ply binding around the body and a traditional headstock add both beauty and protection to this new model. And the improvements don’t end there. A special-design L.R. Baggs piezo pickup has been added underneath the Tune-o-matic bridge to deliver outstanding acoustic simulation. A pair of EMG 85 active humbuckers deliver tone, power, and performance for any style of music, while a new two-jack input from L.R. Baggs offers separate outputs for both the piezo and the humbuckers. This gives players the option of either blending the two sounds or playing them individually, thus allowing guitarists all types of sonic possibilities. The neck is one-piece mahogany with Gibson’s traditional ’60s slim-taper profile, topped by an ebony fingerboard with white acrylic small-block fretboard inlays created especially for the Longhorn. Also in keeping with tradition is the headstock’s Flowerpot inlay, which dates back to the early 1900s and several of Gibson’s historic mandolins and archtops. The new Gibson USA Longhorn is available only in a Trans Blue finish. Production is limited to just 1,000 instruments. Finishes Hot Points The Gibson Logo The Gibson logo has graced the headstock of some of the finest stringed instruments of our time. From the Les Paul to the ES-335, and everything in between, the name Gibson is synonymous with originality and excellence. The hand-cut, mother of pearl logo is inlayed into a pressed fiber-head veneer then glued to the face of the mahogany headstock. It is the most recognizable logo in all of music. There is simply no equal. Adjustable Truss Rod A Gibson innovation that revolutionized the guitar, the adjustable truss rod—which moves a neck forward and back—makes it possible for guitars to be set up using a variety of string gauges and string heights, which can accommodate any style of playing. Before this ground-breaking discovery in the early 1920s, the truss rod was used only to strengthen and stabilize the neck. It has become a fundamental part of the guitar, and another example of Gibson’s commitment to developing the instrument. Angled Headstock Gibson’s angled headstock is a small, subtle engineering marvel. Angled at exactly 17 degrees, the Gibson headstock increases pressure on the strings to help them stay in the nut slots, which means there is no loss of string vibration between the nut and the tuners, equaling better sustain. In addition, each Gibson headstock is carved out of the same piece of wood as the neck, ensuring solid alignment and excellent tonal qualities. The Longhorn headstock also comes adorned with Gibson’s Flowerpot inlay, which dates back to the early 1900s and has appeared on several of Gibson’s historic models. ’60s Slim-Taper Neck Profile No guitar neck profiles are more distinguishable than the neck profiles employed on the Gibson models of today. The ’60s neck profile—found on the new Longhorn Double Cutaway—is the more modern, slim-tapered neck most commonly associated with the Les Paul and SG models of the early 1960s. The neck is machined in Gibson’s rough mill using wood shapers to make the initial cuts. But once the fingerboard gets glued on, the rest—including the final sanding—is done by hand. That means there are no two necks with the exact same dimensions. So while it still has the basic characteristics of its respective profile, each neck will be slightly different, with a distinct but traditional feel. 22-Fret Ebony Fingerboard The fingerboard on Gibson USA’s new Longhorn Double Cutaway is constructed from the highest grade ebony on the planet. The resilience of this dense and durable wood makes every fingerboard extremely balanced and stable, and gives each chord and note unparalleled clarity and bite. The 12-inch radius of the fingerboard provides smooth note bending capabilities and eliminates “dead” or “choked out” notes, which can occur on fingerboards with lesser radiuses. Nickel and Silver Alloy Fret Wire The fret wire on the Gibson models is a combination nickel and silver alloy (approximately 80 percent nickel and 20 percent silver) specifically designed for long life and superior wear. Gibson’s traditional “medium/jumbo” fret wire is first shaped by hand, then cut to an exact 12-inch radius. After hand pressing it into the fingerboard, a machine press finishes the job to eliminate the gap between the bottom of the fret wire and the fingerboard. New Small Block Inlays The small block inlays on the new Longhorn Double Cutaway are a new inlay design from Gibson. They are a variation of Gibson’s more traditional larger block inlays, and give the Longhorn’s fingerboard a distinctly smooth look. A figured, swirl acrylic gives these inlays that classic “pearl” appearance. They are inserted into the fingerboard using a process that eliminates gaps and doesn’t require the use of fillers. Set-Neck Construction Like all classic Gibson guitars, the necks on the new Longhorn are glued into the body of the guitar using a process known as “set-neck construction.” Gluing the neck to the body of the guitar insures a “wood-to-wood” contact, no air space in the neck cavity, and maximum contact between the neck and body, allowing the neck and body to function as a single unit. The result? Better tone, better sustain, and no loose or misaligned necks. Mahogany Body and AA Maple Top The joining together of a solid mahogany back and maple top is a time-honored tradition at Gibson, and a critical part of making the new Longhorn Double Cutaway. The formula employed to select the wood and dry it is just as important. On the Longhorn, the mahogany back is matched with a AA figured maple top, both of which are personally inspected and qualified by Gibson’s team of skilled wood experts. Inside the Gibson factories, humidity is maintained at 45 percent, and the temperature at 70 degrees. This insures all woods are dried to a level of “equilibrium,” where the moisture content does not change during the manufacturing process. This guarantees tight-fitting joints and no expansion, and controls the shrinkage and warping of the woods, in addition to reducing the weight. It also improves the woods’ machinability and finishing properties, and adherence to glue. Consistent moisture content means that every Longhorn Double Cutaway will respond evenly to temperature and humidity changes long after it leaves the factory. Nitrocellulose Finish Applying a nitrocellulose finish to any Gibson guitar—including the new Longhorn Double Cutaway—is one of the most labor-intensive elements of the guitar-making process. A properly applied nitro finish requires extensive man hours, several evenly applied coats, and an exorbitant amount of drying time. But this fact has never swayed Gibson into changing this time-tested method, employed ever since the first guitar was swathed with lacquer back in 1894. Why? For starters, a nitro finish dries to a much thinner coat than a polyurethane finish, which means there is less interference with the natural vibration of the instrument, allowing for a purer tone. A nitro finish is also a softer finish, which makes it easily repairable. You can touch up a scratch or ding on a nitro finish, but you can’t do the same on a poly finish. In addition, a nitro finish is very porous in nature, and actually gets thinner over time. It does not “seal” wood in an airtight shell—as a poly finish does—and allows the wood to breathe and age properly. EMG 85 Pickups and L.R. Baggs Piezo Pickup The EMG 85 is one of most popular active humbuckers in the world, and rightfully so. Equipped with a bar-shaped Alnico V magnet and coils with separate outputs, the EMG 85 yields a warmer and more natural tone, and delivers balanced and uniform string response. The wide aperture of the coils produces a beefier low end and fatter top end, with loads of output that doesn’t get muddy. They can be used to play everything from classic rhythm and blues to heavy metal. The new, special-design L.R. Baggs piezo pickup is located under the Tune-o-matic bridge and offers a wide range of outstanding acoustic simulation capabilities. The Longhorn also comes equipped with a new two-jack input, also from L.R. Baggs, that offers separate outputs for both the piezo and the humbuckers, allowing for plenty of options to blend the two distinct sounds, or playing them individually. Body Binding To see the process of putting the binding on a Gibson guitar is to really appreciate the effort and attention put into every instrument. A lone craftsman carefully glues and fits three pieces of binding around the entire body of the new Longhorn. He then winds a single, very long piece of narrow cloth around the body until the entire surface is nearly covered. The body is then hung to dry for a full 24 hours before it is unwrapped and moved into the next phase of production. It has been done the same way for over 100 years. Some question the value of adding binding, but Gibson believes it is a fundamental part of our rich guitar-making history. It not only adds elegance to the Longhorn, but also helps protect the edges of the body. The neck binding is installed over the fret ends, which eliminates sharp fret edges and provides for a smooth neck and easier playability. Tune-O-Matic Bridge The Tune-o-matic bridge was the brainchild of legendary Gibson president Ted McCarty in 1954. At the time, it was a true revelation in intonation, and set a standard for simplicity and functionality that has never been bettered. This pioneering piece of hardware provides a firm seating for the strings, allowing the player to adjust and fine-tune the intonation and string height in a matter of minutes. It also yields a great union between the strings and body, which results in excellent tone and sustain. It is combined with a separate “stopbar” tailpiece, essentially a modified version of the earlier wraparound bridge. To this day, the Tune-o-matic remains the industry standard. It is the epitome of form and function in electric guitar bridge design, and is one of the most revered and copied pieces of guitar hardware ever developed. Gallery Gibson Longhorn Les Paul Limited Edition Guitar of the Month 2008 Midnight BlueThe Gibson Longhorn Double Cut Guitar has a unique body style that incorporates slightly extended, asymmetrical cutaways on a solid piece of mahogany with an AA figured maple top. The special-design L.R. Baggs piezo pickup beneath the Tune-O-Matic bridge combined with two EMG-85 active humbuckers housed in the bridge and neck offer an extended range of tonal options. Separate pickup outputs enable guitarists to use the pickups individually or blend their sounds. The Longhorn has a 1960s-era slim tapered mahogany neck, traditional headstock, and flowerpot inlays on the headstock that date back to Gibson’s guitars, mandolins, and archtops of the early 1900s.This guitar is in Near Mint condition and is an awesome limited edition Guitar of the Month from 2008. Super tough to find and VERY LOW Serial number 069. Gorgeous Huge Flame Maple top on this one also! NeckThe neck is a solid-one-piece mahogany with Gibson’s traditional ’50s rounded profile, topped by an ebony fingerboard with white acrylic small-block fretboard inlays created especially for the Longhorn. Also in keeping with tradition is the headstock’s Flowerpot inlay, which dates back to the early 1900s and several of Gibson’s historic mandolins and archtops. The fingerboard on the Longhorn is constructed from the highest grade ebony on the planet. The resilience of this dense and durable wood makes every fingerboard extremely balanced and stable, and gives each chord and note unparalleled clarity and bite. The fret wire on the Gibson models is a combination nickel and silver alloy (approximately 80 percent nickel and 20 percent silver) specifically designed for long life and superior wear. The small block inlays on the new Longhorn Double Cutaway are a new inlay design from Gibson. They are a variation of Gibson’s more traditional larger block inlays, and give the Longhorn’s fingerboard a distinctly smooth look.", "ItemID": "202515159213", "EndTime": "2018-12-03T17:32:56.000Z", "StartTime": "2018-11-26T00:48:25.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2008-Gibson-Limited-Edition-Longhorn-Guitar-Week-/202515159213", "ListingType": "Chinese", "Location": "Astoria, New York", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/2025151592138080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MjQ4WDcxMw==/z/WvwAAOSwElhb5uHu/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/WAkAAOSw0d1b7xfG/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/b2wAAOSwnWpb67kN/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/OkoAAOSwD~Fb67lb/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/~eUAAOSwtgZb67os/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/pFEAAOSw0rdb67rW/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/9RAAAOSwA29b67sR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/LbYAAOSwB19b67jb/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/NwQAAOSwsRVb7xdD/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/SzkAAOSwaPNb-1Y8/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/5FUAAOSwdrdb-1ZJ/$_57.JPG?set_id=8800005007"], "PostalCode": "11106", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "secureshop2010", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 104, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 1550.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1550.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "r***h", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 327}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2008 Gibson Limited Edition Longhorn Guitar of the Week ", "ItemSpecifics": {"NameValueList": [{"Name": "UPC", "Value": ["Does not apply"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model Year", "Value": ["2008"]}, {"Name": "Body Type", "Value": ["Double Cutway"]}, {"Name": "Model", "Value": ["Les Paul Longhorn"]}, {"Name": "Body Color", "Value": ["Midnight Blue"]}, {"Name": "Custom Bundle", "Value": ["Yes"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Body Material", "Value": ["Mahogamy"]}, {"Name": "Features", "Value": ["Double Cut body style on Mahogany"]}, {"Name": "Soundboard Style", "Value": ["AA Figured Maple Top"]}, {"Name": "Non-Domestic Product", "Value": ["Yes"]}, {"Name": "Applicable Regions", "Value": ["USA"]}, {"Name": "Size", "Value": ["Full Size"]}, {"Name": "Product Line", "Value": ["Gibson Limited Edition 1000 run"]}, {"Name": "Own a piece of musical History.", "Value": ["1960s era slim tapered mahogany neck"]}, {"Name": "Bundle Description", "Value": ["The special-design L/R Baggs piezo pick-up beneath the Tune-O-Matic bridge combined with Two EMG-85 active humbuckers"]}]}, "HitCount": 61, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "14 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 1575.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "This guitar is flawless. Shows little to no wear. Not a mark anywhere on the guitar, Showing no sings of wear or use such as belt-buckle or pick scratches, scuffs, dings or scrapes on the instrument.        Features: Double Cut guitar has a unique body style that incorporates slimly extended, Asymmetrical cuttings a solid piece of mahogany with AA figured maple top. The special-design L/R Baggs piezo pick-up beneath the Tune-O-Matic bridge combined with Two EMG-85 active humbuckers  housed in the bridge and neck offer an extended range of tonal options.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}