{"BestOfferEnabled": false, "Description": "DJ GEAR INSTRUMENT GEAR LIVE SOUND RECORDING MICROPHONES HEADPHONES ACCESSORIES SOFTWARE LIGHTING BUNDLES Authorized Dealer - Full Warranty Charvel Pro-Mod San Dimas Style 1 HH FR - Satin Black - Used San Dimas Style 1 Electric Guitar w/ Floyd Rose - Satin Black - Used - Description The Pro-Mod series continues upon Charvel&rsquo;s storied legacy of innovative excellence in high-performance guitar design, offering the latest technology and top-notch features that modern players need. An ideal instrument for dazzling high-speed playing, the San Dimas Style 1 HH FR M boasts scorching sound, stunning style and grininducing playing feel and performance. Its body is crafted from ash and is coupled with a bolt-on two-piece maple neck with a pair of graphite reinforcement rods to resist bending and warping under environmental stresses. The speed neck profile is designed for lightning fast playing and completely unhindered position shifts while the comfortably rolled fingerboard edges provide the broken-in feel of an instrument with plenty of playing miles on it, and plenty more to go. This axe also features a maple fingerboard with 22 jumbo frets and black dot inlays, as well as a heel-mounted spoke wheel for quick and convenient truss rod adjustments. High-output Seymour Duncan JB and Seymour Duncan '59 humbucking pickups are directly mounted to the body, cranking out high octane rock &lsquo;n&rsquo; roll tone with plenty of sweet overtones. The volume control conceals a push/pull coil split to have even more tonal variations on tap while the No-Load tone control operates like a standard tone control from positions one through nine, removing itself from the circuit at position ten for transparent sound, letting the full natural voice of the guitar shine through. Dive to rumbling depths or add a well-placed rising harmonic without sacrificing your tuning with the Floyd Rose 1000 series double-locking recessed tremolo bridge system. Designed with style in mind, the San Dimas Style 1 HH FR M is brand new finishes &mdash; Satin Black (gold hardware). Features/Specs Series : Pro-Mod Body Material : Alder Body Finish : Satin Neck : Bolt-On 2-Piece Maple Speed Neck with Graphite Reinforcement and Rolled Fingerboard Edges Neck Finish : Hand-Rubbed Urethane Gel Fingerboard : Maple, 12&rdquo; - 16&rdquo; Compound Radius (304.8 mm to 406.4 mm) Frets : 22, Jumbo Position Inlays : Black Dot Nut (Material/Width) : Floyd Rose FRT-O1000 (534) or FRT-O3000 (568) Locking, 1.6875&rdquo; (42.86 mm) Tuning Machines : Charvel Branded Sealed Die-Cast Scale Length : 25.5&rdquo; (648 mm) Bridge : Floyd Rose FRT-O1000 (534) or FRT-O3000 (568) Double-Locking Recessed Pickguard : None Pickups Seymour Duncan JB TB-4 Humbucking (Bridge) Seymour Duncan &lsquo;59 SH-1N Humbucking (Neck) Pickup Switching : 3-Position Blade : Position 1 : Bridge Pickup, Position 2 : Both Inner Coils, Position 3 : Neck Pickup, (Split Engaged) Position 1 : Bridge Outer Coil, Position 2 : Both Outer Coils, Position 3 : Neck Outer Coil Controls : Volume (Push/Pull Coil Split), No-Load Tone Control Knobs : Knurled Flat-Top Hardware Finish : Chrome (534), Gold (568) Strings : NPS, .009-.042 Gauges We are authorized dealers for all these brands. Click a logo to see our listings. We collect NYS Sales Tax for items shipping within New York. Local duties, taxes and fees out of the USA are not included in the sale price or ship charge. Proaudiostar is not responsible for any taxes outside of NY and or the USA. If an item is refused by the buyer, ship costs to and from the destination in which the item was shipped to are not refunded. Please note the cost of return shipping is usually double of what the original ship cost. Shipping is not free to HI, AK, and PR. FREE SHIPPING ONLY TO THE LOWER 48 STATES. We provide free shipping to the contiguous 48 United States, on most items. Shipping fees to ALL OTHER LOCATIONS will be calculated individually and added to customer invoices. Local duties, taxes and charges are not included in the sale price or ship charges. ProAudioStar is not responsible for any taxes outside of NY and or the USA. In the event that the customer refuses a shipment, all shipping costs to and from the country or State in which the item was shipped to are not refunded. Please note, in some cases return shipping can cost as much as double the original ship cost. We operate a 30-day return period. Items must be returned with all original packaging as well as all included items. Items that are not returned in original, resalable condition are subject to a 15% restocking fee. We charge a 15% restocking fee on returned items only if the item is clearly used and or the packaging is tarnished. A 10% re-stock is more likely if the unit comes back in mint condition. The ship cost we paid to ship your item will be deducted as well. In some cases restock fees and ship costs can be applied as a store credit. We will exchange a defective unit for the same unit within the 30-day period. After that period, you will have to work directly with the manufacturer for warranty service. Items that can not be returned include: software, units with contents or packaging that is damaged/missing, and items that are considered for personal use (such as earphones, headphones, microphones, instrument mouthpieces, harmonicas or other items that you wouldn't want to purchase if someone else had previously used them). Also, Items which we do not normally stock (i.e. \"Special Orders\", discontinued products, close-outs, used products, etc.) are non-returnable. We strongly suggest that you check your order after receiving it to be sure that it is in proper working order. Please contact us for a Return Authorization before returning any items.", "ItemID": "292943189136", "EndTime": "2019-02-18T21:26:22.000Z", "StartTime": "2019-02-01T18:43:25.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Charvel-Pro-Mod-San-Dimas-Style-1-HH-FR-Satin-Black-Used-/292943189136", "ListingType": "FixedPriceItem", "Location": "Winchester, Virginia", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2929431891368080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/OTg0WDEyMTU=/z/8QkAAOSw6TdbonhZ/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTg0WDEyMTU=/z/hPQAAOSwDOlbonha/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTg0WDEyMTU=/z/ut4AAOSw3mNbonhZ/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTg0WDEyMTU=/z/EBcAAOSwrqBbonha/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTg0WDEyMTU=/z/UEsAAOSwlv9bonhZ/$_1.JPG?set_id=880000500F"], "PostalCode": "22601", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "proaudiostar", "FeedbackRatingStar": "RedShooting", "FeedbackScore": 212120, "PositiveFeedbackPercent": 98.8, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 689.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 689.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "t***n", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 269}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Charvel Pro-Mod San Dimas Style 1 HH FR - Satin Black - Used", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Charvel"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}]}, "HitCount": 128, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=336450849", "StoreName": "proaudiostar"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "DiscountPriceInfo": {"OriginalRetailPrice": {"Value": 849.99, "CurrencyID": "USD"}, "PricingTreatment": "STP", "SoldOneBay": false, "SoldOffeBay": false}, "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "BR"], "GlobalShipping": false, "ConditionDescription": "Used", "QuantitySoldByPickupInStore": 0, "SKU": "CVL-29651315-68-B", "NewBestOffer": false}