{"BestOfferEnabled": true, "Description": "Offered is a 1958 Fender Stratocaster. Now how cool is this! Buddy Holly's 1958 Stratocaster on display in Lubbock, Texas is serial number 028228 and dated 4-58. This one is dated and made just a month prior dated 3-58 and serial 026200. Fender history at its finest time. Take advantage of this rare opportunity. You just dont see these anymore come up for sale in any condition especially player grade. They have either been parted out for huge money or people just tend to hold onto them. I purchased this piece from Willies American Guitars. They purchased it from an older lady in Iowa and the guitar belonged to her late husband. They sold the original tweed case and pots before I bought the guitar. The body is one piece ash and all 58 Strats were Alder except the Blonds which were ash. In pic 4 you can see the original blond in the neck pocket. In the middle pickup cavity it is date 3-58 (see pic 2) and an employee's name in the neck pickup cavity (see pic 3). The body has no routes or repairs and has been refinished long ago in a lacquer burst. The neck is also original to the guitar. There is no date on the end of the neck but you can see the original dowel marks in pics 12 &13. The tuners are original single line tuners and fairly tight and hold tune and , have the patent # and believe it or not the tuner holes have never been reamed out for other tuner's and still sports original serial # neck plate 026200 and screws. For some unknown reason the neck was shaved fairly low down past the black dots in its life and you can see the end of the truss rod where it meets the body. The truss rod works and the guitar functions and plays well as is and holds tune. When I received the guitar the headstock was painted black and the finish was a amber pink hue which distracted from the instrument. The guitar neck has been refinished in nitro lacquer in the right color and correct period headstock decal added. It has a correct replacement single ply pick guard pickup covers and knobs and tremolo bridge. The pickups are Seymour Duncan vintage with CTS pots and a 3 way switch. The case is a Fender tweed case(not original) but is worn and stain with great patina. The handle has tape on it and one latch needs replaced. In summary original parts include: 1958 Ash body(1 piece) no routes and properly documented with refinished burst1958 Maple neck that has been shaved on the fingerboard and refinishedoriginal single line Kluson tunersoriginal strap buttons Original Neck Plate serial # 026200 with original neck screwsOriginal Input jack cupThis information was verified by Willies and myself (25 years of buying, trading and selling vintage Fenders )The guitar will be shipped at a fixed price with insurance and signature to lower 48 States. International only through ebay global shipping program no exceptions.. Try finding another maple neck 50's Stratocaster or Telecaster complete that plays for under $4500. You won't check ebay and reverb. Parts alone easily equal or exceed purchase amount. Get some old wood and a piece of Fender history without breaking the bank. I have taken great time to explain and photo this guitar. Please read the description fully and examine all pics as they are part of the sale and buyers consent of purchase acknowledges that you have and consent all sales final. Check my feedback for history. Guitar is also for sale on reverb and if two people purchase the instrument the first sale will get the instrument and the latter will get full refund no exceptions.", "ItemID": "183702028156", "EndTime": "2019-02-24T20:06:48.000Z", "StartTime": "2019-02-24T19:27:55.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1958-Fender-stratocaster-Sunburst-/183702028156", "ListingType": "FixedPriceItem", "Location": "Harrison, Ohio", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1837020281568080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/w1oAAOSwR2FccurZ/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/mFgAAOSwlltccurG/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/W10AAOSwDXFccus2/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/1uQAAOSwBG9ccuyc/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDUwWDYwMA==/z/Gv4AAOSw35hccuzg/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/XXMAAOSwCuBccurS/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/LFMAAOSwjARccuvA/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/UTsAAOSwKmhccuuS/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/4RoAAOSwEWNccuun/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/brsAAOSwrw1ccurJ/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/lm4AAOSwxy5ccurL/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/S4kAAOSwYS5ccurX/$_57.JPG?set_id=880000500F"], "PostalCode": "45030", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "fenmustang", "FeedbackRatingStar": "Red", "FeedbackScore": 2420, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 4499.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 4499.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "n***o", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 65}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "1958 Fender stratocaster Sunburst", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Model", "Value": ["Stratocaster"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Color", "Value": ["Sunburst"]}, {"Name": "Model Year", "Value": ["1958"]}]}, "HitCount": 25, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}