{"BestOfferEnabled": true, "Description": "Bought this to write 7 string parts. Has been a solid guitar for that purpose. Only used to perform once. The instrument is in excellent condition (near mint condition). Schecter's Omen Extreme-7 delivers hard rock performance, elegance and playability. Schecter's Omen Extreme-7 boasts a mahogany body with a quilted maple top, supercharged with a pair of Schecter Diamond Plus humbuckers that deliver the hard rock crunch needed to cut through today's modern metal and rock mixes. Maple neck Maple has a uniform grain, it's strong and stable, and it has less reaction from environmental changes than other hardwoods. Its tone is highly reflective, and focuses more energy onto the body wood. Maple transfers a bright tone to the body which complements the warm tones of a mahogany body. Rosewood fretboard The most common fretboard, rosewood is naturally oily, and works well for any surface that sees frequent human contact. The sound is fundamentally richer than maple because the stray overtones are absorbed into the oily pores. Schecter Diamond Plus humbuckers Over-wound coils with a ceramic magnet give these aggressive high output pickups the push that will send your amp over the edge. Made for crunchy rhythms and blistering leads, and perfect for drop tunings, this pickup will cut through the mix with ease. Sparkling single-coil tone when push-pull knob is activated. Schecter tuning machines These high quality tuners feature a classic design in a lubricated and sealed housing to protect gears for a lifetime of maintenance free playability. Details include a 15:1 gear ratio for smooth and precise tuning, removable knobs, threaded hex peghead bushing and a 10mm diameter peg hole. TOM w/thru body bridge Classic design Tune-O-Matic bridge with a Schecter 'String Thru' body tail, for added string tension, sustain and clarity. Case sold separately. FEATURES Mahogany contoured body Carved quilted maple top 26.5\" scale bolt-on maple neck Rosewood fretboard 24 X-Jumbo frets Schecter Vector inlay Schecter Diamond Plus humbucking neck pickup Schecter Diamond Plus humbucking bridge pickup Master volume and tone control with coil-tap 3-Way pickup selector TOM w/thru body bridge Schecter tuning machines Black chrome hardware Case sold separately", "ItemID": "113395485743", "EndTime": "2018-11-28T21:30:25.000Z", "StartTime": "2018-11-23T23:03:45.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Schecter-Guitar-Research-Omen-Extreme-7-Electric-Guitar-See-Thru-Black-/113395485743", "ListingType": "Chinese", "Location": "Rochester, New Hampshire", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1133954857438080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTMyMFg1Nzg=/z/PBMAAOSw8Y1bpWHu/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/omQAAOSw~IFbpWNt/$_12.JPG?set_id=880000500F"], "PostalCode": "03868", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "yourfriendzac", "FeedbackRatingStar": "Yellow", "FeedbackScore": 41, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 259.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 259.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "h***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1084}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Schecter Guitar Research Omen Extreme-7 Electric Guitar See-Thru Black", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Schecter Guitar Research"]}]}, "HitCount": 25, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "14 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 264.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}