{"BestOfferEnabled": true, "Description": "ComputerWorksA+ Packing Fast ShippingQuick Email Replies PRS CE22?? Swamp Ash Special?? Electric Guitar With Padded Case PaymentShippingReturnsInfo - The Small PrintPaymentShippingReturnsInfo - The Small Print We accept payment by any of the following methods: PayPal - MasterCard - Visa - Amex Please pay as soon as possible after winning an auction, as that will allow us to post your item to you sooner! All sold items are expected to be paid in a timely manner.Unpaid items will be forwarded to the eBay Resolution Center. We offer Fast Shipping on all orders! All paid items are packaged and shipped within 2 business days. We do not process orders on Saturday or Sunday. In the unlikely event that your item is lost or damaged during shipping, then WE are responsible and will issue either a full refund or replacement. If you are not 100% satisfied with your purchase, you can return the product and get a full refund or exchange the product for another one, be it similar or not. You can return a product for up to 14 days from the date you purchased it. Any product you return must be in the same condition you received it and in the original packaging. Please keep the receipt. We try to document every scuff, scratch, dent, crack, etc. in the listing pictures so please examine pictures and ask questions before you purchase. We APPRECIATE & WILL CONSIDER ALL REASONABLE OFFERS! Please ask questions prior to purchasing our items to avoid unnecessary order cancellations. We will reply promtly to help you make good purchase decisions. FEEDBACK: Feedback should be a positive experience for everyone. If there is a problem with your order, please contact us to resolve the issue before leaving negative or neutral feedback. We want eBay shopping to be great for everyone. ATTENTION: Grade A (like New): No signs of wear (scuffs,scratches, etc.) Grade B (Very Good): Unit may come with some slight cosmetic defects (scratches, scuff marks, dents, bumps, discoloration). Grade C (Used/ Good): Unit may come with some major cosmetic defects (scratches, scuff marks, dents, bumps, discoloration). Grade D: (Heavy wear or damaged but functional) Unit will have Scratches, deep gouges, dents or cracks. DNF (Does Not Function): (Item does not work) Physical damage that prevents full use of item or \"Parts Only\".See our other itemsVisit our Store - ComputerWorks ComputerWorksPRS CE22 Electric Guitar With Padded CaseSee our other items Payment We accept payment by any of the following methods: PayPal - MasterCard - Visa - Amex Please pay as soon as possible after winning an auction, as that will allow us to post your item to you sooner! All sold items are expected to be paid in a timely manner.Unpaid items will be forwarded to the eBay Resolution Center.Shipping We offer Fast Shipping on all orders! All paid items are packaged and shipped within 2 business days. We do not process orders on Saturday or Sunday. In the unlikely event that your item is lost or damaged during shipping, then WE are responsible and will issue either a full refund or replacement. Returns If you are not 100% satisfied with your purchase, you can return the product and get a full refund or exchange the product for another one, be it similar or not. You can return a product for up to 14 days from the date you purchased it. Any product you return must be in the same condition you received it and in the original packaging. Please keep the receipt. We try to document every scuff, scratch, dent, crack, etc. in the listing pictures so please examine pictures and ask questions before you purchase. Info - The Small Print We APPRECIATE & WILL CONSIDER ALL REASONABLE OFFERS! Please ask questions prior to purchasing our items to avoid unnecessary order cancellations. We will reply promtly to help you make good purchase decisions. FEEDBACK: Feedback should be a positive experience for everyone. If there is a problem with your order, please contact us to resolve the issue before leaving negative or neutral feedback. We want eBay shopping to be great for everyone. ATTENTION: Grade A (like New): No signs of wear (scuffs,scratches, etc.) Grade B (Very Good): Unit may come with some slight cosmetic defects (scratches, scuff marks, dents, bumps, discoloration). Grade C (Used/ Good): Unit may come with some major cosmetic defects (scratches, scuff marks, dents, bumps, discoloration). Grade D: (Heavy wear or damaged but functional) Unit will have Scratches, deep gouges, dents or cracks. DNF (Does Not Function): (Item does not work) Physical damage that prevents full use of item or \"Parts Only\".Visit our Store - ComputerWorks", "ItemID": "163487610728", "EndTime": "2019-01-17T22:30:04.000Z", "StartTime": "2019-01-15T02:11:52.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/PRS-CE22-Swamp-Ash-Special-Electric-Guitar-Padded-Case-/163487610728", "ListingType": "FixedPriceItem", "Location": "Newnan, Georgia", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1634876107288080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/ODQwWDQ3Mg==/z/6EoAAOSw8MJb0Wh2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODg5WDY2Nw==/z/Fd0AAOSwRYNb0WrA/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODQwWDYzMA==/z/6~oAAOSw9PFb0WiE/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODQwWDYzMA==/z/yt4AAOSwy-5b0Wh9/$_57.JPG?set_id=8800005007"], "PostalCode": "30265", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "compwks", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 371, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1250.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1250.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "l***v", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 899}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "CA", "GB", "DK", "RO", "SK", "BG", "CZ", "FI", "HU", "LV", "LT", "MT", "EE", "GR", "PT", "CY", "SI", "CN", "SE", "TH", "BE", "FR", "IE", "NL", "PL", "ES", "IT", "DE", "AT", "BS", "IL", "MX", "NZ", "CH", "NO", "SA", "UA", "AE", "QA", "KW", "BH", "HR", "MY", "CO", "PA", "JM", "BB", "BD", "BM", "BN", "BO", "EG", "GF", "GG", "GI", "GP", "IS", "JE", "JO", "KH", "KY", "LI", "LK", "LU", "MC", "MO", "MQ", "MV", "NI", "OM", "PK", "PY", "RE"], "Site": "US", "TimeLeft": "PT0S", "Title": " PRS CE22?? Swamp Ash Special?? Electric Guitar With Padded Case", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["PRS"]}, {"Name": "Model", "Value": ["Custom 22"]}]}, "HitCount": 159, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=10214042", "StoreName": "ComputerWorks"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "14 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": true, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}