{"BestOfferEnabled": false, "Description": "2015 Gibson Memphis ES-Les Paul '59 Neck in Tobacco Burst - limited edition of 150. This guitar is in very good condition with a nice '59 neck. Plays great. Only blemish to call out is finish where neck meets body - have included a close-up picture. Also the truss rod cover is a plain cover rather than the \"f-hole\" cover of other 2015's. Moving only to make room for more acquisitions. From Gibson Memphis: The perfect marriage of Les Paul and ES-335 yields powerful tones and a lightweight playing feel. Features include a figured maple top, maple back and rims, cream-bound rosewood 'board with pearloid trapezoids on a mahogany neck with a 1959 neck profile, rolled binding for a played-in feel, PAF-style MHS pickups. The ES-Les Paul '59 Neck is the ultra-lightweight answer to a 1959 Tobacco Sunburst Les Paul, only with the added bonus of having ES-semi-hollowbody construction! Killer tone never came in a more comfortable and accessible package. Only 150 of these rare, beautiful Tobacco Burst guitars will be made. From Sweetwater: Gibson Memphis ES-Les Paul Semi-hollowbody Electric Guitar at a Glance:Legendary tone from Memphis Historic Spec humbuckersFast, smooth feelGibson Memphis's commitment to qualityLegendary tone from Memphis Historic Spec humbuckersTonal excellence is yours when you plug this Gibson Memphis ES-Les Paul into your favorite tube amplifier. Loaded with a pair of Memphis Historic Spec (MHS) alnico humbuckers, which are based on '50s-era pickups and designed to enhance the sound of semi-hollowbody guitars, you'll be able to dial in chiming country tones as easily as savagely distorted rock tones. The Alnico III neck pickup gives you classic hollowbody-style tones for everything from smooth jazz to dirty blues. Flip to the Alnico II bridge pickup, and you'll command sounds covering everything from bright and clean to raw and mean.Fast, smooth feelWhether you're playing rhythm or lead roles, or even both, you'll feel right at home with the Gibson Memphis ES-Les Paul. The modified '59 neck shape is fat and soulful, yet smooth to play. And the neck binding is rolled to fit more comfortably in your hand, while low-profile frets enhance playability and intonation.Gibson Memphis's commitment to qualityWhen you want a premium hollowbody or semi-hollowbody guitar, there's nothing like a Gibson. Handbuilt at the Gibson Memphis Custom Shop, these guitars feature premium craftsmanship and carefully selected tonewoods that give you amazing playability and tone. Countless jazz, rock, and blues players have used Gibson hollowbodies for decades. Take it from Sweetwater - this Gibson Memphis ES-Les Paul will give you years of great performance!Gibson Memphis ES-Les Paul Semi-hollowbody Electric Guitar Features:Semi-hollowbody design for enhanced harmonic richnessWeight-relieved mahogany center block and spruce top bracing provide majestic toneModified 1959 profile 1-piece mahogany neck delivers great playabilityMemphis Historic Spec (MHS) alnico humbuckers are designed to enhance semi-hollowbody guitarsRolled neck binding and low-profile frets for fast, smooth playabilityPlek Pro fretboard optimization ensures perfect action and intonation", "ItemID": "302989371056", "EndTime": "2018-12-15T21:37:26.000Z", "StartTime": "2018-12-08T21:37:26.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2015-Gibson-Memphis-ES-Les-Paul-59-Neck-Tobacco-Burst-VOS-Used-/302989371056", "ListingType": "Chinese", "Location": "Alpharetta, Georgia", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/3029893710568080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/M~4AAOSwj-RcDDZd/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/6OsAAOSw-4JcDDZd/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/~NAAAOSwY0ZcDDZd/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/XoYAAOSwKSlcDDZc/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/AUEAAOSwf1xcDDZc/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/DnwAAOSw3fxcDDZc/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/QokAAOSwkHFcDDZc/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/2WwAAOSwUMBcDDZc/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/jAcAAOSwS4VcDDZd/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/5K4AAOSw6jJcDDZd/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/h1AAAOSwF1tcDDZd/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/it0AAOSw~2VcDDbi/$_32.JPG?set_id=880000500F"], "PostalCode": "30004", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jtbro2323", "FeedbackRatingStar": "Yellow", "FeedbackScore": 16, "PositiveFeedbackPercent": 100.0}, "BidCount": 6, "ConvertedCurrentPrice": {"Value": 1500.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1500.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "n***n", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 811}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2015 Gibson Memphis ES-Les Paul '59 Neck Tobacco Burst VOS Used", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson Memphis"]}, {"Name": "Product Line", "Value": ["Gibson Les Paul"]}, {"Name": "Model Year", "Value": ["2015"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}]}, "HitCount": 377, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 1525.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}