{"BestOfferEnabled": true, "Description": "Here's a nice example of an Ovation Deacon (Breadwinner) model guitar at a nice low starting price. I didn't have the extra cash at this point in time to fully restore this one. The knobs are not correct so if you want you can hunt down and replace them. The electronics seem to be all original and are working fine. The knob closer to the pickups seems to be the volume. The other seems to be the tone and may need an adjustment with a new/old knob to get the balance correct between the 0 middle between. Otherwise just understand that the cut is between and adjusts +/- from a given position. On an original tone knob the middle position is \"0\". The three way switch underneath works fine and gives a great range of tones as well as the cut switch above which is sort of a notch filter before notch filters were common. The guitar definitely needs a new set of strings, neck adjustment and overall setup. At this point when I did a test play it did stay in tune overall and the space was wider between fretboard and strings closer to the pickups you go looking down at the neck. Yes, definitely needs an adjustment. Slight crack in pickguard near the neck pickup. About 10 to 15 slight dingers overall front and back. Wiring for batteries all good. No corrosion visible. PC board inside appears in good condition. Back plate fits very snug probably because I always store with it off and batteries out. With batteries in the plate is very hard to secure on without force. I will not force it on. I would suggest possibly removing the foam inside because today's batteries are thicker than they used to be and maybe filing around the edges around so the plate slides in easier. The screws match up fine. no issues with them. I usually use a dime to screw and unscrew those two screws or a thicker headed flat head screwdriver. I will ship without batteries, plate off and secured inside the case's storage area under the neck. The lid is not attached, just put in place and it stays well put. No issues with the latches or any other part of the case. Has less than normal wear for a case from the 1970s I would think. I have videotaped the testing process for my own protection to show that the guitar is working well. I will also video the day I have it professionally packed for shipment. I know that people like to change out the PC boards with non-working ones and say that I sent it that way. This is why I do the filming processes. This also ensures that if the guitar is not working once you get it that it would have had to have happened during the shipping process. So it protects the buyer as well if they have to file for the insurances for any reason. For these reasons I will not take back this guitar for any reason from the buyer. If you have any issues I will definitely provide all that I can to help you recoup any losses. I just cannot provide a refund whatsoever. If you wish me to play the guitar over a phone or video call to show that my information is all truthful and accurate I will work with you to make that happen as well. Please refer to my excellent feedback for a long history of excellent service to my buyers. The 1 recent incident of shipping taking a long time was due to an unexpected hospital stay so please forgive that one. I'm better now and keeping up on my new medications. Any questions? Be rest assured that this, as well as all my auctions, benefit the disabled and elderly (myself and my mom). As well as our feral cat rescue efforts. So bid often and generously on all our items. Or just buy them straight up on a BIN. Every dollars counts and helps more than words could ever express. It's our lives and the lives of innocent kitty cat kittens that you are helping. You can help directly too.. please inquire. And make sure to always watch for new listings and my other items and SHARE anything that you think friends or family might like to buy too....please! US Priority Mail and UPS are standard offerings for shipment due to the fact that they offer tracking and insurance included. Being disabled we cannot ship by any other means, our apologies. As they say beggars can't be choosers. We are definitely in the beggar category. Thank you, good luck and happy bidding or buying. :^) Ovation Deacon Breadwinner 12xx series1970s early model E44xx VG condition OHSC LOW starting bid NATURAL Light Brown color.", "ItemID": "233088529034", "EndTime": "2019-01-15T11:09:16.000Z", "StartTime": "2019-01-10T11:09:16.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Ovation-Deacon-1970s-early-model-E44xx-VG-condition-OHSC-LOW-starting-bid-NAT-/233088529034", "ListingType": "Chinese", "Location": "Stratford, Connecticut", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2330885290348080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA2OFgxNjAw/z/21cAAOSwdrdcNyUI/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAyOVgxNjAw/z/nb4AAOSw3ZJcNyUK/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/2k0AAOSwWAhcNyUM/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/xLMAAOSwv0dcNyUO/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIxNFgxNjAw/z/EGEAAOSw~wVcNyVf/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/D9IAAOSwi3xcNyVi/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/hRUAAOSwylBcNyVk/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE3MVgxNjAw/z/HnEAAOSwRfxcNyWF/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTM2N1gxNjAw/z/sQEAAOSw-GNcNyWI/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE0OFgxNTY5/z/rWQAAOSw09NcNyWM/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/HpEAAOSwWI5cNyWd/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/4iEAAOSw~5dcNyWf/$_57.JPG?set_id=8800005007"], "PostalCode": "06614", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "remarkablerescuegplantiques", "FeedbackRatingStar": "Purple", "FeedbackScore": 965, "PositiveFeedbackPercent": 96.6}, "BidCount": 10, "ConvertedCurrentPrice": {"Value": 690.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 690.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "g***a", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 151}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "Ovation Deacon 1970s early model E44xx VG condition OHSC LOW starting bid NAT", "ItemSpecifics": {"NameValueList": [{"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Brand", "Value": ["Ovation"]}, {"Name": "Body Type", "Value": ["Mahogany Natural color"]}, {"Name": "Body Color", "Value": ["Light natural brown tan"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Material", "Value": ["Mahogany"]}, {"Name": "Model", "Value": ["12xx series I believe"]}, {"Name": "Size", "Value": ["Full Size"]}, {"Name": "Model Year", "Value": ["1970s"]}, {"Name": "Product Line", "Value": ["Deacon Breadwinner Solid Body Series"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}]}, "HitCount": 370, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=4275946", "StoreName": "GPL Estates remarK-able Vintage"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 700.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 5, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Condition is as described in description and thru email and pictures. Expect NO unpleasant surprises.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}