{"BestOfferEnabled": false, "Description": "Gretsch G6122T-FM Mint Players Edition Amber Flame Country Gentleman Guitar 20 SKU: SS2619 Brand: GRETSCH Condition: Used Body Type: Hollow String Configuration: 6 String Dexterity: Right-Handed Body Color: Amber Flame Country of Manufacture: Japan Model: G6122T-FM MPN: 2401236820 UPC: 885978770472 STREET SOUNDS THE LARGEST AUTHORIZED GRETSCH DEALER IN THEWORLD IS PROUD TO OFFERTHIS: GRETSCHG6122T-FM AMBER FLAME COUNTRY GENTLEMAN PLAYERS EDITIONGUITAR WEIGHT: 7LBS. 8OZ.SUPER MINT CONDITIONPHOTO OF ACTUAL GUITAR2018 PRODUCTIONGRETSCH HARDSHELL CASE INCLUDEDSET UP INCLUDEDFACTORY WARRANTY INCLUDEDSHIPPING IN CONTINENTAL U.S. INCLUDED Reinvigorated for modern players who demand the pinnacle of performance and tone from their guitar, the Gretsch G6122TFM Players Edition Country Gentleman Hollow Body with String-Thru Bigsby and Flame Maple is packed with the sound and style that made the original a classic. With updated, performance-oriented features this instrument is destined to become an indispensible part of your guitar collection. Premium features include a laminated flame maple body, dual High Sensitive FilterTron humbucking pickups that provide pristine high end, glassy midrange, robust low end and balanced harmonics for tone that blends seamlessly with other instruments, and innovative Gretsch ML bracing that is specifically voiced for the thinner, 2.25 body and produces distinct tone by synchronizing the top and back vibrations for harmonious tone without clashing overtones. The control complementseparate bridge and neck volume controls, three-way pickup switching, no-load master tone and master volumeallows for near-infinite tonal variations. The all-new Gretsch Squeezebox paper-in-oil caps add smooth vintage tone while the treble bleed circuit lets your guitar retain all of its tasty clarity when rolling the volume control down. 12-radius ebony fingerboard with 22 medium jumbo frets and striking pearloid Neo-Classic thumbnail inlays tops a maple neck with a comfortably familiar standard U-shaped profile for fluidly easy playing. Highly expressive, the Bigsby B6GP vibrato tailpiece and pinned rocking bar bridge combine with the GraphTech TUSQ XL nut for stable tuning. In a uniquely Gretsch touch, the Bigsby tailpiece is now string-through, making it quicker (and easier) to change strings as well as providing increased vibration transfer for enhanced sustain. A treat for the eyes and ears, this guitar is a highly-tuned music machinefrom the stately Amber Stain finish to the shining gold Gotoh die-cast locking tuning machines, gold G-Arrow control knobs, F Holes, gloss urethane finish and gold vintage thick plexi pickguard with Gretsch logo. Engineered for todays player who requires the most from their instrument, the Players Edition Country Gentlemen with String-Thru Bigsby and Flame Maple updates authentic classic Gretsch style and sound with modern innovations. Includes a deluxe hardshell case. Model Name G6122TFM Players Edition Country Gentleman with String-Thru Bigsby, Filter'Tron Pickups, Flame Maple, Amber Stain Model Number 2401236820 MSRP $3,999.00 Series Gretsch Professional Collection Color Amber Stain Build Hollow Body Body Laminated Flame Maple Body Shape Country Gentleman Bracing ML Bracing Body Binding White with B/W/B Purfling Body Back Laminated Flame Maple Body Top Laminated Flame Maple Body Depth 2.25\" (57 mm) Neck Material Maple Neck Finish Gloss Neck Shape Standard \"U\" Neck Binding White Scale Length 25.5\" (648 mm) Fingerboard Ebony Fingerboard Radius 12\" (305 mm) Number of Frets 22 Fret Size Medium Jumbo Nut Graph Tech TUSQ XL Nut Width 1.6875\" (42.86 mm) Position Inlays Pearloid Neo-Classic Thumbnail Neck Plate NA Bridge Pickup High Sensitive Filter'Tron Middle Pickup N/A Neck Pickup High Sensitive Filter'Tron Controls Volume 1. Neck Pickup, Volume 2. Bridge Pickup, Master Volume, Master Tone Pickup Switching 3-Position Toggle: Position 1. Bridge Pickup, Position 2. Bridge And Neck Pickups, Position 3. Neck Pickup Pickup Configuration Filter'Tron / Filter'Tron SPL Electronics N/A Bridge Rocking Bar Tuning Machines Gotoh Locking Pickguard Gold Plexi w/ Black Gretsch Logo Control Knobs G-Arrow Orientation Right-Hand Strings Nickel Plated Steel .011-.049 SET UP INCLUDEDGRETSCHHARDSHELL CASE INCLUDED STREET SOUNDS 30 DAY TRIAL PERIOD INCLUDED FREE SHIPPING IN CONTINENTAL U.S. INCLUDED LOCATED IN BROOKLYN, JUST 4 MILES FROM THE ORIGINAL GRETSCH FACTORYCONTAINS ONE OF THE LARGEST INVENTORIES OF GRETSCHGUITARSANYWHERE IN THE WORLD. WE WOULD LIKE TO THANK FRED GRETSCH AND JOE CARDUCCIFOR THERE MULTIPLE VISITS TO OUR SHOP AND CONTINUED SUPPORT OF THE GREATEST GUITAR BRAND EVER PRODUCED ALL NEW GRETSCH GUITARS INCLUDE FACTORY WARRANTY ALL USED GRETSCH GUITARS INCLUDE STREET SOUNDS 1 YEAR WARRANTY ANY GUITARLISTED WITH FREE SHIPPING IS FOR CONTINENTAL U.S. ONLY Gretsch is a registered trademark of Fred W. Gretsch Enterprises.", "ItemID": "292831859096", "EndTime": "2018-12-22T18:00:11.000Z", "StartTime": "2018-11-24T18:45:15.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gretsch-G6122T-FM-Mint-Players-Edition-Amber-Flame-Country-Gentleman-Guitar-20-/292831859096", "ListingType": "FixedPriceItem", "Location": "Brooklyn, New York", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2928318590968080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/ODUwWDEyODA=/z/kB4AAOSwEwhb-Zw6/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDYzOA==/z/roEAAOSwXAxb-Zw6/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDYzOA==/z/pfUAAOSws~pb-Zw6/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDYzOA==/z/324AAOSw-yJb-Zw6/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDYzOA==/z/FM8AAOSwVHpb-Zw6/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDYzOA==/z/pxYAAOSwPXFb-Zw6/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDYzOA==/z/FJwAAOSw9g1b-Zw6/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDYzOA==/z/MoUAAOSwg05b-Zw6/$_12.JPG?set_id=880000500F"], "PostalCode": "11209", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "rockystreetsounds", "FeedbackRatingStar": "TurquoiseShooting", "FeedbackScore": 26916, "PositiveFeedbackPercent": 99.9, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1899.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1899.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "s***4", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 402}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "GB", "CN", "MX", "DE", "JP", "FR", "AU", "DK", "RO", "SK", "BG", "CZ", "FI", "HU", "LV", "LT", "MT", "EE", "GR", "PT", "CY", "SI", "SE", "KR", "ID", "TH", "BE", "HK", "IE", "NL", "PL", "ES", "IT", "AT", "BS", "IL", "NZ", "SG", "CH", "NO", "SA", "UA", "AE", "QA", "KW", "BH", "HR", "MY", "CO", "PA", "JM", "BB", "BD", "BM", "BN", "BO", "EG", "GF", "GG", "GI", "GP", "IS", "JE", "JO", "KH", "KY", "LI", "LK", "LU", "MC", "MO", "MQ", "MV", "NI", "OM", "PK", "PY", "RE"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gretsch G6122T-FM  Mint Players Edition Amber Flame Country Gentleman Guitar  20", "ItemSpecifics": {"NameValueList": [{"Name": "UPC", "Value": ["885978770472"]}, {"Name": "Brand", "Value": ["GRETSCH®"]}, {"Name": "Body Type", "Value": ["Hollow"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Body Color", "Value": ["Amber Flame"]}, {"Name": "Country of Manufacture", "Value": ["Japan"]}, {"Name": "Model", "Value": ["G6122T-FM"]}, {"Name": "MPN", "Value": ["2401236820"]}]}, "HitCount": 433, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=157392609", "StoreName": "STREETSOUNDS NYC"}, "Country": "US", "ReturnPolicy": {"Refund": "Money back or replacement (buyer's choice)", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": true, "QuantitySoldByPickupInStore": 0, "SKU": "SS2619", "NewBestOffer": false}