{"BestOfferEnabled": false, "Description": "Powered by Frooition Pro Shop Search 2012 Fender Kurt Cobain Mustang Electric Guitar - Fiesta Red w/Gig Bag MIJ Click here to view full size. Full Size ImageClick to close full size. Item Description 2012 Fender Kurt Cobain Mustang Electric Guitar in very good condition with little to no play wear and just a few minor dings and scratches. Cool Fiesta Red finish. The original pickguard was replaced with a WD white pickguard. The guitar has a nice action and the maple neck with a \"C\" profile feels great. The frets are in excellent condition. The pickups have a good tone and the Seymour Duncan JB bridge pickup that is directly mounted to the body, has a strong output. The electronics let you have both pickups on \"in phase\" and \"out-of-phase\", giving you even more sonic choices. The guitar is equipped with an \"adjusto-matic\" bridge, vintage style tuners and the neck plate has been swapped to a Fender \"F\" plate, like the ones on Kurt's guitars. This is a great playing and sounding Mustang in a cool color and in very good condition. Looks, plays and sounds great. Includes the gig bag. The tremolo arm is missing and is NOT included. Made in Japan. Serial Number: JD12006901 Weight: 7 lbs. 5 oz. Fender introduces a Mustang inspired by a true grunge legend: Kurt Cobain When Kurt Cobain hit the stage, it was very often with a Mustang® guitar—an enigmatic anti-hero figure with an esoteric anti-hero instrument. It’s with great pride then that Fender introduces the Kurt Cobain Mustang, which evokes the man, the band, the sound and the times, and gives an authentically crafted nod to one of the most unlikely guitars to ever find itself at the center of a musical maelstrom.See for yourself—go back and watch the famous 1991 video for “Smells Like Teen Spirit,” and there he is with it is slung over his shoulder. Or think back to when you saw them on the ’93-’94 In Utero tour, when he seldom went onstage with anything but a Mustang. Quite often and especially later on, Mustangs were a big influence on Kurt Cobain's distinctive sound.Inspired by his arsenal of modded guitars, the new Fender Kurt Cobain Mustang boasts highly distinctive features including an angled single-coil Mustang neck pickup and ferocious Seymour Duncan® JB humbucking bridge pickup mounted directly to the body, dual on-off/phase in-out switches for each pickup, a polyester-finished alder body and an Adjusto-Matic™ bridge with dynamic vibrato tailpiece.Other features include the classic 24” Mustang scale length, C-shaped maple neck with urethane finish, 7.25” radius fretboard with 22 vintage-style frets and vintage-style ivory dot inlays, master volume and tone controls, vintage-style tuners, and chrome hardware. Key Features Alder body 24\" Scale C-shape maple neck Seymour Duncan JB bridge humbucker mounted directly to the body Mustang single-coil neck pickup Dual On/Off phase in-out switches for each pickup Adjusto-Matic® bridge Vintage Style Tuners About Us Payment Shipping Terms Returns About UsWe offer a large selection of quality pre-owned musical instruments and equipment from the industries finest manufactures including Akai, Ampeg, Boss, Denon, Digidesign, DigiTech, Epiphone, Fender, Gibson, Gretsch, Guild, Ibanez, Korg, Lexicon, Line 6, Mackie, Mesa Boogie, Marshall, Martin, MusicMan, MXR, Neumann, Peavey, Pioneer, PRS, Roland, Shure, Tascam, Taylor, TC Electronic and Yamaha. New gear arrives daily so check our store often. Lighthouse Sound, Inc. is proud to be an authorized dealer of the following brands of guitar effects pedals, pedal boards, amplifiers and accessories: Bearfoot FX, Bigsby, Cooper Stands, Dunlop, Earthquaker Devices, Ernie Ball, EVH, Fender Accessories, Keeley Electronics, Gretsch Accessories, Ken Smith Strings, Lava Cable, Martin Accessories, Mojo Hand FX, RotoSound, SnaKe Oil Strings, Snark Tuners, Suhr Guitars, Amps, Pedals and Pickups, Voodoo Lab and Wampler Pedals About Us Payment Shipping Terms Returns PaymentWe accept PayPal payments. All major Credit Cards are accepted through PayPal including Master Card, Visa, American Express and Discover. About Us Payment Shipping Terms Returns ShippingLighthouse Sound specializes in prompt, safe shipping. We take great care packaging every item to ensure safe shipment to you. We get your gear to you fast, most orders ship within 1 business day of payment clearance. Tracking information is uploaded to eBay and can be viewed from your eBay account. International customers are responsible for any duties, taxes, brokerage or other fees. Please check with your country's customs office to determine what these additional costs will be. These fees vary from country to country and we have no way to calculate them. About Us Payment Shipping Terms Returns TermsSales Tax - 7 % Ohio Sales Tax will be added to the total amount for all purchases delivered to Ohio. We take pride in our customer service and your satisfaction is very important to us. In the rare event that you have a problem with your item please contact us and we'll be happy to help. While all care is taken, any errors, omissions or variations in the item details are unintentional. About Us Payment Shipping Terms Returns ReturnsWe offer a 14 day return policy. Items must be returned to us within 14 days of the original delivery date. We ask that you please return the product in the original product packaging along with all included materials (manual, warranty card, all accessories) and in the original condition that it was received. Buyer is responsible for return shipping and insurance cost. Refunds will be issued upon return of the item less the original shipping charge and a 15% restocking fee will apply. Helpful Links More Items! This listing is currently undergoing maintenance, we apologize for any inconvenience caused. Powered by SixBit's eCommerce Solution", "ItemID": "352553560808", "EndTime": "2018-12-27T04:53:07.000Z", "StartTime": "2018-12-26T12:38:14.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2012-Fender-Kurt-Cobain-Mustang-Electric-Guitar-Fiesta-Red-w-Gig-Bag-MIJ-/352553560808", "ListingType": "FixedPriceItem", "Location": "Salem, Ohio", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/3525535608088080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/3kkAAOSw86BcC9Q~/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/H00AAOSwoVZcC9RC/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDU5/z/kDYAAOSwIs1cC9RE/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDU5/z/znwAAOSwGIZcC9RH/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/RiIAAOSwUMBcC9RJ/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/o3sAAOSwnhlcC9RL/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/GrYAAOSwp3dcC9RO/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/WbEAAOSwYTtcC9RQ/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/BrsAAOSw5tNcC9RW/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/DnsAAOSwhzhcC9RT/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/7foAAOSwNXpcC9RZ/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/LYgAAOSwUu5cC9Rb/$_57.JPG?set_id=880000500F"], "PostalCode": "44460", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "lighthouse_sound", "FeedbackRatingStar": "TurquoiseShooting", "FeedbackScore": 33092, "PositiveFeedbackPercent": 99.6, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 899.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 899.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "p***m", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 504}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "CA", "GB", "CN", "MX", "DE", "JP", "FR", "AU", "DK", "RO", "SK", "BG", "CZ", "FI", "HU", "LV", "LT", "MT", "EE", "GR", "PT", "CY", "SI", "SE", "KR", "ID", "TW", "TH", "BE", "HK", "IE", "NL", "PL", "ES", "IT", "AT", "BS", "IL", "NZ", "SG", "CH", "NO", "SA", "UA", "AE", "QA", "KW", "BH", "HR", "MY", "CL", "CO", "CR", "PA", "TT", "GT", "HN", "JM", "BB", "BD", "BM", "BN", "BO", "EG", "GF", "GG", "GI", "GP", "IS", "JE", "JO", "KH", "KY", "LI", "LK", "LU", "MC", "MO", "MQ", "MV", "NI", "OM", "PK", "PY", "RE"], "Site": "US", "TimeLeft": "PT0S", "Title": "2012 Fender Kurt Cobain Mustang Electric Guitar - Fiesta Red w/Gig Bag MIJ ", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Model", "Value": ["Kurt Cobain Mustang"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Color", "Value": ["Fiesta Red"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Model Year", "Value": ["2012"]}, {"Name": "Modified Item", "Value": ["Yes"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Items Included", "Value": ["Tremolo arm is missing"]}, {"Name": "Modifications", "Value": ["Pickguard and neckplate"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}]}, "HitCount": 27, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=22579709", "StoreName": "LHSound"}, "Country": "US", "ReturnPolicy": {"Refund": "Money back or replacement (buyer's choice)", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": true, "ConditionDescription": "2012 Fender Kurt Cobain Mustang Electric Guitar in very good condition with little to no play wear and just a few minor dings and scratches.", "QuantitySoldByPickupInStore": 0, "SKU": "43415", "NewBestOffer": false}