{"BestOfferEnabled": false, "Description": "LTD MH-330FR The ESP LTD MH-330FR Electric Guitar is a working musicians guitar with pro features. A super comfortable and fast thin-U maple neck with 24 XJ frets on a rosewood fingerboard complement the warm tone of the mahogany body by adding bite. Floyd Rose Special bridge offers smooth and stable tremolo dives and ESP ALH-200 active pickups pump out searing hot tone. This model is a super clean N.O.S. (new-old-stock) model that looks even better than the pictures because of it's finish that looks either blue or purple, depending on what angle it's viewed from. ESP LTD MH330FR Electric Guitar SpecificationsConstruction: Bolt-On Scale: 25.5 in. Body: Mahogany Neck: Maple Fingerboard: Rosewood Nut: 42mm Neck Contour: Thin U Frets: 24 XJ Hardware: Black Nickel Tuners: ESP Bridge and Tailpiece: Floyd Rose Special Pickups: ESP ALH-200 Controls: 3-Way Switch Master Volume Master ToneReturns & Replacements GuitarBassPro.com Amp-Shop (BassExchange.com) has a 2-week money back return policy (less shipping costs). If you are not satisfied with a product purchased from GuitarBassPro.com Amp-Shop (BassExchange.com), simply call or e-mail us within seven days of receipt to arrange the details of your return. Should you decide to return your shipment, please follow the return steps printed on the back of your invoice and pack your return carefully to prevent damage during shipment. All returns must: 1. Include a return authorization number; 2. Be in the original packaging complete with all collateral materials such as cases, straps, cables, care kits, certificates of authenticity, warranty cards, manuals, and any other materials that originally shipped with the instrument. 3. Be in brand-new condition, showing no signs of wear or use such as belt-buckle or pick scratches, scuffs, dings, or scrapes on the instrument or collateral materials. No items will be accepted unless accompanied by a return authorization number, valid for 7 days only. Note: All returns are subject to inspection and a 20% restocking fee, to cover our tech time, and shipping/handling/insurance fees. Returns of special order merchandise and drop-ship items may be subject to manufacturers' restocking fees. Please allow a minimum of two weeks from the time we receive your return for your refund or reshipment to arrive. If paid by credit card, please allow up to two billing cycles for your credit to appear on your statement. (Sorry, but no returns are accepted on microphones, videos, books, pickups, raw frame speakers, mouth-blown instruments, and Special Order items.) Free Shipping offer: A Free Shipping offer is valid on qualified items. Qualified items are identified on product information pages with free shipping graphic. - Basic shipping will be selected by GuitarBassPro.com (BassExchange.com) for the Free Shipping offer. - Free shipping offer is limited to \"In Stock\" items only. - FREE Shipping charges are available for the lower 48 states only. Please contact us for all other US states (HI, AK, PR) and/or an international shipping quote. Due to international shipping limitations (each country has a shipping dimensions limit) not all items can be accepted by USPS service. We always can check the alternative shipping carriers and the method of shipping. If a shipping charge does apply, the charge will appear in your shopping basket at checkout. - This offer is for a limited time only. GuitarBassPro.com (BassExchange.com) reserves the right to end or change this free shipping offer at any time.***Products purchased from The Amp Shop are fully checked before being shipped to insure full customer satisfaction. In instances where any packaging has been altered, the customer understands that all products sold as \"new\" are indeed new and are covered by full factory warranty where applicable. As an authorized dealer for most of the brands we sell, we take great pride in making sure our customers are fully satisfied with their purchase not only when their products are received, but long afterwards as well.***", "ItemID": "382390321810", "EndTime": "2019-02-18T01:46:40.000Z", "StartTime": "2018-02-24T02:53:16.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/LTD-MH-330FR-/382390321810", "ListingType": "FixedPriceItem", "Location": "North Hollywood, California", "PaymentMethods": ["PayPal", "VisaMC", "Discover", "AmEx"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/3823903218108080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg4MTg=/z/VQsAAOSwcgxakNMd/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDE1/z/42IAAOSwUjpakNMm/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg4OTg=/z/bNkAAOSwMlRakNMv/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/ATcAAOSweDhakNM3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/aV0AAOSwkL5akNM~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/0mcAAOSwooRakNNH/$_57.JPG?set_id=8800005007"], "PostalCode": "91601", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "amp-shop", "FeedbackRatingStar": "Red", "FeedbackScore": 3946, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 374.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 374.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "n***n", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 534}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "LTD MH-330FR", "ItemSpecifics": {"NameValueList": [{"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Brand", "Value": ["LTD"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Model", "Value": ["MH-330FR"]}]}, "HitCount": 858, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1135067", "StoreName": "Amp-Shop"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "14 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalRefund": "MoneyBack", "InternationalReturnsWithin": "14 Days", "InternationalReturnsAccepted": "ReturnsAccepted", "InternationalShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "N.O.S.  (new-old-stock)", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}