{"BestOfferEnabled": false, "Description": "Untested All items sold as is,Few hours home playing time on this (for real, original crap strings), 25 more guitars to be posted for sale: no reserve, most are like this- pretty much new, all have some minor flaw/ding or other- I will describe flaws. these are tough to photograph- glare, reflections, dust, fingerprints...but they will polish nice. Photo shows condition- took few angles to reduce glare questions. tuners need polish, have some tarnish. Look at my pics, you can see the dust. there is no wear on the frets and foam still under bridge. Beautiful, cool guitar: cheap. tires and rent can wait. ES-175The legendary ES-175 is the “bridge” guitar between the old world and the new. Featuring a Florentine cutaway and two Alnico Classic™ humbucker pickups, the ES-175 has all the bark, bite, and projection of an archtop plus the complex tones that can only come from the combination of humbucker pickups and tone woods. The ES-175 originally debuted in 1949 and became instantly popular for offering players who sought the electric archtop “Wes Montgomery” L-5 sound in a less expensive alternative. In 1957 when the ES-175 switched from single coil to humbucker pickups, it quickly became a favorite for guitarists in every genre and can be heard on scores of hit records. Three generations of players have made their mark on the ES-175 including Elvis Presley lead guitarist Scotty Moore, Pat Metheny, Joe Pass, and Green Day’s Billy Joe Armstrong. The Epiphone ES-175 Reissue is a perfect fit for any player who wants the tone of an archtop with the reach of a Les Paul! SPECIFICATIONSBodyLaminated mapleTopLaminated mapleNeckHard mapleNeck ShapeSlimTaper™ “C” shapeNeck JointGlued-inScale Length24.75”Fingerboardrosewood with parallelogram inlaysFingerboard Radius12”Neck PickupAlnico Classic™ humbuckerBridge PickupAlnico Classic™ humbuckerControls2-volume, 2-tonePickup Selector3-way Epiphone all-metal toggleBridgeFloating rosewood base with Tuno-O-Matic™ BridgeTailpieceTraditional TrapezePickguard3-ply black/white/blackNut Width1.68”HardwareNickelTunersGrover® 16:1ColorVintage Sunburst (VS)StringsD'Addario® 1, 14, 19 (wound) 30, 41,52 Epiphone ES-175: Classic Materials, Classic Sound.Epiphone is the world’s most popular archtop guitar maker and for the first time, this time-honored workhorse is affordable to beginners and professionals with all the tone and quality construction of the original but without the vintage price tag. The ES-175 features a Vintage Sunburst finish on a maple top and body with a hard maple, 24.75” scale SlimTaper™ “C” neck. The neck features a bound rosewood fingerboard with split parallelogram inlays and a 1.68” nut. Best of all, the Florentine cutaway gives the ES-175 a striking look with lots of room to reach the upper frets for leads and harmonics. The Historic Sound of Alnico PickupsThe tone of the ES-175 comes from two Alnico Classic™ humbucker pickups that provide players an endless palette of colors and shades. The pickups are framed by a vintage style 3-ply pickguard The Alnico Classic™ are inspired by the famous “PAF” humbuckers from the late ’50s that revolutionized the sound of guitar and within a few short years became the standard for great tone. The combination of acoustic construction, time proven tone woods, and the Alnico Classic™ make the ES-175 anyone’s go-to guitar.The ES-175’s ’50s style controls feature 1-bridge volume, 1-neck volume, 1-bridge tone and 1-neck tone - all equipped with Epiphone’s full-size 1” 500K ? potentiometers. Rounding out the controls is an Epiphone all metal pickup selector switch with a premium, rim-mounted output jack. Epiphone HardwareThe bridge on the ES-175 features a traditional floating rosewood base supporting a fully-adjustable Tune-o-matic™ bridge. Grover® 16:1 ratio machine heads provide long-lasting, dependable tuning stability and accuracy and an Epiphone classic trapeze tailpiece. Buy it, play it, spark some new creativity, take care of it, get bored with it, sell it for what you paid- (keep the boxes). Whatever gets you to play moar ! Amplifiers coming: Randall Mesa Boogie Weller Guitar Research Many, many more quality musical instruments: violins, yamaha sax, keyboards, digital drums, recording gear. studio rack gear. Gotta go, am moving into trailer. Deals galore, prices are fair for fairly mint gear. 20 years on ebay this Summer. add me to your favorites We do not accept P.O. BOXES - PLEASE PROVIDE A PHYSICAL ADDRESS. Am human, make errors. I fix. Beep Bop.", "ItemID": "283287329755", "EndTime": "2018-12-09T21:42:15.000Z", "StartTime": "2018-12-02T21:42:15.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Epiphone-ES175-Guitar-Vintage-Sunburst-Alnico-Classic-/283287329755", "ListingType": "Chinese", "Location": "Manhattan, Illinois", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2832873297558080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg4MDg=/z/IFMAAOSwsQJcBE7v/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg4ODM=/z/NUkAAOSwqxdcBE7t/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzIxWDEyMDA=/z/VuoAAOSwwkRcBE7c/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg4ODQ=/z/gpgAAOSwlINcBE7n/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg3Nzg=/z/qkcAAOSwa1hcBE71/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU3NFgxMjAw/z/bOcAAOSwUpFcBE7y/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MVgxMjAw/z/QGkAAOSwEphcBE7o/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDY=/z/-T0AAOSwDEBcBE7q/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzI2WDEyMDA=/z/7qQAAOSwOWdcBE7r/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg4MDc=/z/yZ4AAOSw-ghcBE7w/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg3NDI=/z/VOYAAOSwC9hcBE7z/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzEwWDEyMDA=/z/C3EAAOSwc6ZcBE8O/$_57.JPG?set_id=8800005007"], "PostalCode": "60442", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "diesel.army", "FeedbackRatingStar": "Red", "FeedbackScore": 1067, "PositiveFeedbackPercent": 99.5}, "BidCount": 2, "ConvertedCurrentPrice": {"Value": 295.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 295.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "g***9", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 790}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Epiphone ES175 Guitar Vintage Sunburst Alnico Classic", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "Model", "Value": ["ES-175"]}]}, "HitCount": 242, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 300.0, "CurrencyID": "USD"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Beautiful wallhanger needs to be played.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}