{"BestOfferEnabled": false, "Description": "MIJ, made in japan, Gibson, Lespaul, White, SG, Höfner, Duesenberg, Ibanez, ATELIER Z, ARIA, ESP, Caparison, Killer, COMBAT GUITARS, GUYATONE, Greco, Sugi Guitars, TEISCO, DEVISERA, Nil, Bacchus, VANZANDT, Fernandes, Fender Japan, Fujigen, MOON GUITARS, momose, Yairi Guitar, YAMAHA, TOKAI, Zemaitis, VOX, B, C, Rich, Epiphone, Gibson, Gretsch, Suhr, Schecter, Charvel, Jackson, Dean, Tom Anderson, Fender, Paul Reed Smith, Melancon, Mosrite, Rickenbacker, Robert Benedetto, Washburn, Ibanez, kramer, EDWARDS, Burny, Grassroots, 1996 Ibanez RG680 BK All Original ~ Fujigen ~Players Condition !!Made in Japan Down from here. Photo is dent and scratches, etc.. About scratches that are hard to see. To make it easy to understand the condition of the scratches, I lighted the light strongly. 1996 Ibanez RG680 BK All Original ~ Fujigen ~Players Condition !!Made in Japan Body Bass wood. Neck 1-piece maple. Wizard. Scale 24F Jumbo. 25.5inch ( 648mm ). Fender long scale. Nut Width About 1.69inch (43mm). Pickup Neck : IBZ QM1(H). Mid : IBZ QMS1(S).Bridge : IBZ QM2(H). Control 1 Volume, 1 Tone / 5-Way lever. Bridge Lo Pro Edge. Machine heads Made in Japan. Color Black. Weight About 8.157pound ( 3.7Kg ) This is Used Guitar. There are many paint clacks on the body top. They are stand out according to the influence of light and the viewing angle. There are scratches and dents. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. It was manufactured in 1996 by Fujigen factory. The RG-5 and 6 series are used by many overseas professional guitar players. Thin neck shape is RG's tradition. It is a neck shape that you can play a technical solo part without stress. We adopt All Access Neck Joint which can play high position easily. Hardware is also adopted for JEM and PGM, and adopts Lo-Pro EDGE with high evaluation. Unfortunately, I will starting an auction from $ 10, as state of body painting is bad. In order to make the paint crack easier to understand, I strongly irradiated the light. You may care about paint cracks or you may do not care. However the Neck state is excellent !! The remaining amount of the Frets are many. You do not have to change the new frets for some time. Accuracy of the product is high. Ibanez is Great !! About guitar play, Current state, the space between the strings and the frets is very narrow. Remaining amount of the Frets is many, and the Fret type is JUMBO. Thanks to that, you can play the guitar with a light touch. I feel easy to play the guitar. I recommend to technical guitar players. Playability is high. The Pickups is very powerful sound. I feel good distortion sound. It is the best for Heavy Metal music. It is cleanliness. I polished with guitar exclusive polish, so it is in a very clean state. I after the finger board cleaning, painted beeswax. The aim is moisturizing and and protection. Current neck condition, very good ! roughly straight ! There is no problem with the Truss rod and it can be adjusted. Remaining Frets are 95% on average. You can play immediately after it is delivered to you. I was set new strings. Regular tuning. ( Inch : 009, 011, 016, 024, 032, 042 )Guitar playing, is comfortable. All is working well. It is in a very good condition. The Truss rod Wrench is not included. All Original.Note : I changed the bridge's tone pot and the output jack to new one. The strap pin has been changed to the lock type. Look at the photos, please verify by yourself! It will be professionally pack. Double air packing. And ships inside a sturdy cardboard box. This electric guitar is USED. Please consider it when bidding. Thank you. Payment I accept PayPal only. Please pay within 3 days after the auction closed. Shipping Worldwide shipping from Japan! EMS / Shipping includes a tracking number. / / / Destination cost Delivery time / / / Asia : $1004 ~ 7daysUS Canada : $1205 ~ 8 daysEurope : $1406 ~ 10 daysOceania : $1205 ~ 8 daysSouth America : $2408 ~ 12 days This item is shipped within 3 business days after payment is confirmed. Terms of Sale International buyers - Please Note: Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer's responsibility. Please check with your country's customs office to determine what these additional costs will be prior to bidding/buying. These charges are normally collected by the delivering freight (shipping) company or when you pick the item up -do not confuse them for additional shipping charges. Please contact us first with 30 working days for any returns, Buyer pays shipping cost from buyer's country to Japan when being returned. In case of return, the shipping cost won't be refunded. We sell various kinds of Japanese products to international customers. Our goal is to provide the best quality products and service and your satisfaction is the most important to us. Happy bidding!! Thank you !!", "ItemID": "254124961472", "EndTime": "2019-02-22T05:00:52.000Z", "StartTime": "2019-02-15T05:00:52.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1996-Ibanez-RG680-BK-All-Original-Fujigen-Lo-Pro-Edge-Wizard-Made-Japan-/254124961472", "ListingType": "Chinese", "Location": "Nagoya-shi,Kita-ku, Aichi", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2541249614728080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTUyMlgxNjAw/z/He0AAOSwl2hcZjKV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/XxcAAOSwvSNcZjKa/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/24sAAOSw0yVcZjKg/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/0ZgAAOSwLXBcZjKl/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/doIAAOSwj8VcZjKq/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNTk5/z/ubcAAOSwoW1cZjKq/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/6UIAAOSw-RFcZjKy/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI5OFgxNjAw/z/a2QAAOSwDK9cZjK3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg1NDI=/z/ZH8AAOSwvcBcZjK5/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/tb0AAOSwpCFcZjLC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI2MFgxNjAw/z/u~oAAOSwA4VcZjLG/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/3hQAAOSwW0tcZjLK/$_57.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jguitar-shop", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 376, "PositiveFeedbackPercent": 100.0}, "BidCount": 41, "ConvertedCurrentPrice": {"Value": 264.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 264.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "o***r", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 112}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Americas", "Europe", "Asia", "AU"], "Site": "US", "TimeLeft": "PT0S", "Title": "1996 Ibanez RG680 BK. All Original. Fujigen. Lo Pro Edge. Wizard. Made in Japan.", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Ibanez"]}, {"Name": "Model Year", "Value": ["1996"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Model", "Value": ["RG680 BK"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "Product Line", "Value": ["Ibanez RG"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Series", "Value": ["Original"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["F625441"]}]}, "HitCount": 1017, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "JP", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 269.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["APO/FPO", "Africa"], "GlobalShipping": false, "ConditionDescription": "Players Condition. This is Used Electric Guitar. The electric guitar when connect to the amplifier, sound output is normal. There are scratches and Dents. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. Please Read the descriptions for details.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}