{"BestOfferEnabled": false, "Description": "Item DescriptionTitle:1984 Gibson USA Explorer 3 Camouflage Electric Guitar Made One Year OnlyDescription:EXPLORER III - offset hourglass Explorer-style alder body; set maple neck; 22-fret rosewood fingerboard with pearl dot inlays; hockey stick Explorer-style headstock with gold Gibson logo decal; six-on-one-side tuners; tune-o-matic bridge with a stop tailpiece or optional locking tremolo bridge; three soapbar P-90 pickups; two knobs (v; tone); two three-way pickup switches; chrome hardware; available in Alpine White; Camouflage; Ebony; or Red finish; 24.75 in. scale; mfg. 1984-85. Gibson Explorer 3 this is a pretty cool old Gibson and these Explorer 3 guitars were only made the one year as far as I know. This 1984 Explorer 3 for sure is ebony wood for the fretboard and not rosewood as the Blue Book Info is incorrect at least to this specific Explorer 3. The Gibson Branded Kahler Tremolo probably was an original factory option but I do not know this for sure and this guitar comes with two different tremolo bars. These Explorer 3 guitars had 3 of the P-90 Soapbar single coil pickups and one volume and one tone knob; and two pickup selector switches and the tuners are an upgrade to Grover Tuners. This vintage 84 Explorer 3 is in very good condition it does present as a used guitar and shows some normal signs of past usage over 30+ years; including one small screw is missing from the electronics cavity plastic plate on the backside. There is some slight but noticeable dings/dents and or nicks and chips to the camo finish of this guitar; one dent is pictured by the input jack; also there is a small paint chip on tip of the headstock; as well as some few pictured scratches and scrapes most noticeable on the topside of the guitar. Also there is some crazing/checking or finish age cracks to the camo paint finish of the guitar; and these are just surface finish cracks and do not affect play ability at all. This Explorer 3 plays and sounds very nice the set neck is straight and the string action is low; and the ebony board and 22 frets are in great shape 95% + usable life left in the frets. Before I bought the guitar the previous owner had it professionally set up with neck relief adjusted; and intonation set and the electronics were serviced including the vol/tone pots were deoxidized and cleaned. This vintage 1984 somewhat rare and HTF Gibson Explorer 3 will ship in its HSC which is also in very good condition. Size: Not provided. Condition: See above. Stock Number: A021788 Terms of Sale Buy It Now: If this item has a Buy It Now option, then we have reviewed comparable sale prices on eBay for this item and have established a Buy It Now price based on our research. If you feel the price is fair, please use the Buy It Now button to immediately purchase and pay for the item. If you are buying multiple items from us, please do not use the Buy It Now button, rather please follow the instructions below for buying multiple items. Make Offer: If this item has a Make Offer option, then please submit a reasonable offer, based on comparable eBay sale prices, which we can accept. We are more likely to accept your offer if the price is close to the Buy It Now price and you add a comment supporting your offer. We want to sell items quickly, so we can continue to bring new items to market, so we will try our best to work with you. Keep in mind that we may be negotiating with multiple buyers at the same time, so the first offer we accept wins the item. If we already have the lowest price on eBay, please use the Buy It Now option. Buying Multiple Items: To purchase multiple items from us using the eBay website: 1) add all the items to your shopping cart by clicking the \"Add to cart\" button on each eBay listing, 2) from your eBay shopping cart, click the \"Request total from seller\" button located at the top right of the page, 3) on the next page (Request total from seller page), click the \"Commit to buy & submit request\" link at the bottom of the page. This will reserve the items in your cart and send us a request to combine the shipping. We will then send you a single combined invoice to pay with the correct combined shipping amount. Please note: the eBay app may not support this functionality. Payment: We accept Paypal on all our listings. If you use the Buy It Now option, an immediate payment will normally be required. If you are buying multiple items from us, please do not use the Buy It Now button, rather please follow the instructions above for buying multiple items. If we accept your offer, we will send you an invoice through eBay, and payment is due within 24 hours. If you win an auction, we will send you an invoice through eBay, and payment is due within 24 hours. Shipping: We ship all of our items in-house using all new boxes and cushioning materials. We use shipping services from the USPS and UPS, so more than one option may be available under the 'Shipping and Payments' tab above. We will ship most of our items internationally directly through the USPS. All international shipments will be declared as commercial and at their full value. Any customs charges and/or import duties are always paid directly by the buyer in their local country. The eBay Global Shipping Program may also be an option for certain items (please contact us before buying the item, so we can add that option to the listing). Please use the eBay shipping calculator to obtain the cost of shipping and handling. In some cases, the eBay shipping calculator may not work, so please contact us directly for a shipping quote. We try to keep our shipping costs as low as possible and only charge our actual cost of shipping. If our actual cost of shipping turns out to be less than what we charged, we will refund you the difference. We always combine shipping on multiple items to save you money (see the instructions above for buying multiple items). Our handling time is one business day. Free local pickup is always available (please contact us before buying the item, so we can add a local pickup option to the listing). Kansas Sales Tax: Sales tax will only be collected on non-exempt shipments within the state of Kansas and on local pickups. If you live in Kansas and are exempt from Kansas sales tax, please email us your Kansas Resale Exemption Certificate, and we will remove the tax at checkout. Sales tax will not be collected on shipments outside the state of Kansas. Return Policy: We carefully inspect all of our items before listing, so we only allow returns if the item you receive differs significantly from the description and photos. Please ask any questions you may have about an item before purchasing the item. Please contact us within 48 hours after receiving the item if there is a problem. If we determine that a return is warranted, we will pay the return shipping. We want happy customers, so we always try to make it right. Feedback: If this transaction has met with your satisfaction, please leave us positive feedback and high seller ratings on eBay. If you cannot leave positive feedback or a 4 or higher seller rating, please contact us directly, before contacting eBay or Paypal, and give us a chance to make it right. We automatically return all positive feedback left for us. About Us Sunflower Auction Gallery is a Top Rated Plus eBay seller located in Overland Park, Kansas. We have been selling on eBay since 1999. We primarily sell items in the following categories: Antiques, Collectibles, Dolls, Pottery & Glass and Toys, although we will list pretty much anything of value on eBay. All of our items come from a smoke and pet-free environment. We look forward to doing business with you.", "ItemID": "223255254536", "EndTime": "2019-02-03T03:51:03.000Z", "StartTime": "2018-11-26T21:38:17.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1984-Gibson-USA-Explorer-3-Camouflage-Electric-Guitar-Made-One-Year-Only-/223255254536", "ListingType": "FixedPriceItem", "Location": "Overland Park, Kansas", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2232552545368080_2.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTM2MFg1NDA=/z/F54AAOSwq6Vb~Gjr/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTUyMVg5MDA=/z/M-YAAOSwM6Fb~Gjt/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg3MDc=/z/tI4AAOSwXItb~Gju/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTM4NFg4Njk=/z/u18AAOSwtYZb~Gjw/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjQzWDE2MDA=/z/f4YAAOSwvhxb~Gjx/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NTc5WDE2MDA=/z/4uYAAOSwzd9b~Gjy/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjcwWDE2MDA=/z/FTAAAOSwylBb~Gjz/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTMzNFg2OTk=/z/wuQAAOSwtjhb~Gj0/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NTc4WDEzNjU=/z/xWoAAOSwqxdb~Gj2/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjM3WDE2MDA=/z/QLYAAOSwEVlb~Gj3/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NDgyWDgyOA==/z/MFEAAOSwKtlb~Gj4/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NTQyWDEyMjY=/z/p7kAAOSwuQhb~Gj5/$_12.JPG?set_id=880000500F"], "PostalCode": "66223", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "sunflowerauctiongallery", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 10406, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1995.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1995.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "y***m", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1435}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "1984 Gibson USA Explorer 3 Camouflage Electric Guitar Made One Year Only", "HitCount": 860, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=47548865", "StoreName": "Sunflower Auction Gallery"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "TopRatedListing": true, "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "SKU": "A021788", "NewBestOffer": false}