{"BestOfferEnabled": false, "Description": "Welcome! Please read entire description before bidding or asking questions! Winning bidder must pay for auction within 48 hrs of auction close. Bidders with less than 5 feedbacks, and/or multiple bid retractions, must contact me before bidding. I reserve the right to cancel bids from bidders with a sketchy bidding history. If you have questions, please ask before bidding! You are checking out a Line 6 Variax in excellent fully functional 100% condition. Cosmetically it is in excellent condition with no marks that I can see. It was used only a few times. Carry bag is slightly dirty and is missing one shoulder strap that had torn off, regular carry handle works as should, can still be worn over the shoulder just not as a back pack type vibe. Please see pics and judge for yourself! Line6 - Variax 700 Year of Manufacture: 2011 to Now Country Of Origin: Japan Color: Translucent Black Bound Neck: No Hardware Color: Chrome Case: None Modifications: Stock Documentation: No Documentation Electronics (Controls): 5 way switch, volume, tone, simulator selector Neck Wood: Maple Neck Type: Bolt On Fretboard Wood: Rosewood Pickup Configuration: line 6 custom Inlay Style: Custom Tail Type: Stoptail Top Wood: ASH Body Wood: Mahogany RETURNS I will accept returns up to 14 days from your receipt of item provided it's not as described and shows up here in the condition it left. I've had buyers try to swap their non-working components with mine before and then claim it doesn't work. It will have tamper proof tape on it. If that is broken, the return option is void. Auction includes the Line 6 Variax with carry bag shown and small plastic bag of tools shown. I highly recommend using Uship for Very delicate heavy or bulky items. They come to me pick it up and deliver it to you safely. You must go to their website and setup an account, (it takes 5 minutes) and make the arrangements yourself. I have had great dealings with this service, but in no way am I responsible for damage during their handling. It is located in West Ft Lauderdale area. Just give them your location and approximate dimensions, for example, \"Drum set with hardware\" they take bids with drivers passing my area to yours, or you can set a price you are willing to spend for the transaction, It works and its easy! Costs less than UPS or Fedex for heavy or bulky items! I use a great deal of packing material to make sure everything arrives safely and this will be shipped in a strong box. . Please keep that in mind when calculating your shipping . Check out my feedback regarding packing! Yes my shipping may be more money then the other guys....but isn't spending a couple of bucks more, better than getting your merchandise damaged? My handling fee covers extra packing material, and or my time to find the best box for your item! FYI, If you pay fast I ship fast! International bidders are responsible for duties. All shipping labels are being created through Paypal. When the label is made, Paypal will send you an email with the tracking information for your order. If you haven't received the email in a reasonable amount of time please make sure to check your SPAM folder. Payment is expected within 2 days of auction close. I accept PayPal only, for your protection and mine. If you don't have a Paypal account, please do not bid. Please note: I log all serial #'s so if you plan to purchase this for parts or swapping purposes then please don't even bother! Winning bidder must contact me within 48 hrs of auction close. If you have no feedback or multiple negative feedback, you must contact me before bidding or your bid will be withdrawn from the auction. If you have questions, please ask before bidding! My feedback rating is very important to me. So please contact me before leaving negative, or neutral feedback if you think your item has been represented incorrectly. I am only interested in a 100% positive experience for my buyers. Things can always be worked out. Thank you for looking. Paypal only within 48 hrs of auction close. _gsrx_vers_837 (GS 7.0.15 (837))", "ItemID": "183519638265", "EndTime": "2018-11-12T03:00:23.000Z", "StartTime": "2018-11-05T03:00:23.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/LIne-6-Variax-700-Gloss-Black-100-Working-Barely-Used-/183519638265", "ListingType": "Chinese", "Location": "Fort Lauderdale, Florida", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1835196382658080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA2M1gxNTk5/z/0u4AAOSwn1Fbw8hj/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2M1gxNTk5/z/~XsAAOSwu~5bw8hj/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2M1gxNTk5/z/2rUAAOSw7PJbw8hl/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2M1gxNTk5/z/k58AAOSwaXpbw8hl/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2M1gxNTk5/z/i1UAAOSwnFpbw8hm/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2M1gxNTk5/z/SHEAAOSwYcBbw8hn/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2M1gxNTk5/z/lyoAAOSw1i5bw8ho/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2M1gxNTk5/z/GF8AAOSwDkBbw8ho/$_3.JPG"], "PostalCode": "33321", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "protoolshd3-88", "FeedbackRatingStar": "Red", "FeedbackScore": 1072, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 400.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 400.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "8***6", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 262}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "LIne 6 Variax 700 Gloss Black 100% Working, Barely Used!", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Line 6"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "Body Material", "Value": ["Mahogany"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Size", "Value": ["Full Size"]}, {"Name": "Product Line", "Value": ["Variax"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}]}, "HitCount": 190, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=19142343", "StoreName": "protoolshd3-88"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 405.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Central America and Caribbean", "Europe", "North America", "Oceania", "South America", "RU"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}