{"BestOfferEnabled": false, "Description": "2017 Gibson Les Paul Classic Plus. Condition is Used. Shipped with USPS Priority to conus. In excellent condition, just gorgeous around 9 lbs. *Original hard shell case*Pouch, Gibson multi-tool,warranty and strap, papers etc.Excellent condition except for 2 holes (pickguard screws) and slight dulling where the pickguard touched.Upgraded pickups and wiring assembly as below (see pics)*Seymour Duncan SH-4 JB custom bridge*Seymour Duncan APH-2 Slash neck.*Les Paul ® Type Wiring Harness 50s Style Wiring Harness Mojo Tone Vitamin T PIO .022uF Caps CTS TAOT 525k Long Shaft Audio Pots. Black Varnish Spaghetti Tubing Comes with OHSC/ all papers, Gibson multi tool with velvet pouch, etc.Almost 2300.00 in Gorgeous classic plus excellence for 1400.00I love this guitar however I find my self preferring fatter 50s necks.Here are the exact specs from Gibson. An upgraded top and an exclusive finish. This Gibson 2017 Les Paul Classic Plus Electric Guitar comes in an exclusive finish. Crafted from premium tonewoods, the Les Paul Classic Plus carries a highly figured Grade-AA maple top, which looks absolutely stunning beneath this exclusive high-gloss, hand-sprayed nitrocellulose lacquer. Classic Les Paul Standard appointments such as acrylic trapezoid fingerboard inlays and cream body and neck binding are accompanied by a deceptively powerful pair of humbucking pickups mounted “open-coil” for a modified look that sits great with the guitar’s lack of pickguard, which also serves to show off the Les Paul Classic Plus’s gorgeous wood. And, to top it all off, players will appreciate its comfortable SlimTaper neck profile. As with the best Les Pauls crafted since the early ’50s, the Les Paul Classic Plus starts with the legendary tonewood pairing of a solid carved Grade-AA maple top glued to a Grade-A mahogany body. Marrying maple’s clarity and definition to mahogany’s richness and depth produces a tonal complexity that no single-wood guitar has ever matched. Its resonance and sustain are only further enhanced by the deep-set quarter-sawn mahogany neck with 17-degree back-angled headstock. Optimum playability is ensured by the SlimTaper neck profile and a 12-inch fingerboard radius for choke-free string bending. The guitar’s 22-fret fingerboard is made from rosewood that offers a clear tone and extreme durability. To pump up all this tonal goodness to the max, Gibson loads the Les Paul Classic Plus with a pair of Zebra '57 Classic and Classic Plus humbucking pickups. A pairing of Tune-o-matic bridge and stopbar tailpiece ensures solid sustain and accurate intonation, while a set of Grover locking looks great and makes tune-up a breeze. Each guitar comes protected in a hardshell case with plush lining, includes an owner’s manual and adjustment literature. Features Body Body shape: Single cutaway Body type: Solid body Body material: Solid wood Top wood: AA Figured Maple Body wood: Mahogany Body finish: High gloss Nitrocellulose Orientation: Right handed Neck Neck shape: SlimTaper Neck wood: Mahogany Joint: Set-in Scale length: 24.75 in. Truss rod: Standard Neck finish: Gloss Fretboard Material: Rosewood Radius: 12 in. Fret size: Medium jumbo Number of frets: 22 Inlays: Trapezoid Nut width: 1.69 in. (43 mm) Pickups Configuration: HH Neck: Zebra '57 Classic Middle: Not applicable Bridge: Zebra '57 Classic Plus Brand: Gibson Active or passive pickups: Passive Series or parallel: Not applicable Piezo: No Active EQ: No Special electronics: Hand-wired with orange drop capacitors.Controls Control layout: Volume 1, volume 2, tone 1, tone 2 Pickup switch: 3-way Coil tap or split: No Kill switch: No Hardware Bridge type: Fixed Bridge design: Tune-o-matic Tailpiece: Stopbar Tuning machines: Grover Locking Kidneys Color: Chrome Other Number of strings: 6-string Special features: Electronics, Exclusive finish Case: Hardshell case Accessories: Owner's manual, Truss rod wrench Country of origin: United States", "ItemID": "202602554440", "EndTime": "2019-03-01T01:01:09.000Z", "StartTime": "2019-02-20T03:14:54.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2017-Gibson-Les-Paul-Classic-Plus-/202602554440", "ListingType": "FixedPriceItem", "Location": "Aurora, Illinois", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2026025544408080_2.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTU5OVg3Nzg=/z/tgQAAOSwLtBcbMWY/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTU5OFg3NDE=/z/ecwAAOSwn2pcbMVM/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/OAUAAOSwpvRcbMVP/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/kuMAAOSwy2NcbMVS/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/f4UAAOSwAvNcbMVU/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/ngcAAOSwTJZcbMW-/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTU5OFg3Mzg=/z/5U0AAOSwFfJcbMXb/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/OyYAAOSw6DNcbMXv/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/00oAAOSwuHdcbMpR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/ClcAAOSwe0tcbMpb/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/X08AAOSwPaBccXyQ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/kM4AAOSwh0NccXym/$_57.JPG?set_id=8800005007"], "PostalCode": "60502", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mprette2011", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 327, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1375.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1375.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "v***j", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 891}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2017 Gibson Les Paul Classic Plus", "ItemSpecifics": {"NameValueList": [{"Name": "Product Line", "Value": ["Gibson Les Paul"]}, {"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model Year", "Value": ["2017"]}, {"Name": "Model", "Value": ["Les Paul Classic"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Body Type", "Value": ["Classical"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Size", "Value": ["Full Size"]}]}, "HitCount": 323, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 4, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}