{"BestOfferEnabled": true, "Description": "Hoo wee is this guitar pretty. I know they have these in various colors, but do not understimate the beauty of straight-up maple, let alone with Bubinga accents. The photos don't do it justice. This instrument is a head-turner. And the neck is one of the smoothest I've ever played. This is a 2013 model, has been treated lovingly its whole life and is basically in mint condition. And its sound is every bit as sweet as its looks. Plug this baby into a Vox or maybe a 3rd Power Extra Chimey and you will not leave your studio for a month. As the text from Sweetwater elaborates below, this guitar offers a lot of sonic possibilities. It comes in its original case which is nice and streamlined but protects it like a tank. Note: I will be travelling internationally from 12/13/18 - 1/3/19. I will have internet access during this time, but if it sells while I'm away, I will ship it promptly as soon as I return. I live in North Carolina and can easily ship to the U.S. or Canada. I don't sell often on eBay, but all my reviews have been very positive. Here's what Sweetwater says about this model: A Pedigreed Rocker with Deluxe AppointmentsThe Rickenbacker 360 is the deluxe version of the 330. In addition to the 330's jangly maple tones and classic good vibes, the 360 gives you rounded horns, a contoured top edge that rolls into back binding, and iconic triangle (\"shark fin\") fingerboard inlays. Though most of these updates are cosmetic, one of the coolest upgrades to the 360 is the Rick-O-Sound stereo output. This sends each of the Hi-gain pickups to its own amplifier, or straight into a recording medium for instant stereo guitars. The Rickenbacker was loved by artists like George Harrison and Roger McGuinn for its shimmering chord voicings, and Sweetwater is sure contemporary players will enjoy its top-class tones as well.All-maple construction provides a bright foundation Everything but the Rickenbacker 360's fingerboard is made from high-grade maple. Maple's density is partly responsible for the 360's famous sustain and top-end jangle and shimmer. Maple is also very stable, aiding in maintaining the structural integrity of the neck. The thick rosewood fingerboard adds a touch of warmth and harmonic richness to this otherwise bright instrument. Dot inlays give it the traditional 360 look.Hi-gain pickups and 5-knob layout allow for a wide range of tonesThe heart and soul of all Rickenbackers are the proprietary electronics. In the 360 electric guitar you'll find a pair of Hi-gain single-coils. These pickups deliver the stringiness of many other single-coils, but with an aggressive cut that has driven so many rhythm and lead guitar tracks through the decades. A 5-knob control layout with \"blend\" knob gives you a wide range of sounds to play with.Stereo Rick-O-Sound output opens up a palette of sonic possibilitiesRickenbacker spec'd the 360 with two output jacks. The first is a standard mono output. The second is a stereo Rick-O-Sound output, which outputs both pickups as a seperate signal. Just think about the possibilities! You can feed your 360's neck pickup into a clean American tweed for bass definition, then out your bridge pickup to an overdriven British stack for raucous tube grit. This option is also great for studio performers. By sending one signal to two sources, you can get an instant stereo track with only one performance.Rickenbacker 360 Semi-hollowbody Electric Guitar Features:Iconic guitar enjoyed by George Harrison, Peter Buck, and Roger McGuinnDeluxe upgrade to the 330Semi-acoustic maple body with cat's eye soundhole is lightweight and balancedContoured horns and rounded body edges roll into back binding", "ItemID": "223287513181", "EndTime": "2018-12-21T16:16:48.000Z", "StartTime": "2018-12-16T22:29:46.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Rickenbacker-360-6-String-Electric-Guitar-MapleGlo-Gorgeous-/223287513181", "ListingType": "FixedPriceItem", "Location": "Huntersville, North Carolina", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/2232875131818080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/GD0AAOSwRrlcFshN/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/uoUAAOSwiqBcFsg7/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/UtwAAOSwbX1cFsg7/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/D-IAAOSwjrFcFsg6/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/WbIAAOSwEJ1cFsg7/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/BV0AAOSwRF1cFsg7/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/RgwAAOSwvERcFsg5/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/ts0AAOSwmXpcFsg6/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/GxcAAOSw0YlcFsg6/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/~OwAAOSwhfRcFsg7/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5MDA=/z/OYcAAOSwyPFcFsg7/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTAwWDE2MDA=/z/HG4AAOSwjMtcFsii/$_32.JPG?set_id=880000500F"], "PostalCode": "28078", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "matsen_1122", "FeedbackRatingStar": "None", "FeedbackScore": 4, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1700.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1700.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "l***l", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 2108}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Rickenbacker 360 6-String Electric Guitar MapleGlo - Gorgeous! ", "ItemSpecifics": {"NameValueList": [{"Name": "Body Material", "Value": ["Maple"]}, {"Name": "Product Line", "Value": ["Rickenbacker"]}, {"Name": "Brand", "Value": ["Rickenbacker"]}, {"Name": "Model Year", "Value": ["2013"]}, {"Name": "Model", "Value": ["360"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Body Type", "Value": ["Semi-Hollow"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Body Color", "Value": ["MapleGlo"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Size", "Value": ["Full Size"]}]}, "HitCount": 84, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}