{"BestOfferEnabled": true, "Description": "For your consideration is a barely used WR7 from Jackson. Guitar has low miles on it, biggest ding is on the backside of the body...it's on one of the wings...rather small. Plays well and sounds killer. Capitol Guitars is an authorized Jackson dealer. We are fortunate to be the first dealer in line to receive the 2018 Jackson product line. ORDER WITH US TO GET YOUR GUITAR FASTER THAN ORDERING ANY PLACE ELSE! Please contact us with any questions. Over the last decade, Boston-based act Revocation has firmly established itself as one of the finest in today’s death metal and thrash metal genres. Heralded as one of modern metal’s elite guitarists, frontman Dave Davidson is also the driving force behind the band as it continues to evolve and challenge conventional metal norms. Jackson continues its storied history of working with the best in the business with the creation of Davidson’s Pro Series Signature Warrior™ WR7 model, an instrument built for taking creative liberties and running the metal gamut. Davidson’s take on Jackson’s revered angular shape is in a 7-string form featuring a 25.5” scale length, mahogany body with ash top and one-piece through-body maple neck with graphite reinforcement and scarf joint, providing the utmost stability against the rigors and ravages of the road. The oiled neck back finish allows for smooth playing feel, while its 12”-16” compound radius ebony fingerboard with 24 jumbo frets is designed for highly technical lightspeed playing—more curved by the nut for comfortable chording, it flattens out as you move up the neck for increasingly fast playing speed and wide bends without fretting out. To meet Revocation’s propensity for building rich, complex chord voicings, Davidson teamed with DiMarzio® to create his own signature Imperium pickups, which power this signature Pro Series axe with dynamic tone and punchy clarity. Designed so that all notes ring through, from full-bodied, tight low end while using high gain amps to crystal clear cleans on nondistorted channels, these pickups are also highly responsive to harmonics. This axe also features a single tone control, a single volume control with push/pull coil split for single-coil tone and a three-way toggle switch. Dive-bomb or flutter at will with the Floyd Rose® FRT 1000 series doublelocking tremolo bridge system, recessed for pick hand comfort and providing superior string stability, sustain and dynamic tremolo action. Dark and menacing with its Distressed Ash finish, black body, neck and headstock binding and black hardware, this signature Warrior is primed and ready for battle. • 25.5” scale length • Mahogany body with ash top • One-piece through-body maple neck with graphite reinforcement and scarf joint • Oiled neck back finish • 12”-16” compound radius ebony fingerboard with 24 jumbo frets and pearloid piranha tooth inlays • DiMarzio® Dave Davidson Signature Imperium Bridge Pickup and DiMarzio Dave Davidson Signature Imperium Neck Pickup • Single volume (push/pull coil split) and tone controls, plus three-way toggle switch • Recessed Floyd Rose® FRT-SSO2000 double-locking tremolo bridge system • Dunlop® dual-locking strap buttons • Available in Distressed Ash with black hardware and black body, neck and headstock binding • Jackson pointed 7-in-line headstock Series: Pro Series Body Material: Mahogany with Ash Top Body Finish: Satin Neck: 1-Piece Maple Neck-Through-Body with Graphite Reinforcement and Scarf Joint Neck Finish: Oiled Fingerboard: Ebony, 12” - 16” Compound Radius (304.8 mm to 406.4 mm) Frets: 24, Jumbo Position Inlays: Pearloid Piranha Tooth (Small Sharkfin) Nut (Material/Width): Floyd Rose® Locking, 1.875” (47.6 mm) Tuning Machines: Jackson®-Branded Sealed Die-Cast Scale Length: 25.5” (648 mm) Bridge: Floyd Rose® FRT-SSO2000 Double-Locking Tremolo (Recessed) Pickguard: None Pickups: DiMarzio® Dave Davidson Signature Imperium (Bridge and Neck) Controls: Volume (Push/Pull Coil-Split), Tone Control Knobs: Dome Style Hardware Finish: Black WE SHIP FAST! Please E-mail or call with any questions.***We reserve the right to end the auction early if no one has bid - item is for sale locally***", "ItemID": "173632194106", "EndTime": "2019-01-17T21:03:16.000Z", "StartTime": "2018-11-09T21:49:22.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Jackson-Pro-Series-Dave-Davidson-Signature-Warrior-WR7-/173632194106", "ListingType": "FixedPriceItem", "Location": "Saint Paul, Minnesota", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1736321941068080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTAwNFgxNjAw/z/wZAAAOSwsO5b5gBb/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg1NDk=/z/590AAOSwvYRb5gBe/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMzk2/z/rF0AAOSwNptb5gBg/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg4Njk=/z/UXgAAOSwXbFb5gBi/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMzUy/z/qH8AAOSwmUBb5gBm/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg3NDE=/z/fgkAAOSwuvtb5gBq/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMzMy/z/sbEAAOSwWIJb5gBt/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNDYw/z/BpkAAOSw7R9b5gBw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTUxM1gxNjAw/z/Fy4AAOSw6gdb5gBy/$_57.JPG?set_id=8800005007"], "PostalCode": "55102", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "capitolguitars", "FeedbackRatingStar": "Green", "FeedbackScore": 6925, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1053.97, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1053.97, "CurrencyID": "USD"}, "HighBidder": {"UserID": "e***f", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 455}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Jackson Pro Series Dave Davidson Signature Warrior WR7 ", "ItemSpecifics": {"NameValueList": [{"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "String Configuration", "Value": ["7 String"]}, {"Name": "Model", "Value": ["WR7"]}, {"Name": "Model Year", "Value": ["2018"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Brand", "Value": ["Jackson"]}]}, "HitCount": 464, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=169023333", "StoreName": "CAPITOL GUITARS"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Low miles!", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}