{"BestOfferEnabled": false, "Description": "Late 80's Charvel Str*t model in black signed by MEGADETH in the early 90's. __________________________________________________________________________________________ Allgemeine Geschäftsbedingungen § 1 Allgemeines 1. Für die Geschäftsbeziehungen zwischen der Firma music-outlet-shop und dem Kunden gelten die nachfolgenden allgemeinen Geschäftsbedingungen in ihrer jeweils gültigen Fassung. Abweichende Geschäftsbedingungen des Kunden gelten nicht. 2. Sämtliche Angebote, unabhängig davon, ob sie telefonisch, per Telefax, Internet, E-Mail oder in sonstiger Weise erteilt werden, sind für die Firma music-outlet-shop erst verbindlich, wenn sie schriftlich bestätigt worden sind bzw. die Ware zur Auslieferung gebracht und/oder eine Rechnung erteilt wurde. 3. Die Firma music-outlet-shop behält sich vor, die versprochene Leistung nicht zu erbringen, wenn sich nach Vertragsschluss herausstellt, dass die Ware nicht verfügbar ist, obwohl ein entsprechendes Deckungsgeschäft abgeschlossen wurde. In einem solchen Fall erhält der Kunde unverzüglich Nachricht. Eventuell bereits erbrachte Gegenleistungen des Kunden werden unverzüglich erstattet. Weitere Ansprüche des Kunden gegen die Firma music-outlet-shop sind ausgeschlossen. § 2 Lieferung 1. Wir liefern die Ware gemäß den mit Ihnen getroffenen Vereinbarungen. Anfallende Versandkosten sind jeweils bei der Produktbeschreibung aufgeführt und werden von uns gesondert auf der Rechnung ausgewiesen. Wir weisen darauf hin, dass bei einem Versand ins Ausland eventuell höhere Versandkosten, Zölle und Gebühren oä. anfallen können. Liefertermine und Lieferfristen sind nur verbindlich, wenn sie von uns schriftlich bestätigt wurden. 2. Soweit wir die Lieferung der Ware nicht oder nicht vertragsgemäß erbringen, so müssen Sie uns zur Bewirkung der Leistung eine Nachfrist von zwei Wochen setzen. Ansonsten sind Sie nicht berechtigt, vom Vertrag zurückzutreten. 3. Angaben über Lieferfristen sind grundsätzlich unverbindlich, es sei denn, es wurde eine bestimmte Lieferfrist schriftlich vereinbart. § 3 Widerrufsrecht Sie haben das Recht, binnen vierzehn Tagen ohne Angabe von Gründen diesen Vertrag zu widerrufen. Die Widerrufsfrist beträgt vierzehn Tage ab dem Tag an dem Sie oder ein von Ihnen benannter Dritter, der nicht der Beförderer ist, die Waren in Besitz genommen haben bzw. hat. Um Ihr Widerrufsrecht auszuüben, müssen Sie uns music-outlet-shop Inhaber: Frank Schauer Grethenstrasse 9 50739 Köln Tel. : 0160 6746 438 mittels einer eindeutigen Erklärung (z. B. ein mit der Post versandter Brief, Telefax oder E-Mail) über Ihren Entschluss, diesen Vertrag zu widerrufen, informieren. Sie können dafür das beigefügte Muster-Widerrufsformular verwenden, das jedoch nicht vorgeschrieben ist. Zur Wahrung der Widerrufsfrist reicht es aus, dass Sie die Mitteilung über die Ausübung des Widerrufsrechts vor Ablauf der Widerrufsfrist absenden. Folgen des Widerrufs Wenn Sie diesen Vertrag widerrufen, haben wir Ihnen alle Zahlungen, die wir von Ihnen erhalten haben, einschließlich der Lieferkosten (mit Ausnahme der zusätzlichen Kosten, die sich daraus ergeben, dass Sie eine andere Art der Lieferung als die von uns angebotene, günstigste Standardlieferung gewählt haben), unverzüglich und spätestens binnen vierzehn Tagen ab dem Tag zurückzuzahlen, an dem die Mitteilung über Ihren Widerruf dieses Vertrags bei uns eingegangen ist. Für diese Rückzahlung verwenden wir dasselbe Zahlungsmittel, das Sie bei der ursprünglichen Transaktion eingesetzt haben, es sei denn, mit Ihnen wurde ausdrücklich etwas anderes vereinbart; in keinem Fall werden Ihnen wegen dieser Rückzahlung Entgelte berechnet. Wir können die Rückzahlung verweigern, bis wir die Waren wieder zurückerhalten haben oder bis Sie den Nachweis erbracht haben, dass Sie die Waren zurückgesandt haben, je nachdem, welches der frühere Zeitpunkt ist.“ Sie haben die Waren unverzüglich und in jedem Fall spätestens binnen vierzehn Tagen ab dem Tag, an dem Sie uns über den Widerruf dieses Vertrags unterrichten, an uns zurückzusenden oder zu übergeben. Die Frist ist gewahrt, wenn Sie die Waren vor Ablauf der Frist von vierzehn Tagen absenden.“ Sie tragen die unmittelbaren Kosten der Rücksendung der Waren.. Sie müssen für einen etwaigen Wertverlust der Waren nur aufkommen, wenn dieser Wertverlust auf einen zur Prüfung der Beschaffenheit, Eigenschaften und Funktionsweise der Waren nicht notwendigen Umgang mit ihnen zurückzuführen ist. Ende der Widerrufs- und Rückgabebelehrung § 4 Rücksendekosten bei Ausübung des Widerrufsrechtes Machen Sie von Ihrem gesetzlichen Widerrufsrecht Gebrauch (siehe Widerrufsbelehrung) haben sie die unmittelbaren Kosten der Rücksendung zu tragen. § 5 Gewährleistungen und Schadensersatzansprüche 1. Liegt ein von der Firma music-outlet-shop zu vertretender Mangel der Kaufsache vor, ist die Firma music-outlet-shop nach eigener Wahl zur Mängelbeseitigung oder zur Ersatzlieferung berechtigt. Die Firma music-outlet-shop behebt den Mangel auf eigene Kosten in ihrer Firma. Die Rücksendung der Ware muss frei an die Firma music-outlet-shop erfolgen. Es bleibt der Firma music-outlet-shop aber überlassen, ob sie die Mängelbeseitigung von einem anderen, dem Wohnort des Kunden nähergelegenen Fachmann, ausführen lässt. Ist die Firma music-outlet-shop zu dieser Leistung nicht bereit oder nicht in der Lage oder verzögert sich diese über einen angemessenen Zeitraum hinaus aus Gründen, die die Firma music-outlet-shop zu vertreten hat oder schlägt in sonstiger Weise die Mängelbeseitigung / Ersatzlieferung fehl, ist der Kunde nach seiner Wahl berechtigt, vom Vertrag zurückzutreten oder eine entsprechende Herabsetzung des Kaufpreises (Minderung) zu verlangen. Bei nur geringfügigen Mängeln steht dem Kunden jedoch kein Rücktrittsrecht zu. 2. Die Gewährleistungsfrist für neue Waren beträgt bei Verbrauchern 24 Monate. Die Frist beginnt mit Gefahrübergang zu laufen. Die Gewährleistungsfrist für gebrauchte Waren beträgt bei Verbrauchern 12 Monate. Ist der Kunde Unternehmer im Sinne des §14 BGB, so beträgt die Gewährleistungsfrist für neue Waren ein Jahr und für gebrauchte Waren sechs Monate ab Gefahrübergang. Zur Fristwahrung genügt die rechtzeitige Absendung der Ware oder die Anmeldung des Gewährleistungsanspruches. § 6 Fälligkeit und Zahlungsbedingungen Die Rechnungen der Firma music-outlet-shop sind - soweit nicht schriftlich etwas anderes vereinbart wurde - unverzüglich und ohne Abzug per Banküberweisung zahlbar. Alle Preise verstehen sich inklusive 19 % Mehrwertsteuer. Die anfallenden Versandkosten sind bei jedem unserer Angebote im Versandkostenfeld aufgeführt. Für den Zahlungsverzug gelten die gesetzlichen Bestimmungen. § 7 Eigentumsvorbehalt 1. Bei Verträgen mit Verbrauchern im Sinne von §13 BGB behält sich die Firma music-outlet-shop das Eigentum bis zur vollständigen Zahlung des Kaufpreises vor. Bei Kunden, die nicht Verbraucher sind, bleibt die gelieferte Ware bis zur vollständigen Zahlung aller gegen den Kunden bestehenden Ansprüche, einschließlich aller Nebenforderungen, im Eigentum der Firma music-outlet-shop. 2. Der Kunde ist nicht berechtigt, die Ware bis zur vollständigen Bezahlung des Kaufpreises an Dritte zu veräußern oder sonstige, das Eigentum der Firma music-outlet-shop gefährdende Maßnahmen zu ergreifen. Der Kunde tritt bereits jetzt seine künftigen Ansprüche gegenüber dem Erwerber in Höhe des zwischen der Firma music-outlet-shop und dem Kunden vereinbarten Kaufpreises samt Zinsen und Nebenforderungen an die Firma music-outlet-shop ab. Die Firma music-outlet-shop nimmt diese Abtretung an. § 8 Erfüllungsort und Gerichtsstand 1. Es gilt ausschließlich deutsches Recht unter Ausschluß des UN-Kaufrechts. 2. Erfüllungsort für alle Leistungen aus der mit der Firma music-outlet-shop bestehenden Geschäftsbeziehungen ist Köln. 3. Ausschließlicher Gerichtsstand für Klagen gegen die Firma music-outlet-shop ist Köln. Dieses gilt auch für Klagen der Firma music-outlet-shop gegen den Kunden, soweit der Kunde Kaufmann, juristische Person des öffentlichen Rechts oder öffentlich-rechtliches Sondervermögen ist. § 9 Schlussbestimmung Sollten einzelne dieser Bestimmungen - gleich aus welchem Grund - nicht zur Anwendung gelangen, so wird dadurch die Wirksamkeit der übrigen Bestimmungen nicht berührt.", "ItemID": "173758732213", "EndTime": "2019-02-05T01:38:22.000Z", "StartTime": "2019-01-24T14:52:01.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/80s-CHARVEL-STR-T-signed-MEGADETH-/173758732213", "ListingType": "FixedPriceItem", "Location": "COLOGNE", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1737587322138080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/OTYwWDEyODA=/z/eHIAAOSw6CRcH-N-/$_1.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "music-outlet-shop", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 12842, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 899.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 899.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "l***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1355}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Americas", "Asia", "AU"], "Site": "US", "TimeLeft": "PT0S", "Title": "80's CHARVEL STR*T - signed by MEGADETH", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["CHARVEL"]}]}, "HitCount": 56, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=101471293", "StoreName": "music-outlet-shop"}, "Country": "DE", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 5, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Late 80's Charvel Str*t  model in black signed by MEGADETH in the early 90's.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}