{"BestOfferEnabled": false, "Description": "*B-Stock/ Factory 2nd* We are authorized Schecter Guitar Dealers! Please Note:This is a SCHECTER \"B-Stock\" / Factory 2nd (which in most incidents may just mean there is a small cosmetic defect or blemish). There is nothing functionally wrong with this guitar. This is not a Refurbished or Repaired guitar. It is a NEW guitar - never played and direct from Schecter with a *90-Day Schecter Warranty. Set up by Schecter right along side the A-Stock guitars before they come to us.*All factory seconds have a tiny little 2 stamped behind the headstock; and all include whammy bar (if applicable) and tool kit.*(90-Day Schecter Warranty is valid for U.S. customers only. Void if shipped internationally.) Buyer Terms If you have ZERO FEEDBACK, any deserved NEGATIVE FEEDBACK, or a history of bid retraction you MUST receive our permission before bidding or your bid will be cancelled. Further, we reserve the right to cancel any bid from a NEWLY REGISTERED Ebay Member at our discretion.**** VERY, VERY, VERY IMPORTANT: If using PayPal you MUST be a Verified PayPal Member with a Confirmed Shipping Address.Additional Paymnet Guidelines: If payment is not or cannot be made within 48 hours from time of purchase*, please refrain from buying the item. Additionally, if your payment method does not meet our perscribed guidelines /policies, we reserve the right to refuse to complete the transaction. *(If you contact us immediately upon purchasing the item and other arrangements can be made within a reasonable amount of time, we may extend this term. ) AGAIN - If you do not follow the instructions detailed herein WE RESERVE THE RIGHT TO CANCEL ANY BID OR REFUSE TO DO BUSINESS WITH ANYONE SUBJECT TO SELLER'S DISCRETION.International Buyers We welcome bids from International Ebay Members but PLEASE DO NOT BID BEFORE READING CAREFULLY: INTERNATIONAL BUYERS may now pay via PAYPAL, but YOU MUST HAVE A VERIFIED ACCOUNT AND SHIPPING MUST BE TO A CONFIRMED/ REGISTERED PAYPAL ADDRESS. IF you DO NOT MEET THESE QUALIFICATIONS we will accept payment VIA A BANK WIRE TRANSFER only.IF you are an International Buyer and/or do not meet the conditions stated above; THEN you ABSOLUTELY MUST ask permission FIRST/ BEFORE BIDDING in order to be added to the bidder list. International ShippingRecipient/ Buyer is 100% responsible for ALL DUTIES and TAXES (VAT, ETC.) imposed by your local government/ customs officials. THIS INCLUDES CANADA! If using any service other than U.S.P.S. for shipment (i.e. FED EX, FED EX Ground International, UPS) please be aware in advance that these companies may charge additional fees after delivery for use of their \" Brokerage Services\"; it is the recipient/ buyer's responsibility to pay these charges, as well. In all instances, it is the recipient's sole responsibility to research and estimate such fees - whether standard DUTIES and TAXES or additional Brokerage Fees. Whenever possible we will use U.S.P.S. Express International, however as some items exceed the size limits (properly packaged) imposed by the U.S.P.S. to certain Countries, we may opt to use other shipping methods (Fed Ex, FED EX Ground International to CANADA, UPS, etc.).. Manufacturer Warranty for International Buyer'sPLEASE BE AWARE! Per the Manufacturer's Instructions: All NEW (includes B-Stock, DEMO, OPEN-BOX) Items purchased from the U.S. and sent Internationally MAY NOT BE COVERED* under MANUFACTURER WARRANTY - as most manufacturer's already have reps worldwide. HOWEVER, you are still protected under our standard return policies for International buyers *see below - particularly due to or possibly incurred during transit (which is then covered up to the amount of Insurance originally agreed upon per shipment). After that initial 14-Days, however, we cannot be held responsible - and you must understand and agree in advance as you are purchasing this item to import at your own discretion. *(EACH MANUFACTURER HAS DIFFERENT POLICIES REGARDING INTERNATIONAL WARRANTY COVERAGE - Please contact us PRIOR to PURCHASE to check terms for the specific item you are considering!)Return PolicyBuyer has 30-Day Warranty Period from time item is received to report any issues or problems (however, we request that you please inspect your item as soon as possible upon receipt).Buyer is responsible for all return shipping charges. A Re-Stocking Fee of 10 – 15% may apply (Terms subject to our discretion and will be evaluated on a per case basis.)**International buyers please be aware! The above policy still applies; however, if there is a problem with the item and a return is necessary:We will refund the cost paid for the item ONLY! Buyer will be responsible for all return shipping charges. NO shipping costs or VAT/ Taxes/ Duties paid by the buyer to import the item will be refunded. This policy may have some exceptions which will be based strictly on a per item basis - please contact for details. Shipping Information **U.S. Buyers Please Be Aware - The Flat U.S. Shipping Rate will be different than stated in this ad for the following: Puerto Rico, Hawaii, U.S. Virgin Islands. Please contact PRIOR to purchase for calculated rates to these locations.** We strive to insure every item we ship is very well packaged to protect as much as is possible against any damage that may occur in transit. This may be reflected in our flat rate for all shipments within the U.S., and especially so for all International shipments. *FREE SHIPPING APPLIES TO ORDERS SENT ONLY WITHIN THE CONTINENTAL U.S. (excludes Alaska and Hawaii, as well as Puerto Rico and U.S. Virgin Islands); and may not be combined with other NON-NEW-SCHECTER items ordered. Also, see the Fed Ex Ground Service Map below for Estimated Delivery Times for Domestic Shipments: Again, feel free to contact us if you have ANY questions.We will accept Paypal/ Credit Cards via Paypal or CREDIT CARDS. If using Paypal you MUST be a Verified Paypal Member with a Confirmed Address. If not, please email your phone number and we can work it out. We will ship upon receipt of funds. PLEASE NOTE: INTERNATIONAL BUYERS WILL HAVE DIFFERENT TERMS THAN STATED HERE - PLEASE READ OUR AD. _gsrx_vers_468 (GS 6.4 (468)) *** INTERNATIONAL BUYERS: Shipping Costs may be different than listed here to your country - if your location is not listed as available or you want to be sure before buying that the cost is the same - PLEASE CONTACT US! ***</d", "ItemID": "264097921426", "EndTime": "2019-02-21T02:41:54.000Z", "StartTime": "2018-12-21T17:29:03.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Schecter-C-1-FR-S-Apocalypse-Rusty-Grey-RG-B-STOCK-Electric-Guitar-Sustainiac-/264097921426", "ListingType": "FixedPriceItem", "Location": "Nashville, Tennessee", "PaymentMethods": ["PayPal", "VisaMC", "Discover", "AmEx"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2640979214268080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/OTYwWDk2MA==/z/SS4AAOSw~y9ZA59K/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjQwWDk2MA==/z/cyQAAOSwlndZA59A/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjQwWDk2MA==/z/XOAAAOSwt0FZA59C/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjQwWDk2MA==/z/GwcAAOSww5NZA59F/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjQwWDk2MA==/z/iekAAOSwrhBZA59I/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjMzWDk2MA==/z/DAoAAOSwX61ZA59M/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAwMFg2NjY=/z/jMQAAOSwtGlZA59O/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAwMFg2NjY=/z/iuwAAOSwrhBZA59P/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NjI1WDYyNQ==/z/L-AAAOSwaB5XkRPI/$_1.JPG?set_id=880000500F"], "PostalCode": "37209", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "gearorphanage", "FeedbackRatingStar": "Green", "FeedbackScore": 5066, "PositiveFeedbackPercent": 99.2, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 949.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 949.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "h***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1737}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "Schecter C-1 FR S Apocalypse Rusty Grey RG B-STOCK Electric Guitar Sustainiac", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Schecter"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["1302"]}, {"Name": "Model", "Value": ["C-1 FR S Apocalypse"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Body Color", "Value": ["Rust Grey"]}]}, "HitCount": 815, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=737312577", "StoreName": "Gear Orphanage"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "This is a Schecter B-Stock/ Factory 2nd guitar. Schecter requires us to list all B-Stock/ Factory 2nd's as USED. For further details defining B-Stock/ Factory 2nd please read within the ad under factory description.", "QuantitySoldByPickupInStore": 0, "SKU": "1302-B", "NewBestOffer": false}