{"BestOfferEnabled": false, "Description": "Hello and thank you for looking at this auction. My auctions will include fairly priced nice vintage, rare, cool and collectable guitars, amps and basses that I love playing myself. They are setup ready to rock right out of the box. All items are packed and shipped with care and full insurance. Consider adding me to your favorite sellers or checking out my other auctions if you are interested in such things! --AUCTION ENDS THIS SUNDAY 3:00 PM PST, 6:00 PM EST-- *Free shipping with \"Buy it now\" purchases* (I will refund you the shipping charge immediately) 2015 Gibson Les Paul Studio Deluxe III Electric Guitar Fantastic, very gently used electric guitar with the right specs to do literally anything with. Guitar is in fantastic ex+, near mint condition. It includes the original hardcase and materials shown. It will be setup and ready to play right out of the box. This is the right one with gloss finish, carved top and warm and fat vintage sounding pickups. The coil tap feature yields some seriously great tones especially on the neck position with the tone rolled back a bit. The boost is a perfect feature for bumping up your lead volume. All in all this is a perfectly spec'd guitar that would be a great daily user to run around with for the experienced musician! Specs:The Les Paul Studio Deluxe III EX Electric Guitar raises the bar with the Super '57 and Classic '57 humbucking pickups, which are mounted on a carved maple top with a mahogany back. Both pickups offer coil splitting for single-coil sounds and a boost circuit via push/push switching in the volume controls. Straight Split\u009d coil-splitting offers pure single coil tone and differs from LP Standards and Studios that have a Super Tap\u009d coil-tap, which still has a small amount of humbucking. The boost circuit has a user-adjustable 10-dB boost for added power and frequency range for solos, single-note picking and dirty chording (depending on amp settings) and features true bypass that disengages the boost completely, ensuring pure passive Les Paul tone. The Les Paul Studio Deluxe features a traditional-spec SlimTaper '60s neck that offers a comfortable playing experience for which Les Paul models of that era are famous. The hardware is finished in chrome including Gibson's pioneering tune-o-matic bridge and stopbar tailpiece. The Les Paul Studio Deluxe is dependable, affordable, and is built without any compromises. Notable features A user-adjustable 10-dB boost for added power and frequency range for solos, single-note picking and dirty chording (depending on amp settings) Traditional '60s-style neck shape True bypass: disengaging boost completely removes active circuit, ensuring pure passive Les Paul tone Super '57 humbucking pickup in the bridge position. Classic 57 humbucking pickup in the neck position Easy-to-use push/push pots engage coil-splits and boost circuit Straight Split\u009d coil-splitting offers pure single coil tone Non-locking Grover tuners Includes hardshell case FEATURESBodyBody shape: Single cutawayBody type: Solid bodyBody material: Solid woodTop wood: Maple CarvedBody wood: MahoganyBody finish: GlossOrientation: Right handedNeckNeck shape: '60s SlimTaperNeck wood: MahoganyJoint: Set-inScale length: 24.75\"Truss rod: StandardNeck finish: GlossFretboardMaterial: RosewoodRadius: 12\"Fret size: Medium jumboNumber of frets: 22Inlays: TrapezoidNut width: 1.69\" (43mm)PickupsConfiguration: HHNeck: '57 ClassicMiddle: Not applicableBridge: '57 ClassicBrand: GibsonActive or passive: PassiveSeries or parallel: Not applicablePiezo: NoActive EQ: NoSpecial electronics: 2 volume with boost circuit via push/push switching, 2 tone with coil-splittingControlsControl layout: Volume 1, volume 2, tone 1, tone 2Pickup switch: 3-wayCoil tap or split: Coil splitKill switch: NoHardwareBridge type: FixedBridge design: Tune-o-maticTailpiece: StopbarTuning machines: Non locking GroversColor: ChromeOtherNumber of strings: 6-stringSpecial features: Tektoid nut, exclusive model, quick-connect control pocket assemblyCase: Hardshell caseAccessories: NoneCountry of origin: United States Thank you for looking and best of luck bidding...this is the RIGHT one! Grab it! Additional questions can be answered at call/text: 858-888-02 two zero Please contact for international bidding eligibility and a shipping quote. All import duties will be the responsibility of the buyer. Guitar must be able to be fully insured.", "ItemID": "123639790016", "EndTime": "2019-02-17T23:08:15.000Z", "StartTime": "2019-02-10T23:08:15.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2015-Gibson-Les-Paul-Studio-Deluxe-III-Gloss-Finish-USA-Made-Guitar-/123639790016", "ListingType": "Chinese", "Location": "Cardiff by the Sea, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1236397900168080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/k~AAAOSwTxhb71VX/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/W28AAOSwWAhb71WE/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/sxIAAOSwlfNb71WW/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/vGwAAOSw2fRb71XJ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/VUUAAOSw9tlb71Xc/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/j5EAAOSw-4Jb71X9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/s8MAAOSwlfNb71Yb/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/3ZsAAOSwxtVb71Y3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/2XsAAOSw9GVb71ZW/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/EecAAOSw22lb71Zx/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/nf0AAOSwXx9b71aK/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/QCoAAOSw9~Rb71aj/$_57.JPG?set_id=8800005007"], "PostalCode": "92007", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "alan1irwin", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 342, "PositiveFeedbackPercent": 100.0}, "BidCount": 17, "ConvertedCurrentPrice": {"Value": 866.01, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 866.01, "CurrencyID": "USD"}, "HighBidder": {"UserID": "c***6", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 33}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "Europe", "CA", "CN", "JP"], "Site": "US", "TimeLeft": "PT0S", "Title": "2015 Gibson Les Paul Studio Deluxe III Gloss Finish USA Made Guitar", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Model", "Value": ["Les Paul Studio Deluxe iii"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Color", "Value": ["Burst"]}, {"Name": "Body Material", "Value": ["Mahogany"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Model Year", "Value": ["2015"]}, {"Name": "Features", "Value": ["Single Cut", "Volume Knob"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}]}, "HitCount": 516, "Subtitle": "CARVED TOP, GLOSS FINISH, 57 CLASSIC PUPS, EX+ COND", "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 876.01, "CurrencyID": "USD"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Original guitar and hardcase with owners manual and original prepack checklist and allen wrench.  Guitar and case are in excellent+ condition.  There is no fretswear, no dents or dings.  Guitar is used but only very gently by respectful adults and always placed back in the protective hardcase.  Guitar will ship fully insured in an original Gibson Les Paul shipping box.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}