{"BestOfferEnabled": true, "Description": "I bought this guitar off of a touring musician based in Colorado back in 2009 and when it arrived it was in this vintage Fender hardshell case (which fits it perfectly), so now that the time has come for me to sell the Kapa it just seems to make sense to sell them together. Koob Veneman created the Kapa line and back in 1968 I had bought a red Kapa Continental 12-string from Veneman Music in Silver Spring, MD. Lots of us in the DC area who aspired to Fenders and Gibsons but didn't have the $$ were drawn to Kapa because they had great features and quality at a price point well below the big boys. As much as I'd loved that 12 string I ended up selling it and my amp before heading off to college - a decision I regretted for years. All of which is just my long-winded way of getting around to saying that when I first held this guitar a lovely sense of deja vu washed over me. They're feel-good guitars, from the off-set Mustang/Jaguar-ish bodies to the sixties vibe of the pickups to the thin maple necks that feel great in the hand. This one is in very nice playing shape and it sounds great. It's all original except that it has lost its bridge cover. The body shows the kind of honest wear you'd expect - see the photos for reference - but there's no damage at all to the neck, fretboard or headstock. I replaced the original knobs with Fender types, but the originals work just as well and I will include them with the guitar. The finish. originally white, has mellowed to something of a soft yellow or ivory color. I'm not one to mess with the electronics of a guitar, but I want to mention that the \"on\" position on the slider switch for the neck pu is like an 1/8 of an inch from where you'd expect. I'm used to it, but a cleaning is probably in order. The vintage (1964-1965) Fender hardshell case is in good shape although there are cosmetic issues on the exterior that can be seen in the photos. The 2 spring latches work great and the leather of the handle is in very good condition, however the small middle latch is missing its buckle. The following are some excerpts from a uniqueguitar.blogspot.com post from 2010: \"KAPA Guitars was founded in 1963 by a Dutch immigrant named Koob Veneman. Mr. Veneman was the owner of Veneman's Music Emporium, a musical instrument store in Silver Spring Maryland. During the early 1960’s Veneman made the decision to build his own unique line of guitars. This was the years of the British Invasion and the Guitar Boom and Mr. Veneman wanted his piece of the pie.The necks, pickups and electronics originally came from German manufacturer Hofner. The guitars generally were equipped with two slider switches to control on/off function of the pickups, which is typical of Hofner's design of the 1960’s. In the company's later years they made their own pickups, which looked similar to Hofner units.The tuners were made by Schaller. Kapa made his own bridges and tremolo assemblies. Most KAPA guitars are equipped with the tremolo.KAPA necks are ultra thin, which is sort of a ’60 thing. The bodies also were thin in comparison to Fender and Gibson bodies. To the unfamiliar, one could mistake a KAPA for a Fender guitar, based on it's Jaguar and Stratocaster-like shapes and the shape of the headstock. The KAPA logo used script on the headstock was very similar to what we call the Fender Spaghetti script. However the KAPA logo had a circle with a crest in the middle that was similar to the Veneman family crest.KAPA guitars were founded on some great principals set up by the Venemans. The instruments were well made, playable and affordable. Plus they were made in the USA.The Continental was probably KAPA's most popular model.\"", "ItemID": "163452516052", "EndTime": "2019-01-05T23:08:58.000Z", "StartTime": "2018-12-26T18:53:56.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1960s-Kapa-Continental-Guitar-Vintage-Fender-Mustang-Duo-Sonic-Case-/163452516052", "ListingType": "FixedPriceItem", "Location": "Santa Fe, New Mexico", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1634525160528080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg5Mjg=/z/Ns8AAOSwa~FcI65f/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg4NDA=/z/CGwAAOSwg05cI65y/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDMy/z/BKIAAOSwb15cI659/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5OTY=/z/kvwAAOSwcDdcI66C/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg2OTY=/z/vH4AAOSwIvBcI66I/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg3NTc=/z/ntUAAOSwwZxcI66N/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMTUz/z/SAIAAOSwMpFcI66U/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDYy/z/e0YAAOSwlypcI66Z/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTU1WDE2MDA=/z/JcsAAOSwXGRcI66f/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODk1WDE2MDA=/z/GTQAAOSwg-tcI66m/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NTI3WDE2MDA=/z/XMMAAOSwPmVcI66r/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/NTA1WDE2MDA=/z/jGkAAOSwaPpcI66x/$_32.JPG?set_id=880000500F"], "PostalCode": "87507", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "kskccharlie", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 186, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 600.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 600.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "d***o", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1076}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "1960s Kapa Continental Guitar in  Vintage Fender Mustang or Duo-Sonic Case", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Kapa Continental"]}, {"Name": "Model Year", "Value": ["1966-1969"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Continental"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Orig. white has mellowed to yellow"]}]}, "HitCount": 308, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}