{"BestOfferEnabled": false, "Description": "Everything you need A-Z For Sale - We Have a Buy It Now item! Fender American Vintage 60's ReissueJazzmaster Electric Guitar Model / MPN: Jazzmaster Includes: Fender AVRI 65 Jazzmaster Electric GuitarFender guitar leather shoulder strapSet of guitar stringsString winderFender PaperworkFender logo bumper stickerFender locking hard storage case w/ Orange velvet interior lining Features: (via manufacturer) Originally designed to appeal to jazz guitarists with elegant appointments and sophisticated controls, the Jazzmaster found its way into the hands of musical rebels. From surf to punk and indie rock, its flexible sound heralded the call of change and shaped the voice of rebellion. The American Original ‘60s Jazzmaster faithfully recreates the voice and style of this classic guitar, supplementing them with smooth, modern playability.Alder body with lacquer finish - The nitrocellulose lacquer finish not only lets the body breathe with its true tonal character, it also ages in a distinctively personal way.Two Pure Vintage ‘65 single-coil Jazzmaster pickups - American Original instruments feature specially voiced pickups crafted to reproduce authentic Fender sound.“’60s C”-shaped neck profile; 9.5”-radius round-lam rw fingerboard - sculpted for a vintage-style playing feel. Vintage-Accurate Body & Neck Radii - Original-era fans can rest assured every curve and line of the body and neck are accurate to the historic originals.Floating tremolo bridge with lock button and push-in arm; vintage-style hardware - From the bridge to the string tree and tuning machines, every piece of hardware is just like the original. - Note: tremolo arm is not includedIncludes vintage-style hardshell case The American Vintage Series has long presented some of Fender's best selling guitars (their early-'80s introduction, in fact, was one of the first signs that Fender was \"back\" as the CBS era ended). Today, Fender has boldly cleared the slate to make way for a fresh American Vintage series with fresh features, hotter specs, and the most meticulous level of vintage accuracy yet. Rather than just replacing the previous models with different ones, they've completely and comprehensively re-imagined the entire vintage-reissue concept--restoring original tooling dies, pickups, reformulating vintage colors and more--based on actual vintage guitars they tracked down to make sure they had it right. Fender did the work, and it shows, because there's pure tonal magic in each American Vintage instrument. Technical Specs:Body Finish: Gloss Nitrocellulose Lacquer Body Shape: Jazzmaster® Neck Binding: 1-Ply White Neck Finish: Gloss Nitrocellulose Lacquer Scale Length: 25.5\" (648 mm) Nut Material: Bone Nut Width: 1.650\" (42 mm) Position Inlays: Pearloid Dots Truss Rod: Vintage-Style Heel Adjust Truss Rod Nut: Vintage-Style Slotted See all pictures for what you will receive! And don't forget to check out my other items in my store at: Everything You Need A - Z! When you buy from us, expect to receive what you see in the pictures. We do our absolute best to thoroughly test all of our merchandise and accurately describe and depict any flaw or defect we find. When an item's condition is defined, we are simply expressing our own opinion. We know the feeling of buying something sight unseen only to find out the seller was not that accurate. Please inspect all pictures, if you do come across an issue that we may have overlooked, please contact us, and we will be happy to work with you to resolve the issue. We do not guarantee or warranty any Batteries or Calibrations, unless specified otherwise, as they are maintenance issues, therefore, may need to be performed periodically. Batteries are an item that may need to be replaced or rebuilt time to time and are sold as is. Please keep in mind with shipping, when you buy a guitar from us, you are not just paying for shipping. You are paying for our time and experience in packaging delicate items, as well as the cost of new boxes, shipping peanuts, bubble wrap, etc. Shipping Quote is for USA lower 48 states to a physical address only. Buyer Pays shipping & handling if stated. We accept PAYPAL ONLY! All payments are due within 24 hours. Read Payment instructions before bidding. Buyer is responsible for return shipping. Item must be in its original condition as it was received. A 20% restocking fee will apply. Upon receiving your item, thoroughly inspect all contents within. If item received is damaged in any way from shipping, notify FedEx immediately, and they will require you to have ALL original packaging & shipping materials for the item in order to prevent any delays for a claim, per FedEx. Please e-mail any questions or concerns, prior to bidding. Thanks for Looking at our Auction!! And good luck in bidding! Thanks for stopping by!", "ItemID": "153357436186", "EndTime": "2019-02-06T00:12:16.000Z", "StartTime": "2019-01-30T01:13:31.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fender-USA-American-Vintage-65-Jazzmaster-White-w-Matching-HeadStock-Case-Kandy-/153357436186", "ListingType": "FixedPriceItem", "Location": " USA", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1533574361868080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMTAy/z/lPAAAOSwFbpasYEr/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDcx/z/Fa8AAOSw6jNasYEu/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA3MVgxNjAw/z/XTwAAOSwTOtasYEy/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA3MVgxNjAw/z/hpYAAOSw8jVasYE2/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA3MVgxNjAw/z/1PUAAOSwbgpasYE5/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA3MVgxNjAw/z/1PkAAOSwbgpasYE7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDcx/z/EZcAAOSwmoVasYE~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA3MVgxNjAw/z/ghcAAOSwpixasYFB/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA3MVgxNjAw/z/rTEAAOSwtc1asYFF/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA3MVgxNjAw/z/1WoAAOSwJQtasYFH/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA3MVgxNjAw/z/0T0AAOSw3fpasYFK/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA3MVgxNjAw/z/yIEAAOSwpcBasYFO/$_57.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "kostalota", "FeedbackRatingStar": "Green", "FeedbackScore": 7454, "PositiveFeedbackPercent": 99.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1499.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1499.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***_", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 236}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "CA", "GB", "DK", "RO", "SK", "BG", "CZ", "FI", "HU", "LV", "LT", "MT", "EE", "AU", "GR", "PT", "CY", "SI", "JP", "CN", "SE", "KR", "ID", "TW", "TH", "BE", "FR", "HK", "IE", "NL", "PL", "ES", "IT", "DE", "AT", "BS", "IL", "MX", "NZ", "SG", "CH", "NO", "SA", "UA", "AE", "QA", "KW", "BH", "HR", "MY", "CO", "PA", "JM", "BB", "BD", "BM", "BN", "BO", "EG", "GF", "GG", "GI", "GP", "IS", "JE", "JO", "KH", "KY", "LI", "LK", "LU", "MC", "MO", "MQ", "MV", "NI", "OM", "PK", "PY", "RE"], "Site": "US", "TimeLeft": "PT0S", "Title": "Fender USA American Vintage 65 Jazzmaster White w/ Matching HeadStock Case Kandy", "ItemSpecifics": {"NameValueList": [{"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Body Color", "Value": ["Olympic White"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["American Vintage 65 Jazzmaster"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Product Line", "Value": ["AVRI"]}, {"Name": "Style", "Value": ["Jazzmaster"]}, {"Name": "Series", "Value": ["American Vintage"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Brand", "Value": ["Fender"]}, {"Name": "Body Type", "Value": ["Solid"]}]}, "HitCount": 189, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=42091554", "StoreName": "Everything U need A to Z"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["US Protectorates", "APO/FPO", "PO Box"], "GlobalShipping": true, "ConditionDescription": "This item is used w/ some minor cosmetic wear - light scratches/scuffs and a few little dings, but nothing major which affects its operation (see all zoomed in pics). Comes with everything you see in pics - nothing more, nothing less.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}