{"BestOfferEnabled": true, "Description": "CALL OR TEXT G-BRAT’S GUITARS ANYTIME; (972)816-7736 You are looking at a 2016 Gretsch G6136T-DCHFL-LTD16 “ \"The Falcon\" Hollowbody, with a Deep Cherry finish on gorgeous flamed maple top and back, gold sparkle trim, TV Jones pickups, Bigsby, gold hardware and ebony fretboard! If you like Gretsch's your gonna LOVE this one! The action is smooth and easy, and it sounds like a great Gretsch should! She's 100% original and ready to rock! Here's the lowdown on the features: Model: G6136T-DCHFL-LTD16 “The Falcon\"Color: Deep Cherry Stain, glossBody Style: Hollow with single cut-awayTop: Arched laminated maple, with over-sized bound F holesBack & Sides: Laminated maple: 17\" Wide, 2.75\" DeepNeck: Maple, set neckFretboard: Ebony, 12” radius, 22 medium jumbo fretsBinding: Gold sparkle on body, fretboard & headstockScale-Length: 25.5\"Nut-width: 1-11/16\"Bridge: Ebony based space-control roller-bridge, with Gretsch Bigsby vibrato tailpiece, goldControls: 3-way toggle master tone switch, volume 1 - neck pickup, volume 2 bridge pickup, master volumeHardware: Gold PlatedTuners: Grover Imperial gold plated, die-cast, stair stepHeadstock: V-shaped Falcon, with god sparkle logo and “The Falcon” badgeFret Inlays: Hump-blocks, mother-of-pearlPickups: Dual TV Jones, goldPickguard: Gold plexi Dove style, with Falcon detailTruss Rod: Adjustable, with gold sparkle coverKnobs: Arrow, goldWeight: 8 lbs.Serial # JT16072622 She just celebrated her 2nd birthday and has been totally babied. There are no nicks or dings to report here. There are merely a few light pick-scratches which can only be found with direct reflective light. The neck is straight, with no cracks or repairs... the frets are excellent, with their entire life ahead… and the sound is sweet! Also included is the original Gretsch hard shell case, and even includes the case candy, just as shown in the last picture! Whoever brings this baby home is gonna be STOKED!! LET'S GO!! WHILE YOU ARE HERE, GO AHEAD AND LOOK AT MY OTHER LISTINGS!! OUR CLIENTS ARE THE BEST IN THE WORLD!! Me- I have a 100% positive feedback rating, and intend to keep it that way! So please don't worry! You're in good hands here!! Shipping- We take pride in packing our guitars well, and shipping them quickly. Please note, if you are paying with Pay Pal, we will only ship to the address that is listed in Pay Pal. Here are the shipping rates, covering the planet earth:USA - $59 with UPSCanada, Hawaii, Alaska, Puerto Rico - $119Brazil, Argentina - $179Australia, New Zealand, Switzerland - $249 USPS Express or $349 UPSAll Other Worldwide Shipping - $219 - UPS Worldwide Expedited (in most cases); However, if UPS is more costly in certain countries, USPS will then be used instead. Payment Methods- Pay Pal is preferred!! We do also accept direct payment with Mastercard, Visa, American Express and even Discover! ~ TEXAS RESIDENTS ARE REQUIRED TO ADD 8.25% SALES TAX ~ Factory Warranty- We are an authorized dealer for: Knaggs, Ken Smith, Trussart, Warwick, Breedlove and Warrior, so for these instruments, if listed as NEW, there is a full factory warranty. For all other brands, and for instruments listed as USED, so there is no warranty available. Return Policy- We do accept returns up to 14 days from the point of the initial sale, which means that the guitar must be back in our possession within this 14 day period. However, please be aware of the following conditions: If for any reason you wish to return the guitar, just call or email me directly, within 24 hours of your receiving the item, and let me know that you want to return it. Once we receive the guitar back, in the same condition, you will receive a refund, less a $50 restock fee. Also be aware that the initial shipping fee is not refundable under any circumstances. International Bidders- We, at G-Brat's Guitars, are HONORED to do business with anybody on the planet earth... So international buyers are VERY welcome here! That being said, please observe the following conditions: If you are paying with Pay Pal, please be completely registered with Pay Pal, prior to the purchase; this will help avoid shipment delays, and will assure that you will get your guitar as quickly as possible!International shipments usually require additional \"Customs Fees\" or \"Import Taxes\". These fees will vary, depending on the country, and are the responsibility of the buyer. If you want more information on what these fees entail, please contact your local customs office for this information. THANK YOU SO MUCH FOR LOOKING!!! _gsrx_vers_841 (GS 7.0.16 (841))", "ItemID": "362564121612", "EndTime": "2019-03-01T03:39:38.000Z", "StartTime": "2019-02-22T16:27:31.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2016-GRETSCH-G6136T-DCHFL-LTD16-FALCON-HOLLOWBODY-FLAME-TOP-w-BIGSBY-DEEP-CHERRY-/362564121612", "ListingType": "FixedPriceItem", "Location": "Midlothian, Texas", "PaymentMethods": ["PayPal", "VisaMC", "Discover", "AmEx"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/3625641216128080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/ZfgAAOSwwrlccCLo/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/8DsAAOSwsupccCLo/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/croAAOSwuDFccCLp/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/WzIAAOSwhUpccCLp/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/m6QAAOSwdwlccCLq/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/jncAAOSwVbhccCLq/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/hHkAAOSwOztccCLr/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/840AAOSwupBccCLs/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/9hYAAOSwESdccCLu/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/2hMAAOSwiLZccCLt/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/xFwAAOSw~TdccCLu/$_3.JPG", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/cHkAAOSwobJccCLx/$_3.JPG"], "PostalCode": "76065", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "guitarbrat1", "FeedbackRatingStar": "Red", "FeedbackScore": 3678, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 2999.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2999.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "e***m", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 0}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "2016 GRETSCH G6136T-DCHFL-LTD16 FALCON HOLLOWBODY FLAME TOP w BIGSBY DEEP CHERRY", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Grestch"]}, {"Name": "Body Type", "Value": ["Hollow"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Model", "Value": ["G6136T-DCHFL-LTD16 FALCON"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Color", "Value": ["Deep Cherry"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Model Year", "Value": ["2017"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}]}, "HitCount": 46, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=43416548", "StoreName": "guitarbrat1"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "14 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Excellent condition", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}