{"BestOfferEnabled": false, "Description": "Item DescriptionTitle:2005 Dean USA Custom Shop SIGNED Michael Schenker Black & White Electric GuitarDescription:Dean Guitars USA Custom Shop Michael Schenker Signature Flying V; in opposing or contrasting black/white finish with beautiful triple pinstriping. This Dean USA CS Schenker Flying V was made during the first production run and endorsement agreement; between Dean Guitars & Michael Schenker in 2005. This Dean USA CS guitar was made during the timeframe 2000-08 when Dean Zelinsky; came back to work for Dean Guitars the company he founded in the late 1970's. Dean Zelinsky had previously sold his company Dean Guitars around 1990-91 to new owners. Information perused from online guitar forums; etc. indicate that Zelinsky returned to Dean Guitars again around 2000; after selling the company some 10 years previous to work for the then owners of Dean Guitars. This Dean Michael Schenker signature guitar has a COA from Dean Guitars USA Custom Shop signed by Dean Zelinsky. The guitar is signed and numbered as well by the infamous guitar hero Michael Schenker on the headstock; and this guitar is an oddity somewhat in that this was #101 of 100 guitars made on the Dean USA CS COA. This guitar is made with a mahogany body and has the Dean V shaped neck groove with 22 like new frets; and an ebony fingerboard with mother of pearl block inlays; and all chrome hardware with Grover Tuners. The pickups are custom wound Michael Schenker humbuckers in same black/white scheme as the paint on this guitar; with 3 vol/tone knobs and a 3 way selector switch. This Dean USA CS shop Schenker was set up with a new set of GHS Boomers strings .010-.046. The guitar plays super easy and fast with the V neck; with low action and the neck relief and intonation were set proper. This Dean USA CS Schenker guitar has the matching HSC; in excellent condition done in the similar contrasting black/white finish. This Dean USA CS shop Schenker is in very nice condition; there are some minor visible scuffs in the finish. There is a small but visible slight scratch or scrape on the chrome v shaped metal piece on the topside that the strings go through. Overall though this is a very good to better described excellent condition well kept guitar; that was bought from the original owner who kept it mostly as a collectable guitar. This Dean USA CS Schenker with the COA will be well securely packed inside the HSC. Size: Not provided. Condition: See above. Stock Number: A021786 Terms of Sale Buy It Now: If this item has a Buy It Now option, then we have reviewed comparable sale prices on eBay for this item and have established a Buy It Now price based on our research. If you feel the price is fair, please use the Buy It Now button to immediately purchase and pay for the item. If you are buying multiple items from us, please do not use the Buy It Now button, rather please follow the instructions below for buying multiple items. Make Offer: If this item has a Make Offer option, then please submit a reasonable offer, based on comparable eBay sale prices, which we can accept. We are more likely to accept your offer if the price is close to the Buy It Now price and you add a comment supporting your offer. We want to sell items quickly, so we can continue to bring new items to market, so we will try our best to work with you. Keep in mind that we may be negotiating with multiple buyers at the same time, so the first offer we accept wins the item. If we already have the lowest price on eBay, please use the Buy It Now option. Buying Multiple Items: To purchase multiple items from us using the eBay website: 1) add all the items to your shopping cart by clicking the \"Add to cart\" button on each eBay listing, 2) from your eBay shopping cart, click the \"Request total from seller\" button located at the top right of the page, 3) on the next page (Request total from seller page), click the \"Commit to buy & submit request\" link at the bottom of the page. This will reserve the items in your cart and send us a request to combine the shipping. We will then send you a single combined invoice to pay with the correct combined shipping amount. Please note: the eBay app may not support this functionality. Payment: We accept Paypal on all our listings. If you use the Buy It Now option, an immediate payment will normally be required. If you are buying multiple items from us, please do not use the Buy It Now button, rather please follow the instructions above for buying multiple items. If we accept your offer, we will send you an invoice through eBay, and payment is due within 24 hours. If you win an auction, we will send you an invoice through eBay, and payment is due within 24 hours. Shipping: We ship all of our items in-house using all new boxes and cushioning materials. We use shipping services from the USPS and UPS, so more than one option may be available under the 'Shipping and Payments' tab above. We will ship most of our items internationally directly through the USPS. All international shipments will be declared as commercial and at their full value. Any customs charges and/or import duties are always paid directly by the buyer in their local country. The eBay Global Shipping Program may also be an option for certain items (please contact us before buying the item, so we can add that option to the listing). Please use the eBay shipping calculator to obtain the cost of shipping and handling. In some cases, the eBay shipping calculator may not work, so please contact us directly for a shipping quote. We try to keep our shipping costs as low as possible and only charge our actual cost of shipping. If our actual cost of shipping turns out to be less than what we charged, we will refund you the difference. We always combine shipping on multiple items to save you money (see the instructions above for buying multiple items). Our handling time is one business day. Free local pickup is always available (please contact us before buying the item, so we can add a local pickup option to the listing). Kansas Sales Tax: Sales tax will only be collected on non-exempt shipments within the state of Kansas and on local pickups. If you live in Kansas and are exempt from Kansas sales tax, please email us your Kansas Resale Exemption Certificate, and we will remove the tax at checkout. Sales tax will not be collected on shipments outside the state of Kansas. Return Policy: We carefully inspect all of our items before listing, so we only allow returns if the item you receive differs significantly from the description and photos. Please ask any questions you may have about an item before purchasing the item. Please contact us within 48 hours after receiving the item if there is a problem. If we determine that a return is warranted, we will pay the return shipping. We want happy customers, so we always try to make it right. Feedback: If this transaction has met with your satisfaction, please leave us positive feedback and high seller ratings on eBay. If you cannot leave positive feedback or a 4 or higher seller rating, please contact us directly, before contacting eBay or Paypal, and give us a chance to make it right. We automatically return all positive feedback left for us. About Us Sunflower Auction Gallery is a Top Rated Plus eBay seller located in Overland Park, Kansas. We have been selling on eBay since 1999. We primarily sell items in the following categories: Antiques, Collectibles, Dolls, Pottery & Glass and Toys, although we will list pretty much anything of value on eBay. All of our items come from a smoke and pet-free environment. We look forward to doing business with you.", "ItemID": "323570334954", "EndTime": "2018-12-23T16:30:28.000Z", "StartTime": "2018-11-26T21:38:44.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2005-Dean-USA-Custom-Shop-SIGNED-Michael-Schenker-Black-White-Electric-Guitar-/323570334954", "ListingType": "FixedPriceItem", "Location": "Overland Park, Kansas", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/3235703349548080_2.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg0OTU=/z/HT0AAOSw7R9b~HMj/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTc0WDY3Mg==/z/7oAAAOSwI7Fb~HMk/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ0N1g3MjU=/z/aUgAAOSwZ3pb~HMl/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ2NVg5MDA=/z/v4UAAOSwaPNb~HMm/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzMwWDE0MDM=/z/GdsAAOSwE~Zb~HMn/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQwNVg2MTA=/z/6FYAAOSw3LVb~HMo/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTM1MFg2NzY=/z/dTcAAOSwfgRb~HMo/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ2MFg5MDA=/z/F5MAAOSwBZxb~HMp/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjA3WDE1MDE=/z/P3gAAOSw0vJb~HMq/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDkwWDE2MDA=/z/6dAAAOSwPeVb~HMr/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MzcyWDUwMA==/z/phIAAOSwVEFb~HND/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2MVg1MjM=/z/IbUAAOSw27lb~HMs/$_1.JPG?set_id=8800005007"], "PostalCode": "66223", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "sunflowerauctiongallery", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 10377, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 2995.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2995.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "0***l", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 4}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "CA"], "Site": "US", "TimeLeft": "PT0S", "Title": "2005 Dean USA Custom Shop SIGNED Michael Schenker Black & White Electric Guitar", "HitCount": 129, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=47548865", "StoreName": "Sunflower Auction Gallery"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "TopRatedListing": true, "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "SKU": "A021786", "NewBestOffer": false}