{"BestOfferEnabled": true, "Description": "item up for your consideration Schecter Diamond series C-1 right handed electric guitar string thru and set neck design. active EMG pick ups 1 vol, 1 tone control, 1 way selector switch 24 fret rosewood fret board with dot inlays ScoreBid is the E-commerce business owned and operated by Siegel's Jewelry & Loan SIEGEL'S JEWELRY & LOAN3525 1st Avenue SECedar Rapids, Iowa 52403 Business Hours:Monday: 10:00am - 5:00pmTuesday: 10:00am - 5:00pmWednesday: 10:00am - 5:00pmThursday: 10:00am - 5:00pmFriday: 10:00am - 5:00pmSaturday: 10:00am - 5:00pmSunday: CLOSED! (Sorry No international Shipping) ABOUT US:ScoreBid is the e- commerce and eBay consignment company for Siegel’s Jewelry & Loan a family owned and operated business since 1940 located in Cedar Rapids, IA. J.D.Siegel started the company in 1940 with his son Oscar Siegel coming into the business shortly after the war. At present, Oscar’s son Ken operates the day to day business and oversees the operation. Oscar’s other son Jary runs the wholesale jewelry side of the business. ScoreBid is operated by Ken Siegel. Please call us if you have any questions or comments about our products and/or listings. GUARANTEE:We strive to make sure you are happy with your purchase. Items are guaranteed to arrive in the condition described. If we have overlooked something or something doesn't work correctly when it arrives please call or email us to initiate a refund or RMA. We ask that you notify us of any issues within 7 days of the item delivery date. This item is guaranteed to work as described in this auction listing. Returns are accepted if an item is found to be in a condition other than described or if the item in general is different than what was described in the listing. We look forward to serving you! SHIPPING: We will attempt to ship your item within 24-72 hours after payment has been received. This item is subject to a FIXED SHIPPING price. This means that the shipping fee will be the displayed amount for all ship-to destinations shown. U.S. Fixed rate shipping prices are based on Continental US.- Alaska & Hawaii residents might be required to pay more and shipping can take as long as 3 weeks for delivery depending on what service is used to ship the item(s). If you prefer you may select a service of your choice however, additional shipping charges may apply. This item is eligible for pickup unless otherwise stated. We do not ship to any destinations that are not specified here. Customers in Iowa will be subject to Iowa's 7% sales tax on items that are being sold out of our Iowa location. FEEDBACK: We appreciate Positive Feedback and will leave positive feedback for all buyers who pay in a reasonable time frame or arrange for payment at a later date. NOTE: Our system is designed to automatically give you positive feedback as soon as you give us positive feedback. TRUST AND SAFETY:We have a 99%+ Positive Feedback. This is a track record that spans over 9 years of active listing with eBay. We are members of SquareTrade and Siegel’s is a member of the Better Business Bureau, Jewelers of America, and Iowa Jewelers Association. We stand behind everything we sell. You can feel fully confident and safe in any purchase with us. Our business is all about keeping our customers satisfied and happy with their purchases and service. OTHER INFO:If you have any problems with your transaction, contact us prior to leaving any neutral or negative feedback so that we can have the chance resolve any problems. We prefer to handle all communication via email/eBay messaging to ensure documentation. Thank you very much for your business! Good luck and Happy Bidding!!!", "ItemID": "312424733909", "EndTime": "2019-01-15T15:46:45.000Z", "StartTime": "2019-01-11T21:24:49.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Schecter-Diamond-Series-C-1-Platimun-right-hand-elec-guitar-EMG-p-ups-/312424733909", "ListingType": "FixedPriceItem", "Location": "Cedar Rapids, Iowa", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/3124247339098080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNTk5/z/S-kAAOSwJFBcOQbE/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNTk5/z/4NIAAOSwc6ZcOQbI/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNTk5/z/bHIAAOSwpaVcOQbN/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNTk5/z/T8IAAOSwMhVcOQbR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNTk5/z/9NUAAOSwyUFcOQbV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNTk5/z/c1YAAOSwsZhcOQbZ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNTk5/z/J6sAAOSw2~NcOQbd/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNTk5/z/Pb0AAOSwYwZcOQbi/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNTk5/z/c2cAAOSwsZhcOQbn/$_57.JPG?set_id=8800005007"], "PostalCode": "52402", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "scorebid", "FeedbackRatingStar": "Green", "FeedbackScore": 8250, "PositiveFeedbackPercent": 99.6, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 350.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 350.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "0***5", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 0}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Schecter Diamond Series C-1 Platimun right hand elec guitar with EMG p/ups", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["grey"]}, {"Name": "Brand", "Value": ["Schecter"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}]}, "HitCount": 36, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=7457647", "StoreName": "Siegels Diamond and Gold Outlet"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "instrument is very clean , plays great", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}