{"BestOfferEnabled": true, "Description": "The Gibson Explorer 2016 T's solid mahogany body delivers a big and punchy sound, while the 496R Hot Ceramic and 500T Super Ceramic humbuckers snarl with aggressive authority. This is a true, made in the USA rockmachine. (This one is in good condition, with only minor play scuffs, no chips, and includes the Gibson soft case) *shipping is based on actual cost through EBay/ UPS calculator. A Modern Update of the 1958 Explorer Add a dash of spice to your guitar collection with the Gibson Explorer solidbody electric guitar. This classic guitar is made from mahogany for the body and neck, with a 1-piece rosewood fretboard and a fixed bridge for rock-solid tuning stability. Once you get your hands on this guitar's comfortable slim neck with bound rosewood fingerboard, you won't be able to put this classic-styled, rock-ready axe down. A pair of 500T and 496R pickups deliver the classic tones you need for your next gig. Get ready to rock with the Gibson Explorer! Gibson Explorer Solidbody Electric Guitar at a Glance: * A genuine Explorer, through and through * Rounded neck profile is fast and comfortable * Two smoking hot ceramic humbuckers for hot tones * PLEK'd for precision playability A genuine Explorer, through and through Gibson built the Explorer with a solid mahogany body and a very comfortable set mahogany neck (topped with rosewood), so you know you're in for rich tones, great sustain, and outstanding midrange character. The Explorer has been embraced by hard rockers the world over for decades; its set-neck construction and fast-playing neck combine to give you an unbeatable sonic weapon onstage or in the studio. From the tonewoods to the rock-solid set-neck to the top-shelf hardware, this axe was made to rock. Rounded neck profile is fast and comfortable Some Gibsons had huge mahogany necks, but by 1960 the company made a number of modifications until those early '60s necks became among the fastest available. The special rounded neck profile of the Explorer is one favored by many of today's top players. You can move up and down the neck at blazing speeds, but the rosewood fingerboard still has that warm, classic Gibson feel, allowing easy access to the upper frets so you can really dig into your solos. It also sounds great when grabbing big fat power chords. The pearloid dots complete the vintage look. Two smoking hot ceramic humbuckers for hot tones Historically, Gibson has long been associated with the dark, punchy tone of the humbucking pickup with its fat low end and crunchy, complex midrange. The Explorer carries on that tradition with two scorching hot humbuckers with ceramic magnets (a 496R in the neck position and a 500T in the bridge position). The Explorer comes standard with coverless pickups but some Sweetwater guitarists even prefer them removed for a louder output and more top end. PLEK'd for precision playability This Gibson Explorer 2016 T feels fast and precise, thanks in large part to PLEK processing. Typically reserved for top-dollar custom guitars, this process levels the frets with pinpoint precision, providing you with the most playable fretboard you're likely to own. Each note rings loud and clear, and the fret edges feel smooth as silk. Gibson Explorer Solidbody Electric Guitar Features: * Comfortable, lightweight mahogany body lets you rock all night * Slim, lightweight, and smoothly contoured mahogany body won't tax your back * Bound rosewood fingerboard with dot inlays looks cool and is easy on your fingers * Slim mahogany neck feels great and provides ultra-fast action * Gibson 500T and 496R humbuckers give you access to a universe of tone * Nitrocellulose lacquer finish enhances this guitar's looks, feel, and tone", "ItemID": "173612987885", "EndTime": "2018-11-04T01:14:07.000Z", "StartTime": "2018-10-29T02:19:02.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2016-USA-Gibson-Explorer-Guitar-Cherry-/173612987885", "ListingType": "Chinese", "Location": "Belvidere, New Jersey", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1736129878858080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/1HEAAOSwBfhb1mpa/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/~YgAAOSwVYhb1mpM/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/0aoAAOSw2~Zb1mpJ/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/8rkAAOSwWB5b1mpU/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/hroAAOSwR6Bb1mpW/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/VgoAAOSwdW5b1mpO/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/R2QAAOSwhwlb1mqE/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/u64AAOSwfgRb1mpS/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/82AAAOSwQIFb1mpY/$_12.JPG?set_id=880000500F"], "PostalCode": "07823", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "gilf.sam", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 181, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 700.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 700.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "s***r", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 389}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2016 USA Gibson Explorer Guitar - Cherry", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model Year", "Value": ["2016"]}, {"Name": "Model", "Value": ["Explorer"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}]}, "HitCount": 174, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 710.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}