{"BestOfferEnabled": true, "Description": "Condition of Instrument This Vivian Campbell is in excellent condition with very minimal signs of use. Includes the original hardshell case and COA. A Legend Times Two How many guitar players can say that they played in TWO legendary bands? Vivian Campbell can, and that’s why he has a new signature Gibson Les Paul Custom! As the main guitarist in Dio, Vivian was responsible for laying down some of the heaviest riffs of the ‘80s. Anyone who’s ever spent time air-guitaring to “Rainbow in the Dark” knows that Vivian’s work with the late Black Sabbath frontman exemplified a rare combination of raw aggression and chops, but he got a chance to show off his more melodic side when he joined Def Leppard in 1992. Every Def Leppard record since has showcased Vivian’s muscular rhythm playing and tasteful lead work as well as his thoughtful songwriting. A Heavy Metal Monster Wildwood Guitars is full of huge Def Leppard and Dio fans, so we are ecstatic to announce that Vivian has partnered with the Gibson Custom Shop to design a guitar befitting his heavy metal legacy! The Vivian Campbell Signature Les Paul Custom is based on Vivian Campbell’s main stage guitar, a Frankensteined creation with a ’78 Custom neck and a modern lightweight Les Paul Standard body that he tricked out with LP Custom appointments. His new signature model pays homage to the hybrid styling and sound of the original with a few brand new twists that make it a fresh, vital addition to the Gibson Custom family! Rock of Ages First things first: this guitar has a finish unlike anything else the Gibson Custom Shop offers. It’s called Antrim Basalt Burst, and it was inspired by the color of the coastal rock formations outside his hometown in Northern Ireland (rock, rock, ‘til you drop—literally!). The finish is also unique in that it sports a rubbed patina that adds to the tasteful rustic vibe. Satin chrome hardware and Les Paul Custom “tuxedo” appointments provide the icing on the cake. All in all, this is a Les Paul with stunning looks that will make you want to stand up and kick love into motion! Fiery Tone Fit for a Pyromaniac The tone of this guitar is as awe-inspiring as a rainbow in the dark! You can certainly feel the magic of the soundwaves floating in the air thanks to the set of high-output passive humbuckers from Dimarzio. The neck pickup sounds like baked Alaska: hot, sweet, and creamy. It’s perfect for fat-sounding solos and thick, heavy riffage! The bridge pickup provides the prototypical glam metal rhythm tone, but it sounds thick enough for searing leads, too! Adrenalize Your Left Hand Playing the Vivian Campbell Les Paul Custom is a joy, too! The thin-to-medium C-shaped neck is a dead ringer for the lightning-fast necks attached to all the best Les Pauls from the seventies, so you can shred with precision and grace for hours without fatigue. The satin feel on the back of the neck provides excellent grip and aids left-hand stability, too! It’s also constructed from five pieces of maple and walnut, so you can see its stripe and know it’s clean! Ride the Tiger The Wildwood team is proud to showcase the Vivian Campbell Les Paul Custom for our exceptional customers. Its one-of-a-kind Antrim Basalt Burst finish is inspiring to the eyes, and its powerful, meaty tone is sure to pull lots of radical riffs out of your hands. We invite you to look between the velvet lies and glimpse a truth as hard as steel: the Vivian Campbell Les Paul Custom is one of the coolest artist models ever to come out of the Gibson Custom Shop. Specifications:Brand: UsedModel: Limited Edition Vivian Campbell Les Paul CustomFinish Color: Antrim Basalt BurstWeight: 9.75 lbsTop Wood: 2-Piece Figured MapleBody Wood: Lightweight Solid MahoganyNeck Wood: 5-Piece Maple/Walnut, Long TenonNeck Shape: Slim-to-Medium 1970s C-Shape, Satin FeelNeck Dimensions: .840 1st - .990 12thFingerboard: RichliteFingerboard Radius: 12\"Inlays: Pearl BlockScale Length: 24.75\"Width at Nut: 1.687\"Nut Material: CorianFrets: 22Pickups: DiMarzio Super Distortion w/Satin Cap in Bridge, DiMarzio Super 3 w/Satin Cap in NeckControls: 2 500K CTS Volume Pots, 2 500K CTS Tone Pots, Orange Drop Capacitors, Hand-Wired Harness, Switchcraft Toggle SwitchKnobs: Three Top Hat, One Speed KnobHardware: NickelBridge: Tonepros Satin LockingTailpiece: Tonepros Satin LockingTuners: Grover KidneysCase: Gibson Custom HardshellCOA: Yes", "ItemID": "362486956801", "EndTime": "2019-02-03T16:27:23.000Z", "StartTime": "2018-11-14T17:33:49.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Used-Used-Gibson-Custom-Vivian-Campbell-Les-Paul-Custom-/362486956801", "ListingType": "FixedPriceItem", "Location": "Louisville, Colorado", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/3624869568018080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTAwMFg0NzM=/z/qFsAAOSwEKpb7Fxx/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTUwMFg1MTQ=/z/HyQAAOSwQZVb7Fxy/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTUwMFg0OTg=/z/h7YAAOSwRDpb7Fxz/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAwMFg0OTU=/z/ms8AAOSwYh9b7Fx1/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTE4OVgxMDAw/z/i3kAAOSwHjtb7Fx2/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTk1WDEyMDA=/z/HHgAAOSwC9hb7Fx5/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/ODI3WDEyMDA=/z/MCAAAOSwAbxb7Fx7/$_12.JPG?set_id=880000500F"], "PostalCode": "80027", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "wildwoodguitars", "FeedbackRatingStar": "Purple", "FeedbackScore": 935, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 4599.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 4599.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "6***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 1426}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Used Used Gibson Custom Vivian Campbell Les Paul Custom", "ItemSpecifics": {"NameValueList": [{"Name": "MPN", "Value": ["VC022"]}, {"Name": "Brand", "Value": ["Does not apply"]}]}, "HitCount": 676, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=11482461", "StoreName": "Wildwood Guitars"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "14 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "SKU": "VC022", "NewBestOffer": false}