{"BestOfferEnabled": false, "Description": "Powered by Frooition Pro Shop Search 2003 Gibson Les Paul Standard Double Cut Plus Charcoal Flame w/Gibson Case USA Click here to view full size. Full Size ImageClick to close full size. Item Description 2003 Gibson Les Paul Standard Double Cut Plus electric guitar in good condition with a some dents and dings on the front with some chipping in sections of the top edge. The back also has a some of dents and dings of different sizes and severity. Nice transparent Charcoal finish on the beautiful AAA flame maple top with gold hardware and gold knobs. The gold hardware is worn through around the edges. The guitar has a nice action and the '60's profile mahogany neck with a bound fretboard and trapezoid inlays has a great feel. The frets are in very good condition with little to no playwear. The Gibson 490R/498T pickups have a nice tone with good output that sound great into a clean or overdriven amp. The guitar is equipped with a tune-o-matic style bridge, stop bar tailpiece and Grover tuners. Don't let the cosmetic issues of this instrument deter you. This is a great sounding, playing and still pretty good looking guitar with a full lifetime left in it. Includes the Gibson hard shell case. Made in the USA. Serial Number: 01853346 Weight: 7 lbs. 15 oz. About Us Payment Shipping Terms Returns About UsWe offer a large selection of quality pre-owned musical instruments and equipment from the industries finest manufactures including Akai, Ampeg, Boss, Denon, Digidesign, DigiTech, Epiphone, Fender, Gibson, Gretsch, Guild, Ibanez, Korg, Lexicon, Line 6, Mackie, Mesa Boogie, Marshall, Martin, MusicMan, MXR, Neumann, Peavey, Pioneer, PRS, Roland, Shure, Tascam, Taylor, TC Electronic and Yamaha. New gear arrives daily so check our store often. Lighthouse Sound, Inc. is proud to be an authorized dealer of the following brands of guitar effects pedals, pedal boards, amplifiers and accessories: Bearfoot FX, Bigsby, Cooper Stands, Dunlop, Earthquaker Devices, Ernie Ball, EVH, Fender Accessories, Keeley Electronics, Gretsch Accessories, Ken Smith Strings, Lava Cable, Martin Accessories, Mojo Hand FX, RotoSound, SnaKe Oil Strings, Snark Tuners, Suhr Guitars, Amps, Pedals and Pickups, Voodoo Lab and Wampler Pedals About Us Payment Shipping Terms Returns PaymentWe accept PayPal payments. All major Credit Cards are accepted through PayPal including Master Card, Visa, American Express and Discover. About Us Payment Shipping Terms Returns ShippingLighthouse Sound specializes in prompt, safe shipping. We take great care packaging every item to ensure safe shipment to you. We get your gear to you fast, most orders ship within 1 business day of payment clearance. Tracking information is uploaded to eBay and can be viewed from your eBay account. International customers are responsible for any duties, taxes, brokerage or other fees. Please check with your country's customs office to determine what these additional costs will be. These fees vary from country to country and we have no way to calculate them. About Us Payment Shipping Terms Returns TermsSales Tax - 7 % Ohio Sales Tax will be added to the total amount for all purchases delivered to Ohio. We take pride in our customer service and your satisfaction is very important to us. In the rare event that you have a problem with your item please contact us and we'll be happy to help. While all care is taken, any errors, omissions or variations in the item details are unintentional. About Us Payment Shipping Terms Returns ReturnsWe offer a 14 day return policy. Items must be returned to us within 14 days of the original delivery date. We ask that you please return the product in the original product packaging along with all included materials (manual, warranty card, all accessories) and in the original condition that it was received. Buyer is responsible for return shipping and insurance cost. Refunds will be issued upon return of the item less the original shipping charge and a 15% restocking fee will apply. Helpful Links More Items! This listing is currently undergoing maintenance, we apologize for any inconvenience caused. Powered by SixBit's eCommerce Solution", "ItemID": "233073870137", "EndTime": "2019-01-08T05:39:14.000Z", "StartTime": "2018-12-30T01:25:04.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2003-Gibson-Les-Paul-Standard-Double-Cut-Plus-Charcoal-Flame-w-Gibson-Case-USA-/233073870137", "ListingType": "FixedPriceItem", "Location": "Salem, Ohio", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/2330738701378080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/ARAAAOSw~flcKB5W/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/~c4AAOSwsQJcKB5Z/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/eHQAAOSw19dcKB5c/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/ywwAAOSwj91cKB5e/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/grwAAOSw2zRcKB5h/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/pe0AAOSwuNNcKB5j/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTUzWDEzNDI=/z/hUQAAOSw8zRcKB5m/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/5YIAAOSwh7tcKB5o/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/2~EAAOSwQ5pcKB5t/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/tn8AAOSwgb1cKB5r/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/-ZkAAOSw~rhcKB5R/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA1OVgxNjAw/z/9l0AAOSwdwVcKB5U/$_57.JPG?set_id=880000500F"], "PostalCode": "44460", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "lighthouse_sound", "FeedbackRatingStar": "TurquoiseShooting", "FeedbackScore": 33092, "PositiveFeedbackPercent": 99.6, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1149.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1149.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "d***8", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 2}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "CA", "GB", "DK", "RO", "SK", "BG", "CZ", "FI", "HU", "LV", "LT", "MT", "EE", "AU", "GR", "PT", "CY", "SI", "JP", "CN", "SE", "KR", "ID", "TW", "TH", "BE", "FR", "HK", "IE", "NL", "PL", "ES", "IT", "DE", "AT", "BS", "IL", "MX", "NZ", "SG", "CH", "NO", "SA", "UA", "AE", "QA", "KW", "BH", "HR", "MY", "CO", "PA", "JM", "BB", "BD", "BM", "BN", "BO", "EG", "GF", "GG", "GI", "GP", "IS", "JE", "JO", "KH", "KY", "LI", "LK", "LU", "MC", "MO", "MQ", "MV", "NI", "OM", "PK", "PY", "RE"], "Site": "US", "TimeLeft": "PT0S", "Title": "2003 Gibson Les Paul Standard Double Cut Plus Charcoal Flame w/Gibson Case USA ", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Model", "Value": ["Les Paul Std Double Cut"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Color", "Value": ["Charcoal"]}, {"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Features", "Value": ["AAA Flame Maple Top"]}, {"Name": "Model Year", "Value": ["2003"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Gibson Styles", "Value": ["Les Paul"]}, {"Name": "Color", "Value": ["Charcoal"]}, {"Name": "Model, Series", "Value": ["Std. Double Cut"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}]}, "HitCount": 146, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=22579709", "StoreName": "LHSound"}, "Country": "US", "ReturnPolicy": {"Refund": "Money back or replacement (buyer's choice)", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": true, "ConditionDescription": "2003 Gibson Les Paul Standard Double Cut Plus electric guitar in good condition with a some dents and dings on the front with some chipping in sections of the top edge. The back also has a some of dents and dings of different sizes and severity. Nice transparent Charcoal finish on the beautiful AAA flame maple top with gold hardware and gold knobs. The gold hardware is worn through around the edges. The guitar has a nice action and the '60's profile mahogany neck with a bound fretboard and trapezoid inlays has a great feel. The frets are in very good condition with little to no playwear. The Gibson 490R/498T pickups have a nice tone with good output that sound great into a clean or overdriven amp. The guitar is equipped with a tune-o-matic style bridge, stop bar tailpiece and Grover tuners. Don't let the cosmetic issues of this instrument deter you. This is a great sounding, playing and still pretty good looking guitar with a full lifetime left in it.  \n\nIncludes the Gibson hard shel", "QuantitySoldByPickupInStore": 0, "SKU": "43381", "NewBestOffer": false}