{"BestOfferEnabled": false, "Description": "The guitar is in excellent/mint condition. I purchased it on June 26, 2018 from Sweetwater. The guitar plays and sounds great. This guitar’s original list price was over $4900. The woods used are the same as the stock 594, but were hand selected.(Maple, Mahogany, and Rosewood) It comes with the wood library case, original accessories and receipt in the original box. I will ship to the lower 48 US only. I have sold over a dozen guitars on eBay. Check my Feedback. I will gladly provide additional photos if requested. Please contact me if you have any questions or would like to make an offer. Please include where this guitar is being shipped if you make an offer. Copied from the website it was purchased from: https://www.sweetwater.com/store/detail/WL1122QP--prs-wood-library-mccarty-594-fire-red-fade-natural-back-pattern-vintage-neck Custom-built PRS with Hand-selected Woods PRS has been making some of the finest electric guitars in the world since it first launched in 1985. One of the cornerstones of PRS guitars is the choice of tonewoods used to build their renowned solidbody lines. Partnering with PRS, Sweetwater has launched their Wood Library series by going straight to the PRS factory and hand-selecting the woods that go into the guitars. The PRS Wood Library McCarty 594 is just one of those hand-selected beauties that exudes artistry in its appearance and excellence in its tone. The mahogany body is topped with a gorgeous artist-grade maple top, while its lightweight mahogany neck is capped with an exquisite cocobolo fingerboard. And for the sound — a pair of coil tapped 58/15 LT pickups serves up a massive array of vintage humbucking and single-coil tones. If you're looking for an off-the-shelf guitar, keep on looking. If you're searching for an axe with distinction, you've found it in the Wood Library McCarty 594. Smooth vintage voice When you plug the Wood Library McCarty 594 into your favorite amplifier, you will be enveloped in a rich and decidedly vintage tone. The sound is similar to the warm, clear tones that have propelled the original 58/15 pickups to the top of many guitarists' favorite PAF-style list. But the lower wire turns of the 58/15 LTs deliver even more clarity and nuance. Pulling up on the tone knobs attains true single-coil chime, and you have full and independent control of each pickup by way of the 4-knob control layout. Updated dimensions for effortless playability Some of the least visible but most powerful features of the Wood Library McCarty 594 include a neck feel that maximizes your performance and comfort with an asymmetrical Pattern Vintage profile. Though much like their Pattern profile, the Pattern Vintage carve is slightly thicker to fill your hand in just the right way. And the strings will always feel silky smooth when playing and bending due to the guitar's 24.594\" scale length. Finally, a tweaked version of the Phase III locking tuners transfers even more string energy to the guitar's neck. PRS Wood Library McCarty 594 Electric Guitar Features: Custom-built electric guitar with woods that were hand-selected Mahogany capped with an exquisite artist-grade maple top looks and sounds amazing Coil tapped 58/15 LT (Low Turn) pickups deliver vintage humbucking and single-coil tones 4-knob layout allows individual control of each pickup's volume and tone Comfortable asymmetric Pattern Vintage neck carve Updated Phase III locking tuners transfer more energy to the headstock Ultra-tough V12 finish feels like the perfect balance between nitro and polyurethaneOn Oct-28-18 at 18:11:18 PDT, seller added the following information: In the original description I had put that that the guitar is Maple, Mahogany, and Rosewood. The fingerboard is actually Cocobolo not Rosewood as described in the original listing from the Sweetwater website. This is a much rarer wood thank rosewood and has similar tonal characteristics.On Oct-29-18 at 04:40:10 PDT, seller added the following information: I have had a few questions about the guitar the guitar as to why I am selling it, because I live in area effected by Hurricane Florence and what the case looks like. Please see below and feel free to contact me if you have any other questions. The case is black paisley fabric covered. I am selling it because I actually have another 594 that I purchased when they were first released a couple of years ago. I simply find myself playing the other one because it’s familiar, and I don’t want to hold on to it because although it’s expensive it shouldn’t just sit there looking good. There is no water damage. The higher end guitars I own evacuated with me to the Charlotte Area during Hurricane Florence and remained there with my sister in law for a few weeks following. There are no issues it plays great and is an outstanding condition.", "ItemID": "173611027358", "EndTime": "2018-10-30T17:36:10.000Z", "StartTime": "2018-10-27T17:36:10.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Paul-Reed-Smith-PRS-Wood-Library-McCarty-594-Fire-Red-Fade-Natural-Back-Mint-/173611027358", "ListingType": "Chinese", "Location": "Jacksonville, North Carolina", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1736110273588080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMDk4/z/-bcAAOSwEKpb0zCg/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTQzNlg4NzA=/z/wrYAAOSwJGdb0y~F/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/lsAAAOSwv1db0y-A/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/Yj4AAOSw2gNb0y-F/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/q84AAOSw8-lb0y-L/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/tMgAAOSwCgNb0y-I/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/3yMAAOSwTitb0y-D/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/jl4AAOSwlelb0y-B/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/vjAAAOSw-tlb0y-J/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/5lgAAOSwujJb0y-P/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/cr4AAOSwmDBb0y-S/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/MgYAAOSwEJlb0y-W/$_12.JPG?set_id=880000500F"], "PostalCode": "28540", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "abebomb33", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 168, "PositiveFeedbackPercent": 100.0}, "BidCount": 12, "ConvertedCurrentPrice": {"Value": 2550.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 2550.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "h***i", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 272}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Paul Reed Smith PRS Wood Library McCarty 594 - Fire Red Fade, Natural Back, Mint", "ItemSpecifics": {"NameValueList": [{"Name": "Body Material", "Value": ["Solid Wood"]}, {"Name": "Brand", "Value": ["PRS"]}, {"Name": "Model Year", "Value": ["2018"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["McCarty 594"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Body Type", "Value": ["Double Cut"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Body Color", "Value": ["Fire Red Fade"]}]}, "HitCount": 362, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 2600.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}