{"BestOfferEnabled": false, "Description": "At top 40 guitarsour customers satisfaction is our first concern.All of out items have a 14 day return policy.If after 14 days you are not completely satisfiedwith your purchase, please return it for a full refund....Peace be with you... *all returned items must be in the same condition theywere at the time of sale. All original packing must be included. # Up for Sale is a 2017 Fender '60s Jazzmaster Lacquer! Surf Green Finish! Made In Mexico! This is Really Cool. You are looking at a 2017 Fender '60s Jazzmaster Lacquer. Beautiful Surf Green Finish with Pao Ferron Fingerboard and tinted Maple Neck. RETROLICIOUS! From The Web: For guitarists who must have original-era Jazzmaster sound, look and feel, the Classic Series ’60s Jazzmaster Lacquer epitomizes the instrument during the 1960s, when guitarists from coast to coast used it to ride waves of reverb-drenched surf and instrumental music. With authentic features including a nitrocellulose lacquer finish in classic Surf Green and dual American Vintage Jazzmaster pickups, everything about it takes you back to a wildly creative time when rock music came into its own, from surf to psychedelia and more. Snappy, vivacious tone Fender equips the '60s Jazzmaster Lacquer with a pair of American Vintage '65 single-coil pickups. You'll be amazed at the balance of bark and bite you'll hear from your amplifier. It's one of the reasons you'll hear Jazzmasters in so many instrumental hits from the '60s — the tone is rich, balanced, and defined, the perfect foundation for many different musical styles.Offset waist for exceptional balance While it has a huge tonal range, many players love the Fender Jazzmaster simply because it feels great to wear and play, even for hours onstage. The offset waist on the '60s Jazzmaster Lacquer looks undeniably cool, but it also enhances the overall balance of the instrument. Whether you play sitting down or standing up, the Jazzmaster is one of the more comfortable guitars you'll find.Classic Jazzmaster tone shaping Lead and Rhythm tone circuits with individual tone controls give the '60s Jazzmaster Lacquer incredible flexibility. It's surprising that many of the most iconic Jazzmaster players often ignored the versatile switching options, but there's a whole world of tone to discover here. Between the wide tonal range of the '60s Jazzmaster Lacquer, your guitar amplifier, and your pedalboard, it's easy to sculpt your own unique tone.Fender '60s Jazzmaster Lacquer Solidbody Electric Guitar Features: Classic Jazzmaster guitar with vintage-accurate nitrocellulose lacquer finish Rich, snappy tone from dual American Vintage '65 Jazzmaster single-coil pickups Vintage looks and performance with the floating vibrato bridge/tailpiece Dual tone circuits give you a wide tonal range suitable for virtually any music style Comfortable maple neck capped with smooth-feeling and clear-sounding pau ferro Tech Specs Body Type: Solidbody Body Shape: Jazzmaster Left-/Right-handed: Right-handed Number of Strings: 6 Body Material: Alder Body Finish: Nitrocellulose Lacquer Color: Surf Green Neck Material: Maple Neck Shape: C Radius: 7.25\" Fingerboard Material: Pau Ferro Fingerboard Inlay: Pearloid dots Number of Frets: 21, Vintage-Style Scale Length: 25.5\" Nut Width: 1.650\" Nut Material: Synthetic bone Bridge/Tailpiece: 6-saddle vintage-style adjustable with floating tremolo tailpiece Tuners: Vintage-Style Neck Pickup: American Vintage '65 Jazzmaster Single-coil Bridge Pickup: American Vintage '65 Jazzmaster Single-coil Controls: 1 x volume (bridge), 1 x tone, 2 x thumbwheels (neck volume, tone), 2-way slide switch (rhythm/lead tone), 3-way toggle switch Strings: Fender USA, NPS, (.010-.046 Gauges) Case Included: Hardshell case Our luthier did a complete setup. Brand new strings were installed. Gig ready on Arrival! Great Sounding and Playing Guitar. Serial Number: #MX17886573 Nut Width: 1.65\" Weight: 7.60 lbs. Complete Package with Fender Hard Shell Case Included! Due to CITES Treaty for Endangered Wood (Mahogany, Rosewood) We no longer ship out of the USA. Cosmetics: Excellent Condition. Pristine. Dripping with \"Mojo\". It is used. Not perfect. Overall, a really nice guitar. Look at the pictures closely. They will tell the story. Top 40 guitars is a Veteran owned business.", "ItemID": "392222631000", "EndTime": "2019-02-04T02:05:14.000Z", "StartTime": "2019-01-25T02:05:14.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2017-Fender-60s-Jazzmaster-Lacquer-Surf-Green-Finish-RETROLICIOUS-NO-RESERVE-/392222631000", "ListingType": "Chinese", "Location": "Santee, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/3922226310008080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTQyOFgxMDI4/z/98AAAOSwrClcSkwX/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/rjUAAOSwUWtcSkvC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI5Mlg5MzE=/z/WaoAAOSwWrNcSk0i/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA1OVg4NDg=/z/bOwAAOSwSudcSkzO/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU1MVg4OTI=/z/bk0AAOSwSudcSk4j/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU0N1g4ODc=/z/CFUAAOSwm5xcSk5W/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU1Nlg5NTg=/z/e0oAAOSwm~1cSk3o/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQ2M1g5NTg=/z/Qf4AAOSwuvpcSk3A/$_57.JPG?set_id=8800005007"], "PostalCode": "92071", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "top40powertrio", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 13211, "PositiveFeedbackPercent": 99.7}, "BidCount": 19, "ConvertedCurrentPrice": {"Value": 840.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 840.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "u***u", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 33}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2017 Fender '60s Jazzmaster Lacquer - Surf Green Finish! RETROLICIOUS NO RESERVE", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Model Year", "Value": ["2017"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["Mexico"]}, {"Name": "Body Color", "Value": ["Surf Green"]}, {"Name": "Model", "Value": ["'60s Jazzmaster Lacquer"]}]}, "HitCount": 746, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=47416021", "StoreName": "Top 40 Guitars"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 850.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "2017 Fender '60s Jazzmaster Lacquer Electric Guitar, Excellent Condition, See ad below for Full Description", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}