{"BestOfferEnabled": false, "Description": "Perfect for Christmas! A gorgeous, professional quality electric guitar and Peavey Vyper VIP1 amp included. Plug and play on Christmas morning! NO RESERVE! Our boy learned to play with this setup and is now moving from his hard rock phase to a blues rock phase and needs a new setup for that. That makes this killer hard rock setup available to you as a package. Both the guitar and the amp features are described below. Guitar cost new: $850-$950 (Guitar Center) Condition: Both the guitar and amp are used, but have been lovingly cared for. The amp is basically in perfect condition. The guitar has a small number of barely noticeable scuffs and a tiny ding on the quilted top in the spot your wrist would be when playing. See pics for details on both the guitar and amp. All cords are included. *NOTE: I took the guitar outside for pics to show off the color. It’s never been outside otherwise. GUITAR: This is a 2008 SCHECTER Diamond Series Hellraiser Special C-1 in Black Cherry w/EMG Active CoilTap & Floyd Rose tremolo/whammy bar. Factory description says it’s designed to deliver amazing hard rock/metal tones (it does!). Its mahogany body has the “ultra-access cutaway” that lets artists get all the way up the neck. Its rosewood fretboard has 24 extra-jumbo frets and gothic cross inlays in abalone (mother-of-pearl). Its Active EMG pickups deliver real power and you can activate single-coil sound via push/pull volume knobs. The abalone (mother-of-pearl) binding is gorgeous against the black cherry quilted maple top. It has Grover tuners, and black chrome hardware. Factory Specs: * Construction: Set-Neck with Ultra Access * Scale length: 25-1/2\" * Body: Mahogany (black cherry finish includes quilted maple top) * Neck: 3-pc. Mahogany * Fingerboard: Rosewood * Frets: 24 extra-jumbo * Inlays: Gothic Cross * EMG active pickups * Push/pull knobs for single coil * Electronics: 2 Vol with push/pull coil-splitting/Tone/3-Way Switch * Bridge: Floyd Rose 1000 Series Tremolo System * Abalone/mother-of-pearl binding * Tuners: Grover * Hardware: Black chrome AMP: Peavey Vyper VIP-1, 20 watts, effects built-in (no need for mom & dad to buy effects pedals right away) AND has headphone jack (also a great feature for mom and dad) ;) Amp cost new: $149 (Guitar Center) Manufacturer description: The Peavey VYPYR® VIP is the first amplifier that contains Electric guitar, Bass guitar, and Acoustic guitar amp models. Now for the first time ever using our Variable Instrument Input, a single amp can provide amplification for a variety of instrument types. Not only does the amplifier morph from a bass amp to an acoustic amp to an electric amp, it also (for the first time ever in an amplifier in this category) allows the electric guitar player access to instrument models as well. The VYPYR combines Peavey's exclusive TransTube® analog circuitry with a powerful 32-bit, floating point SHARC processor to deliver uncompromised tone, making the VYPYR series the best sounding modeling amplifiers available. All VYPYR effects, amp models and parameter controls can be accessed via the amp itself, with no need to hook the amplifier to a computer. Peavey's WYSIWYG control surface quickly allows the user the ability to see and adjust the control position -- no guessing where the control is supposed to be or having to manually move it to where it should be from preset to preset. VYPYR's new USB bi-directional data and audio port provides an easy way to record and/or connect to our VYPYR software and store presets, get lessons, and practice to backing tracks while connected to your computer. The VYPYR VIP series gives you all of the revolutionary features from the original VYPYR series, now even better. More power, more effects, more amp models, Variable Instrument Input, instrument models, and more make this the ultimate amplifier. Features: 20 watts Acoustic guitar simulation Bass guitar Simulation Acoustically ported semi-closed back Patented TransTube® technology 16 Presets Specially voiced 8\" modeling speaker 25 amp accessible effects 36 on board amp models 6 bass amp models 6 acoustic amp models On-board looper - activated with optional Sanpera™ I or II WYSIWYG (what you see is what you get) controls Amp accessible real time dual parameter controls Amp accessible global reverb and delay Tap Tempo Bi-directional USB - Data - Midi - Audio record out Aux/MP3/CD input Studio quality headphone out Up to 4 effects simultaneously Enhanced chromatic tuner Weight Packed: 20.00 lb(9.071 kg) Width Packed: 17.5\"(44.45 cm) Height Packed: 17.5\"(44.45 cm) Depth Packed: 10\"(25.4 cm) Total guitar/amp package cost new: $999-$1099 (Guitar Center) Please note: I have attempted to show the full condition of this guitar/amp package via photos and description. Both are used. While lovingly cared for, normal scuffing/minor dings from normal use are present. Both guitar and amp are fully functional and ready to play. You or your future rock star will be delighted by the sounds you can get from this setup. Will ship with insurance. Will work with auction winner to establish final shipping cost with insurance included. Will ship faster if desired. Will work with buyer to determine final shipping cost of overnight desired. No overseas shipping.", "ItemID": "153288646826", "EndTime": "2018-12-10T17:00:01.000Z", "StartTime": "2018-12-03T17:00:01.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Package-Schecter-Diamond-Series-C-1-Hellraiser-w-Floyd-Rose-EMG-PLUS-Amp-/153288646826", "ListingType": "Chinese", "Location": "Gulf Shores, Alabama", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1532886468268080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/wm0AAOSw8BdcBVN4/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/kbYAAOSwZ8pcBVOF/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/MGgAAOSwVMJcBVOX/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/MDEAAOSwVMJcBVN7/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/FewAAOSw5tNcBVOb/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/kPEAAOSwzd9cBVOB/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/RB0AAOSwcttcBVOh/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/6vEAAOSwa1hcBVOI/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/XjMAAOSwzZNcBVOU/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/afQAAOSwfMlcBVOe/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/wpMAAOSw8BdcBVOQ/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/XB0AAOSwBPRcBVOM/$_12.JPG?set_id=880000500F"], "PostalCode": "36542", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "scrider1", "FeedbackRatingStar": "Blue", "FeedbackScore": 80, "PositiveFeedbackPercent": 100.0}, "BidCount": 44, "ConvertedCurrentPrice": {"Value": 325.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 325.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "b***a", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 303}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Package: Schecter Diamond Series C-1 Hellraiser w/ Floyd Rose & EMG PLUS Amp!", "ItemSpecifics": {"NameValueList": [{"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Brand", "Value": ["Schecter"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "MPN", "Value": ["1795"]}]}, "HitCount": 408, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 330.0, "CurrencyID": "USD"}, "ProductID": {"Value": "137067983", "Type": "Reference"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}