{"BestOfferEnabled": false, "Description": "Gibson SG 60’s Tribute Black Electric Guitar EMG Pickups w/ Hard Case – 2013 USA Gibson SG 60’s Tribute Black Electric Guitar EMG Pickups w/ Hard Case – 2013 USAPlease read the item description carefully before bidding. We will describe the item to the best of our ability.Please look at the pictures and judge for yourself. Click images to enlarge Description Up for auction is this Gibson SG 60’s Tribute Black Electric Guitar with Zakk Wylde EMG Active Humbucker Pickups. This is a pre-owned guitar that is in nice condition with some minor signs of wear/use. The back of the neck has some minor paint chips and the side of the guitar where your strummer arm would be is starting to wear as well. Overall the guitar is in nice condition and has been restrung and tested! The listing includes the guitar and hard case pictured. The case does not include keys. Lightly Used Not Abused. Comes from a Smoke Free and Pet Free Home. Please read the item description carefully before bidding. We will describe the item to the best of our ability. Please look at the pictures and judge for yourself. Please see my other auctions as I would happily combine shipping! I charge actual shipping cost for the combined shipping. Please Email thru eBay using the Item number if you have any questions. WE DO NOT SHIP OUTSIDE THE UNITED STATES- NO INTERNATIONAL BIDDERS. Once you have paid for the item, please email us if you need a tracking number and we will reply with the information. If you have any questions, please send them through eBay Mail and I will try to answer them as quickly as possible. Thank you. Kevin Bid With Confidence; We Have Been in the Retail Business for Over 22 Years We accept Only PayPal Payment for eBay's service to make fast, easy, and secure payments for your eBay purchases! All customers must have a USA Confirmed Address and USA Account from PayPal. **Please be careful WE DO NOT MAKE SECOND CHANCE OFFERS on our items! So be careful!** We do not generally issue 2nd Chances at any of our merchandise, but if we do the payment will come directly to us, MCLEANGOODIES. You should never pay anyone other than the specific seller of an item! So please be aware of scams and spam email. According with eBay's policy, We only take PayPal that has a confirmed USA account. Please read our payments policies because we can only receive payments according to these policies. You must have a USA eBay account and a confirmed USA PayPal account as well. Shipping within the Continental US (lower 48 states): $22.30 Terms of Bidding Payment must be received through PayPal within 3 business days of auction closing. After 3 days we will file a non-paying bidder alert and relist the item. Shipping We ship via UPS Ground, which does not service Hawaii, Alaska, APOs, FPOs, or PO Boxes. Please give a physical address for shipping. We do not ship outside the lower 48 States. We cannot ship to PO Box addresses. Hawaii and Alaska residents, please ask for shipping costs before bidding. We ship to Alaska and Hawaii through UPS 2-Day Air only. WE DO NOT SHIP OUTSIDE THE 48 STATES- NO INTERNATIONAL BIDDERS. Item Description We have described this item to the best of our knowledge and ability. We have also described any flaws or faults in the item to the best of our ability. The pictures in the listing are of the actual item being sold, so please judge for yourself. This product is being sold as is with no warranty unless otherwise stated. Items are guaranteed to be in stated condition. If you are not satisfied with an item, you must contact us within 72 hours of receipt of the item. Thank you. If you have any questions, feel free to email me and I will try to answer as best that I can. Buyer pays actual shipping and insurance costs. Buyer pays with Paypal. Please see pictures below. Illinois residents must pay sales tax. Buyer pays shipping, handling, and insurance. As usual $0.99 No Reserve! WINNER PAYS by PAYPAL!!! If you intend to bid on our items, please read our terms and make sure you agree with them. Thank you and Good Luck. Get images that make Supersized seem small.Tailor your auctions with Auctiva's Listing Templates! THE simple solution for eBay sellers. Track Page Views With Auctiva's FREE Counter", "ItemID": "333020489132", "EndTime": "2019-01-27T19:35:39.000Z", "StartTime": "2019-01-17T19:35:39.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Gibson-SG-60-s-Tribute-Black-Electric-Guitar-EMG-Pickups-w-Hard-Case-2013-USA-/333020489132", "ListingType": "Chinese", "Location": "Bloomington, Illinois", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/3330204891328080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/OTYwWDEyODA=/z/~FcAAOSwC9hcQNkP/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDEyODA=/z/qDsAAOSwMKxcQNkP/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDEyODA=/z/Z2wAAOSwSudcQNkP/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDEyODA=/z/Ah4AAOSwj9hcQNkO/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDEyODA=/z/Y0kAAOSwg5FcQNkP/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDEyODA=/z/~BEAAOSw5pRcQNkP/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDEyODA=/z/mGgAAOSwTxJcQNkP/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDEyODA=/z/6hgAAOSwWrxcQNkP/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDEyODA=/z/7MAAAOSw8fRcQNkP/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDEyODA=/z/0LYAAOSwRzZcQNkO/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDEyODA=/z/6DIAAOSwRGhcQNkP/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/OTYwWDEyODA=/z/B8QAAOSwoRpcQNkP/$_1.JPG?set_id=880000500F"], "PostalCode": "61704", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "mcleangoodies", "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 12224, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 55, "ConvertedCurrentPrice": {"Value": 631.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 631.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***s", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 362}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Gibson SG 60’s Tribute Black Electric Guitar EMG Pickups w/ Hard Case – 2013 USA", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "MPN", "Value": ["SG"]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Model", "Value": ["60's Tribute"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "String Configuration", "Value": ["6 String"]}]}, "HitCount": 1213, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=12894106", "StoreName": "mcleangoodies"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 641.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "TopRatedListing": true, "GlobalShipping": false, "ConditionDescription": "Lightly Used Not Abused.  Nice condition with some minor signs of wear use.  The guitar has Zakk Wylde Active EMG Humbucker Pickups and comes with the Hard Case pictured.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}