{"BestOfferEnabled": false, "Description": "Add Us To Your Favorites List! Check Out Our Other Items! DESCRIPTION Item #: Title: Fender Telecaster Mexican Made Cream Color Used Electric Guitar-Item is in pretty good condition with signs of wear & usage! Some scratches and dings! See photos!-COMES AS IS with the items that are shown in the photos & NOTHING ELSE!-Great for collectors! Guitar lovers delight!!!-Please see all photos!!!! Please see all the photos for further details, check with the manufacturer's website and feel free to contact us should you have any questions. Please read our policies below before making your purchase. TERMS OF SALE If you should decide to make a purchase with us this is what we like you to know; Please review the description, pictures and buying terms very carefully before bidding! We do our best to offer you accurate photos and descriptions of the items we sell, however because we are selling secondhand items we do not always have an accurate history on that item. All items come as they are shown in the photos, including with or without accessories (unless otherwise noted). BATTERY POLICY for all electronics and power tools. Pretty much anything that takes a battery; Used batteries are variable; they can last a few minutes, or they can last a few hours. It is impossible for us to test and guarantee each and every battery's length of charge. We test that all batteries hold a charge at the time of purchase, however we do not time how long they hold a charge. Therefore, it is our policy to guarantee that your battery will hold a charge but not the length of that charge. STORE COUPONS: Coupons found on our website, or in other advertisements, DO NOT apply to eBay sales (including local pick-ups) as our eBay listings already reflect our discount prices. WE RESERVE THE RIGHT TO STOP ANY LISTING PRIOR TO WINNING BIDS OR PURCHASES BECAUSE ALL OF OUR ITEMS ARE FOR SALE LOCALLY IN OUR STORE AS WELL. PAYMENTS We currently only accept payments via PayPal.All payments must be paid with-in 3 days of winning your bid or purchase. After the third day a non-payment case will be open and the item will be re-listed for sale. If you should need an extra day or two please contact us as soon as possible so we do not open an unpaid item case or re-list the item. {{All sales are subject to applicable sales tax}} SHIPPING We will ship only to a confirmed PayPal / eBay address and only to the contiguous United States (Lower 48 States). Large, or over-weight items will be shipped via UPS and therefore can not be shipped to a P.O. Box. Your item will be packed and shipped with-in 1 day of cleared payment. RETURNS If you want to return an item, PLEASE contact us FIRST, BEFORE you open a case with eBay, or send an \"item not as described\" email. We accept returns within 14 days of delivery depending on eBay's policies and our store return policy. ALL returned items MUST be in the same condition as purchased. We do not accept returns on the following: • Sealed packages that have been opened. • Any item that has been modified without our prior approval.We care for our customers and want to offer the best customer service that we can provide. We are easy to work with and will always do our best to work out any problems that may occur. Refunds will be processed with-in 3 days after we receive the returned item. ALL returned items MUST be insured. We are not responsible for uninsured returned items. ff", "ItemID": "163512667875", "EndTime": "2019-02-04T14:54:57.000Z", "StartTime": "2019-01-28T14:54:57.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fender-Telecaster-Made-Mexico-Cream-Color-USED-/163512667875", "ListingType": "Chinese", "Location": "Central Valley, New York", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1635126678758080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/3uAAAOSwtINcTxeh/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/R98AAOSw~VBcTxer/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/dR8AAOSw8zRcTxb~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/gmMAAOSwm~1cTxcD/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/ClgAAOSwvwRcTxcI/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/i1gAAOSwpRxcTxcL/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/Q3UAAOSw5r1cTxcO/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/W3EAAOSwakxcTxcR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/dOgAAOSwZnpcTxcV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/v8YAAOSwnjZcTxcY/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/lAAAAOSw~llcTxca/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/T3MAAOSwRzZcTxcd/$_57.JPG?set_id=8800005007"], "PostalCode": "10917", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "goldbuyers1867", "FeedbackRatingStar": "Purple", "FeedbackScore": 645, "PositiveFeedbackPercent": 99.4}, "BidCount": 44, "ConvertedCurrentPrice": {"Value": 346.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 346.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***e", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 3}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Fender Telecaster Made in Mexico, Cream Color - USED", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "Country/Region of Manufacture", "Value": ["Mexico"]}, {"Name": "Model", "Value": ["Telecaster Mexico"]}, {"Name": "Body Color", "Value": ["cream"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}]}, "HitCount": 1116, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 351.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Has signs of wear/tear! See all photos as I am not an expert!!!", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}