{"BestOfferEnabled": true, "Description": "Fender Modern Player Telecaster Thinline DeluxeUpgraded Locking Tuners - Brand New! ($60 upgrade) Barely used in brand new mint condition! **** Ships to Continental USA only in Original Packaging Double Boxed **** Contact me if you have less than 20 feedback. DO NOT buy or make offers if you have less than 20 feedback please Country, Blues, Rock - This Tele Does it All! From country twang to blues-rock bite, Fender's Modern Player Telecaster Thinline Deluxe electric guitar gives you the expression and tone you've always wanted. Like the rest of the Modern Player Series, the Modern Player Telecaster Thinline Deluxe features a comfortable C-shaped neck. Its chambered mahogany body and string-through-body Stratocaster bridge give you epic sustain and a fat, woody sound. But the crowning glory of the Modern Player Telecaster Thinline Deluxe is its pair of classic-style MP-90 single-coil pickups. Ask anyone at Sweetwater, and we'll tell you all about Fender's amazing Modern Player Telecaster Thinline Deluxe! Fender Modern Player Telecaster Thinline Deluxe Semi-hollowbody Electric Guitar at a Glance:The bite and growl of P-90-style pickups Resonant chambered mahogany body Rock-solid Strat-style bridge The bite and growl of P-90-style pickups Nothing beats the crunch and growl of classic P-90-style pickups. That's why Fender gave their Modern Player Telecaster Thinline Deluxe a pair of their custom MP-90 single-coils. These pickups let the Modern Player Telecaster Thinline Deluxe sing the blues and tear out gritty rock riffs with ease. Discover the tone that's been shaping modern music for decades with the Fender Modern Player Telecaster Thinline Deluxe! Resonant chambered mahogany body Not only does the Modern Player Telecaster Thinline Deluxe's chambered mahogany body make this an incredibly comfortable guitar to play, but it also adds depth and resonance to its tone. Fat, warm, and woody, the Modern Player Telecaster Thinline Deluxe goes beyond the classic tone of a Fender Telecaster. Rock-solid Strat-style bridge To top it all off, Fender decided to give the Modern Player Telecaster Thinline Deluxe a modern Stratocaster bridge. This bridge features a 6-saddle hardtail configuration, which lets you perfectly tune your axe. Even cooler, the Modern Player Telecaster Thinline Deluxe gives you the extra-tight sonics of a string-through-body tailpiece, providing you with tons of extra sustain. Fender Modern Player Telecaster Thinline Deluxe Semi-hollowbody Electric Guitar Features:Classic Tele style with a unique twist Chambered mahogany body is light on your shoulders and heavy on tone Dual MP-90 single-coil pickups provide plenty of bite and growl String-through-body configuration adds remarkable sustain Vintage-style 6-saddle hardtail Stratocaster bridge lets you lock in your tuning The Fender Modern Player Telecaster Thinline Deluxe electric guitar gives you classic Tele tone with a cool thinline twist! NOTE: This product is available in the United States only - no international sales. Tech Specs Body Type: Semi-hollowbody Body Shape: Telecaster Left-/Right-handed: Right-handed Number of Strings: 6 Body Material: Mahogany Body Finish: Urethane Gloss Color: 3 Tone Sunburst Neck Material: Maple, Bolt-on Neck Shape: C Radius: 9.5\" Fingerboard Material: Maple Fingerboard Inlay: Black dots Number of Frets: 22, Medium Jumbo Scale Length: 25.5\" Nut Width: 1.650\" Nut Material: Synthetic Bone Bridge/Tailpiece: Vintage Style 6-Saddle Strings-Through-Body Hardtail Bridge Tuners: Vintage Style Tuning Machines Neck Pickup: Modern Player MP-90 Pickup Bridge Pickup: Modern Player MP-90 Pickup Controls: 2 x Volume, 2 x Tone, 3-way pickup selector Manufacturer Part Number: 0241202500", "ItemID": "333072165900", "EndTime": "2019-02-17T01:54:47.000Z", "StartTime": "2019-02-13T18:59:19.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Fender-Modern-Player-Telecaster-Thinline-Deluxe-Upgraded-MINT-BOX-/333072165900", "ListingType": "FixedPriceItem", "Location": "Saint Paul, Minnesota", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/3330721659008080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/jagAAOSwUjVcU455/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/KzoAAOSwhBxcU4-i/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/TrUAAOSwK89cU45j/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/qQUAAOSwR3tcU45T/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/m0gAAOSwvDpcU45V/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/TSoAAOSwo6NcU45Y/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/JrAAAOSw8~hcU45a/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/g3IAAOSwoFNcU45d/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/-5cAAOSwmaJcU45l/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/3foAAOSwEUdcU45p/$_57.JPG?set_id=8800005007"], "PostalCode": "55111", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "zrtel", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 317, "PositiveFeedbackPercent": 95.7}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 399.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 399.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "n***3", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 206}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "** Fender Modern Player Telecaster Thinline Deluxe - Upgraded MINT IN BOX **", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Fender"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}, {"Name": "Model", "Value": ["Telecaster Thinline"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Country/Region of Manufacture", "Value": ["China"]}, {"Name": "Body Type", "Value": ["Semi-Hollow"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Body Color", "Value": ["transparent black"]}]}, "HitCount": 376, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "MINT IN BOX/ Brand New Condition. Upgraded Gotoh Locking Tuners", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}