{"BestOfferEnabled": true, "Description": "1960s Kapa Continental, Sunburst Finish, All Original, All Complete and in Excellent Condition. A Kapa Continental from the mid to late 1960s in remarkably clean shape. This is a fifty year old American-made guitar that that shows virtually no signs of age or use. As I photographed the guitar and began to think about how I would write about her, it made me a little uneasy to think that I might be describing the condition as \"perfect\" because that seemed beyond belief for a five-decades-old instrument. I was actually relieved, when looking the guitar over in direct sunlight, to find a 1/8\" dimple or dent on the inside surface of the right-side cutaway (see photo). I've owned this Kapa for 8 or 9 years and had never noticed it before. The dent doesn't penetrate the finish and may have already been there prior to the application of the finish. When I photographed it I positioned the guitar in such a way that the light really bounces around inside the little divot, because it wouldn't have been posssible to see what I was even talking about otherwise. Aside from that: The Hofner staple-top pickups have the expected british invasion vibe - strong output with a bit of chime and jangle.The electronics are perfect.The maple neck is super clean as can be seen in the photos. Same is true for the rosewood fretboard and frets.The original finish remains glossy and smooth, with absolutely no checking. None.The Schaller tuners are in excellent condition; snug - no slippage or play.The action is low and clean.Everything mechanical and electrical works as it should.Everything is original to the guitar and nothing is missing.You almost never see a Continental that still has its bridge guard. Yes, this one even has its bridge guard! While I don't know this guitar's history during the 40+ years before she came to me, it appears that she sat in a case or a closet, largely unplayed. There just doesn't seem to be any other explanation. As a teenager in the DC area I bought a candy-apple red Kapa Continental 12-string in '67 or '68 from Veneman Music in Silver Spring, MD. It was my pride and joy but several years later, as a college-age idiot, I sold her and my Ampeg. In 2009, the year before I picked up this beauty, I had bought a wonderful Continental with substantial \"honest playing wear\" perfectly appropriate to her age. It felt like a reunion to hold such a familiar guitar again after all those years, Anyway, after buying this pristine example I'd still tend to grab my more beaten-up Kapa, because this one was so immaculate and I wanted to keep her that way. Now I'm in the midst of down-sizing and this beauty needs a new home. Continentals are feel-good guitars, from the off-set Mustang/Jaguar-ish bodies to the sixties vibe of the pickups to the thin maple necks that feel great in the hand. Maybe you're looking for a quality vintage electric that's a blast to play (there are some pretty good videos out there on youtube) or maybe you're looking for a 50 year old guitar that seems to have emerged from a time capsule... either way, this is probably the guitar you're looking for. I have no case for sale, but she'll ship inside a nice TKL gig bag. This item comes from a smoke-free environment. For the sake of background info, here are some excerpts from a uniqueguitar.blogspot.com post from 2010: \"KAPA Guitars was founded in 1963 by a Dutch immigrant named Koob Veneman. Mr. Veneman was the owner of Veneman's Music Emporium, a musical instrument store in Silver Spring Maryland. During the early 1960’s Veneman made the decision to build his own unique line of guitars. This was the years of the British Invasion and the Guitar Boom and Mr. Veneman wanted his piece of the pie.The necks, pickups and electronics originally came from German manufacturer Hofner. The guitars generally were equipped with two slider switches to control on/off function of the pickups, which is typical of Hofner's design of the 1960’s. In the company's later years they made their own pickups, which looked similar to Hofner units.The tuners were made by Schaller. Kapa made his own bridges and tremolo assemblies. Most KAPA guitars are equipped with the tremolo.KAPA necks are ultra thin, which is sort of a ’60 thing. The bodies also were thin in comparison to Fender and Gibson bodies. To the unfamiliar, one could mistake a KAPA for a Fender guitar, based on it's Jaguar and Stratocaster-like shapes and the shape of the headstock. The KAPA logo used script on the headstock was very similar to what we call the Fender Spaghetti script. However the KAPA logo had a circle with a crest in the middle that was similar to the Veneman family crest.KAPA guitars were founded on some great principals set up by the Venemans. The instruments were well made, playable and affordable. Plus they were made in the USA.\"", "ItemID": "163493865192", "EndTime": "2019-01-25T05:17:00.000Z", "StartTime": "2019-01-18T18:34:55.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1960s-Kapa-Continental-Sunburst-All-Original-Complete-Excellent-Condition-/163493865192", "ListingType": "FixedPriceItem", "Location": "Santa Fe, New Mexico", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/1634938651928080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg2MTY=/z/7qYAAOSwgfRcQVXi/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg1ODY=/z/iMQAAOSw5wFcQVX0/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDYy/z/iKcAAOSw5AhcQVYE/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDc5/z/R1gAAOSwMKxcQVYK/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg2NzY=/z/QPwAAOSw8zNcQVYQ/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg2NDE=/z/oSYAAOSwVsRcQVYU/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDYy/z/kV8AAOSwQLVcQVYc/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMDY0/z/qHYAAOSwmE9cQhUG/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFg5NTg=/z/0zkAAOSwvytcQVYh/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/RKkAAOSw5tNcQVYo/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA2MlgxNjAw/z/xd8AAOSwIqxcQVYs/$_32.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjY0/z/WCEAAOSw3T5cQVY3/$_32.JPG?set_id=880000500F"], "PostalCode": "87507", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "kskccharlie", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 186, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 795.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 795.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "r***9", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 80}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "1960s Kapa Continental - Sunburst, All Original, Complete & Excellent Condition", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Kapa"]}, {"Name": "Model", "Value": ["Continental"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Body Type", "Value": ["Solid, double-cutaway"]}, {"Name": "Body Color", "Value": ["Sunburst"]}, {"Name": "Size", "Value": ["Full Size"]}, {"Name": "Features", "Value": ["Zero fret, tremolo bar, adjustable truss-rod"]}]}, "HitCount": 89, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}