{"BestOfferEnabled": true, "Description": "Proud to offer for your pleasure: 2015 Gibson Midtown. She has that killer Jazz/Blues tone that we love in a Gibson Guitar of this type.This guitar is capable of multiple tonal nuances & expressions crossing the genres of jazz, rock, blues, fusion, country and just about anything the professional musician needs. This similar style version of an ES-335 is far more versatile than its bigger archtop cousin yet can replicate the jazz box sound as easily as it can deliver blistering solid body style tones. If you are a versatile player who wants to combine the Gibson tones of an ES-335, 175 and Les Paul all in one guitar, you should check one of these out. This guitar has been played sparingly. That being said, I could find little if any signs of wear. Super clean. It includes Hard Shell Gibson Case, Tools, Owners Manual/ Pre ship check list. Made to be played and heard, this one sounds great. You will receive item pictured, look at photos carefully. Item sold as is no returns, you buy it, you bought it. No Reasonable Offer Refused. This is a thin the herd type deal, will have fresh set of strings/fret board condition before shipping. If you are looking for a great sounding Gibson you will not be afraid to gig with your search is over... here she is. Buyer to pay $85.00 flat shipping fee for US More Details: Ultra-playable, the Midtown Standard starts with premium tone woods which covers the sonic spectrum, from hard rock to soft jazz with an elegant, upscale design. The two matched Burstbucker pickups power the big, full sound with its hallmark smooth sustain and tremendous tone: Features: Semi-hollow Mahogany Body with Maple Top featuring Chambered F Holes Mahogany Set-Neck with Bound Rosewood Fingerboard Grover Tuners Gibson Burstbucker 1 and 2 Pickups Hardshell Case Included The genuine rosewood fingerboard carries 22 medium-jumbo frets and is inlaid with traditional dot inlays that link the Midtown Standard to one of its predecessors, the Les Paul Standard, while cream binding enhances both fingerboard and body top. To best show off its great woods and luscious finishes, the Midtown Standard is built without a pickguard. By merging the best attributes of Gibson's legendary solid body and archtop electric guitars, the Midtown Standard and Midtown Custom of 2011 became instant hits with players of all stripes. This great guitar maintains its predecessors' trimmed-down and more player-friendly body size that still emulates the lines of Gibson's classic archtops, but which is built with the Midtown line's advanced chambered, solid-wood construction (rather than laminated top and back) to truly embody the optimum marriage of solid body and archtop. To take the Midtown Standard anywhere from raw vintage rock, blues and funk to contemporary jazz, Americana, or whatever you want to throw at it, Gibson USA loads the guitar with a pair of fat- and rich-sounding Burstbuckers 1 and 2 humbuckers and dresses it all in a hand-sprayed, high-gloss nitrocellulose finish. Plugged in, the Midtown Standard reveals its true glory via a pair of Gibson's Burstbucker 1 and 2 pickups. These beloved pickups have a fatter, richer tone, and provide everything from thick grit and snarl for rock 'n' roll, to rich, creamy warmth for jazz, to singing blues tones with great snappy and funky tones in between. For optimum resonance and sustain, the Midtown Standard carries the classic pairing of a Tune-o-matic bridge and Stopbar tailpiece with a PLEK-cut Corian nut up top, partnered with a set of Grover tuners. Each guitar comes protected in a plush-lined Hardshell case and includes owner's manual and adjustment literature. Check out the Midtown Standard today and get ready to groove in Midtown style.", "ItemID": "173423696557", "EndTime": "2018-12-25T15:02:16.000Z", "StartTime": "2018-07-22T02:10:41.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/2015-Gibson-Midtown-6-String-Blues-Jazz-Semi-Hollow-Body-Case-VNM-M-/173423696557", "ListingType": "FixedPriceItem", "Location": "Boonville, Missouri", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1734236965578080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/ibQAAOSwgslbI0ta/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/pUcAAOSwj0RbI0tg/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/wd4AAOSw~Q9bI0ts/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/JfAAAOSwf5BbI0ty/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/nKMAAOSwUwlbI0t4/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/UG4AAOSw1PJbI0uD/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/BNgAAOSw~19bI0uQ/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/iJAAAOSwt5VbI0ub/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/sJYAAOSw-a1bI0un/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/io4AAOSwgslbI0uu/$_12.JPG?set_id=880000500F"], "PostalCode": "65233", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "media1one", "FeedbackRatingStar": "Red", "FeedbackScore": 1746, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1195.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1195.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "r***r", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 299}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "2015 Gibson Midtown, 6 String Blues/Jazz Semi-Hollow Body with Case, VNM-M. ", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model Year", "Value": ["2015"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Midtown"]}, {"Name": "Soundboard Style", "Value": ["Archtop"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Body Type", "Value": ["Semi-Hollow"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "Size", "Value": ["Full Size"]}]}, "HitCount": 1530, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}