{"BestOfferEnabled": true, "Description": "57 year-old Gibson USA Kalamazoo made Epiphone Melody Maker. Under 7 lbs! One of the last true bargains in Vintage instruments, this is a one-of-a-kind guitar because of the vintage Gibson mini-humbuckers that were added, otherwise all original (except much better bridge added), gorgeous crazed sunburst finish, refretted with jumbo frets, plays like a dream and sounds unbelieveably good. And a featherweight under 7 lbs too. This is exactly the same guitar as a Gibson Melody maker (except for the smaller headstock), made on the same assembly line by the same people in Kalamazoo, MI. And the fingerboard is Brazillian RW! Both single coils and humbuckers can sound great in a guitar with old, really resonant wood, but any Gibson with humbuckers from the early 60's costs a bloody fortune. So this guitar is a great way to get a 57 year old gem with humbuckers without routing the heck out of the guitar. While the full size humbuckers have been more popular, in recent years people are starting to figure out how good the mini's really are, and these are vintage minis. BTW, the Wilkinson aluminum intonatable bridge is totally needed in a Melody Maker if you want to play in tune with a plain D string, plus aluminum actually sounds better too! I've owned this guitar for well over 30 years and did not play it much before I put that bridge in. It made a world of difference! So why am I selling? I’m getting old (just over 72 now) and a bit deaf, plus pretty terrible tinnitus (constant ringing in my ears), and I have way too much stuff (just ask my wife!) So I must tearfully say goodbye to nearly all of it. Sigh. And I’d prefer that I don’t burden my kids with having to get rid of it after I die. I have been selling on eBay since 1997. My eBay user names are edch, and sdhark858, both with tons of great feedback, which you can easily check. In a previous life I founded Guitar Trader in San Diego, and then sold it over 30 years ago. I’ve owned just about every rare guitar (including real vintage 50’s and 60’s Les Pauls, Strats, Teles, 335s, etc etc), as well as just about every old amp and pedal there is. So when I tell you something is exceptional (and really I’ve only kept the most truly exceptional gear) I do have the experience to know. Does that mean you will love what I love? Probably, but it ain’t necessarily so. First off, everyone has their own preferences. Then there is how things are setup. Do you prefer high action or low? Fat strings or skinny? The type of pickups, hardware, wiring, caps, tubes, etc ALL make a difference. Also, some things work better together, some don’t, so most people find that a Tube Screamer sounds better with a Fender amp than a Marshall, whereas a Fuzz Face likes Marshalls better. So with a different amp or guitar you might prefer something different, plus your ears are different too, so don’t let anyone tell you what you should like; doesn’t work with food, art, music, or anything else, really. So if you play through a Marshall, a Vox or a Fender you might prefer different guitars, effects, and so on for each amp. Jimi used an old coil cord which killed the treble with high capacitance, then used a treble booster! Doesn’t matter, it WORKED! I never argue with what works :<) Fun link about simulating old coil cords:premierguitar.com/articles/The_Vintage_Coiled_Cable_Simulator_Mod Willing to ship internationally if I can do so safely. If you are in San Diego you are welcome to try out any of my remaining guitars and amps. Plus local pickup means no shipping cost or risk.", "ItemID": "173726769994", "EndTime": "2019-02-25T18:00:50.000Z", "StartTime": "2019-01-06T20:00:12.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1962-57-Year-Old-Epiphone-USA-Kalamazo-Melody-Maker-2-cut-2-humbucker-Awesome-/173726769994", "ListingType": "FixedPriceItem", "Location": "San Diego, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1737267699948080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg1Njc=/z/dHgAAOSwC85cMlyS/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg1OTA=/z/BSkAAOSwQ5pcMl0~/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/p8IAAOSwaPpcMl1G/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTU5OVgxMTcy/z/CF4AAOSwjMtcMl1P/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMTAw/z/p~sAAOSwoPpcMl1T/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg4NDU=/z/0QMAAOSwVP5cMl1X/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg3MzY=/z/ea8AAOSwHAxcMl1Z/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg4MDk=/z/6xUAAOSw7OdcMl1c/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE5OFgxNjAw/z/R0IAAOSwwTFcMl1f/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/HBYAAOSw5vxcMl1u/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg4MDk=/z/4LIAAOSwV0VcMl2A/$_57.JPG?set_id=8800005007"], "PostalCode": "92122", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "sdhark858", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 169, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1225.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1225.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "a***r", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 198}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "1962  57-Year-Old Epiphone USA Kalamazo Melody Maker 2-cut 2-humbucker  Awesome!", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Gibson"]}, {"Name": "Model Year", "Value": ["1961"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Melody Maker"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Exact Year", "Value": ["1961"]}, {"Name": "Body Color", "Value": ["sunburst"]}]}, "HitCount": 836, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}