{"BestOfferEnabled": false, "Description": "Vintage Schecter Tele Genesis - Mid 80s - Electric GuitarYou are buying a pre-owned Genesis by Schecter in great working condition!! Light scuffs and minor dust are present. The serial number is G25352. From the research I did on this, I believe it is from the mid 80s. The body is in great shape. There are minor scratches throughout on the body and pick guard from normal usage. There are a few minor chips in the paint. I tried to show all imperfections in the pictures. The neck is straight and she plays really nicely. The color is a beautiful pearl cranberry that pops when sunlight hits it. All knobs and pickups work as they should. The back plate is missing.Thanks for looking! Please check our other auctions located in our eBay store!! (15961-1)Please use all of the actual item pictures to better determine the condition and description. SEE PICTURES PLEASE!!!! FREE USPS OR UPS SHIPPING WITHIN USA (48 States)!!!Please ask all questions BEFORE bidding/buying!Quick Draw Quality PawnPlease read our auction policy before bidding! By placing a bid, you agree to comply with all the terms and conditions below.**We are happy to help all of our customers! Please call, email, or message us if you have any problems or questions**About us:We are a fairly new Pawn Shop in Venice, Florida. Our key word is \"Quality\". We have combined experience of over 25 years in the pawn and firearms businesses. Our interest is the lowest around at 20%, and we have our SOT2 manufacturing license. *Please call between 10am-4pm ET Monday-Saturday if you have any questions*ALL OF OUR ITEMS ARE AUTHENTIC AND AS DESCRIBED TO THE BEST OF OUR KNOWLEDGE!!!!· If you are in Venice, Florida; please stop by to check out anything and everything SIX days a week! We are CLOSED ON SUNDAYS.We describe all items to the best of our knowledge and ability. We sell everything from new and used jewelry, watches, electronics, clothing, video game systems and games, tools, firearms and accessories, musical instruments, and collectibles. Everything should be considered sold AS IS. Bidders with ZERO or NEGATIVE Feedback, please contact us before bidding. Florida residents have to pay 7% sales tax. We generally ship via USPS or UPS 1-2 business days after payment is received. You will receive your tracking info through eBay. Full payment is due within 72 hours of winning bid or item will be relisted and you will be reported to eBay as a nonpaying bidder. We will combine shipping, so ask us for a quote first. We only offer our listings to people in the United States and Canada. We prefer our items stay within either of these two countries, and we cannot guarantee product usage in other countries around the world. Always use the information provided in the listings to ensure our items will work for you. Out of country bidders should request a shipping quote BEFORE bidding. We charge a 20% restocking fee to those who change their mind after receiving an item in as described condition but request a return. Should you not use eBay's return system properly, you will be reported. By bidding on this item, you are agreeing to the above terms.· PayPal is our preferred payment method. We only accept payment from CONFIRMED PayPal addresses. Call the number at the top to make a credit card payment.· Feedback Policy: We strive to leave positive feedback for all customers. If you have an issue with the transaction, please call, email, or message us BEFORE leaving any negative/neutral feedback or opening a case. Please leave us feedback when you receive your item and are happy with it!!· Local pickups are always welcome!PLEASE TAKE THE TIME AND CHECK OUT OUR OTHER AUCTIONS LOCATED IN OUR EBAY STORE! Being an upscale pawn shop, we have a little of everything! Add us to your favorites!***SPECIAL NOTE: Please be aware that we are not experts in the categories we sell in. We are a pawn shop, we have a diverse inventory. If we have inappropriately posted something or have errors within the auction, feel free to politely correct us. Thank you in advance!!!", "ItemID": "323289158447", "EndTime": "2019-03-02T02:06:10.000Z", "StartTime": "2018-06-05T14:30:55.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Vintage-Schecter-Tele-Genesis-Mid-80s-Electric-Guitar-FREE-SHIPPING-/323289158447", "ListingType": "FixedPriceItem", "Location": "Venice, Florida", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/3232891584478080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/fEsAAOSwNFFbFWZ0/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/r7oAAOSwFV1bFWZ3/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/kQgAAOSwfp9bFWZ2/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/-28AAOSw~SlbFWZ4/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/mcIAAOSwj2RbFWZ7/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/km0AAOSwj-BbFWZ9/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/bo8AAOSwR5BbFWaE/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/zBkAAOSwhEVbFWaG/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/LQgAAOSwZ~hbFWaJ/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/GX0AAOSwjzJbFWZ~/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/oS8AAOSwuHJbFWaC/$_57.JPG?set_id=880000500F"], "PostalCode": "34285", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "quickdrawqualitypawn2013", "FeedbackRatingStar": "Red", "FeedbackScore": 2150, "PositiveFeedbackPercent": 99.7}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 345.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 345.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "p***_", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 957}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Vintage Schecter Tele Genesis - Mid 80s - Electric Guitar - FREE SHIPPING", "ItemSpecifics": {"NameValueList": [{"Name": "Body Color", "Value": ["Red"]}, {"Name": "Bundle Listing", "Value": ["No"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Model", "Value": ["Tele Genesis"]}, {"Name": "Model Year", "Value": ["mid 80s"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Brand", "Value": ["Schecter"]}, {"Name": "Body Type", "Value": ["Electric"]}]}, "HitCount": 1468, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1161204555", "StoreName": "Quick Draw Quality Pawn"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "Great pre-owned working condition!! Back plate is missing.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}