{"BestOfferEnabled": true, "Description": "--> --> Ernie Ball Music Man Cutlass Firemist Silver w/ Roasted Maple Neck This guitar is in virtually new condition, with virtually no signs of wear on the body (except for the light scuff) or frets. Comes with original case and paperwork. Introducing a fun new addition to our \"barely used\" selection: The Ernie Ball Music Man Cutlass HSS. This frosted beauty is a stunning example of the modern manufacturing giant and for us G&L guys an interesting look in the timeline of Leo Fender. In terms of fit and finish the Cutlass HSS is smooth as butter and features top notch materials and a few exciting innovations. When compared to a typical HSS style guitar the Cutlass checks all the right boxes while staying a cut above: Mid-weight Alder body, Roasted Maple neck, stainless steel frets, alnico pickups with a noise cancelling circuit and top notch playability. For exceptional performance at an exceptional price, this guitar is the real deal. This USA EB Music Man Cutlass features:Firemist Silver finish on Alder, 7.2 poundsFigured Roasted Maple neck, 10\" radius, 1-5/8\" nut, 25-1/2\" scale length22 high profile, medium width stainless steel frets5-bolt neck w/sculpted pocket for easy access to high frets(2) Custom wound Music Man single coil pickups(1) Custom wound Music Man humbucker bridge pickupActive noise reduction circuit to cleanly cut out 60 cycle hum5-position pickup switchTortoise shell pickguardSchaller locking tunersCompensated nutDeluxe Music Man hardshell caseMade in USA As die-hard G&L guys we were excited to get our hands on a Music Man simply because of their old ties to Leo Fender, and amidst a slew of interesting innovations it's clear that they have earned their stripes as a top notch manufacturer. As an homage to the classic S-style HSS the Cutlass exceeds expectations right off the bat with a gorgeous roasted maple neck that plays real fast thanks to the slick stainless steel frets, modern 10\" radius and carefully crafted neck pocket that gives your hands instant access to the whole board. The pickups are a custom Music Man design that offer glassy single coil tones in the neck and middle and a beefed up but nuanced humbucker in the bridge. You can get all the classic sounds out of the Cutlass with ease and we have always been fans of a humbucker bridge pickup in this setting because you never have to worry about your twang being too brittle or thin. You'll also notice that this baby runs with a 9-Volt battery in the back, which operates a noise cancelling circuit making it virtually silent even when you're rocking the single coils alone. It got along great with our JAM TubeDreamer 58 and was right in the SRV, John Mayer wheelhouse. Put together with the balanced response of a lightweight Alder body, they got the recipe just right. Overall the Music Man Cutlass is a solid axe and a great way to get into the HSS world with the comfort of world class materials and truly creative craftsmanship. This guitar was traded to us by a customer who was looking to move into another tonal spectrum which gives you the chance to grab this exceptionally mint guitar at a great discount. Come try it today!Orders received by 12:00EST will be shipped the next day. All guitars are setup and tested prior to shipment All merchandise is subject to prior in-store sales and we reserve the right to end this auction early. Payment I accept the following forms of payment: PayPalDirect Offline Credit Card Payment: Visa/Master Card, Discover Card, American Express", "ItemID": "303062701743", "EndTime": "2019-02-27T04:53:46.000Z", "StartTime": "2019-02-14T23:16:22.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Ernie-Ball-Music-Man-Cutlass-Firemist-Silver-w-Roasted-Maple-Neck-/303062701743", "ListingType": "FixedPriceItem", "Location": "Bellingham, Massachusetts", "PaymentMethods": ["PayPal", "VisaMC", "Discover", "AmEx"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/3030627017438080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTAwMFgxMDAw/z/-4cAAOSwepdcZfWv/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAwMFg2NzY=/z/X4YAAOSwntRcZfWt/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjY4WDEwMDA=/z/fF8AAOSw3CdcZfW3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjY4WDEwMDA=/z/q4sAAOSw1vxcZfWy/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjY3WDEwMDA=/z/4HcAAOSwPEhcZfWp/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAwMFgxMDAw/z/GKcAAOSwyABcZfWx/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTAwMFg2NzU=/z/1pgAAOSwgX9cZfW0/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjY4WDEwMDA=/z/my8AAOSwtxtcZfWr/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjY4WDEwMDA=/z/zJ8AAOSwPb1cZfW5/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjY4WDEwMDA=/z/WREAAOSwBRZcZfW1/$_57.JPG?set_id=8800005007"], "PostalCode": "02019", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "upfrontguitars", "FeedbackRatingStar": "Red", "FeedbackScore": 1819, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1749.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1749.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "c***a", "FeedbackPrivate": false, "FeedbackRatingStar": "Purple", "FeedbackScore": 677}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "Ernie Ball Music Man Cutlass Firemist Silver w/ Roasted Maple Neck", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Ernie Ball"]}, {"Name": "Model", "Value": ["Cutlass"]}, {"Name": "MPN", "Value": ["G84606"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Color", "Value": ["Silver"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Country of Manufacture", "Value": ["USA"]}, {"Name": "Style", "Value": ["Stratocaster"]}, {"Name": "Body Material", "Value": ["Basswood"]}]}, "HitCount": 192, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=12205009", "StoreName": "UpFront Guitars LLC"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": true, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "This guitar is in virtually new condition, with virtually no signs of wear on the body or frets. Comes with original case and paperwork.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}