{"BestOfferEnabled": false, "Description": "Sweetwater recently began offering an exclusive PRS SE Custom 24 solidbody electric guitar. SE Custom 24 instruments offer the sound, playability, and gorgeous looks of the Custom line, all packed into a high-quality, affordable instrument. This guitar’s mahogany body and rosewood top hold two great-sounding PRS-designed SE 85/15 humbucking pickups. It has 3-piece maple neck with a wide-thin shape for very easy playing. White binding outlines the instrument for an even more stunning appearance. The contoured mahogany body gives the SE Custom 24 a perfect balance of rich midrange and top-end clarity (and the beautiful rosewood top veneer helps make this instrument a real looker). Add a pair of PRS-designed humbuckers in the bridge and neck positions, and you've got a recipe for thick, sustaining tones. Pull up on the tone pot, and you'll access chiming, bell-like single-coil sounds. Appointments exclusive to Sweetwater: Though all PRS SE Custom 24 solidbody electric guitars are beautiful, this Sweetwater exclusive model boasts some aesthetic appointments that we believe sets it a step above. The rosewood top features rich, deep brown hues, and it is perfectly offset by this guitar body's white binding. Finally, a beautiful rosewood veneer is applied to the guitar's headstock. Features: White body binding Beautiful matching headstock design Legendary PRS quality and playability Beautiful rosewood top gives the guitar an elegant look Mahogany body for punchy tone and long sustain PRS-designed tremolo maintains tuning under heavy use PRS SE 85/15 pickups sound great humbucking or single-coil Push-pull tone knob accesses great single-coil-type tones Wide-thin maple neck is comfortable and fast This guitar has only left my smoke-free home only once, and is in out-of-the-box condition. It comes with a cool brown PRS gig bag. I hate to see this one go, but it’s either me or the guitar. Enough said. Please give this superb instrument a good home. 1.Now for the fine print: 2.Once the item has been purchased, the buyer must contact me within 24 HOURS! 3.U.S. buyers must provide a confirmed ship-to address. NO EXCEPTIONS! 4.Foreign buyers must use Paypal. Also, a $10 shipping and handling fee that will be added to the invoice. Foreign buyers are also responsible for full shipping costs including any and all import duties and taxes associated with the country to which they are importing. Shipping prices listed in my ads are for U.S. lower 48 states only. 5.Bids from buyers with negative feedback will be rejected. 6.Buyer to pay all shipping and handling costs. All shipping charges listed, including \"Free Shipping With Buy It Now\" (when applicable) applies to the lower 48 United States only. As previously stated, foreign buyers are responsible for full shipping costs including any and all import duties and taxes associated with the country to which they are importing. 7.Insurance will be added into the shipping costs unless otherwise requested by the buyer. 8.Items are being sold \"as is\". ALL SALES FINAL! 9.I accept Paypal only. 10.NO PERSONAL CHECKS or WIRE TRANSFERS 11.Final payment is required within 7 days of the end of auction. 12.I reserve the right to end this auction at any time without prior notice. 13.Please email with any questions. Thanks for looking! Good luck!", "ItemID": "123527748007", "EndTime": "2018-12-12T17:40:11.000Z", "StartTime": "2018-12-05T17:40:11.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/PRS-SE-Custom-24-Sweetwater-Exclusive-Natural-Rosewood-/123527748007", "ListingType": "Chinese", "Location": "Bel Air, Maryland", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1235277480078080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTYwMFg1NzU=/z/K1sAAOSwJ3Rb~hfW/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMTYw/z/0WEAAOSwNJlb~hfr/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5NDI=/z/r0EAAOSwuCdb~hf7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg5NzE=/z/xfoAAOSw44db~hgI/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg1Njk=/z/9TgAAOSwzZNb~hgX/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMTYx/z/u9EAAOSwvL1b~hgv/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg2NTQ=/z/VlcAAOSwXItb~hhA/$_57.JPG?set_id=8800005007"], "PostalCode": "21015", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "willssonline", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 276, "PositiveFeedbackPercent": 100.0}, "BidCount": 8, "ConvertedCurrentPrice": {"Value": 605.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 605.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "y***o", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 15}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "PRS SE Custom 24 Sweetwater Exclusive - Natural Rosewood", "HitCount": 381, "Subtitle": "Mint condition", "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 615.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Middle East", "RU", "AF", "AM", "AZ", "BD", "BT", "CN", "GE", "IN", "JP", "KZ", "KR", "KG", "MV", "MN", "NP", "PK", "LK", "TJ", "TM", "UZ"], "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}