{"BestOfferEnabled": true, "Description": "Description Stock#: HEG002592 Manufacturer: Epiphone Model: Les Paul II Ltd. Ed. **************10 % Restocking Fee************** All items will incur a 10% restocking fee if sent back for reasons other than fault by the seller. If the item is not as described and the seller is contacted within three (3) days of receipt, and the item is shipped back in that time-frame, the restocking fee will be waived. Description: This guitar is in great shape, with average wear from normal use. It worked very well when tested in our shop. There are a few dings, scuffs, and scratches as can be seen in the pictures. Please examine the photos very carefully to determine item condition details. The pictures shown are of the actual item, and strive to show it as accurately and honestly as possible. This item is in stock and ready for shipment within 24 hours. Feel free to ask any questions you may have. You are welcome to make us an offer! Payment Heritage Jewelry and Loan gladly accepts payments from PayPal customers for all orders. For special considerations, please contact us directly through Ebay if you have any issues. We only ship to confirmed addresses. Shipping Heritage Jewelry and Loan sends items by the following methods: UPS USPS FED-EX All items are shipped within 24 hours of payment posting or the next business day. All items are sent fully insured with tracking information that is uploaded to Ebay. All items are sent in tamper evident packing. Most countries charge customs duties/taxes when shipping to a country outside of the USA. You are responsible for all charges that are incurred on the item within your country. We will not mark the item as a gift or lower the value on customs paperwork. All items shipped or received within Texas are subject to 8.25% state sales tax. ISSUES: If there are any issues with the item at the time of delivery, please refuse the item and contact us as soon as possible. We fully insure all parcels and want to ensure that if there are any issues that they are dealt with in the most professional and practical manner possible. If there are any issues once the package is opened, please contact us and do not throw away any of the packing materials. Terms of Sale All items must be paid in full within 7 days. We only ship to confirmed addresses through PayPal. We only ship to billing addresses when paying directly with a merchant credit card. We do not accept multiple payments from PayPal when paying for one item. Guarantee: All items are guaranteed to be 100% authentic with regard to the Brand Maker, metal content, and diamonds. All gold, silver, platinum, and diamonds are tested using industry-standard techniques and are certified authentic prior to listing. All watches are inspected and serviced by a certified watchmaker and are guaranteed to be authentic. All diamond color and clarity grades are opinions by our staff unless accompanied by a diamond certificate. ALL TREATMENTS TO STONES ARE DISCLOSED IF KNOWN. Return Policy: We have a \"No questions asked\" 14-day return policy. Buyer must contact us via email or telephone to get a return authorization number. No returns will be accepted without this number. Buyer is responsible for shipping back to us. Shipping back to us must be fully insured for the purchase price--no exceptions. We can provide return shipping for a fee in certain cases. Heritage Jewelry and Loan is not an authorized re-seller of any items that are offered here. We are selling the items \"as-is\" and all warranties, if given, are through Heritage Jewelry and Loan and not through the makers. All items are considered USED and PRE-OWNED no matter the condition or age. About Us Heritage Jewelry and Loan is a family owned and operated pawnshop in the Sugar Land, Texas, area that offers loans on items of value. We specialize in antiques, watches, jewelry, and musical instruments. We bring a combined 45 years of experience in the pawn and jewelry industry and are well versed in the values and the authentication procedures needed to ensure that only authentic items are offered to our customers. We are leaders in our industry and are one of the few with a BBB rating of A+. So take some time and look at all of our cool offerings here! Contact Us If there is anything that we can do to help you, or it there is anything that you might need, please feel to contact us here through eBay. We will never entertain any offers that are against eBay's rules and will report all buyers who ask. Please allow 24 hours for a response to your questions as we have large numbers of emails daily. Images sell! Get Supersized Images & Free Image HostingCreate your brand with Auctiva's Customizable Templates. Attention Sellers - Get Templates Image Hosting, Scheduling at Auctiva.com. Every buyer gets a MyStoreRewards invitation for cash back", "ItemID": "292465159959", "EndTime": "2019-01-20T19:21:12.000Z", "StartTime": "2018-02-27T14:50:01.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Epiphone-Les-Paul-Special-II-LE-Electric-Guitar-Right-Handed-Made-China-/292465159959", "ListingType": "FixedPriceItem", "Location": "Sugar Land, Texas", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2924651599598080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTI0NVg3Nzc=/z/OhAAAOSwQfpZuaky/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI0M1g3NzM=/z/AmkAAOSwK-pZuak1/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTcxWDE1MTc=/z/fIYAAOSw2AFZuak5/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzAyWDE2MDA=/z/1kQAAOSwUnFZuak8/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTY1WDE0NDI=/z/TN4AAOSwiOdZuak~/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjM4WDE2MDA=/z/U4UAAOSwP8BZualB/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/Njk1WDE0MDE=/z/QUsAAOSw791ZualG/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjA1WDEyOTI=/z/z28AAOSwNf1Zualn/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDY3WDE2MDA=/z/j1MAAOSwnB1ZualO/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODUzWDEyODA=/z/MGEAAOSwk6ZZualR/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODUzWDEyODA=/z/6GQAAOSwnNFZualT/$_1.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA0NFgxNDIw/z/zy8AAOSwNf1ZualW/$_1.JPG?set_id=8800005007"], "PostalCode": "77478", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "heritagejewelryandloan", "FeedbackRatingStar": "Red", "FeedbackScore": 3729, "PositiveFeedbackPercent": 99.3}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 109.95, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 109.95, "CurrencyID": "USD"}, "HighBidder": {"UserID": "-***0", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 0}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Epiphone Les Paul Special II LE Electric Guitar Right-Handed Made in China", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Model", "Value": ["Les Paul Special II"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Dexterity", "Value": ["Right-Handed"]}, {"Name": "Body Color", "Value": ["Sunburst"]}, {"Name": "Size", "Value": ["Full Size"]}, {"Name": "Country/Region of Manufacture", "Value": ["China"]}, {"Name": "Type", "Value": ["Electric Guitar"]}]}, "HitCount": 924, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=171042581", "StoreName": "Heritage Jewelry and Loan"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["Africa", "Asia", "Central America and Caribbean", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "AL", "AD", "AT", "BY", "BE", "BA", "BG", "HR", "CY", "CZ", "DK", "EE", "FI", "FR", "DE", "GI", "GR", "GG", "HU", "IS", "IE", "IT", "JE", "LV", "LI", "LT", "LU", "MK", "MT", "MD", "MC", "ME", "NL", "NO", "PL", "PT", "RO", "SM", "RS", "SK", "SI", "ES", "SJ", "SE", "CH", "UA", "VA"], "GlobalShipping": false, "ConditionDescription": "Pre-owned; good working and cosmetic conditions. Showing some dings and scuffs / average wear from normal use. Please examine the photos VERY CAREFULLY to determine item condition details.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}