{"BestOfferEnabled": false, "Description": "CAREFULLY READ ITEM DESCRIPTION AND THE TERMS OF SALE. Thanks— ITEM DESCRIPTION: When getting one's audio ready for final mix and mastering, hitting the mastering unit with control and with heat is imperative. The Waves L2 is the unit know for precisely this kind of \"brick-wall\" limiting. This unit is in proper working conditions, ships with power cord, and shows light signs of previous racking and use. There is a reason why the hardware version of the L2 is still in high demand: when it comes to making one's material master-ready, short of dropping a mini-fortune at a mastering house, these units provide the best all-in-one compression processing for the job. And in my humble opinion, there is really no substitute for a hardware-based method of dialing in the necessary tweaks required for an audio work's final processing.Unit will be boxed up tight to insure safe transit during shipping. Thanks for stopping by! TERMS BIDDING AND SHIPPING ARE TO CONFIRMED EBAY MEMBERS ONLY. WE SHIP ALL OVER THE WORLD. DOMESTIC BUYERS IN THE UNITED STATES AND INTERNATIONAL BUYERS MUST HAVE CONFIRMED PAYPAL ACCOUNTS. Shipping within the lower 48 (the Continental United State) ship via UPS or FedEx Ground. Buyers in Alaska, Hawaii, and Puerto Rico, please make contact for a shipping quote. ALL international shipments ship via USPS EMS International Express. ALL shipments are fully insured and require signature when delivered. INTERNATIONAL BUYERS need to make contact for shipping price quote (as shipping will be different from country to country). All shipments MUST be delivered to the buyer's confirmed Ebay/Paypal physical address (no PO Boxes or AFO/FPO deliveries). We cannot release shipments to any alternative address. Any attempt to reroute a shipment will trigger the item's interception and return, and a 20% service/restocking fee will be assessed at time of refund. For both our safety and your peace of mind, there is no exception to these buying/shipping terms.RETURNS: ALL International Shipments are nonreturnable; PERIOD!Return shipping is the obligation of buyer, not seller. Thanks! ROCK HARD, ROCK STEADY, ROCK FRICKIN' ON!", "ItemID": "303042081116", "EndTime": "2019-01-31T19:48:12.000Z", "StartTime": "2019-01-27T01:55:50.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Waves-L2-Ultramaximizer-Mastering-Processor-Limiter-Compressor-/303042081116", "ListingType": "FixedPriceItem", "Location": "Fullerton, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/3030420811168080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NzY5WDE2MDA=/z/nx4AAOSw~5dcQ83i/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTEyWDE2MDA=/z/hBwAAOSwuQhcQ85i/$_57.JPG?set_id=8800005007"], "PostalCode": "92835", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "metaunstable", "FeedbackRatingStar": "Red", "FeedbackScore": 2457, "PositiveFeedbackPercent": 98.1}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 1150.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 1150.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "u***u", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 22}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "Waves L2 Ultramaximizer Mastering Processor Limiter/Compressor", "ItemSpecifics": {"NameValueList": [{"Name": "Model", "Value": ["L2 ULTRAMAXIMIZER"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Custom Bundle", "Value": ["No"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Brand", "Value": ["WAVES"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}]}, "HitCount": 48, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "ConditionDescription": "Up for sale is a Waves L2 Ultramaximizer Mastering Post Production Processor Limiter Compressor. These units are very well known within the industry and serve to provide a platform for rendering audio hot for being CD-ready.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}