{"BestOfferEnabled": true, "Description": "EPIPHONE ES-339 PRO ELECTRIC GUITAR, MAPLE BODY, ALNICO PU’S, SLIM TAPER NECK The classic shape and bell-like tone of the ES series guitars, but with reduced body dimensions. Epiphone introduced the ES-339 PRO as a new instrument with roots firmly planted in the classic era when Epiphone’s Kalamazoo factory was producing rock’s most legendary instruments. Featuring a reduced size ES-style body with Alnico Classic PRO humbucker pickups, the new ES-339 PRO semi-hollowbody from Epiphone turns back the clock while breaking new ground in sound and style. First introduced in the late ’50s, the ES series became an instant rock classic, bringing the feel and look of an archtop to a generation of players who had grown up playing solid body guitars like the Les Paul. The ES-335, the first in the ES series, was an instant success. But for many players who were used to smaller solid body guitars, the ES-335 felt too bulky to play on stage. The new ES-339 PRO is the perfect remedy, featuring smaller body dimensions while still retaining the bell-like tone the ES series is famous for. The Epiphone ES-339 PRO features a reduced size laminated maple body with a solid center block, much like original ES-style classics. The mahogany SlimTaper “D” profile 24.75” scale neck has 22 medium jumbo frets and is hand-set and glued with a mortise and tenon neck joint with Titebond glue. The 12” radius neck features a rosewood fingerboard with pearloid inlays and a 1.68” nut. Single-ply cream binding on the fingerboard and body completes the classic look. The new Epiphone ES-339 PRO’s Alnico Classic PRO humbucker pickups provide a huge variety of sound choices for the modern guitarist. For those who are used to carrying two guitars to gigs, the ES-339 PRO will solve that problem once and for all. Now, you can play any gig and any style with just one guitar – the Epiphone ES-339 PRO. The ES-339 PRO features Alnico Classic PRO humbuckers in both the neck position and bridge position providing an infinite variety of tones thanks to the 3-way pickup selector which also features a push/pull coil tap. The neck pickup volume pot and the bridge pickup volume pot each feature an easy-touch push/pull coil tap, making for smooth transitions back and forth between single coil and classic humbucker sounds. The all-metal heavy duty Epiphone 1/4” output jack gives you a lifetime of worry-free use. The ES-339 PRO features rock-solid hardware including Epiphone’s LockTone Tune-o-matic bridge and LockTone Stopbar tailpiece. The ES-339 PRO has all nickel hardware along with Grover 14:1 ratio vintage style machine heads with tombstone buttons. Case not included. This Epiphone ES-339 PRO electric guitar is a used item in excellent condition with virtually no use on it. This guitar has been played in a home studio only or about 2-3 hours of time, then put away. There are no dings, marks, or issues with this guitar. Electronics work as they should. A super clean in marvelous condition with a huge tone. Gorgeous maple body under the superb sunburst finish; neck shows no marks or concerns. You will receive this item well-packed but without a gig bag, case, the original paperwork and packaging. Please contact this seller for additional information. Returns are limited so please ask all questions before bidding as your satisfaction is important to me before you purchase. Customer 100% satisfaction is our one and only goal. The only way to show that to our customers is via our feedback. If for some reason you are not 100% satisfied, please do not leave negative or neutral feedback. Give us a chance to fix or resolve any problem you may have with your transaction. We want to earn every single positive feedback because we don't plan to work with you only once, we want you to come back. PayPal preferred and all payments need to clear before shipping. Insurance included with shipping. Buyer is responsible for any and all local taxes or custom duties with this purchase. Most importantly, thank you for looking! Epiphone ES-339 PRO Features: Body: Reduced size Laminated maple body with solid center block Neck: Mahogany Neck Profile: SlimTaper D Profile Neck Joint: Glued-in mortise and tenon Truss Rod: Adjustable Scale: 24.75” Nut: 1.68” Fingerboard: Rosewood with pearloid dot inlays Fingerboard Radius: 12” Frets: 22 medium jumbo Neck Pickup: Alnico Classic PRO Bridge Pickup: Alnico Classic PRO Controls: Neck Pickup volume with push/pull coil-tapping, Bridge Pickup volume with push/pull coil-tapping, Neck Pickup tone, Bridge pickup tone Hardware: Nickel Binding: Fingerboard and body 1-ply (cream) Bridge: LockTone Tune-o-matic Tailpiece: LockTone Stopbar Machine Heads: Grover Vintage with tombstone buttons 14:1 radio Case: Not included Normal 0 false false false EN-US X-NONE X-NONE", "ItemID": "113459215903", "EndTime": "2018-12-20T12:55:37.000Z", "StartTime": "2018-12-17T03:08:43.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Epiphone-ES-339-PRO-Electric-Guitar-Maple-Body-Alnico-PU-s-Slim-Taper-Neck-/113459215903", "ListingType": "FixedPriceItem", "Location": "Hanover, Massachusetts", "PaymentMethods": ["PayPal", "VisaMC", "Discover", "CashOnPickup", "AmEx"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/1134592159038080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIyNlgxNjAw/z/H74AAOSwXI1cBEgO/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg3NzY=/z/0wkAAOSwuQhcBEgK/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/5KEAAOSwCPZcBEgQ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/uBIAAOSwbX1cBEgU/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMlgxNjAw/z/WOoAAOSw8L5cBEgX/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/Nzg3WDE2MDA=/z/ZcQAAOSwy3JcBEga/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODkxWDE2MDA=/z/EYoAAOSwLKhcBEgc/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE4NFgxNjAw/z/wvcAAOSw2hxcBEgf/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTk3WDE2MDA=/z/tesAAOSwF5VcBEgi/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE1MFgxNjAw/z/~ogAAOSwydZcBEgl/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTAxWDE2MDA=/z/wEUAAOSwCWRcBEgn/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg1MTE=/z/SUIAAOSwxO9cBEgo/$_57.JPG?set_id=8800005007"], "PostalCode": "02339", "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "bbqbobcraig", "FeedbackRatingStar": "Green", "FeedbackScore": 5486, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 399.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 399.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "7***7", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 0}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "Epiphone ES-339 PRO Electric Guitar, Maple Body, Alnico PU’s, Slim Taper Neck", "ItemSpecifics": {"NameValueList": [{"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Body Material", "Value": ["Maple"]}, {"Name": "Brand", "Value": ["Epiphone"]}, {"Name": "Model", "Value": ["ES-339"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Soundboard Style", "Value": ["Archtop"]}, {"Name": "Non-Domestic Product", "Value": ["No"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Body Type", "Value": ["Semi-Hollow"]}, {"Name": "Body Color", "Value": ["Vintage Sunburst"]}, {"Name": "Size", "Value": ["Full Size"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Model Year", "Value": ["2017"]}, {"Name": "Product Line", "Value": ["N/A"]}, {"Name": "Country/Region of Manufacture", "Value": ["China"]}]}, "HitCount": 76, "PrimaryCategoryIDPath": "619:3858:33034", "Storefront": {"StoreURL": "https://stores.ebay.com/id=7153720", "StoreName": "BBQ Bob&#39;s Crossroads of Music"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalRefund": "MoneyBack", "InternationalReturnsWithin": "30 Days", "InternationalReturnsAccepted": "ReturnsAccepted", "InternationalShippingCostPaidBy": "Buyer"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Used", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}