{"BestOfferEnabled": false, "Description": "MIJ, made in japan, Gibson, Lespaul, White, SG, Höfner, Duesenberg, Ibanez, ATELIER Z, ARIA, ESP, Caparison, Killer, COMBAT GUITARS, GUYATONE, Greco, Sugi Guitars, TEISCO, DEVISERA, Nil, Bacchus, VANZANDT, Fernandes, Fender Japan, Fujigen, MOON GUITARS, momose, Yairi Guitar, YAMAHA, TOKAI, Zemaitis, VOX, B, C, Rich, Epiphone, Gibson, Gretsch, Suhr, Schecter, Charvel, Jackson, Dean, Tom Anderson, Fender, Paul Reed Smith, Melancon, Mosrite, Rickenbacker, Robert Benedetto, Washburn, Ibanez, kramer, EDWARDS, Burny, Grassroots, 1990 Greco SS-65P2 All Original Kanako Nakayama model Very Good+ condition.Made in Japan Down from here, Photo is dent and scratches etc.. About scratches that are hard to see. To make it easy to understand the condition of the scratches, I lighted the light strongly. 1990 Greco SS-65P2 All Original Kanako Nakayama model Very Good+ condition.Made in Japan Body Mahogany. Deep Joint. Neck Mahogany. Frets 22F. Scale 24.75inch (628mm) Gibson Scale. Nut Width About 1.60 inch (40.5mm). Pickup Greco Screamin' x 2 Control 2 Volume, 2 Tone, 3-Way PU Toggle switch. Bridge Tune O Machic. Stop Tailpiece. Color Black. Weight About 6.17 Pound ( 2.8 Kg ). This is Used Guitar. The machine head of the 3rd string is not straight and installed. _But that is the original state, there is no problem with tuning. The Strap pin is in the body little. There are scratches and dents. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. It was manufactured by Fujigen factory in 1990. It was made about 28 years ago. This Greco SS-65 P2 is japanese girl's rock band pioneer \"Princess Princess\" guitarist Kanako Nakayama signature model. Greco designed this guitar for her. This guitar was produced on a special line, not a regular line. She is a small Japanese woman. Perhaps her fingers were short. The width of the nut is 40.5 mm. Accuracy of the product is high, It is deep joint. From the body, the vibration of the sound is transmitted well. \" The High quality guitars at a Low price \". It is brand concept of Greco at the time. And current... It has became high price. 1980, Gibson filed a lawsuit. The cause is copyright issues. And more than anything, Greco's ( Fujigen's ) high degree of perfection. Perhaps Gibson had a feeling of crisis. I think this Greco is very good. Make of Greco (Fujigen) is very polite. Accuracy of the product is high. About guitar play, Current state, the space between the strings and the frets is standard. This Greco is Deep joint. Therefore Un pluged sound is very loud. I feel the narrow neck is very easy to play the guitar. I recommend to a short fingers guitar player. You can feel vibrations transmitted to the body. The Pickups is original installed SCREAMIN. This SCREAMIN Pickup is excellence. And worldwide assessment is high. I feel the good Over drive and Distortion sound. The clean sound is also wonderful. Greco is Great !! It is cleanliness. I polished with guitar exclusive polish, so it is in a very clean state. I after the finger board cleaning, painted beeswax. The aim is moisturizing and and protection. Current neck condition, very good ! roughly straight ! There is no problem with the Truss rod and it can be adjusted. Remaining the frets are 93% on average. You can play immediately after it is delivered to you. I was set new strings. Regular tuning. ( Inch : 009, 011, 016, 024, 032, 042 ) Guitar playing, is comfortable. All is working well. It is in a very good condition. The Truss rod Wrench is not included. All Original.Note : The Lock nut and the Whammy bar are not original. The GIG BAG inclide. Look at the photos, please verify by yourself! It will be professionally pack. Double air packing. And ships inside a sturdy cardboard box. This electric guitar is USED. Please consider it when bidding. Thank you. Payment I accept PayPal only. Please pay within 3 days after the auction closed. Shipping Worldwide shipping from Japan! EMS / Shipping includes a tracking number. / / / Destination cost Delivery time / / / Asia : $1004 ~ 7daysUS Canada : $1205 ~ 8 daysEurope : $1406 ~ 10 daysOceania : $1205 ~ 8 daysSouth America : $2408 ~ 12 days This item is shipped within 3 business days after payment is confirmed. Terms of Sale International buyers - Please Note: Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer's responsibility. Please check with your country's customs office to determine what these additional costs will be prior to bidding/buying. These charges are normally collected by the delivering freight (shipping) company or when you pick the item up -do not confuse them for additional shipping charges. Please contact us first with 30 working days for any returns, Buyer pays shipping cost from buyer's country to Japan when being returned. In case of return, the shipping cost won't be refunded. We sell various kinds of Electric guitars to international customers. Our goal is to provide the best quality products and service and your satisfaction is the most important to us. Happy bidding!! Thank you !!", "ItemID": "254072644261", "EndTime": "2019-01-22T05:05:05.000Z", "StartTime": "2019-01-15T05:05:05.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/1990-Greco-SS-65P2-All-Original-SG-type-Kanako-Nakayama-model-Made-Japan-/254072644261", "ListingType": "Chinese", "Location": "Nagoya-shi,Kita-ku, Aichi", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/2540726442618080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTM1MlgxNjAw/z/1n0AAOSw0rdcCcnb/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/j7oAAOSwO7dcCcnm/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTQwMlgxNjAw/z/K0QAAOSwMOtcCcnw/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNTk5/z/0C0AAOSw27lcCcn1/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/tdAAAOSw~VBcCcn-/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/QRQAAOSwSs1cCcoK/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/p8IAAOSwKphcCcoP/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFg2MDE=/z/i~AAAOSwcH5cCcoP/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/m6cAAOSwnh5cCcop/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2N1gxNjAw/z/WowAAOSwC9hcCcoW/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/TqgAAOSwhzhcCcoc/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/stwAAOSw5UFcCcoe/$_57.JPG?set_id=8800005007"], "PrimaryCategoryID": "33034", "PrimaryCategoryName": "Musical Instruments & Gear:Guitars & Basses:Electric Guitars", "Quantity": 1, "Seller": {"UserID": "jguitar-shop", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 369, "PositiveFeedbackPercent": 100.0}, "BidCount": 4, "ConvertedCurrentPrice": {"Value": 308.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 308.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "w***o", "FeedbackPrivate": false, "FeedbackRatingStar": "Blue", "FeedbackScore": 93}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Americas", "Europe", "Asia", "AU"], "Site": "US", "TimeLeft": "PT0S", "Title": "1990 Greco SS-65P2. All Original. SG type. Kanako Nakayama model. Made in Japan.", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Greco"]}, {"Name": "Model Year", "Value": ["1990"]}, {"Name": "String Configuration", "Value": ["6 String"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Model", "Value": ["SS-65P2"]}, {"Name": "Right-/ Left-Handed", "Value": ["Right-Handed"]}, {"Name": "Country/Region of Manufacture", "Value": ["Japan"]}, {"Name": "Series", "Value": ["Original"]}, {"Name": "Body Type", "Value": ["Solid"]}, {"Name": "Body Color", "Value": ["Black"]}, {"Name": "MPN", "Value": ["0 7357"]}]}, "HitCount": 279, "PrimaryCategoryIDPath": "619:3858:33034", "Country": "JP", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 313.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Used", "ExcludeShipToLocation": ["APO/FPO", "Africa"], "GlobalShipping": false, "ConditionDescription": "Very Good+ Condition. This is Used Electric Guitar. The electric guitar when connect to the amplifier, sound output is normal. There are scratches and Dents. But fatal damage is not. I was shooting a lot of photos. Please confirm with a photograph. Please Read the descriptions for details.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}