{"BestOfferEnabled": false, "Description": "AUTHENTIC VINTAGE OAKLEY M FRAME METALLIC \"NEW \"BLUE with BLUE IRIDIUM HEATER LENS! These are 100% Genuine ••• Made In USA••• Oakley Vintage M FRAMES. They are the hard to find, in what Oakley called, \"New\" Metallic Blue colorway with a Blue iridium Heater lens. These feateure a VR28 Base for high contrast applications. Oakley Part Number 06-723 . They also come with the M Frame specific Large Genuine Oakley Microfiber Bag. I purchase my Oakley’s from Oakley directly or Authorized Retail Outlets. I take many high-rez pictures of the frames & lenses so you can see the actual condition and verify authenticity. Beware of imposters stealing my pictures and descriptions on eBay, What you see is EXACTLY what you'll be receiving! I also try to be critical in my assessment of actual condition. See My Feedback on the previous Oakley items I’ve sold! ••••All Pre-owned glasses are properly disinfected and cleaned ready for new owner•••• FRAME: Metallic Blue Frames / Chrome O’s. These frames are in great pre-owned condition They show only minor signs of use. The original Oakley Nose Pad is black /gray and useable, clean and isn't sticky, matchers the earsocks. The original Oakley earsocks are also Gray and show the minor signs of use. The grey earsocks can typically show minor discoloration over time, but overall these are useable and not sticky. LENS: Hard To Find Original Oakley Blue Iridium lenses have a VR28 Base and they are in Excellent pre-owned condition, There is no peeling or flaking of the AR coating or iridium anywhere. I have tried to take pictures of any flaws, They are so small that most won't show up in the magnified pictures. There may be some very minor micro-marks on them as s typical for these delicate vintage iridium lens coatings that have been handled, cleaned or seen minimal use. They are visible under magnification and at the right angle. I can't see them while wearing them, but this may also depend on your sensitivity. Overall these are in really nice shape! Blue Iridium: Utilizes a contrast-enhancing VR28 lens tint with an Iridium® coating to further tune contrast and reduce glare Light Transmission: 15% Conditions: Medium to bright light with contrast enhancing bias Protection Index: 3 These are great for Fishing, Golf, Cycling, Driving or Baseball etc... Lenses are perfect for use in High contrast applications. These take the standard M frame lenses In case you want a different tint, replacement lenses are readily available. I ship the same day as I receive payment so you'll get your glasses QUICKLY! I also ship bubble wrapped in a box NOT an Envelope, so you know they will make it it to your destination intact! Will ship worldwide as long as it is a country I can ship and track to, you have good feedback with NO recent non-pay strikes. Some bidders outside the US may have problems placing bids. If this happens please be sure to contact me and I can put you on my approved bidders outside of US list and can add appropriate shipping cost. SEE MY OTHER LISTINGS FOR OTHER VINTAGE OAKLEY LENSES AND ACCESSORIES. Check out my other items! Paypal payment due at end of auction. Thanks and Good Luck!!I _gsrx_vers_841 (GS 7.0.16 (841))", "ItemID": "143179181781", "EndTime": "2019-03-31T01:59:41.000Z", "StartTime": "2019-03-19T21:25:36.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/AUTHENTIC-VINTAGE-OAKLEY-M-FRAME-METALLIC-NEW-BLUE-IRIDIUM-HEATER-RARE-LENS-/143179181781", "ListingType": "FixedPriceItem", "Location": "San Francisco, California", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/1431791817818080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA2NlgxNTk5/z/alUAAOSwEaxckV5G/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2NlgxNTk5/z/QJ0AAOSw64NckV5H/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2NlgxNTk5/z/0-kAAOSwHxxckV5I/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2NlgxNTk5/z/eN0AAOSwZ6hckV5J/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2NlgxNTk5/z/nbwAAOSwHtNckV5K/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2NlgxNTk5/z/Lp8AAOSwylhckV5L/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2NlgxNTk5/z/QRYAAOSwBLVckV5M/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2NlgxNTk5/z/giIAAOSwF2hckV5M/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2NlgxNTk5/z/P78AAOSwAn9ckV5M/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2NlgxNTk5/z/STUAAOSwdmdckV5N/$_3.JPG", "https://i.ebayimg.com/00/s/MTA2NlgxNTk5/z/BNEAAOSwd5lckV5O/$_3.JPG"], "PostalCode": "94116", "PrimaryCategoryID": "79720", "PrimaryCategoryName": "Clothing, Shoes & Accessories:Men's Accessories:Sunglasses & Sunglasses Accessories:Sunglasses", "Quantity": 1, "Seller": {"UserID": "astralo98", "FeedbackRatingStar": "Purple", "FeedbackScore": 656, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 129.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 129.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "s***i", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 1}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "AUTHENTIC VINTAGE OAKLEY M FRAME METALLIC NEW BLUE- IRIDIUM HEATER RARE LENS", "ItemSpecifics": {"NameValueList": [{"Name": "Model", "Value": ["Oakley M Frame"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Style", "Value": ["Wrap"]}, {"Name": "Protection", "Value": ["100% UVA & UVB"]}, {"Name": "Lens Technology", "Value": ["HDO Iridium"]}, {"Name": "Gender", "Value": ["Men's"]}, {"Name": "Size", "Value": ["ONE SIZE FITS ALL"]}, {"Name": "MPN", "Value": ["06-723"]}, {"Name": "Frame Material", "Value": ["O-Matter"]}, {"Name": "Lens Color", "Value": ["Blue"]}, {"Name": "Brand", "Value": ["Oakley"]}, {"Name": "Frame Color", "Value": ["Blue"]}]}, "HitCount": 428, "PrimaryCategoryIDPath": "11450:4250:179239:79720", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Pre-owned", "GlobalShipping": false, "ConditionDescription": "Pre-Owned,SEE DETAILED DESCRIPTION BELOW!  If you have any questions feel free to contact me BEFORE buying.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}