{"BestOfferEnabled": false, "Description": "Versace Mod 2163 1002/81 63 15 135 3p Sunglasses Medusa Men's Wrap Description This pair of sunglasses are from a lot of Lost & Found items from a local municipality that we have been consigned to sell.   The frames have very minor scuffing/scratches from normal use.The glass lenses have fine scratches from normal use and wear.  They are too fine to photograph.The case is in good physical condition, with a working hinge.  See photos for a more detailed description.Included: Versace Mod 2163 1002/81 63 15 135 3p Medusa Men's Wrap Sunglasses Case Does not include: Anything else not listed or pictured Serial # : NA For items containing batteries - IF the item described above contains any kind of battery, the battery IS NOT GUARANTEED TO WORK unless the ad specifically states that the BATTERY works. An item may be described as in working condition, but unless the battery is ALSO described as working, the battery is NOT GUARANTEED at all. Please consider this if you are bidding on any item containing a battery. About Us Payment Shipping Environment International Buyers About Us We are a Government, Educational, and Corporate Surplus Management company. We make every effort to describe our items truthfully and to the best of our abilities. We have little to no operating or service knowledge for many of the items that we resell. For this reason, we may be unable to answer some questions regarding features or functionality for items we are selling. Please consider this prior to bidding or buying from us. PLEASE READ 'Item Condition' located under the time remaining section of this ad. If Item Condition is 'Used' then we guarantee it to work as described above only, even though we may have or may not have been able to test it. If Item Condition is ‘For Parts or Not Working ‘, please be advised that it may or may not work or be serviceable in any way, and should you require a guaranteed working item we respectfully recommend that you purchase the item from other vendors here on eBay who have the expertise and scope to fully test and guarantee such items. Payment Technology Surplus Depot is now enrolled in the eBay’s Managed Payments System! Apple Pay Now Accepted! We are now able to accept Apple Pay! Checking out on eBay with a credit card or Apple Pay is safe, secure, and includes the same buyer protections you know and enjoy. PayPal? Unfortunately, since eBay has not included PayPal as part of their Managed Payments System, we are not able to accept payments from that platform. They are working on integrating that platform before the end of 2019, so we hope to be able to resume payment through PayPal at that time. If you can only pay through PayPal, feel free to message us and we can still send you an invoice through PayPal for your transaction. If payment has not been received within 2 CALENDAR DAYS of auction close, the item will be relisted. If you are bidding on several of our items, then you must pay for any item (plus shipping) within 2 calendar days after the oldest item was won. All items not paid for within 2 calendar days will automatically invoke an Unpaid Item Case by eBay. Note that our system will automatically leave Positive Feedback for you as soon as payment has been received! Shipments to Florida addresses will have Florida sales tax added. Additionally, if you pick up at our location (no matter what State or Country you are from) you will have to pay Florida Sales Tax. Shipping We employ a professional shipping department in a 81,000 square ft facility. We do not ship out of a house or garage. We use new boxes and packing material 98% of the time. Keep in mind you are most likely buying something that does not come with the original box or packing material (unless otherwise pictured or stated). In these cases, in order to guarantee a professional packing job, new boxes and superior packing materials must be used. Unless your package is mistreated by the carrier, we guarantee it will arrive safe and sound. That's a major difference between us and other sellers on eBay. We cannot absorb the high cost of new boxes and packing material in the product selling price because we most often sell on behalf of others. We keep a smaller portion of each sale. By the time we pay eBay and PayPal fees, along with our payment to our consignors, there is not enough money left to give our boxes and packing material away. Therefore, if you believe our shipping prices are too high and do not care in what condition your item arrives in, then we respectfully request that you please do not bid on or buy our products. To save on shipping, local pick-up by winning bidder is always welcome. We are open Mon-Fri from 10:00AM to 5:00PM for pick ups. Environment Please Consider the Environment If you are purchasing anything from us for parts or repair, or if you no longer need a product you purchased from us, we will gladly take back that product or any parts not used to ensure proper recycling of those parts. All we ask is that you pay to ship it back and we will recycle at no cost to you (other than shipping). Please do not discard any electronics, plastic, metal, batteries, circuit boards, or wiring in the trash. These are all 99.9% recyclable these days. If you are unable to return anything you cannot use, then please contact us for information about the proper recycling of items containing those materials. International Buyers Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer’s responsibility. Please check with your country’s customs office to determine what these additional costs will be prior to bidding/buying. These charges are normally collected by the delivering freight (shipping) company or when you pick the item up – do not confuse them for additional shipping charges. We do not mark merchandise values below value or mark items as ‘gifts’ - US and International government regulations prohibit such behavior. Copyright© 2003-2018 Technology Surplus Depot - All Rights Reserved Sell Smarter with Kyozou.Inventory and Ecommerce Management", "ItemID": "192858815510", "EndTime": "2019-03-22T20:40:13.000Z", "StartTime": "2019-03-15T20:40:13.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Versace-Mod-2163-1002-81-63-15-135-3p-Sunglasses-Medusa-Mens-Wrap-/192858815510", "ListingType": "Chinese", "Location": "Lake Mary, Florida", "PaymentMethods": ["VisaMC", "AmEx"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/1928588155108080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA5M1gxNjAw/z/Ht4AAOSwhW1cjA3R/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAzN1gxNjAw/z/iE0AAOSwlLdcjA3R/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIxN1gxNjAw/z/A3MAAOSwxqZcjA3S/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTA4OFgxNjAw/z/xVMAAOSwcGtcjA3S/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTM1N1gxNjAw/z/cSIAAOSwiBBcjA3S/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTI0M1gxNjAw/z/AhsAAOSwFpVcjA3S/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/BgAAAOSwnDRcjA3S/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/JNgAAOSw8ZxcjA3S/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTQ5MlgxNjAw/z/VNAAAOSwIS9cjA3S/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTI4M1gxNjAw/z/~c4AAOSwpclcjA3T/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/LoYAAOSw-RVcjA3S/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/rjwAAOSwSsZcjA3S/$_1.JPG?set_id=880000500F"], "PostalCode": "32746", "PrimaryCategoryID": "79720", "PrimaryCategoryName": "Clothing, Shoes & Accessories:Men's Accessories:Sunglasses & Sunglasses Accessories:Sunglasses", "Quantity": 1, "Seller": {"UserID": "technologysurplusdepot", "FeedbackRatingStar": "TurquoiseShooting", "FeedbackScore": 44264, "PositiveFeedbackPercent": 99.8, "TopRatedSeller": true}, "BidCount": 30, "ConvertedCurrentPrice": {"Value": 105.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 105.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "d***2", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 194}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Versace Mod 2163 1002/81 63 15 135 3p Sunglasses Medusa Men's Wrap", "ItemSpecifics": {"NameValueList": [{"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Style", "Value": ["Wrap"]}, {"Name": "Brand", "Value": ["Versace"]}, {"Name": "Frame Color", "Value": ["Multi-Color"]}, {"Name": "Frame Material", "Value": ["Metal & Plastic"]}, {"Name": "Lens Technology", "Value": ["Polarized"]}, {"Name": "Temple Length", "Value": ["135 mm"]}, {"Name": "Model", "Value": ["2163 1002/81 63 15 135 3p"]}]}, "HitCount": 643, "PrimaryCategoryIDPath": "11450:4250:179239:79720", "Storefront": {"StoreURL": "https://stores.ebay.com/id=16701833", "StoreName": "Tech Surplus Depot"}, "Country": "US", "ReturnPolicy": {"Refund": "Money back or replacement (buyer's choice)", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Seller", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 107.5, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": true, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Pre-owned", "ExcludeShipToLocation": ["BR", "CL", "MA", "NE", "AM", "BD", "RU", "LK", "AU", "FR", "IT", "UA"], "TopRatedListing": true, "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "SKU": "941D572B-33D7-421C-9016-A284FB99217C", "NewBestOffer": false}