{"BestOfferEnabled": true, "Description": "Oakley Sunglass Lot(1) Flak Jacket Custom Paint SplatterBlack Iridium - Standard Lens(3) M-Frame Custom, New Blue, Metallic GreyGold Iridium - Heater LensYellow - Heater LensFire Iridium - New Hybrid VentedPersimmon - New Hybrid +Red Iridium - New Hybrid+Red Iridium - Sweep Listing included 4 complete pairs of Oakley shades, with a few extra M-Frame lenses; Yellow heater has light scratches but still okay to wear, perfect for yard-work which is what I used them for. The persimmon New Hybrid is excellent condition just a couple minute imperfections otherwise near flawless. Fire vented New Hybrid is in fairly decent condition, there are marks on either side but can still be worn if they do not bother you - these were also used around the yard. Flak Jacket's were recently painted in a white/blue splatter theme, the Flak has brand new genuine white oakley sock kit installed - the lenses on them do show some signs of wear, they are genuine black iridium standard cut. White/Blue M-Frame was also recently painted, with an additional white pearl clear coat applied hence why it's a bit lighter in tone - they have some small imperfections to the finish but do not bear any serious flaws. It's mounted with Gold Iridium heater lens that's in excellent condition with only some minor imperfections which should not pose any issues to the user. New Blue M-Frame are in excellent condition, the frames do not appear to have any flaws that I can find. They are paired with +Red Iridium sweep lens which apart from a tiny scuff on the right the mounting hook has parted away some, however I've mounted/dismounted the lens a number of times (20+) over the past 2 years without incident. So long as you're weary of how to properly remove a lens you should be fine, as the visual condition of the lens is just too nice to go to waste. Metallic Grey M-Frame are in good condition, the temple tips were shortened to wear while riding this with a helmet otherwise they are excellent condition cosmetically speaking. The lens is +Red Iridium New Hybrid lens, which is in good condition as well they have some superficial surface wear imperfection although they do not obstruct my general FOV while wearing them. NO INTERNATIONAL SHIPPINGIf You Have Question, Please Ask Them Prior To Submitting A Offer/PurchasingThanks Terms of Purchase:Before placing a bid/win/purchase the item read the full description, I will not cancel the order if you changed your mind or/and someone used your phone to make a purchase, and/or you decide after purchase that you'd changed your mind or only now realized a certain detail. Payment must be made within 2 days. Unpaid item case will be opened automatically after 48 hours of nonpayment, if you need more time or have any difficulties to pay please let me know before place a bid/win/purchase the item so we can work it out.These are listed as pre-owned Sunglasses which will have some signs of use. You are responsible to review all images and description provided on the item, along with any additional research in regards to their size/fitment. I will not accept a return based on your dissatisfaction of their fitment, there is plenty of information out there on size/fitment; you are responsible to do your own research.Understand I'm describing the product how I see them. The lighting, angle, the line of sight and sensitivity to scratches are subjective. The main point of the description is to give you an idea of the condition, even with the pics attached to see how it looks and where it is located and then you need to decide if it works for you; some people are very sensitive to visual clarity, while some are not even bothered by deep scratch). If there are any concerns regarding the product, you must contact me prior to placing the bid/purchase for further details/explanation otherwise you are bound to going through with the purchase. Make sure you have correct shipping address before purchase, I will not ship to any other address, except the one indicated in the order - if you are using a forwarding service for international shipping you must note this in your purchase details as we require signature confirmation on such orders due to past negative experiences.", "ItemID": "223464785353", "EndTime": "2019-03-29T18:27:36.000Z", "StartTime": "2019-03-29T17:29:42.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Oakley-M-Frame-Sunglasses-Flak-Jacket-Custom-Splatter-Paint-6-Lenses-Red-Fire-/223464785353", "ListingType": "FixedPriceItem", "Location": "New Haven, Connecticut", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/2234647853538080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/W3YAAOSwh8xcnkpH/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/czgAAOSwrdlcnlCR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/qLgAAOSwndBcnlDT/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/nCIAAOSw7mNcnlCp/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNDU1/z/qVQAAOSwEeBcnktm/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxMDY2/z/7toAAOSwPPtcnktb/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTUyMVgxNjAw/z/ezoAAOSwtNlcnlB3/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTMwOVgxNjAw/z/SPwAAOSwVblcnlB7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI4MVgxNjAw/z/vT4AAOSwZ2pcnlB-/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODU5WDE2MDA=/z/Vu0AAOSwCrtcnlCA/$_57.JPG?set_id=8800005007"], "PostalCode": "06511", "PrimaryCategoryID": "79720", "PrimaryCategoryName": "Clothing, Shoes & Accessories:Men's Accessories:Sunglasses & Sunglasses Accessories:Sunglasses", "Quantity": 1, "Seller": {"UserID": "kstogniew", "FeedbackRatingStar": "Purple", "FeedbackScore": 691, "PositiveFeedbackPercent": 100.0}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 175.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 175.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "l***e", "FeedbackPrivate": false, "FeedbackRatingStar": "YellowShooting", "FeedbackScore": 11595}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Oakley M Frame Sunglasses Flak Jacket Custom Splatter Paint 6 Lenses +Red Fire ", "ItemSpecifics": {"NameValueList": [{"Name": "Model", "Value": ["\"New\" M-Frame"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Style", "Value": ["Vintage"]}, {"Name": "Theme", "Value": ["Retro"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Lens Color", "Value": ["+Red"]}, {"Name": "Brand", "Value": ["Oakley"]}, {"Name": "Frame Color", "Value": ["Multi-Color"]}]}, "HitCount": 16, "PrimaryCategoryIDPath": "11450:4250:179239:79720", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Pre-owned", "GlobalShipping": false, "ConditionDescription": "Listing included 4 complete pairs of Oakley shades, with a few extra M-Frame lenses", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}