{"BestOfferEnabled": false, "Description": "(2) Oakley Frogskins Sunglasses MODEL - Frogskins FRAME - Crystal Black | Polished Black LENS - Blue Iridium | Ice Iridium Left Lens Engraved w/ Heritage 30th Anniversary Logo SPARES - Black Iridium Left Lens Engraved w/ Grenade Logo | Jade Iridium CONDITION - This listing is for two pairs of pre-owned Frogskins, with four pairs of genuine Oakley lenses. Polished Black frame is of the most recent style Frogs out there, so their arms have that snappy feeling to them as though they were spring loaded as you'd find on some of the more sporty frames. Crystal Black pais is older style frogs, they show more wear with a fissure line under the orbital and some surface wear around the edges. Arms move good with decent amount of resistance open/closing. Ice Iridium lenses mounted in the black frame show light wear with a couple hairline scratch lines - should not effect FOV - 11% VLT. Jade Iridium replacement lenses mild wear, there is a nick mark as seen in photo 11 - as the mark is on the lower portion I didn't find it to impact my general FOV, occasionally could as though be felt but do not consider it a major obstruction - 17% VLT. Blue Iridium lenses mounted in the crystal black pair have very minimal wear - 20% VLT. Black Iridium spares, have moderate wear in form of bunch of fine hairline scuffs seen in photo 10 - they can be felt while worn, although not large enough to obstruct the FOV imo - 9% VLT. NOTES - There will be two storage cases included to keep each pair in, if I find lens bags I'll include them if not the spare lenses will be packed in protective foam. Items will be shipped within 1 business. Feel Free To Request Additional Photos or Ask Any Questions Terms of Purchase:Before placing a bid/win/purchase the item read the full description, I will not cancel the order if you changed your mind or/and someone used your phone to make a purchase, and/or you decide after purchase that you'd changed your mind or only now realized a certain detail. These are listed as pre-owned Sunglasses which will have some signs of use. You are responsible to review all images and description provided on the item, along with any additional research in regards to their size/fitment. I will not accept a return based on your dissatisfaction of their fitment, there is plenty of information out there on size/fitment; you are responsible to do your own research.Payment must be made immediately upon Buy Now/Make Offer purchase offers, in case of Auctions buyers will have 18hrs. If you need more time or have any difficulties to pay please let me know before placing a bid/win/purchase the item so we can work it out. If no payment is made within 36 hours of purchase a courtesy direct message will be sent to the buyer to check-in on the status of when you intend to pay. Unpaid item case will be opened automatically after 48 hours of nonpayment - if you decline to go through with the order and simply ignore the attempts of contact the case will be handed over to eBay and you will be blocked from making any future purchases.Understand I'm describing the product how I see them. The lighting, angle, the line of sight and sensitivity to scratches are subjective. The main point of the description is to give you an idea of the condition, even with the pics attached to see how it looks and where it is located and then you need to decide if it works for you; some people are very sensitive to visual clarity, while some are not even bothered by deep scratch). If there are any concerns regarding the product, you must contact me prior to placing the bid/purchase for further details/explanation otherwise you are bound to going through with the purchase. Make sure you have correct shipping address before purchase, I will not ship to any other address, except the one indicated in the order - if you are using a forwarding service for international shipping you must note this in your purchase details as we require signature confirmation on such orders due to past negative experiences.", "ItemID": "223455542580", "EndTime": "2019-03-26T00:57:43.000Z", "StartTime": "2019-03-21T00:57:43.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Oakley-Crystal-Black-Frogskins-Sunglasses-2-Frames-4-Lenses-GUC-not-polarized-/223455542580", "ListingType": "Chinese", "Location": "New Haven, Connecticut", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs1.ebaystatic.com/pict/2234555425808080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/OTk4WDE2MDA=/z/LxwAAOSwq5dcjweu/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTg5WDEwMDA=/z/43QAAOSwOztcj-yV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA1M1gxNjAw/z/yGsAAOSwkYpcjuO1/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/3f4AAOSw~9JcjuOZ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDU5WDE2MDA=/z/~PgAAOSwfjBcjt95/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/avMAAOSwqaNcjt1T/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/1D4AAOSw4uhcjuOX/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDU5WDE2MDA=/z/JL4AAOSw1AZcjt97/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTYwMFgxNjAw/z/3KEAAOSwmThcjt1L/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/6XEAAOSwHVdcjuOs/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/588AAOSwQ45cjuOu/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTA2NlgxNjAw/z/kioAAOSwzqdcjuSA/$_57.JPG?set_id=8800005007"], "PostalCode": "06511", "PrimaryCategoryID": "79720", "PrimaryCategoryName": "Clothing, Shoes & Accessories:Men's Accessories:Sunglasses & Sunglasses Accessories:Sunglasses", "Quantity": 1, "Seller": {"UserID": "kstogniew", "FeedbackRatingStar": "Purple", "FeedbackScore": 690, "PositiveFeedbackPercent": 100.0}, "BidCount": 10, "ConvertedCurrentPrice": {"Value": 67.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 67.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "n***a", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 131}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Oakley Crystal Black Frogskins Sunglasses 2) Frames 4) Lenses GUC not polarized", "ItemSpecifics": {"NameValueList": [{"Name": "Model", "Value": ["Frogskins"]}, {"Name": "Country/Region of Manufacture", "Value": ["United States"]}, {"Name": "Style", "Value": ["Frogskins"]}, {"Name": "Temple Length", "Value": ["133"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Frame Material", "Value": ["O-Matter"]}, {"Name": "Lens Color", "Value": ["Blue Iridium"]}, {"Name": "Brand", "Value": ["Oakley"]}, {"Name": "Frame Color", "Value": ["Crystal Black + Polished Black"]}]}, "HitCount": 106, "PrimaryCategoryIDPath": "11450:4250:179239:79720", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 68.0, "CurrencyID": "USD"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Pre-owned", "ExcludeShipToLocation": ["US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "Blue Iridium, Ice Iridium, Jade Iridium, Black Iridium lenses are included, all from oakley not cheapo aftermarkets replacements. I've tried to detail their imperfections best I could and photographed them, so be sure to eview all the images and read the description prior to purchasing/making an offer. The Crystal Black pair appeared to have been fixed by the previous owner, regarding the top fin on L temple, I had issues with the arm but it's something that wasn't mentioned to me, only reason I'm pointing it out.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}