{"BestOfferEnabled": false, "Description": "See My Ebay Store OAKLEY SLIVER OO9262-30 Corten/Warm Gray Metals Collection Sunglasses 57mm You are bidding on a pair of OAKLEY SLIVER OO9262-30 Corten/Warm Gray Metals Collection Sunglasses 57mm. Details: Model: SLIVER OO9262-30 Metal Collection. Frame: Corten/Brown Icons. Lens: 57mm/Warm Gray. Bridge: 18mm. Temple: 140mm. Compare at $120.00 new! Previously owned and worn. Frames are in good condition, normal wear (see photos). Lenses have some scratches, none that appear to interfere with line of sight, use as is, replace with original, FUSE or REVANT aftermarket replacement lenses. This is a great pair of OAKLEY SLIVER sunglasses. We authenticate all of our listing to be what we say they are. Please take a moment to check our feedback regarding similar items. Unless otherwise stated, the listing is for the sunglasses only, no box, bag, case or cleaning cloth. Almost all of our sunglasses are obtained from lost and found sales in lots of 400+ in a box, together, no individual wrapping, cases or papers. When we sort thru them, most are cheaper gas station/dollar store brands. However, about 15% are name brands like this pair. Before we list we insure that they are what we say they are in the listing. If we cannot authenticate, we do not list. We have a 30 day return policy, we take our commitment to customer service seriously and stand behind everything we list and sell. If for any reason you are not happy with your purchase, you may return it for a full refund. We only ask one thing.....please read the listing! These are pre-owned; they have flaws & issues, which we take the time to point out. The condition is our opinion, not a statement of fact. If you are looking for perfect or near perfect or if your eyes are very sensitive, we encourage you to purchase them new from a reputable dealer located near you. We believe we offer great values on quality pre-owned sunglasses, that is our opinion and it is shared by 9000 of our trading partners. If we can answer any other questions, please let us know. Thank you for viewing our auction and good luck!(LFB50) SELLERS PAYMENT INSTRUCTIONS We only accept PayPal. Payment is expected within 3 days from auction end, items will ship within 1 business day of payment. Please email within 3 days of end of auction with any changes of address or other shipping information. If you have any question about an item or policy, please ask before you bid. Your satisfaction is important to me! I will know that you are satisfied with the item and service when I receive your positive feedback. If there is any problem, please email me with the details and please allow for a resolution before leaving a negative feedback. Thank you! INTERNATIONAL BUYERS - Please Note: Import duties, taxes and charges are not included in the item price or shipping charges. These charges are the buyer's responsibility. Please check with your country's customs office to determine what these additional costs will be prior to bidding/buying. These charges are normally collected by the delivering freight (shipping) company or when you pick the item up - do not confuse them for additional shipping charges. We do not mark merchandise values below value or mark items as \"gifts\" - US and International government regulations prohibit such behavior. RETURN POLICY Because I want you to be completely satisfied with your purchase, you may return the item for any reason within 30 days. The item must be received in the same condition in which it was sent. Buyer is responsible for S&H & postage. Refund will be as cash back via PayPal for the purchase price only, S&H & postage are excluded. Items purchased with Free Shipping will be refunded for the purchase price, less cost of postage. If you have any question about an item or policy, please ask before you bid. Thank you! PayPal eBay's service to make fast, easy, and secure payments for your eBay purchases! See My Ebay Store", "ItemID": "254164061943", "EndTime": "2019-03-22T02:26:30.000Z", "StartTime": "2019-03-15T02:26:30.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/OAKLEY-SLIVER-OO9262-30-Corten-Warm-Gray-Metals-Collection-Sunglasses-57mm-/254164061943", "ListingType": "Chinese", "Location": "North Texas", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2541640619438080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/kzcAAOSw1Udciw1N/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/UawAAOSw4EJciw1P/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/IkAAAOSwUMhciw1S/$_1.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/EnEAAOSwkmJciw1V/$_1.JPG?set_id=880000500F"], "PrimaryCategoryID": "79720", "PrimaryCategoryName": "Clothing, Shoes & Accessories:Men's Accessories:Sunglasses & Sunglasses Accessories:Sunglasses", "Quantity": 1, "Seller": {"UserID": "auctionboyusa", "FeedbackRatingStar": "Green", "FeedbackScore": 9219, "PositiveFeedbackPercent": 99.7, "TopRatedSeller": true}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 49.99, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 49.99, "CurrencyID": "USD"}, "HighBidder": {"UserID": "t***r", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 46}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "CA", "GB", "DK", "RO", "SK", "BG", "CZ", "FI", "HU", "LV", "LT", "MT", "EE", "AU", "GR", "PT", "CY", "SI", "JP", "CN", "SE", "KR", "ID", "TW", "TH", "BE", "FR", "HK", "IE", "NL", "PL", "ES", "IT", "DE", "AT", "BS", "IL", "NZ", "SG", "CH", "NO", "SA", "UA", "AE", "QA", "KW", "BH", "HR", "MY", "CL", "CO", "CR", "DO", "PA", "TT", "GT", "SV", "HN", "JM", "AG", "AW", "BZ", "DM", "GD", "KN", "LC", "MS", "TC", "BB", "BD", "BM", "BN", "BO", "EG", "GF", "GG", "GI", "GP", "IS", "JE", "JO", "KH", "KY", "LI", "LK", "LU", "MC", "MO", "MQ", "MV", "NI", "OM", "PK", "PY", "RE", "UY"], "Site": "US", "TimeLeft": "PT0S", "Title": "OAKLEY SLIVER OO9262-30 Corten/Warm Gray Metals Collection Sunglasses 57mm", "ItemSpecifics": {"NameValueList": [{"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Style", "Value": ["Rectangular"]}, {"Name": "Brand", "Value": ["Oakley"]}, {"Name": "Frame Color", "Value": ["Corten"]}, {"Name": "Lens Color", "Value": ["Gray"]}, {"Name": "Frame Material", "Value": ["O-Matter"]}, {"Name": "Protection", "Value": ["100% UVA & UVB & UVC"]}, {"Name": "Lens Technology", "Value": ["N/A"]}, {"Name": "Temple Length", "Value": ["140 mm"]}]}, "HitCount": 46, "PrimaryCategoryIDPath": "11450:4250:179239:79720", "Storefront": {"StoreURL": "https://stores.ebay.com/id=209421427", "StoreName": "auctionboyusa"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 50.99, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Pre-owned", "ExcludeShipToLocation": ["RU"], "GlobalShipping": true, "ConditionDescription": "Previously owned and worn. Frames are in good condition, normal wear (see photos). Lenses have some scratches, none that appear to interfere with line of sight, use as is, replace with original, FUSE or REVANT aftermarket replacement lenses.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}