{"BestOfferEnabled": true, "Description": "Pre-owned pair of Authentic POLARIZED Oakley sunglasses. Great shape, excellent condition. The glasses look very nice and pretty clean, seems that the glasses were barely worn. It might have just a few minor imperfections from normal wear that I do not find it noticeable at all when glasses are on and nothing obstructs the view. Overall Looks like new to me. Please see pictures for a better understanding of the condition of the glasses. Very stylish sunglasses made with the top quality of the brand! Polarized lenses drastically reduce the brightness of shiny surfaces, like chrome, and large bodies of water. Polar lenses reduce reflections and enhance contrast. improving visual clarity and reducing eye strain. Comes with the authentic Oakley box with tags and carrying pouch only. NO RETURNS accepted unless the item is grossly misrepresented. No international shipping. The glasses will be shipped within 2 business days after the payment is received. I use USPS first class delivery service unless the other type is mutually agreed. Description MUST BE READ before placing a bid/win/purchase the item, I will not cancel the order if you haven't read the description or/and changed your mind or/and someone used your phone. Payment must be made within 2 days. Unpaid item case will be opened automatically after 48 hours of nonpayment, if you need more time or have any difficulties to pay please let me know before place a bid/win/purchase the item so we can work it out. Do not consider glasses as flawless, they are still pre-owned. I will consider only reasonable offers. You are responsible to do your own research/ try the size of the glasses. These are a used pair of sunglasses meaning they might be previously worn and be a tiny bit stretched or adjusted for a certain person. The good news that most of them are plastic frame and the adjustment takes only a couple of mins for an optician. I would recommend stopping by an optical store that sells sunglasses and ask them to adjust it, usually, they take a few bucks for or something nothing at all. Sunglasses are always a personal item and need to be adjusted for everybody. I will not accept a return based on it is not for your face. Kindly note that I'm describing the glasses how I see that. Lighting, vision, the line of sight and sensitivity to scratches are subjective. The main point of the description is to give you an idea of the condition, even with the pics attached to see how it looks and where it is located and then you need to decide if it works for you. ( some of the people are very sensitive, some of them not even bothered by deep scratch). If there are any concerns regarding the product, you must contact us within 72 hours after delivery, otherwise, it will not be considered. Make sure you have correct shipping address before purchase, I will not ship to any other address, except the one indicated in the order. Please contact me if you have any questions before purchasing for more details. Size : 54-17 138 Model : OO9245-02In pop culture, it was a time like no other. Ronald Reagan was in the White House, The Terminator was in the box office and Run DMC was in certified gold. It was also the time when Oakley created one-of-a-kind sunglasses called Frogskins. Oakley resurrected the original tooling from the '80s giving you a chance to own a piece of history. All Oakley lenses offer HDO® Technology with the following benefits:Clarity: Conventional lenses can magnify images. HDO® precision gives less distorted vision across the entire field of view.Refraction: With regular lenses, objects aren’t really where you see them. HDO® offers a truer visual image so your brain won’t have to work overtime.UV Protection: All Oakley lenses block 100% of UVA, UVB & UVC rays and harmful blue light up to 400 nm.Iridium Lenses:Oakley Iridium lens coating is engineered to reduce glare and improve contrast. An array of available tints allows the wearer to balance light transmission in any light condition. The 12-micron jacket of Iridium must be treated with special care to avoid scratching. It is only recommended to use an Oakley Micro Bag or Oakley Lens Cleaning Kit to clean Oakley lens, do not use any other solvents, chemicals or third party cleaning kits because they have not been tested on our lenses and can possibly damage them.2.15", "ItemID": "264187080290", "EndTime": "2019-03-30T19:42:52.000Z", "StartTime": "2019-02-08T19:48:08.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/OAKLEY-OO9245-02-FROGSKINS-POLISHED-BLACK-BLACK-IRIDIUM-POLARIZED-AUTHENTIC-/264187080290", "ListingType": "FixedPriceItem", "Location": "Hollywood, Florida", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2641870802908080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/jTgAAOSwZ2pcXdzP/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/-HUAAOSwWtpcXdzL/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/76MAAOSwWiJcXdzQ/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/zNAAAOSwAPxcXdzd/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/RsYAAOSwfVFcXdzb/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/ncgAAOSwmThcXdzS/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/ea4AAOSwyHxcXdzW/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/jTYAAOSwZ2pcXdzN/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/TA8AAOSwBz1cXdza/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/ZLgAAOSwqGFcXdzZ/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/XbUAAOSw2cRcXdzT/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/1JoAAOSw0bpcXdzK/$_12.JPG?set_id=880000500F"], "PostalCode": "33021", "PrimaryCategoryID": "79720", "PrimaryCategoryName": "Clothing, Shoes & Accessories:Men's Accessories:Sunglasses & Sunglasses Accessories:Sunglasses", "Quantity": 1, "Seller": {"UserID": "eye-conic", "FeedbackRatingStar": "Red", "FeedbackScore": 1711, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 71.1, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 71.1, "CurrencyID": "USD"}, "HighBidder": {"UserID": "e***m", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 321}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "OAKLEY OO9245-02 FROGSKINS™ POLISHED BLACK/ BLACK IRIDIUM POLARIZED AUTHENTIC", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Oakley"]}, {"Name": "Frame Material", "Value": ["Plastic"]}, {"Name": "Lens Color", "Value": ["BLACK IRIDIUM"]}, {"Name": "Lens Technology", "Value": ["Polarized"]}, {"Name": "Style", "Value": ["Oval"]}, {"Name": "Protection", "Value": ["100% UVA & UVB"]}, {"Name": "Temple Length", "Value": ["138 mm"]}, {"Name": "Frame Color", "Value": ["POLISHED BLACK"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}]}, "HitCount": 98, "PrimaryCategoryIDPath": "11450:4250:179239:79720", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1556690139", "StoreName": "Eye-conic"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Pre-owned", "GlobalShipping": false, "ConditionDescription": "\" Sunglasses are in great condition, please read the full description \"", "QuantitySoldByPickupInStore": 0, "SKU": "2.15", "NewBestOffer": false}