{"BestOfferEnabled": true, "Description": "I'm selling a used, in great condition, Smith Hudson tactical sunglasses w/ soft case. Stylish design mixes with superior functionality.The Hudson showcases a street-wise frame. An understated cool presence with the performance features that Smith is famous for. The Smith Elite Tactical sunglass line fills the gap in the tactical world by bringing performance and style to protective eyewear. With different frame styles, you can choose your look and get the same high-impact protection and quality optics with any choice. The high-quality lens and frame materials are designed to hold up in the field. Features:Megol nose padsSmall fit, small coverageFrames constructed of lightweight, impact resistant materialsTapered Lens Technology corrects distortionAvailable in Black frame with Ignitor, Gray or Polarized Gray lensIgnitor maximizes an object’s definition and enhances depth perceptionIgnitor lens has a multi-layer mirror coating that increases eye comfort without color appearanceGray lens tint provides true-color perception for exact definitionGray lens creates soothing effect on the eye in bright or sunny conditionsPolarized Gray reduces reflected glare and sharpens details in true colorLenses provide 100% protection from harmful UVA/UVB/UVC raysProprietary high-impact lenses meet ANSI Z87.1 standard for optics and MIL-PRF-31013 standard for impactTactical Lifestyle: Smith Optics Elite acknowledges the need for eyewear that provides protection when you’re NOT expecting trouble. Drawing from the Smith Optics Elite design philosophy and Smith Optics’s experience in making exceptionally wearable eyewear, the Tactical Lifestyle line of protection offers Smith Optics protection while bringing Smith Optics style into the picture. Tactical Core: Smith Optics Elite has fused years of experience developing the world’s most innovative eyewear with the competency of the professionals found within its core program. The experts performing tactical mission sets daily has spawned the highest performing tactical eyewear line in the industry. Integration, maximum protection, optimized fit and function pair with precision optics to provide ultimate capability for those on the extreme edge of the tactical spectrum. School of Design: Smith Optics Elite takes the concept of integration to a new level by adopting the military’s Human Systems Integration (HSI) process. This approach takes human variables such as fit, optical performance, ballistic performance, integrated equipment, and weapons interface into account to refine a product’s functionality across the spectrum of factors. They design specifically to optimize performance allowing real-world testing to drive the product’s evolution. PivLock Technology: Smith Optics Elite introduced the fastest and easiest lens interchange system available. PivLock technology is the ultimate combination of performance and style and it’s a Smith Optics exclusive. They have incorporated the PivLock Lens Interchange Technology in the Aegis eyeshield. You have more important things to do with your time than messing around with a lens. Flip, switch, and get to it. Serialization: In the world of body armor and ballistic helmets, standardized serialization allows for completely transparent backward tracking of every item. Eyewear is simply an extension of these foundational ballistic components. The Tactical Core line of products now adopts this practice. The unique serial number found on the Aegis eyeshields and the OTW goggle allows for discrete traceability of every lens produced. Smith Optics didn’t have to do this but they chose to as proof that every lens meets the highest level of production and validation standards. Our tactical athletes deserve the highest level of protection coupled with the highest level of transparency in the industry. Why would you trust anything else? Lens Material: Quality materials help Smith Optics achieve their goal of premium protection. They use top grade polycarbonate in their tactical core lenses and a proprietary polymer material in their Tactical Lifestyle lenses. Lens Coatings: Fogging is performance inhibiting, annoying, and dangerous. Smith Optics knows more about fog prevention than anyone. They were founded with the invention of the non-fogging goggle over 45 years ago. Their anti-fog technologies keep your line of sight crystal clear, so all you have to think about is your objective. Tapered Lens Technology-TLT Optics: Distortion occurs whenever light passes through any medium, including curved lenses. Smith Optics virtually eliminates all optical distortion with TLT (Tapered Lens Technology) Optics. TLT Optics progressively attunes lens thickness from lens center to the periphery, straightening light rays before they enter the eye so what you see is 100% of what you get. Protection is Paramount: Terms like MIL SPEC and ANSI Z87.1 describe ballistic protection by defining impact resistance of a projectile at a predetermined velocity. Smith Optics use aggressive research and testing to deliver materials that don’t just meet standards, they outclass them. Their lenses are engineered to absorb impacts that exceed requirements with optimized optical clarity. You don’t settle for just getting by and neither do they. Engineering: Smith Optics is fortunate to work with their own top level engineering team. They are hands on and take their jobs seriously. They know they are the gate keeper for quality. Smith Optics is constantly testing impact resistance, optical quality, fog time, abrasion resistance, and light transmission to ensure consistent dependability at the leading edge of product design. Their engineers make sure they get the results so you can focus on the mission. Sunglass Safety Rx: The Elite Tactical Lifestyle Sunglass frames meet the ANSI Z87.1-2003 standard for high impact and can be filled with safety prescriptions. The frames are molded in durable, impact rated material and provide the safety required on the job disguised in frame styles you’ll want to wear on the weekend. The Rx frames are marked according to ANSI Z87.1-2003 requirements. Prescriptions can be filled direct through Smith Optics or through their trusted optical partners. Please contact them at 800-635-4401 for more information.", "ItemID": "264253689822", "EndTime": "2019-03-30T16:32:13.000Z", "StartTime": "2019-03-25T00:35:31.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Smith-Hudson-Sunglasses-Polarized-Used-w-Smith-Soft-Cleaning-Case-/264253689822", "ListingType": "Chinese", "Location": "Bay Shore, New York", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/2642536898228080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/0aQAAOSw56pbNWzl/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/OqYAAOSwesVbNWxR/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/roYAAOSwAOdbNWxe/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/AlsAAOSwa~JbNWxm/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/~FQAAOSw3qdbNWxy/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/36gAAOSw5ItbNWyJ/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/1CYAAOSww7RbNWyV/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/XEcAAOSwSbxbNWyf/$_57.JPG?set_id=8800005007"], "PostalCode": "11706", "PrimaryCategoryID": "79720", "PrimaryCategoryName": "Clothing, Shoes & Accessories:Men's Accessories:Sunglasses & Sunglasses Accessories:Sunglasses", "Quantity": 1, "Seller": {"UserID": "tennisdirector", "FeedbackRatingStar": "Turquoise", "FeedbackScore": 412, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 60.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 60.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "o***y", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 108}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US", "CA", "GB", "DK", "RO", "SK", "BG", "CZ", "FI", "HU", "LV", "LT", "MT", "EE", "AU", "GR", "PT", "CY", "SI", "JP", "CN", "SE", "KR", "ID", "TW", "TH", "BE", "FR", "HK", "IE", "NL", "PL", "ES", "IT", "DE", "AT", "BS", "IL", "NZ", "SG", "CH", "NO", "SA", "UA", "AE", "QA", "KW", "BH", "HR", "MY", "CL", "CO", "CR", "DO", "PA", "TT", "GT", "SV", "HN", "JM", "AG", "AW", "BZ", "DM", "GD", "KN", "LC", "MS", "TC", "BB", "BD", "BM", "BN", "BO", "EG", "GF", "GG", "GI", "GP", "IS", "JE", "JO", "KH", "KY", "LI", "LK", "LU", "MC", "MO", "MQ", "MV", "NI", "OM", "PK", "PY", "RE", "UY"], "Site": "US", "TimeLeft": "PT0S", "Title": "Smith Hudson Sunglasses (Polarized), Used w/ Smith Soft Cleaning Case", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Smith"]}, {"Name": "Lens Color", "Value": ["Gray"]}, {"Name": "Lens Technology", "Value": ["Polarized"]}, {"Name": "Frame Color", "Value": ["Black"]}]}, "HitCount": 15, "PrimaryCategoryIDPath": "11450:4250:179239:79720", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 61.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 3, "ConditionID": 3000, "ConditionDisplayName": "Pre-owned", "GlobalShipping": true, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}