{"BestOfferEnabled": true, "Description": "Pre-owned pair of Authentic PRIZM Oakley sunglasses. Great shape, excellent condition. The glasses look very nice and pretty clean, seems that the glasses were barely worn. It might have just a couple of minor imperfections from normal wear that I do not find it noticeable at all when glasses are on and nothing obstructs the view. The frame is in great shape! Looks like new to me. Please see pictures for better understanding the condition of the glasses. Very stylish sunglasses made with the top quality of the brand! Comes with the authentic Oakley case ( which is alone $25) and carrying pouch. NO RETURNS accepted unless the item is grossly misrepresented. No international shipping. The glasses will be shipped within 2 business days after the payment is received. I use USPS first class delivery service unless the other type is mutually agreed. Description MUST BE READ before placing a bid/win/purchase the item, I will not cancel the order if you haven't read the description or/and changed your mind or/and someone used your phone. Payment must be made within 2 days. Unpaid item case will be opened automatically after 48 hours of nonpayment, if you need more time or have any difficulties to pay please let me know before place a bid/win/purchase the item so we can work it out. Do not consider glasses as flawless, they are still pre-owned. I will consider only reasonable offers. You are responsible to do your own research/ try the size of the glasses. These are a used pair of sunglasses meaning they might be previously worn and be tiny bit stretched or adjusted for a certain person. The good news that most of them are plastic frame and the adjustment takes only a couple of mins for an optician. I would recommend stopping by an optical store that sells sunglasses and ask them to adjust it, usually, they take a few bucks for or something nothing at all. Sunglasses are always a personal item and need to be adjusted for everybody. I will not accept a return based on it is not for your face. Kindly note that I'm describing the glasses how I see that. Lighting, vision, the line of sight and sensitivity to scratches are subjective. The main point of the description is to give you an idea of the condition, even with the pics attached to see how it looks and where it is located and then you need to decide if it works for you. ( some of the people are very sensitive, some of them not even bothered by deep scratch). If there are any concerns regarding the product, you must contact us within 72 hours after delivery, otherwise, it will not be considered. Make sure you have correct shipping address before purchase, I will not ship to any other address, except the one indicated in the order. Please contact me if you have any questions before purchasing for more details. Size : 59-12 133 Model : OO9188-04Oakley engineering takes performance to the next level and brings style along for the ride. Flak 2.0 offers a standard size frame with enhanced lens coverage, and every millimeter of the lens is optimized with High Definition Optics® in a ruggedly durable yet lightweight design. Designed to push your limits with patented XYZ Optics® for razor sharp clarity and secure grip of Unobtanium®FEATURESThe XL edition offers enhanced lens coverage and specialized lens curvature for protection against sun, wind and impactUnobtanium® earsocks and nosepads keep glasses in place, increasing grip despite perspirationPatented High Definition Optics® (HDO®) provides superior optical clarity and razor-sharp vision at every angleO-Matter™ stress-resistant frame material is both lightweight and durable for all-day comfort and protectionPrizm™ is a revolution in lens optics built on decades of color science research. Prizm™ lenses provide unprecedented control of light transmission resulting in colors precisely tuned to maximize contrast and enhance visibility.2.75", "ItemID": "264255933059", "EndTime": "2019-03-30T11:22:22.000Z", "StartTime": "2019-03-26T14:39:10.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Oakley-OO9188-04-FLAK-2-0-XL-PRIZM-ROAD-Matte-Gray-Smoke-frame-AUTHENTIC-/264255933059", "ListingType": "FixedPriceItem", "Location": "Hollywood, Florida", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs4.ebaystatic.com/pict/2642559330598080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/R4AAAOSwSBNcmjl9/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/1zMAAOSwm9Fbjsoe/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/p1EAAOSwbpVbjsof/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/jSIAAOSwqj9bjsoi/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/eNQAAOSw8b9bjsok/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/QsQAAOSwmOZbjsol/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/dAMAAOSwfOJbjsom/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/n4cAAOSw6j9bjsop/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/lOQAAOSw-zNbjsoq/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/HtAAAOSwKF5bjsos/$_57.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/lrQAAOSwVblcmjl4/$_12.JPG?set_id=880000500F"], "PostalCode": "33021", "PrimaryCategoryID": "79720", "PrimaryCategoryName": "Clothing, Shoes & Accessories:Men's Accessories:Sunglasses & Sunglasses Accessories:Sunglasses", "Quantity": 1, "Seller": {"UserID": "eye-conic", "FeedbackRatingStar": "Red", "FeedbackScore": 1711, "PositiveFeedbackPercent": 100.0, "TopRatedSeller": true}, "BidCount": 0, "ConvertedCurrentPrice": {"Value": 95.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 95.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "7***s", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 3281}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Oakley OO9188-04 FLAK™ 2.0 XL PRIZM™ ROAD; Matte Gray Smoke frame AUTHENTIC", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Oakley"]}, {"Name": "Frame Material", "Value": ["Plastic"]}, {"Name": "Lens Color", "Value": ["PRIZM ROAD"]}, {"Name": "Lens Technology", "Value": ["PRIZM"]}, {"Name": "Style", "Value": ["Sport"]}, {"Name": "Protection", "Value": ["100% UVA & UVB"]}, {"Name": "Temple Length", "Value": ["133 mm"]}, {"Name": "Frame Color", "Value": ["Matte Gray Smoke"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}]}, "HitCount": 48, "PrimaryCategoryIDPath": "11450:4250:179239:79720", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1556690139", "StoreName": "Eye-conic"}, "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "AutoPay": true, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 2, "ConditionID": 3000, "ConditionDisplayName": "Pre-owned", "GlobalShipping": false, "ConditionDescription": "\" Sunglasses are in great condition, please read the full description \"", "QuantitySoldByPickupInStore": 0, "SKU": "2.75", "NewBestOffer": false}