{"BestOfferEnabled": false, "Description": "Welcome to our Online eBay Store! FeedBack Join MAILING LIST Save this seller Menu STORE CATEGORIES electronics tools Jewelry & Watches antiques & collectibles toys sporting goods PRODUCT DESCRIPTION Kaenon Kore CarbonSilver/Blue Mirror Polarized Sunglasses ITEM SPECIFICATIONS THESE SUNGLASSES ARE USED BUT IN VERY GOOD CONDITION. THEY ARE WELL KEPT WITH NO DAMAGE OR SCRATCHES. THEY DO NOT COME WITH A CASE OR BOX. PLEASE BID WITH CONFIDENCE.                                                                                                NOTE: FITS LIKE A MEDIUM FRAME SIZE.  About Us Welcome to Arizona EZ Pawn. Whether you are looking for local pawnshops for instant cash loans, title loans, or want to buy quality items at discount prices, we buy and sell gold and silver, diamond jewelry, electronics, firearms, and much more. Our Sun City location is convenient for customers in Peoria, AZ, Glendale, AZ, and Phoenix, AZ. We are reputable pawn brokers offering pawn loans and title loans with reduced interest rates and professional service. A title loan enables you to continue driving your vehicle while paying off the loan. In addition, we are a jewelry and silver dollar pawn shop offering cash for gold, cash for diamonds, platinum, silver, and sterling silver, including fine jewelry, broken, and mismatched pieces. Our pawn and jewelry shop offers a large inventory of quality merchandise. If you are looking for affordable jewelry or a watch pawn shop offering great deals, we have a great selection of exquisite gold, silver, platinum, diamond, and gemstone jewelry and fine watches. Our electronics section has a wide variety of televisions, big screen televisions, computers, camcorders, laptops, and more. In addition, we have a many firearms for sale. If you are looking for local pawn shops in Peoria, AZ, Glendale, AZ, or Phoenix, AZ, please browse our website to learn more about our services, loans on jewelry, title loans, and read our pawn policies. Please contact Arizona EZ Pawn today at (623) 544-3446 for additional information about our loans or visit our local pawn shop to find great deals on jewelry, electronics, watches, and other valuables. Shipping Shipping within the 48 Contiguous United States ONLY No international Shipping No P.O.Box/APO/FPO Delivery Paypal Confirmed Addresses Inly Items Will be Shipped by the Next Bussiness day of Receiving full payment Tracking Number will be Provided 100% SATISFACTION GUARANTEE Comming Soon RETURNS We offer 14 day return policy,no refunds will be approved after the 14 day period.All items must be returned in the same condition in whch they were sent out. if the item is grossly misrepresented we will refund your pur-chase price plus shipping and shipping the item back to us in the orginal condition as you received it. All other returns will be charged a 20% restocking fee,ship- ping and insurance are non-refundable. please be sure you want the item,ask all question and read everthing before you commit to the sale. about Site Welcome to Arizona EZ Pawn. Whether you are looking for local pawnshops for instant cash loans, title loans, or want to buy quality items at discount prices, we buy and sell gold and silver, diamond jewelry, electronics, firearms, and much more. Our Sun City location is convenient for customers in Peoria, AZ, Glendale, AZ, and Phoenix, AZ..... Read More Store Links Contact Us Payment Options Returns Shipping Information Terms of Use NEWSLETTER SIGNUP Add my Store to your Favorite & receive my email newsletters about new items & special promotions! General Interest sign me up Payments Copyright © 2017 Arizona EZ-Pawn . All Rights Reserved. Listing and template services provided by inkFrog", "ItemID": "312534040042", "EndTime": "2019-03-25T22:18:29.000Z", "StartTime": "2019-03-18T22:18:29.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Kaenon-Kore-CarbonSilver-Blue-Mirror-Polarized-Sunglasses-/312534040042", "ListingType": "Chinese", "Location": "Sun City, Arizona", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/3125340400428080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/OTg0WDE2MDA=/z/SQoAAOSwUSRckBkx/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTAxM1gxNjAw/z/TOwAAOSwEwNckBkx/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/JLsAAOSw-RFckBkx/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTYwMFgxMjAw/z/NEUAAOSwyutckBkx/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/0h4AAOSwW0tckBkx/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/fnEAAOSwZNtckBky/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/TU0AAOSwkV9ckBkz/$_12.JPG?set_id=880000500F", "https://i.ebayimg.com/00/s/MTIwMFgxNjAw/z/2k8AAOSw0xxckBkz/$_12.JPG?set_id=880000500F"], "PostalCode": "85351", "PrimaryCategoryID": "79720", "PrimaryCategoryName": "Clothing, Shoes & Accessories:Men's Accessories:Sunglasses & Sunglasses Accessories:Sunglasses", "Quantity": 1, "Seller": {"UserID": "azezpawn", "FeedbackRatingStar": "Green", "FeedbackScore": 7001, "PositiveFeedbackPercent": 100.0}, "BidCount": 1, "ConvertedCurrentPrice": {"Value": 49.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 49.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "0***c", "FeedbackPrivate": false, "FeedbackRatingStar": "Yellow", "FeedbackScore": 38}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Kaenon Kore CarbonSilver/Blue Mirror Polarized Sunglasses", "ItemSpecifics": {"NameValueList": [{"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Brand", "Value": ["Kaenon"]}]}, "HitCount": 35, "PrimaryCategoryIDPath": "11450:4250:179239:79720", "Storefront": {"StoreURL": "https://stores.ebay.com/id=1012022238", "StoreName": "Arizona EZ-Pawn"}, "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 50.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Pre-owned", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America", "PO Box"], "GlobalShipping": false, "ConditionDescription": "VERY GOOD CONDITION", "QuantitySoldByPickupInStore": 0, "SKU": "102997 O7", "NewBestOffer": false}