{"BestOfferEnabled": false, "Description": "These men's sun glasses appear to be in good condition. I see no scratches on the lenses and no cracks on the frames. I do not know the age of the glasses, although they seem to be an older style. The nose cushions are in good shape. They are marked B &L Ray Ban USA on the inside of one side and Wayfarer Max on the inside of the other side piece. All of the used or collectible items we offer are previously owned by someone else before we acquire them. Time, weather, abuse and other factors may have caused changes to the appearance, operability or condition of the item, and sometimes those changes are hidden. We do our best to accurately describe the items’ condition, including any flaws that would be obvious to us. Since we are not experts pertaining to all items we offer, it is possible we might miss describing a flaw, or an asset. We believe that as a buyer of an item, you may know more about it than we do. Therefore, we recommend you review all information and pictures in this auction. If you have any questions about the originality, completeness or condition of this item, or how it will be packed or shipped, please ask them before you bid, and give enough time for us to answer before the auction ends. Important Information: Be sure to pay within three days of the auction end date. We are experienced packers, and we will follow the recommended packing guidelines of the shipping industry. You can request additional packing precautions, but if there is an additional cost to us, you must pay that cost. Occasionally, due to gorilla handling, or machine crunching, the items arrive damaged. In that case, you must make an insurance claim with the shipper at your end by taking the item and the packaging to the shipper’s office. We will not accept responsibility for loss due to damage caused by the shipper. Most of the time we use recycled packing supplies, at no cost to you. That may include shredded paper, wadded up paper; or other unusual materials which will provide sufficient shock protection. If you prefer conventional or new packing, please message us immediately after the auction ends and let us know. We will purchase new packing supplies and add the cost of that to the invoice. Remember, communication is the best way to solve any problem. On Mar-04-19 at 09:06:27 PST, seller added the following information: We've done some additional research on these and learned that these were made by Bausch and Lomb. Each lens has a very small engraving of \"B L\". According to internet information that kind of engraving on the lens was stopped in 1998 when Luxottica acquired the Ray-Ban line from Bausch & Lomb.", "ItemID": "333096954117", "EndTime": "2019-03-09T21:05:58.000Z", "StartTime": "2019-03-02T21:05:58.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Ray-Ban-Sun-Glasses-/333096954117", "ListingType": "Chinese", "Location": "North Bend, Oregon", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/3330969541178080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/MTE5OFgxNjAw/z/f28AAOSw3UlceFA5/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE5OFgxNjAw/z/cjkAAOSwHGFceFA7/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE5OFgxNjAw/z/XxUAAOSwQXxceFA9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE5OFgxNjAw/z/gX0AAOSwp~VceFBA/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE5OFgxNjAw/z/Oz4AAOSwfTlceFBC/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE5OFgxNjAw/z/oPEAAOSw5XJceFBH/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTE5OFgxNjAw/z/BcMAAOSwyElceFBJ/$_57.JPG?set_id=8800005007"], "PostalCode": "97459", "PrimaryCategoryID": "79720", "PrimaryCategoryName": "Clothing, Shoes & Accessories:Men's Accessories:Sunglasses & Sunglasses Accessories:Sunglasses", "Quantity": 1, "Seller": {"UserID": "startgroove", "FeedbackRatingStar": "Red", "FeedbackScore": 1455, "PositiveFeedbackPercent": 98.9}, "BidCount": 20, "ConvertedCurrentPrice": {"Value": 97.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 97.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "l***t", "FeedbackPrivate": false, "FeedbackRatingStar": "Red", "FeedbackScore": 4973}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Ray-Ban Sun Glasses", "ItemSpecifics": {"NameValueList": [{"Name": "Brand", "Value": ["Ray-Ban"]}]}, "HitCount": 198, "PrimaryCategoryIDPath": "11450:4250:179239:79720", "Country": "US", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "14 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 98.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Pre-owned", "GlobalShipping": false, "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}