{"BestOfferEnabled": false, "Description": "How is everybody today? We're okay, thanks for wondering. This is a spiffy pair of Ray-Ban Justin Sunglasses Number RB 4165. Made in Italy 622/55 54016 145 3N Frame material: Nylon Frame color: Black Lenses: Blue Mirror Pre-owned in fine condition. Minor blemishes on the lenses are visible if examined closely but not visible (to us) when the glasses are worn. Arms are nice and tight with secure hinges. Ray-Ban Justin sunglasses may just be one of the coolest looks in the Ray-Ban collection. Inspired by the iconic Wayfarer sunglasses, this style has been redesigned with slightly larger rectangle lenses, fresh new frame colors, stunning colored lenses and a rubberized frame finish to really give it that extra edge. Justin RB4165 sunglasses are bold, fun and unforgettable. These sunglasses come in traditional frame colors, as well as some total statement-making colors such as red, violet, blue, fuchsia, turquoise and matte blue. Add some edge to your style with these durable and unmistakable, iconic sunglasses. Please examine the photos carefully. If you have any questions please don't hesitate to contact us before placing a bid. Buyer receives only what has been described or shown in the photos. Please remit payment within 2 days unless alternate arrangements are made in advance. Thank you for your interest and good luck! Feedback:eBay survives on feedback left by both the seller and buyer.We have had a run of 0 Feedback buyers lately purchasing items and not paying for them. While we know that everyone has to start somewhere we are doing our best to make eBay safer for us and you as the buyer.We ask that if you have less than 5 feedback?s that you contact us before you bid and confirm in writing your intention to buy and purchase an item. Otherwise, we will be forced to cancel your bid and block you from bidding. Thanks for your understanding in this matter.You can bid with confidence on our items as we have been selling on eBay since 2006 and hundreds and hundreds Positive Feedback's.The item you?re bidding/purchasing only includes items listed. Any other item and/or accessories not listed aren?t included unless otherwise stated.Thanks for looking at our item & good luck bidding! Terms, Conditions & Disclosures:Your Shipping Cost: Free shipping is included on some of our Buy it now and Auction listing; however shipping is not included on best offer items. The shipping cost will be added to the invoice on these items. Please keep this in mind when you make an offer. In an effort to expedite your checkout process and to get your item to you as quickly as possible, bidder must pay for shipping and handling unless otherwise stated in listing.Your item will be shipped via a major carrier, which allows us to provide tracking. Please allow 1 business day handling time and 5 to 7 days for regular delivery, with rural areas taking longer. Expedited Shipping varies between 1-3 days. Overnight shipping is available upon customer request. We must have a confirmed address. All shipping charges include handling, labor and packaging materials.Taxes and Payment: If you are a Georgia resident, then you must pay Georgia state sales tax of 8%.Local Pickup:Items can be viewed anytime at: 343 Peters Street SW Atlanta, GA 30313 Phone: [phone removed by eBay]We are one mile south of the Phillips Arena in the Historic Castleberry Hill Arts District.Hours of operation: Monday Thru Friday: 9 to 5 & Saturday: 9 to 4 Please note: We will accept payment at time of local pickup.We are a business and we are required by law to collect Georgia sales tax at the rate of 8.9% for purchases made in state or shipped in state.If buying online and the item will be shipped, you must use eBay checkout. Your item will not be shipped until the total balance due (eBay Sales Price + Shipping Charges + Taxes if applicable) is paid. We accept PayPal payments only, except when your are picking up the item at our store. Payment is required within 2 days of auction close.Coins:Coins are in raw uncertified condition.Please look at the photographs as this is the actual coin you will receive.We do not attach a grade to coins as grading is very subjective and ask that you do that yourself based on the photographs.All of our coins are guaranteed to be 100% authentic!Diamonds:Weight and color of the stones is approximate unless otherwise indicated.The diamonds herein have been purchased from legitimate sources not involved in funding conflict and in compliance with United Nations resolutions.The seller hereby guarantees that these diamonds are conflict free based on personal knowledge and/or written guarantees provided by the supplier of these diamonds.Rolex:Rolex is a registered trademark of ROLEX USA and we are in no way affiliated with the Company in any way. We are not an authorized dealer of Rolex. We are resellers of fine watches and jewelry.Special Jewelry Terms & Conditions:At JWR354 we offer a wide selection of antique, vintage, estate & pre-owned items.These items have age and history. They may have some degree of wear and tear and discoloration; only significant blemishes or flaws are listed, (e. g. metal may need polishing or cleaning, watches may need repairs). All measurements provided are approximates and each inventory item is carefully inspected.If shown in the ad this purchase comes with a professional appraisal document card.Tools & Miscellaneous:Our policy on tools here on eBay is the same that it is in our shop, NO RETURNS/SOLD AS-IS. This also applies to various other miscellaneous items at times. This will be clearly noted in the sale here on eBay. Watches & Pocket Watches:At this time the watch you are buying runs fine and keeps good time but this must be considered sold As-Is.We do not guarantee anything to do with it running, keeping time or if it needs cleaning.This is a Final Sale.WE RESERVE THE RIGHT TO CANCEL ANY BID FOR ANY REASON. NO INTERNATIONAL SHIPPING! JWR354's sole and exclusive warranty is that item will materially conform with the item's description in the auction listing above.JWR354 will not accept any returns unless the item purchased fails to materially conform to the item's description above and the purchaser notifies JWR354 that the item does not materially comply with the description within two days of receipt of the item.IN THE EVENT JWR354 ACCEPTS A RETURN, & THERE IS NOTHING WRONG WITH THE ITEM, (I. E. YOU JUST CHANGE YOUR MIND), THE PURCHASER WILL BE RESPONSIBLE FOR ALL SHIPPING CHARGES AND RESTOCKING FEES OF 20%.ALL RETURNS MUST BE COMPLETED WITHIN 14 DAYS, NO EXCEPTIONS", "ItemID": "382822921093", "EndTime": "2019-03-12T16:30:06.000Z", "StartTime": "2019-03-05T16:30:06.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Ray-Ban-Mens-Unisex-Sunglasses-RB-4165-Justin-BLUE-Mirror-Lenses-Made-Italy-/382822921093", "ListingType": "Chinese", "Location": "Atlanta, Georgia", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs2.ebaystatic.com/pict/3828229210938080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/NzcxWDE2MDA=/z/7yQAAOSwykpceuzA/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTQ5WDE2MDA=/z/7sMAAOSwupBceuzf/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTEwNFgxNTEy/z/DjoAAOSwTGZceuzH/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTE3WDE2MDA=/z/srEAAOSwUR9ceu0Y/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTIyMlgxNjAw/z/CmUAAOSwpWRceu9x/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODYwWDE2MDA=/z/b1cAAOSwMnZceuz9/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTA5WDE2MDA=/z/QXsAAOSw-RFceu0E/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NzYxWDE2MDA=/z/hZ8AAOSw6Ghceu0P/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/MTI0NVgxNjAw/z/nKcAAOSwH5Nceu0g/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NTg0WDEyODA=/z/CEsAAOSwLgFceu0m/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NjYwWDE1MDQ=/z/cNEAAOSwk~Vceu0v/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/ODU2WDE0ODg=/z/JO8AAOSwVVdceuzT/$_57.JPG?set_id=8800005007"], "PostalCode": "30313", "PrimaryCategoryID": "79720", "PrimaryCategoryName": "Clothing, Shoes & Accessories:Men's Accessories:Sunglasses & Sunglasses Accessories:Sunglasses", "Quantity": 1, "Seller": {"UserID": "jwr354", "FeedbackRatingStar": "Red", "FeedbackScore": 2358, "PositiveFeedbackPercent": 99.5}, "BidCount": 5, "ConvertedCurrentPrice": {"Value": 53.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 53.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "c***e", "FeedbackPrivate": false, "FeedbackRatingStar": "Turquoise", "FeedbackScore": 375}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["US"], "Site": "US", "TimeLeft": "PT0S", "Title": "Ray-Ban Men's Unisex Sunglasses RB 4165 Justin BLUE Mirror Lenses Made in Italy", "ItemSpecifics": {"NameValueList": [{"Name": "Lens Color", "Value": ["Blue"]}, {"Name": "Brand", "Value": ["Ray-Ban"]}, {"Name": "Model", "Value": ["Justin"]}, {"Name": "MPN", "Value": ["Does Not Apply"]}, {"Name": "Modified Item", "Value": ["No"]}, {"Name": "Frame Color", "Value": ["Black"]}, {"Name": "Country/Region of Manufacture", "Value": ["Italy"]}, {"Name": "Frame Material", "Value": ["Nylon"]}, {"Name": "Style", "Value": ["Foldable"]}]}, "HitCount": 206, "PrimaryCategoryIDPath": "11450:4250:179239:79720", "Country": "US", "ReturnPolicy": {"ReturnsAccepted": "ReturnsNotAccepted", "InternationalReturnsAccepted": "ReturnsNotAccepted"}, "MinimumToBid": {"Value": 54.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 1, "ConditionID": 3000, "ConditionDisplayName": "Pre-owned", "ExcludeShipToLocation": ["Alaska/Hawaii", "US Protectorates", "APO/FPO", "Africa", "Asia", "Central America and Caribbean", "Europe", "Middle East", "North America", "Oceania", "Southeast Asia", "South America"], "GlobalShipping": false, "ConditionDescription": "Pre-owned in fine condition. Minor blemishes on the lenses are visible if examined closely but not visible (to us) when the glasses are worn.  Arms are nice and tight with secure hinges.", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}