{"BestOfferEnabled": false, "Description": "PLEASE NOTE:> PLEASE NOTE THAT YOU ARE NOT BUYING A NEW SUN GLASS AND DO NOT EXPECT IT TO LOOK LIKE NEW ONE.> NO BOX OR PAPERS WILL BE AVAILABLE AND WE CANNOT GUARANTEE THE SUNGLASS TO BE WATER PROOF ANY MORE. > SOME TIMES ORIGINAL PARTS LIKE Frame, Glass, BALANCE ETC., ARE BEYOND REPAIR SO WE REPLACE THEM WITH NEW OR OLD PARTS AS PER ITS AVAILABILITY. > ALL OUR SUN GLASS ARE CHECKED FOR AT LEAST 24 HOURS PRIOR TO DISPATCH STILL THIS ARE OLD SUN GLASS AND THE SOMETIMES TEND TO DEVELOP ISSUES OVERNIGHT. > NO REPLACEMENT OR GUARANTEE FOR BROKEN ITEMS DUE TO MISHANDLING IN CASE IF YOU ARE HAVING ISSUES IN USING THE QUICK SET PLEASE CONTACT US FIRST. > PICTURES FORM A MAJOR PART OF ITEM DESCRIPTION. PICTURES POSTED ARE OF THE ACTUAL SUN GLASS, ANY DEFECTS OR SCRATCHES NOT MENTIONED IN THE ITEM LISTING HOWEVER VISIBLE IN THE PICTURES WILL BE CONSIDERED AS PART OF ITEM DESCRIPTION.> THIS IS A VINTAGE PIECE SERVING FOR LAST YEARS, HOWEVER WE TRY TO KEEP IT AS ACCURATE AND BALANCE SUN GLASS POSSIBLE BUT DON'T EXPECT IT TO WORK AS A NEW PIECE.> CONDITIONS OF THE CASE IS SATISFACTORY WITH MINOR SCRATCHES WHICH MUST BE IGNORED BY CONSIDERING THE AGE OF THE PIECE. > ANY DESCRIPTION ERROR CAN BE IGNORED AND PLEASE DO NOT CONSIDER IT AS A DELIBERATE MISTAKE. PLEASE BRING IT TO OUR KNOWLEDGE AT THE EARLIEST. SHIPPING POLICY FREE SHIPPING WORLDWIDE THROUGH DHL or SPEED POST ITS DELIVERY TIME IS ANYWHERE BETWEEN 05 TO 10 DAYS. USUALLY PACKAGES SENT THROUGH THE POST OFFICE CLEAR THE CUSTOMS EASILY HOWEVER IN CASE THE PACKAGE IS INSPECTED PLEASE EXPECT MORE DELAYS AS WE HAVE NO CONTROL WHEN CUSTOMS GET INVOLVED. IF PACKAGE RETURN TO SELLER DUE TO INSUFFICIENT ADDRESS, STREET NUMBER MISSING OR NON DELIVERY OF ARTICLE, SHIPPING CHARGE WILL BE DEDUCT FROM PURCHASE AMOUNT, SHIPPING CHARGE AND FREE SHIPPING ALSO CHARGE USD5 IF PACKAGE RETURN TO SELLER, AND RE-SHIP, SHIPPING CHARGE WILL BE PAYABLE BY BUYER ONLY. WE SHIP WITHIN 3 TO 5 WORKING DAYS AFTER THE ITEM IS SOLD& THE PAYMENT IS RECEIVED AS WE CHECK ALL OUR WATCHES ONCE AGAIN (AFTER SALE) FOR A FEW DAYS BEFORE DISPATCHING. TERMS OF SALE RETURN POLICY: - IN CASE OF ANY PROBLEM AND THE WATCH IS RETURNED, THE AUCTION AMOUNT WILL ONLY BE REFUNDED AND THIS DOES NOT INCLUDE SHIPPING CHARGES. MONEY WILL BE REFUNDED BY PAYPAL ONLY, AND AFTER THE WATCH IS RECEIVED.NEW FEEDBACK & DETAILED SELLER RATINGS DSR SYSTEM: - IF ITEM ARRIVES IN SATISFACTORY CONDITION, PLEASE SUPPORT US BY GIVING AN OVER ALL DETAILED SELLER RATING DSR OF FULL STARS.PLEASE EMAIL US FIRST BEFORE GIVING A NEUTRAL OR NEGATIVE FEEDBACK OR RATINGS LESS.KINDLY WRITE TO US FIRST AND GIVE US THE CHANCE TO ADDRESS YOUR CONCERN OR PROBLEM BEFORE GIVING A NEUTRAL OR NEGATIVE FEEDBACK OR A LESS DSR.PLEASE FEEL FREE TO CONTACT US FOR ANY QUERIES OR ISSUES WE WILL TRY OUR BEST TO REPLY WITHIN 24 HOURS. YOUR SATISFACTION IS OUR PRIORITY!Negative feedback is not a solution. So, we request you to contact us and give us a chance to resolve it asap. Thank You and Happy Shopping.INTERNATIONAL BUYERS PLEASE PROVIDE YOUR PHONE NUMBERS FOR PROMPT AND QUICK DELIVERYPAYMENTS PAYPAL ONLY ACCEPTED", "ItemID": "382846086134", "EndTime": "2019-03-27T14:57:26.000Z", "StartTime": "2019-03-17T14:57:26.000Z", "ViewItemURLForNaturalSearch": "https://www.ebay.com/itm/Luxury-Sexy-New-Sunglasses-G-15-indigo-Lenses-Mens-RayBan-/382846086134", "ListingType": "Chinese", "Location": "AHMEDABAD, GUJARAT", "PaymentMethods": ["PayPal"], "GalleryURL": "https://thumbs3.ebaystatic.com/pict/3828460861348080_1.jpg", "PictureURL": ["https://i.ebayimg.com/00/s/Mzk4WDkxMw==/z/F00AAOSwh8tcjl95/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/OTYwWDEyODA=/z/0qMAAOSweaFcjl9X/$_57.JPG?set_id=8800005007", "https://i.ebayimg.com/00/s/NDQ2WDU1MA==/z/BDMAAOSwkR9cjl9a/$_57.PNG?set_id=8800005007"], "PostalCode": "380013", "PrimaryCategoryID": "79720", "PrimaryCategoryName": "Clothing, Shoes & Accessories:Men's Accessories:Sunglasses & Sunglasses Accessories:Sunglasses", "Quantity": 1, "Seller": {"UserID": "vago_5518", "FeedbackRatingStar": "None", "FeedbackScore": 0, "PositiveFeedbackPercent": 0.0}, "BidCount": 19, "ConvertedCurrentPrice": {"Value": 51.0, "CurrencyID": "USD"}, "CurrentPrice": {"Value": 51.0, "CurrencyID": "USD"}, "HighBidder": {"UserID": "s***r", "FeedbackPrivate": false, "FeedbackRatingStar": "None", "FeedbackScore": 0}, "ListingStatus": "Completed", "QuantitySold": 1, "ShipToLocations": ["Worldwide"], "Site": "US", "TimeLeft": "PT0S", "Title": "Luxury  Sexy New Sunglasses With G-15 indigo Lenses For Men's RayBan ", "ItemSpecifics": {"NameValueList": [{"Name": "Modified Item", "Value": ["No"]}, {"Name": "Country/Region of Manufacture", "Value": ["Italy"]}, {"Name": "Style", "Value": ["Round"]}, {"Name": "Protection", "Value": ["100% UV"]}, {"Name": "Lens Technology", "Value": ["Polarized"]}, {"Name": "Gender", "Value": ["Men"]}, {"Name": "Frame Material", "Value": ["Plastic"]}, {"Name": "Lens Color", "Value": ["indigo"]}, {"Name": "Brand", "Value": ["Ray-Ban"]}, {"Name": "Frame Color", "Value": ["Black"]}]}, "HitCount": 115, "PrimaryCategoryIDPath": "11450:4250:179239:79720", "Country": "IN", "ReturnPolicy": {"Refund": "Money Back", "ReturnsWithin": "30 Days", "ReturnsAccepted": "Returns Accepted", "ShippingCostPaidBy": "Buyer", "InternationalRefund": "MoneyBack", "InternationalReturnsWithin": "30 Days", "InternationalReturnsAccepted": "ReturnsAccepted", "InternationalShippingCostPaidBy": "Buyer"}, "MinimumToBid": {"Value": 52.0, "CurrencyID": "USD"}, "AutoPay": false, "PaymentAllowedSite": [], "IntegratedMerchantCreditCardEnabled": false, "HandlingTime": 4, "ConditionID": 3000, "ConditionDisplayName": "Pre-owned", "GlobalShipping": false, "ConditionDescription": "You ARE NOT BUYING A NEW SUN GLASS YOU'RE BUYING PRE OWNED RAYBAN SUNGLASS (RECENTLY", "QuantitySoldByPickupInStore": 0, "NewBestOffer": false}